Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: This dice game contract allows players to guess a number between 1 & 6 during an active game window. The contract owner then has the ability to toggle the game window to disable new guesses from players. To determine the winning number, the contract owner calls the `request_randomness_from_pragma` function to request a random number from the Pragma VRF oracle. Once the random number is received through the `receive_random_words` callback function, it is stored in the `last_random_number` storage variable. Each player has to call `process_game_winners` function to determine if they have won or lost. The `last_random_number` generated is then reduced to a number between 1 & 6, and compared to the guesses of the players stored in the `user_guesses` mapping, which leads to the emission of an event `GameWinner` or `GameLost`.
es: Este contrato de juego de dados permite a los jugadores adivinar un número entre 1 y 6 durante una ventana de juego activa. El propietario del contrato tiene entonces la capacidad de cambiar la ventana del juego para desactivar nuevas conjeturas de los jugadores. Para determinar el número ganador, el propietario del contrato llama a la función `request_randomness_from_pragma` para solicitar un número aleatorio del oracle Pragma VRF. Una vez que el número aleatorio se recibe a través de la función `recibe_random_words` callback, se almacena en la variable de almacenamiento `last_random_number`. Cada jugador tiene que llamar a la función `process_game_winners` para determinar si han ganado o perdido. El `last_random_number` generado se reduce a un número entre 1 y 6, y en comparación con las conjeturas de los jugadores almacenados en la asignación `user_guess`, que conduce a la emisión de un evento `GameWinner` o `GameLost`.
fr: Ce contrat de jeu de dés permet aux joueurs de deviner un nombre entre 1 et 6 pendant une fenêtre de jeu active. Le propriétaire du contrat a alors la possibilité de basculer la fenêtre de jeu pour désactiver de nouvelles devinettes des joueurs. Pour déterminer le nombre gagnant, le propriétaire du contrat appelle la fonction `request_randomness_from_pragma` pour demander un nombre aléatoire de l'oracle Pragma VRF. Une fois que le nombre aléatoire est reçu par la fonction `receive_random_words` callback, il est stocké dans la variable de stockage `last_random_number`. Chaque joueur doit appeler la fonction `process_game_winners` pour déterminer s'il a gagné ou perdu. Le `last_random_number` généré est alors réduit à un nombre entre 1 et 6 et comparé aux devinettes des joueurs stockées dans la cartographie `user_guess`, ce qui conduit à l'émission d'un événement `GameWinner` ou `GameLost`.
id: Kontrak dadu ini memungkinkan para pemain untuk menebak angka antara 1 & 6 selama sebuah jendela permainan aktif. Pemilik kontrak kemudian memiliki kemampuan untuk mengubah jendela permainan untuk menonaktifkan perkiraan baru dari pemain. Untuk menentukan nomor pemenang, pemilik kontrak memanggil fungsi Árequest_randomness_from_pragma--dari fungsi untuk meminta nomor acak dari Pragma VRF Oracle. Setelah jumlah acak diterima melalui Á_ranive_randomback fungsi panggilan, itu disimpan di Álast_random_random_condom. Setiap pemutar harus memanggil Ás_winner untuk menentukan apakah mereka telah kehilangan atau terakhir.
tr: Bu zar oyun sözleşmesi, oyuncuların etkin bir oyun penceresi sırasında 1 ve 6 arasında bir sayı tahmin etmelerini sağlar. Sözleşme sahibi daha sonra oyunculardan yeni tahminleri devre dışı bırakmak için oyun penceresini değiştirme yeteneğine sahiptir. Kazanan sayıyı belirlemek için, sözleşme sahibi, Pragma VRF kahininden rastgele bir sayı istemek için request_randomness_from_pragma fonksiyonunu çağırır. Rastgele sayı receive_random aracılığıyla alındığında
zh_cn: 此 dice 游戏合同允许玩家在活动游戏窗口中猜测 1 和 6 之间的数字。 合同所有人然后能够切换游戏窗口以禁用玩家的新猜想。 要确定胜数, 合同所有人将“ 请求_ randomnes_ from_ pragma” 函数调用“ pragma VRF 或acle” 随机数。 一旦随机数通过“ 接收_ random_ words” 回调功能接收, 它就会被存储在“ 最后_ random_ number ” 存储变量中。 每个玩家必须调用“ 进程_ game_ winner ” 函数来确定他们是否赢了或输了。 生成的“ 最后一个_ random_ number” 后被减为1 和 6 之间的数字, 与存储在“ 用户- guesses ” 映射中的玩家的猜测数相比, 随机数导致事件“ GameWinner ” 或“ GameLost” 的排放。

source: // Approve the randomness contract to transfer the callback fee // You would need to send some ETH to this contract first to cover the fees
es: // Aprobar el contrato de azar para transferir la tarifa de devolución de llamada // Usted tendría que enviar un poco de ETH a este contrato primero para cubrir los honorarios
fr: // Approuver le contrat aléatoire pour transférer les frais de callback // Vous devriez envoyer un certain ETH à ce contrat d'abord pour couvrir les frais
id: //Setujui kontrak acak untuk mentransfer biaya callback //Anda perlu mengirim beberapa ETH ke kontrak ini terlebih dahulu untuk menutupi biaya
tr: // Geri çağırma ücretini aktarmak için rasgele sözleşmeyi onaylayın // Ücretleri karşılamak için önce bu sözleşmeye biraz ETH göndermeniz gerekir
zh_cn: 批准随机合同 转回回扣费 您需要先把一些ETH送到合同

source: // Request the randomness
es: // Solicitar la aleatoriedad
fr: // Demander le caractère aléatoire
id: //Permintaan keacakan
tr: // Rastgelelik isteği
zh_cn: / 要求随机性

source: // Have to make sure that the caller is the Pragma Randomness Oracle contract
es: // Hay que asegurarse de que la persona que llama es el contrato Pragma Randomness Oracle
fr: // Il faut s'assurer que l'appelant est le contrat Pragma Randomness Oracle
id: //Harus memastikan bahwa penelpon adalah kontrak Pragma Acak Oracle
tr: // Arayanın Pragma Randomness Oracle sözleşmesi olduğundan emin olun.
zh_cn: 必须确保打电话者是 普拉格马随机性甲骨文合同

source: // and that the current block is within publish_delay of the request block
es: // y que el bloque actual está dentro de publish_delay del bloque de solicitud
fr: // et que le bloc courant est dans edit_delay du bloc request
id: ///dan bahwa blok saat ini berada dalam mempublikasikan_delay dari blok permintaan
tr: // ve mevcut bloğun istek bloğunun yayın_ gecikmesi içinde olduğunu
zh_cn: / 并且当前区块在请求区块的发布_延迟之内

source: // ETH Contract Address
es: // Dirección del contrato ETH
fr: // Adresse du contrat ETH
id: //Alamat Kontrak ETH
tr: // ETH Sözleşme Adresi
zh_cn: ETET 合同地址

source: <span class="caption">Listing 16-6: Simple Dice Game Contract using Pragma VRF.</span>
es: <span class="caption">Lista 16-6: Contrato de Juego de Dados Simple usando Pragma VRF.</span>
fr: <span class="caption">Liste 16-6: Contrat de jeu de dés simple utilisant Pragma VRF.</span>
id: <span class="caption">Listing 16-6: Simple Dice Game Contract menggunakan Pragma VRF.</span>
tr: span class="caption">Listing 16-6: Pragma VRF kullanarak Basit Zar Oyun Sözleşmesi./span>
zh_cn: <span class="Caption" > listing 16-6: 使用 Pragma VRF 的简单骰子游戏合同。 </span>

source: NB: Fund Your Contract After Deployment to Utilize Pragma VRF
es: NB: Financie su contrato después del despliegue para utilizar Pragma VRF
fr: NB: Financez votre contrat après le déploiement pour utiliser Pragma VRF
tr: NB: Pragma VRF'yi Kullanmak İçin Dağıtım Sonrası Sözleşmenizi Fonlayın
zh_cn: NB:在部署使用Pragma VRF后,为您的合同供资

source: After deploying your contract that includes Pragma VRF functionalities, ensure it holds sufficient ETH to cover the expenses related to requesting random values. Pragma VRF requires payment for both generating the random numbers and executing the callback function defined in your contract.
es: Después de implementar su contrato que incluye funciones Pragma VRF, asegúrese de que tenga suficiente ETH para cubrir los gastos relacionados con la solicitud de valores aleatorios. Pragma VRF requiere el pago tanto para generar los números aleatorios como para ejecutar la función callback definida en su contrato.
fr: Après avoir déployé votre contrat qui inclut les fonctionnalités de Pragma VRF, assurez-vous qu'il détient suffisamment d'ETH pour couvrir les dépenses liées à la demande de valeurs aléatoires. Pragma VRF nécessite le paiement pour générer les numéros aléatoires et exécuter la fonction de rappel définie dans votre contrat.
id: Setelah menyebarkan kontrak yang termasuk fungsionalitas Pragma VRF, pastikan memiliki cukup ETH untuk menutupi biaya yang berhubungan dengan meminta nilai acak. Pragma VRF membutuhkan pembayaran untuk kedua menghasilkan nomor acak dan mengeksekusi fungsi callback didefinisikan dalam kontrak Anda.
tr: Pragma VRF işlevlerini içeren sözleşmenizi dağıttıktan sonra, rastgele değerler istemekle ilgili masrafları karşılamak için yeterli ETH tuttuğundan emin olun. Pragma VRF, hem rastgele sayıları oluşturmak hem de sözleşmenizde tanımlanan geri arama işlevini yürütmek için ödeme gerektirir.
zh_cn: 在部署包含Pragma VRF功能的合同后,确保有足够的ETH支付与要求随机值有关的费用。 Pragma VRF要求支付生成随机数和执行合同中规定的回馈功能的费用。

source: For more information, please refer to the [Pragma](https://docs.pragma.build/Resources/Cairo%201/randomness/randomness) docs.
es: Para más información, véase [Pragma](https://docs.pragma.build/Resources/El Cairo%201/randomness/randomness) docs.
fr: Pour plus d'informations, veuillez consulter les documents [Pragma](https://docs.pragma.build/Resources/Cairo%201/randomness/randomness).
id: Untuk informasi lebih lanjut, silakan lihat dokumen [Pragma][Pragma]://docs.pragma.build/Resources/Cairo%201/randomness/randomness).
tr: Daha fazla bilgi için lütfen [Pragma](https://docs.pragma.build/Resources/Cairo%201/randomness/randomness] belgelerine bakınız.
zh_cn: 详情请查阅[Pragma](https://docs.pragma.building/Resources/Cairo%201/randomness/randomness)文件。

source: This section contains additional examples of Starknet smart contracts, utilizing various features of the Cairo programming language. Your contributions are welcome and encouraged, as we aim to gather as many diverse examples as possible.
es: Esta sección contiene ejemplos adicionales de contratos inteligentes de Starknet, utilizando varias características del lenguaje de programación de El Cairo. Sus contribuciones son bienvenidas y alentadas, ya que nuestro objetivo es reunir tantos ejemplos diversos como sea posible.
fr: Cette section contient d'autres exemples de contrats intelligents Starknet, utilisant diverses fonctionnalités du langage de programmation du Caire. Vos contributions sont les bienvenues et encouragées, car nous visons à rassembler le plus d'exemples possibles.
id: Bagian ini berisi contoh tambahan kontrak cerdas Starknet, memanfaatkan berbagai fitur bahasa pemrograman Kairo. kontribusi Anda diterima dan dianjurkan, karena kami bertujuan untuk mengumpulkan sebanyak mungkin contoh yang berbeda.
tr: Bu bölüm, Kahire programlama dilinin çeşitli özelliklerini kullanarak Starknet akıllı sözleşmelerinin ek örneklerini içerir. Katkılarınız memnuniyetle karşılanır ve teşvik edilir, çünkü mümkün olduğunca çok sayıda farklı örnek toplamayı amaçlıyoruz.
zh_cn: 本节载有斯塔克内特智能合同的其他例子,利用开罗方案语言的各种特点,欢迎和鼓励你的贡献,因为我们的目标是收集尽可能多的不同的例子。

source: Deploying and Interacting with a Voting contract
es: Implementación e interacción con un contrato de votación
fr: Déployer et interagir avec un contrat de vote
id: Menyebarkan dan Interacting dengan kontrak Voting
tr: Oylama sözleşmesi ile dağıtım ve etkileşim
zh_cn: 与表决合同的部署和互动

source: The **`Vote`** contract in Starknet begins by registering voters through the contract's constructor. Three voters are initialized at this stage, and their addresses are passed to an internal function **`_register_voters`**. This function adds the voters to the contract's state, marking them as registered and eligible to vote.
es: El contrato **`Vote`** en Starknet comienza registrando votantes a través del constructor del contrato. Tres votantes son inicializados en esta etapa, y sus direcciones son pasadas a una función interna **`_register_voters`**. Esta función agrega a los votantes al estado del contrato, marcándolos como registrados y elegibles para votar.
fr: Le contrat **`Vote`** à Starknet commence par enregistrer les électeurs par l'intermédiaire du constructeur du contrat. Trois électeurs sont initialisés à ce stade, et leurs adresses sont passées à une fonction interne **`_register_voters`**. Cette fonction ajoute les électeurs à l'état du contrat, les marquant comme inscrits et éligibles au vote.
id: Kontrak **Vote** di Starknet dimulai dengan mendaftarkan pemilih melalui konstruktor kontrak. Tiga pemilih diinisialisasi pada tahap ini, dan alamat mereka dilewatkan ke fungsi internal ***_register_voters**. Fungsi ini menambahkan pemilih ke negara kontrak, menandai mereka terdaftar dan memenuhi syarat untuk memilih.
tr: Starknet'teki **Vote** sözleşmesi, sözleşmenin yapıcısı aracılığıyla seçmenlerin kaydedilmesiyle başlar. Bu aşamada üç seçmen başlatılır ve adresleri bir iç işleve geçer **_register_voters**. Bu işlev, seçmenleri sözleşmenin durumuna ekler ve bunları kayıtlı ve oy kullanmaya uygun olarak işaretler.
zh_cn: 斯塔克内特的“Vote”合同从通过合同的构建者对选民进行登记开始,在这个阶段,有3名选民被初始化,他们的地址被传给内部功能“register_voters”。这一功能使选民加入到合同的状态中,他们被标记为已登记并有资格投票。

source: Within the contract, the constants **`YES`** and **`NO`** are defined to represent the voting options (1 and 0, respectively). These constants facilitate the voting process by standardizing the input values.
es: Dentro del contrato, las constantes **`YES`** y **`NO`** se definen para representar las opciones de votación (1 y 0, respectivamente).Estas constantes facilitan el proceso de votación mediante la normalización de los valores de entrada.
fr: Dans le cadre du contrat, les constantes **`YES`** et **`NO`** sont définies pour représenter les options de vote (1 et 0, respectivement). Ces constantes facilitent le processus de vote en standardisant les valeurs d'entrée.
id: Dalam kontrak, konstanta **YES** **no_** didefinisikan untuk mewakili pilihan pemilih (1 dan 0, masing-masing). Konstanta ini memfasilitasi proses pemilihan dengan standarisasi nilai masukan.
tr: Sözleşme içinde, sabitler **YES** ve **NO** sırasıyla oylama seçeneklerini (1 ve 0) temsil edecek şekilde tanımlanır. Bu sabitler, giriş değerlerini standartlaştırarak oylama sürecini kolaylaştırır.
zh_cn: 在合同中,常数 " YES " 和 " NO " 被定义为代表投票选项(分别为1和0)。这些常数通过使输入值标准化来便利投票过程。

source: Once registered, a voter is able to cast a vote using the **`vote`** function, selecting either the 1 (YES) or 0 (NO) as their vote. When voting, the state of the contract is updated, recording the vote and marking the voter as having voted. This ensures that the voter is not able to cast a vote again within the same proposal. The casting of a vote triggers the **`VoteCast`** event, logging the action.
es: Una vez inscrito, un votante puede emitir un voto usando la función **`vote`**, seleccionando el 1 (YES) o 0 (NO) como su voto. Al votar, el estado del contrato se actualiza, registrando el voto y marcando al votante como el que ha votado. Esto asegura que el votante no puede emitir un voto de nuevo dentro de la misma propuesta. El voto desencadena el evento **`VoteCast`**, registrando la acción.
fr: Une fois inscrit, un électeur peut voter en utilisant la fonction **`vote`**, en sélectionnant soit le 1 (YES) ou 0 (NO) comme leur vote. Lors du vote, l'état du contrat est mis à jour, l'enregistrement du vote et la notation de l'électeur comme ayant voté. Cela garantit que l'électeur n'est pas en mesure de voter à nouveau dans la même proposition.
id: Setelah terdaftar, seorang pemilih dapat memberikan suara menggunakan fungsi **ívote**, memilih salah satu (YES) atau 0 (NO) sebagai suara mereka. Ketika pemungut suara, keadaan kontrak diperbarui, merekam suara dan menandai pemilih sebagai memiliki suara. Hal ini memastikan bahwa pemilih tidak dapat memberikan suara dalam proposal yang sama.
tr: Kayıt olduktan sonra, bir seçmen **vote** işlevini kullanarak oy kullanabilir, 1 (YES) veya 0 (NO) oylarını seçebilir. Oy kullanırken, sözleşmenin durumu güncellenir, oy kaydedilir ve seçmen oy kullanmış olarak işaretlenir. Bu, seçmenin aynı öneri dahilinde tekrar oy kullanamamasını sağlar. Bir oylamanın yapılması, **voteCast eylemini tetikler.
zh_cn: 一旦登记,选民就可以使用“vote”功能投票,选择1(YES)或0(NO)作为他们的选票。在投票时,合同状况将更新,记录投票情况,并将选民标记为投票者。这确保选民无法在同一提案中再次投票。投票引发了“VoteCast”事件,记录了投票情况。

source: The contract also monitors unauthorized voting attempts. If an unauthorized action is detected, such as a non-registered user attempting to vote or a user trying to vote again, the **`UnauthorizedAttempt`** event is emitted.
es: El contrato también supervisa los intentos de votación no autorizados. Si se detecta una acción no autorizada, como un usuario no registrado que intenta votar o un usuario que intenta volver a votar, se emite el evento **`UnhabilitedAttempt`**.
fr: Le contrat surveille également les tentatives de vote non autorisées. Si une action non autorisée est détectée, comme un utilisateur non enregistré qui tente de voter ou un utilisateur qui tente de voter à nouveau, l'événement **`Non autoriséAttente`** est émis.
id: Kontraknya juga memonitor upaya pemungutan suara yang tidak sah. Jika aksi yang tidak sah terdeteksi, seperti pengguna yang tidak terdaftar mencoba memilih atau pengguna yang mencoba untuk memilih lagi, acara yang **Tak berwenang Dipancarkan.
tr: Sözleşme ayrıca yetkisiz oy verme girişimlerini de izler. Kayıt dışı bir kullanıcının oy kullanmaya çalışması veya tekrar oy vermeye çalışan bir kullanıcı gibi yetkisiz bir eylem tespit edilirse, ** İzinsizAttempt** olayı yayılır.
zh_cn: 如果发现未经授权的行动,如未注册的用户试图投票或未注册的用户试图再次投票,则释放“未经授权的企图”事件。

source: Together, these functions, states, constants, and events create a structured voting system, managing the lifecycle of a vote from registration to casting, event logging, and result retrieval within the Starknet environment. Constants like **`YES`** and **`NO`** help streamline the voting process, while events play a vital role in ensuring transparency and traceability.
es: Juntos, estas funciones, estados, constantes y eventos crean un sistema de votación estructurado, gestionando el ciclo de vida de un voto desde el registro hasta el casting, el registro de eventos y la recuperación de resultados dentro del entorno de Starknet. Constantes como **`YES`** y **`NO`** ayudan a racionalizar el proceso de votación, mientras que los eventos juegan un papel vital para garantizar la transparencia y trazabilidad.
fr: Ensemble, ces fonctions, états, constantes et événements créent un système de vote structuré, gérant le cycle de vie d'un vote, de l'inscription au casting, à l'enregistrement des événements et à la récupération des résultats dans l'environnement de Starknet. Les constantes comme **'YES'** et **`NO'** aident à rationaliser le processus de vote, tandis que les événements jouent un rôle vital dans la transparence et la traçabilité.
id: Bersama-sama, fungsi-fungsi ini, negara bagian, konstan, dan peristiwa-peristiwa menciptakan sistem suara yang terstruktur, mengelola siklus hidup dari pendaftaran ke pengecoran, pencatatan peristiwa, dan menghasilkan penerimaan dalam lingkungan Starknet. konstan seperti ** YAS**** dan ** NO** membantu streamkan proses pemilihan, sementara peristiwa memainkan peran penting dalam memastikan transparansi dan keterjejakan.
tr: Birlikte, bu işlevler, durumlar, sabitler ve olaylar, Starknet ortamında kayıttan döküme, etkinlik kaydına ve sonuç alımına kadar bir oylamanın yaşam döngüsünü yöneten yapılandırılmış bir oylama sistemi oluşturur. **YES** ve **NO** gibi sabitler oylama sürecini düzene sokmaya yardımcı olurken, etkinlikler şeffaflık ve izlenebilirliğin sağlanmasında hayati bir rol oynar.
zh_cn: 这些功能、州、州、常数和活动合在一起创造了一个结构化的投票系统,管理从登记到投票、事件记录和史塔克内特环境内结果检索的投票周期。 诸如“YES ” 和“NO”等常数有助于简化投票过程,而活动在确保透明度和可追踪性方面发挥着至关重要的作用。

source: Listing 16-7 shows the `Vote` contract in detail:
es: En la lista 16-7 figura el contrato " Vote " en detalle:
fr: La liste 16-7 montre le contrat "Vote" en détail:
id: Terdaftar 16-7 menunjukkan kontrak åVoteáne secara detail:
tr: 16-7'nin listelenmesi, Vote sözleşmesini ayrıntılı olarak gösterir:
zh_cn: 第16-7号清单详细列出了“Vote”合同:

source: /// @dev Core Library Imports for the Traits outside the Starknet Contract
fr: /// @dev Importations de bibliothèque de base pour les caractères en dehors du contrat Starknet
id: // @dev Core Library Import untuk Traits diluar Kontrak Starknet
tr: /// @dev Çekirdek Kitaplığı Starknet Sözleşmesinin Dışındaki Traits İçin İthalat
zh_cn: ///@dev Core library Exports for the Treats unter the Starknet contract. 合同外的塔克内特核心图书馆进口 /// @dev Core library Exports for the trackits for the Starknet contract

source: /// @dev Trait defining the functions that can be implemented or called by the Starknet Contract
es: /// @dev Rasgo que define las funciones que pueden ser implementadas o llamadas por el Contrato Starknet
fr: /// @dev Trait définissant les fonctions qui peuvent être implémentées ou appelées par le contrat Starknet
id: // @dev Trait mendefinisikan fungsi yang dapat diimplementasikan atau dipanggil oleh Starknet Contract
tr: /// @dev Trait Starknet Sözleşmesi tarafından uygulanabilecek veya çağrılabilecek fonksiyonları tanımlar
zh_cn: ///@dev Trait 界定斯塔克内特合同可以履行或要求履行的职能

source: /// @dev Function that returns the current vote status
es: /// @dev Función que devuelve el estado actual de la votación
fr: /// @dev Fonction qui retourne le statut de vote actuel
id: // @dev Fungsi yang mengembalikan status suara saat ini
tr: /// @dev Geçerli oy durumunu döndüren fonksiyon
zh_cn: // @dev 函数返回当前投票状态

source: /// @dev Function that checks if the user at the specified address is allowed to vote
es: /// @dev Función que comprueba si el usuario en la dirección especificada está autorizado a votar
fr: /// @dev Fonction qui vérifie si l'utilisateur à l'adresse spécifiée est autorisé à voter
id: // @dev Fungsi yang memeriksa jika pengguna pada alamat yang dinyatakan diijinkan untuk memilih
tr: /// @dev Belirtilen adresteki kullanıcının oy kullanmasına izin verilip verilmediğini kontrol eden fonksiyon
zh_cn: // @dev 函数检查指定地址用户是否允许投票

source: /// @dev Function that checks if the specified address is registered as a voter
es: /// @dev Función que comprueba si la dirección especificada está registrada como votante
fr: /// @dev Fonction qui vérifie si l'adresse spécifiée est enregistrée comme électeur
id: // @dev Fungsi yang memeriksa jika alamat yang dinyatakan terdaftar sebagai pemilih
tr: /// @dev Belirtilen adresin seçmen olarak kayıtlı olup olmadığını kontrol eden fonksiyon
zh_cn: // @dev 函数检查指定地址是否登记为选民

source: /// @dev Function that allows a user to vote
es: /// @dev Función que permite a un usuario votar
fr: /// @dev Fonction qui permet à un utilisateur de voter
id: // @dev Fungsi yang memungkinkan pengguna untuk memilih
tr: /// @dev Bir kullanıcının oy kullanmasına izin veren fonksiyon
zh_cn: // @dev 功能允许用户投票

source: /// @dev Starknet Contract allowing three registered voters to vote on a proposal
es: /// @dev Starknet Contrato que permite a tres votantes registrados votar sobre una propuesta
fr: /// @dev Starknet Contrat permettant à trois électeurs inscrits de voter sur une proposition
id: // @dev Starknet Kontrak memungkinkan tiga pemilih terdaftar untuk memilih proposal
tr: /// @dev Starknet Sözleşmesi, üç kayıtlı seçmenin bir öneride oy kullanmasına izin veriyor
zh_cn: ///@dev Starknet 合同允许三名登记选民投票表决一项提案

source: /// @dev Structure that stores vote counts and voter states
es: /// @dev Estructura que almacena los recuentos de votos y los estados votantes
fr: /// @dev Structure qui stocke les comptes de vote et les états d'électeur
id: // @dev Struktur yang menyimpan jumlah suara dan keadaan pemilih
tr: /// @dev Oy sayımlarını ve seçmen durumlarını depolayan yapı
zh_cn: ///@dev 储存计票和选民状态的结构
