Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Cairo is a language built around a linear type system that allows us to statically ensure that in every Cairo program, a value is used exactly once. This linear type system helps prevent runtime errors by ensuring that operations that could cause such errors, such as writing twice to a memory cell, are detected at compile time. This is achieved by implementing an ownership system and forbidding copying and dropping values by default. In this chapter, we’ll talk about Cairo's ownership system as well as references and snapshots.
es: El Cairo es un lenguaje construido en torno a un sistema de tipo lineal que nos permite garantizar estáticamente que en cada programa de El Cairo se utilice un valor exactamente una vez. Este sistema de tipo lineal ayuda a prevenir errores de tiempo de ejecución al garantizar que las operaciones que podrían causar tales errores, como escribir dos veces a una celda de memoria, se detectan en el momento de la compilación. Esto se logra implementando un sistema de propiedad y prohibiendo copiar y soltar valores por defecto. En este capítulo, hablaremos del sistema de propiedad de El Cairo, así como referencias e instantáneas.
fr: Le Caire est un langage construit autour d'un système de type linéaire qui nous permet d'assurer statiquement que dans chaque programme du Caire, une valeur est utilisée exactement une fois. Ce système de type linéaire aide à prévenir les erreurs d'exécution en veillant à ce que les opérations qui pourraient causer de telles erreurs, comme l'écriture deux fois sur une cellule mémoire, soient détectées au moment de la compilation.
id: Kairo adalah bahasa yang dibangun di sekitar sistem linear yang memungkinkan kita untuk memastikan secara statis bahwa dalam setiap program Kairo, nilai digunakan tepat sekali. Sistem linear ini membantu mencegah kesalahan waktu berjalan dengan memastikan bahwa operasi yang dapat menyebabkan kesalahan tersebut, seperti menulis dua kali ke sel memori, terdeteksi pada waktu kompilasi. Hal ini dicapai dengan mengimplementasikan sistem kepemilikan dan melarang menyalin dan menjatuhkan nilai secara baku. Dalam bab ini, kita akan berbicara tentang sistem kepemilikan Kairo serta referensi dan laporan.
tr: Kahire, her Kahire programında statik olarak bir değerin tam olarak bir kez kullanılmasını sağlayan doğrusal tip bir sistem etrafında inşa edilmiş bir dildir. Bu doğrusal tip sistem, bir bellek hücresine iki kez yazma gibi bu tür hatalara neden olabilecek işlemlerin derleme zamanında tespit edilmesini sağlayarak çalışma zamanı hatalarını önlemeye yardımcı olur. Bu, bir sahiplik sistemi uygulayarak ve varsayılan olarak kopyalama ve düşürme değerlerini yasaklayarak elde edilir. Bu bölümde, Kahire'nin sahiplik ve anlık göndermeler gibi özelliklerden bahsedeceğiz.
zh_cn: 开罗是围绕线性类型系统构建的语言,它让我们能够静态地确保每个开罗方案都使用一个数值一次。 这一线性类型系统通过确保在编译时检测出可能导致此类错误的操作,例如写两次到记忆单元格,从而帮助防止运行时间错误。 这是通过实施所有权系统,禁止默认情况下复制和降低数值实现的。 在本章中,我们将讨论开罗的所有权系统以及参考和快照。

source: Ownership Using a Linear Type System
es: Propiedad Usando un Sistema de Tipo Lineal
fr: Propriété utilisant un système de type linéaire
id: Kepemilikan Menggunakan Sistem Tipe Linear
tr: Lineer Tip Sistemi Kullanarak Sahiplik
zh_cn: 使用线性类型系统的所有权

source: Cairo uses a linear type system. In such a type system, any value (a basic type, a struct, an enum) must be used and must only be used once. 'Used' here means that the value is either _destroyed_ or _moved_.
es: El Cairo utiliza un sistema de tipo lineal. En tal sistema de tipo, cualquier valor (un tipo básico, una estructura, un enum) debe ser utilizado y sólo debe ser utilizado una vez. 'Usado' aquí significa que el valor es _destroyed_ o _moved_.
fr: Le Caire utilise un système de type linéaire. Dans un tel système de type, toute valeur (un type de base, une structure, un enum) doit être utilisée et ne doit être utilisée qu'une seule fois.
id: Kairo menggunakan sistem tipe linear. Dalam sistem tipe seperti itu, nilai apapun (tipe dasar, struct, enum) harus digunakan dan harus hanya digunakan sekali. 'Digunakan' di sini berarti bahwa nilai adalah baik _destroyed_ atau _moved_.
tr: Kahire doğrusal tip sistemi kullanır. Böyle bir tip sistemde, herhangi bir değer (temel bir tür, bir yapı, bir enum) kullanılmalı ve sadece bir kez kullanılmalıdır. 'Kullanılmış' burada değerin ya _destroyed_ ya da _moved_ olduğu anlamına gelir.
zh_cn: 开罗使用线性类型系统。 在这种类型系统中, 任何值( 基本类型、 支架、 enum) 都必须使用, 并且只能使用一次 。 “ 使用” 这里的意思是该值要么被销毁, 要么被销毁 。

source: _Destruction_ can happen in several ways:
es: _Destrucción_ puede ocurrir de varias maneras:
fr: _Destruction_ peut se produire de plusieurs façons :
id: _Destruksi_ dapat terjadi dalam beberapa cara:
tr: _Destruction_ birkaç şekilde gerçekleşebilir:
zh_cn: {\fn方正黑体简体\fs18\b1\bord1\shad1\3cH2F2F2F}[法

source: a variable goes out of scope.
es: una variable queda fuera de alcance.
fr: une variable est hors champ.
id: variabel pergi keluar dari ruang lingkup.
tr: Bir değişken kapsam dışına çıkar.
zh_cn: a 变量超出范围。

source: a struct is destructured.
es: una estructura está desestructurada.
fr: une structure est déstructurée.
id: struktur yang didestrukturisasi.
tr: bir strüktür yapılandırılır.
zh_cn: a 建筑结构被拆解。

source: explicit destruction using `destruct()`.
es: destrucción explícita utilizando `destruction()`.
fr: destruction explicite en utilisant `destruct()`.
id: Penghancuran eksplisit menggunakan Connell).
tr: destruct() kullanılarak açık imha.
zh_cn: 使用 " 销毁() " 进行明确销毁。

source: _Moving_ a value simply means passing that value to another function.
es: _Mover_ un valor simplemente significa pasar ese valor a otra función.
fr: _Déplacer_ une valeur signifie simplement passer cette valeur à une autre fonction.
id: _Moving_ nilai hanya berarti melewati nilai itu ke fungsi lain.
tr: _Moving_ bir değer basitçe bu değeri başka bir fonksiyona geçirmek anlamına gelir.
zh_cn: 移动_一个值仅意味着将该值传递到另一个函数中。

source: This results in somewhat similar constraints to the Rust ownership model, but there are some differences. In particular, the Rust ownership model exists (in part) to avoid data races and concurrent mutable access to a memory value. This is obviously impossible in Cairo since the memory is immutable. Instead, Cairo leverages its linear type system for two main purposes:
es: Esto resulta en restricciones algo similares al modelo de propiedad de Rust, pero hay algunas diferencias. En particular, el modelo de propiedad de Rust existe (en parte) para evitar carreras de datos y acceso mutable concurrente a un valor de memoria. Esto es obviamente imposible en El Cairo ya que la memoria es inmutable. En cambio, El Cairo aprovecha su sistema de tipo lineal para dos propósitos principales:
fr: Il en résulte des contraintes quelque peu similaires au modèle de propriété Rust, mais il y a quelques différences. En particulier, le modèle de propriété Rust existe (en partie) pour éviter les courses de données et l'accès mutable concomitant à une valeur mémoire. Ceci est évidemment impossible au Caire puisque la mémoire est immuable.
id: Hal ini menghasilkan batasan yang sama dengan model kepemilikan Rust, tetapi ada beberapa perbedaan. Secara khusus, model kepemilikan Rust ada (di bagian) untuk menghindari ras data dan akses yang dapat diubah ke suatu nilai memori. Hal ini jelas tidak mungkin di Kairo karena memori itu tidak dapat berubah. Sebaliknya, Kairo memanfaatkan sistem linear untuk dua tujuan utama:
tr: Bu, Rust mülkiyet modeline biraz benzer kısıtlamalarla sonuçlanır, ancak bazı farklılıklar vardır. Özellikle, Rust mülkiyet modeli, veri yarışlarını önlemek ve bir bellek değerine eşzamanlı olarak değişken erişim sağlamak için var (kısmen). Bu, Kahire'de bellek değiştirilemez olduğu için açıkça imkansızdır. Bunun yerine, Kahire doğrusal tip sistemini iki ana amaç için kullanır:
zh_cn: 这导致与Rust所有制模式相类似的限制,但有一些差异。 特别是,Rust所有制模式(部分)存在,以避免数据竞赛和同时变换存取记忆值。 在开罗,这显然是不可能的,因为记忆是不可改变的。 相反,开罗利用其线型系统有两个主要目的:

source: Ensuring that all code is provable and thus verifiable.
es: Garantizar que todo el código sea demostrable y, por lo tanto, verificable.
fr: Veiller à ce que tous les codes soient prouvables et donc vérifiables.
id: Memastikan bahwa semua kode dapat dibuktikan dan dengan demikian dapat diverifikasi.
tr: Tüm kodların kanıtlanabilir ve dolayısıyla doğrulanabilir olmasını sağlamak.
zh_cn: 确保所有守则都是可证实的,因而是可核查的。

source: Abstracting away the immutable memory of the Cairo VM.
es: Abstrayendo la memoria inmutable de la VM de El Cairo.
fr: Abstraction faite de la mémoire immuable du MV du Caire.
id: Abstracting jauh memori abadi dari VM Kairo.
tr: Kahire sanal makinesinin değişmez hafızasını soyutlamak.
zh_cn: 总结开罗VM的永恒记忆

source: Ownership
es: Propiedad
fr: Propriété
id: Kepemilikan
tr: Sahiplik
zh_cn: 所有权所有权所有权

source: In Cairo, ownership applies to _variables_ and not to _values_. A value can safely be referred to by many different variables (even if they are mutable variables), as the value itself is always immutable. Variables however can be mutable, so the compiler must ensure that constant variables aren't accidentally modified by the programmer. This makes it possible to talk about ownership of a variable: the owner is the code that can read (and write if mutable) the variable.
es: En El Cairo, la propiedad se aplica a _variables_ y no a _valores_. Un valor puede ser referido con seguridad por muchas variables diferentes (incluso si son variables mutables), ya que el valor en sí es siempre inmutable. Variables sin embargo pueden ser mutables, por lo que el compilador debe asegurarse de que las variables constantes no sean modificadas accidentalmente por el programador. Esto hace posible hablar de propiedad de una variable: el propietario es el código que puede leer (y escribir si mutable) la variable.
fr: Au Caire, la propriété s'applique à _variables_ et non à _valeurs_. Une valeur peut être référencée en toute sécurité par de nombreuses variables différentes (même s'il s'agit de variables mutables), car la valeur elle-même est toujours immuable. Les variables peuvent toutefois être mutables, de sorte que le compilateur doit s'assurer que les variables constantes ne sont pas accidentellement modifiées par le programmeur. Cela permet de parler de propriété d'une variable : le propriétaire est le code qui peut lire (et écrire si mutable) la variable.
id: Di Kairo, kepemilikan berlaku untuk _variables_ dan tidak ke _nilai_. Nilai dengan aman dapat dirujuk oleh berbagai variabel (walaupun mereka variabel yang dapat dimutasi), karena nilai itu sendiri selalu dapat diubah. Variabel namun dapat bermutasi, sehingga kompiler harus memastikan bahwa variabel konstan tidak dapat diubah secara tidak sengaja oleh programmer. Hal ini memungkinkan untuk berbicara tentang kepemilikan dari variabel: pemilik adalah kode yang dapat membaca (dan menulis jika dapat dimutasi) variabel tersebut.
tr: Kahire'de, sahiplik _variables_ ve _values_ için geçerli değildir. Bir değer, değerin kendisi her zaman değiştirilemez olduğu için, birçok farklı değişken tarafından güvenle ifade edilebilir (değiştirilebilir değişkenler olsa bile). Değişkenler ancak değiştirilebilir olabilir, bu nedenle derleyici sabit değişkenlerin programcı tarafından yanlışlıkla değiştirilmediğinden emin olmalıdır. Bu, bir değişkenin sahipliği hakkında konuşmayı mümkün kılar: sahibi, okunabilen (ve yazabilen) koddur.
zh_cn: 在开罗,所有制适用于 _可变变量_,而不是_values_。许多不同的变量可以安全地引用一个值(即使它们是可变变量),因为该值本身总是不可变的。但变量可以是可变的,因此编译者必须确保不变变量不会被程序员意外地修改。这样就可以谈论变量的所有权:所有者是能够读取变量(如果可变则写)的代码。

source: This means that variables (not values) follow similar rules to Rust values:
es: Esto significa que las variables (no los valores) siguen reglas similares a los valores de Rust:
fr: Cela signifie que les variables (pas les valeurs) suivent des règles similaires aux valeurs de Rust :
id: Ini berarti bahwa variabel (bukan nilai) mengikuti aturan serupa ke nilai Rust:
tr: Bu, değişkenlerin (değerlerin değil) Rust değerlerine benzer kurallara uyduğu anlamına gelir:
zh_cn: 这意味着变量(不是数值)遵循与 Rust 值相似的规则:

source: Each variable in Cairo has an owner.
es: Cada variable en El Cairo tiene un propietario.
fr: Chaque variable au Caire a un propriétaire.
id: Setiap variabel di Kairo memiliki pemilik.
tr: Kahire'deki her değişkenin bir sahibi vardır.
zh_cn: 开罗的每个变数都有拥有者。

source: There can only be one owner at a time.
es: Sólo puede haber un propietario a la vez.
fr: Il ne peut y avoir qu'un seul propriétaire à la fois.
id: Hanya ada satu pemilik pada suatu waktu.
tr: Aynı anda sadece bir sahibi olabilir.
zh_cn: 一次只能有一个拥有者。

source: When the owner goes out of scope, the variable is destroyed.
es: Cuando el propietario se sale del alcance, la variable se destruye.
fr: Lorsque le propriétaire est hors de portée, la variable est détruite.
id: Ketika pemilik keluar dari lingkup, variabel hancur.
tr: Sahibi kapsam dışına çıktığında, değişken yok edilir.
zh_cn: 当所有者超出范围时,变量将被销毁。

source: Now that we’re past basic Cairo syntax, we won’t include all the `fn main() {` code in examples, so if you’re following along, make sure to put the following examples inside a main function manually. As a result, our examples will be a bit more concise, letting us focus on the actual details rather than boilerplate code.
es: Ahora que hemos pasado la sintaxis básica de El Cairo, no vamos a incluir todo el código `fn main() en ejemplos, por lo que si usted está siguiendo, asegúrese de poner los siguientes ejemplos dentro de una función principal manualmente. Como resultado, nuestros ejemplos serán un poco más concisos, permitiéndonos centrarse en los detalles reales en lugar de código de placa de caldera.
fr: Maintenant que nous avons passé la syntaxe de base du Caire, nous n'avons pas inclus tout le code `fn main() {` dans les exemples, donc si vous suivez, assurez-vous de mettre les exemples suivants à l'intérieur d'une fonction principale manuellement. Par conséquent, nos exemples seront un peu plus concis, nous permettant de nous concentrer sur les détails réels plutôt que le code de plaque de chaudière.
id: Sekarang kita melewati sintaks dasar Kairo, kita tidak akan memasukkan semua kode utama pada contoh-contoh, jadi jika Anda mengikuti bersama-sama, pastikan untuk menempatkan contoh-contoh berikut dalam fungsi utama secara manual. sebagai hasilnya, contoh-contoh kita akan menjadi sedikit lebih ringkas, membiarkan kita fokus pada rincian sebenarnya daripada kode boilerplate.
tr: Şimdi temel Kahire sözdizimini geçtiğimize göre, tüm fn main() kodunu örneklere dahil etmeyeceğiz, bu yüzden takip ediyorsanız, aşağıdaki örnekleri ana işlevin içine manuel olarak koyduğunuzdan emin olun. Sonuç olarak, örneklerimiz biraz daha özlü olacak ve kazan plakası kodu yerine gerçek ayrıntılara odaklanmamıza izin verecektir.
zh_cn: 既然我们已经过了基本的开罗语法,我们就不会把所有的“fn main () ” 代码都包含在示例中,所以如果你在跟踪的话,就一定要手工将以下示例放在主要函数中。 结果,我们的例子将更加简洁一些,让我们关注实际细节,而不是锅炉代码。

source: Variable Scope
es: Ámbito de aplicación variable
fr: Portée variable
id: Scope Variabel
tr: Değişken Kapsam
zh_cn: 可变范围

source: As a first example of the linear type system, we’ll look at the _scope_ of some variables. A scope is the range within a program for which an item is valid. Take the following variable:
es: Como primer ejemplo del sistema de tipos lineales, veremos el _scope_ de algunas variables. Un alcance es el rango dentro de un programa para el que un elemento es válido. Tome la siguiente variable:
fr: Comme premier exemple du système de type linéaire, nous allons regarder le _scope_ de certaines variables. Une portée est la plage dans un programme pour lequel un élément est valide. Prenez la variable suivante:
id: Sebagai contoh pertama dari sistem linear, kita akan melihat pada _scope_ dari beberapa variabel. Sebuah lingkup adalah jangkauan dalam sebuah program dimana sebuah item valid. Ambil variabel berikut:
tr: Lineer tip sisteminin ilk örneği olarak, bazı değişkenlerin _scope_'sine bakacağız. Bir kapsam, bir öğenin geçerli olduğu bir program içindeki aralıktır. Aşağıdaki değişkeni alın:
zh_cn: 作为线性类型系统的第一个示例,我们将查看某些变量的“范围 ” 。 范围是某个项目有效的程序内的范围。 选择以下变量:

source: The variable `s` refers to a short string. The variable is valid from the point at which it’s declared until the end of the current _scope_. Listing 4-1 shows a program with comments annotating where the variable `s` would be valid.
es: La variable `s` se refiere a una cadena corta. La variable es válida desde el punto en que se declara hasta el final del _scope_ actual. El listado 4-1 muestra un programa con comentarios anotando donde la variable `s` sería válida.
fr: La variable `s` se réfère à une chaîne courte. La variable est valide à partir du point où elle est déclarée jusqu'à la fin du _scope_ courant. Listing 4-1 affiche un programme avec des commentaires annotant où la variable `s` serait valide.
id: Variabelnya mengacu pada string pendek. Variabel valid dari titik dimana ia menyatakan sampai akhir _scope_. Daftar 4-1 menunjukkan sebuah program dengan komentar yang menunjukkan di mana variabel tersebut akan valid.
tr: s değişkeni kısa bir dizgeyi ifade eder. Değişken, geçerli _scope_'un sonuna kadar ilan edildiği noktadan itibaren geçerlidir. 4-1'i listelemek, s değişkeninin nerede geçerli olacağını belirten yorumlar içeren bir programı gösterir.
zh_cn: 变量`s'指短字符串。变量从宣布点起有效,一直到当前 _scope_结束。列出 4-1 显示一个程序,并附有注释,说明变量`s'在什么位置有效。

source: //TAG: ignore_fmt
id: //TAG: abaikan_fmt
tr: //TAG: görmezden gel_fmt
zh_cn: //TAG: 忽略_fmt

source: // s is not valid here, it’s not yet declared
es: // s no es válido aquí, todavía no se ha declarado
fr: // s n'est pas valide ici, il n'est pas encore déclaré
id: //s tidak valid disini, ini belum dideklarasikan
tr: // s burada geçerli değil, henüz ilan edilmedi
zh_cn: / s 在这里无效, 尚未申报

source: // s is valid from this point forward // do stuff with s
es: // s es válido a partir de este punto hacia adelante // hacer cosas con s
fr: // s est valide à partir de ce point vers l'avant // faire des choses avec s
id: //s valid dari titik ini ke depan///lakukan hal-hal dengan s
tr: // s bu noktadan itibaren geçerlidir // s ile şeyler yapın
zh_cn: / s 从此点起有效

source: // this scope is now over, and s is no longer valid
es: // este alcance ha terminado, y s ya no es válido
fr: // cette portée est maintenant terminée, et s n'est plus valide
id: //opong ini sekarang berakhir, dan s tidak lagi valid
tr: // bu kapsam artık bitti ve s artık geçerli değil
zh_cn: / 这一范围现已结束, s不再有效

source: <span class="caption">Listing 4-1: A variable and the scope in which it is valid</span>
es: <span class="caption">Lista 4-1: Una variable y el alcance en el que es válida</span>
fr: <span class="caption">Liste 4-1: Une variable et la portée dans laquelle elle est valide</span>
id: <span class="caption">Listing 4-1: Sebuah variabel dan lingkup dimana itu valid</span>
tr: span class="caption">Liste 4-1: Bir değişken ve geçerli olduğu kapsam/span>
zh_cn: <span类="Caption" > listing 4-1: 一个变量及其有效的范围 </span>

source: In other words, there are two important points in time here:
es: En otras palabras, hay dos puntos importantes en el tiempo aquí:
fr: En d'autres termes, il y a deux points importants dans le temps :
id: Dengan kata lain, ada dua poin penting dalam waktu di sini:
tr: Başka bir deyişle, burada zaman içinde iki önemli nokta vardır:
zh_cn: 换句话说,这里有两个重要时间点:

source: When `s` comes _into_ scope, it is valid.
es: Cuando `s` entra en el ámbito de aplicación, es válido.
fr: Quand `s` vient _into_ scope, il est valide.
id: Ketika datang ke dalam lingkup, itu valid.
tr: s _into_ kapsamı geldiğinde geçerlidir.
zh_cn: 当`s'到`into'范围时,它是有效的。

source: It remains valid until it goes _out of_ scope.
es: Sigue siendo válido hasta que se vaya _fuera de_ alcance.
fr: Il reste valide jusqu'à ce qu'il soit _ hors de_ portée.
id: Ini tetap berlaku sampai keluar dari jangkauan.
tr: _out of_ kapsamına girene kadar geçerli kalır.
zh_cn: 其有效期一直有效,直到它进入_超出_范围为止。

source: At this point, the relationship between scopes and when variables are valid is similar to that in other programming languages. Now we’ll build on top of this understanding by using the `Array` type we introduced in the previous ["Arrays"](./ch03-01-arrays.md) section.
es: En este punto, la relación entre los alcances y cuando las variables son válidas es similar a la de otros lenguajes de programación. Ahora vamos a construir sobre esta comprensión usando el tipo `Array` que introdujimos en la sección anterior ["Arrays"](./ch03-01-arrays.md).
fr: À ce stade, la relation entre les champs et quand les variables sont valides est similaire à celle d'autres langages de programmation. Maintenant, nous allons construire sur le dessus de cette compréhension en utilisant le type `Array` que nous avons introduit dans la section précédente ["Arrays"](../ch03-01-arrays.md).
id: Pada titik ini, hubungan antara lingkup dan ketika variabel valid serupa dengan yang dalam bahasa pemrograman lain. Sekarang kita akan membangun di atas pemahaman ini dengan menggunakan tipe Árray (jenis array) yang kita perkenalkan di bagian sebelumnya ["Arrays"]./ch03-01-array.md).
tr: Bu noktada, kapsamlar arasındaki ilişki ve değişkenler geçerli olduğunda, diğer programlama dillerindekine benzer. Şimdi, önceki ["Arrays"] bölümünde tanıttığımız Arrays tipini kullanarak bu anlayışın üzerine inşa edeceğiz.
zh_cn: 在这一点上,范围与变量有效时之间的关系与其他程序语言的关系相似。 现在,我们将利用在前一个[“阵列”部分(./ch03-01-arrays.md)中引入的“阵列”类型(./ch03-01-arys.md),在这种理解的基础上再接再厉。

source: Moving values
es: Valores en movimiento
fr: Valeurs mobiles
id: Memindahkan nilai
tr: Hareketli değerler
zh_cn: 移动值

source: As said earlier, _moving_ a value simply means passing that value to another function. When that happens, the variable referring to that value in the original scope is destroyed and can no longer be used, and a new variable is created to hold the same value.
es: Como se dijo anteriormente, _moviendo_ un valor simplemente significa pasar ese valor a otra función. Cuando eso sucede, la variable que se refiere a ese valor en el ámbito original es destruida y ya no puede ser usada, y una nueva variable es creada para mantener el mismo valor.
fr: Comme nous l'avons dit plus tôt, _moving_ une valeur signifie simplement passer cette valeur à une autre fonction. Lorsque cela se produit, la variable se référant à cette valeur dans la portée d'origine est détruite et ne peut plus être utilisée, et une nouvelle variable est créée pour tenir la même valeur.
id: Seperti yang dikatakan sebelumnya, _bergerak_ sebuah nilai hanya berarti melewati nilai itu ke fungsi lain. Ketika itu terjadi, variabel yang mengacu pada nilai yang dalam lingkup asli dihancurkan dan tidak dapat lagi digunakan, dan variabel baru dibuat untuk menyimpan nilai yang sama.
tr: Daha önce de belirtildiği gibi, _hareket_ bir değer basitçe bu değeri başka bir fonksiyona geçirmek anlamına gelir. Bu olduğunda, orijinal kapsamdaki bu değere atıfta bulunan değişken yok edilir ve artık kullanılamaz ve aynı değeri tutmak için yeni bir değişken oluşturulur.
zh_cn: 如前所述,_move_ a value 仅意味着将该值传递到另一个函数。如果发生这种情况,在原始范围中提及该值的变量将被销毁,不能再使用,并创建一个新的变量以持有相同的值。

source: Arrays are an example of a complex type that is moved when passing it to another function. Here is a short reminder of what an array looks like:
es: Las matrices son un ejemplo de un tipo complejo que se mueve al pasarlo a otra función. Aquí hay un breve recordatorio de cómo se ve una matriz:
fr: Les tableaux sont un exemple d'un type complexe qui est déplacé lors du passage à une autre fonction. Voici un bref rappel de ce à quoi ressemble un tableau:
id: Array adalah contoh dari jenis kompleks yang dipindahkan ketika melewatinya ke fungsi lain. Berikut adalah pengingat singkat tentang apa yang array terlihat seperti:
tr: Diziler, başka bir fonksiyona geçerken hareket eden karmaşık bir türe örnektir. Burada bir dizinin neye benzediğinin kısa bir hatırlatıcısı vardır:
zh_cn: 矩阵是一个复杂类型的例子,在将它传递到另一个函数时会移动。这里简短地提醒注意一个阵列的外观:
