Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Let's show using an example. We will try to store a `Span<felt252>` inside a dictionary. For that, we will use `Nullable<T>` and `Box<T>`. Also, we are storing a `Span<T>` and not an `Array<T>` because the latter does not implement the `Copy<T>` trait which is required for reading from a dictionary.
es: Vamos a mostrar usando un ejemplo. Vamos a tratar de almacenar un `Span<felt252'' dentro de un diccionario. Para ello, vamos a utilizar `Nulable<TÃ3 y `Box<TÃ3. AdemÃ¡s, estamos almacenando un `Span<TÃ3 y no un `Array<TÃ3 porque este último no implementa el `Copy<TÃ3 que se requiere para la lectura de un diccionario.
fr: Nous allons essayer de stocker un `Span<felt252>` à l'intérieur d'un dictionnaire. Pour cela, nous utiliserons `Nullable<T>` et `Box<T>`. De plus, nous stockons un `Span<T>` et non un `Array<T>` parce que ce dernier n'implémente pas le caractère `Copy<T>` qui est nécessaire pour lire à partir d'un dictionnaire.
id: Mari kita tunjukkan dengan menggunakan contoh. Kita akan mencoba untuk menyimpan sebuah ·Span<felt2> di dalam kamus. Untuk itu, kita akan menggunakan <T> yang dapat dibuang dan juga Box<T>. Juga, kita menyimpan sebuah span <T> dan bukan sebuah array <T> karena yang terakhir tidak mengimplementasikan sifat <T> yang diperlukan untuk membaca kamus.
tr: Bir örnek kullanarak gösterelim. Bir sözlük içinde bir Spanfelt252> saklamaya çalışacağız. Bunun için NulableT> ve BoxT> kullanacağız. Ayrıca, bir SpanT> ve bir ArrayT> değil, bir sözlük okumak için gerekli olan CopyT> özelliğini uygulamayacağız.
zh_cn: 让我们举一个例子来显示。 我们将尝试在字典中存储“ span< fellt252 ” 。 为此, 我们将使用“ nullble < T ” 和“ box < T ” 。 另外, 我们正在存储一个“ span < T ” 而不是“ Array < T ”, 因为后者没有执行从字典读取所需的“ compy < T 特性 ” 。

source: // Create the dictionary
es: // Crear el diccionario
fr: // Créer le dictionnaire
id: //Buat kamus
tr: // Sözlük oluştur
zh_cn: / 创建字典

source: // Create the array to insert
es: // Crear el array para insertar
fr: // Créer le tableau à insérer
id: //Buat array untuk menyisipkan
tr: // Eklemek için dizi oluştur
zh_cn: / 创建要插入的数组

source: // Insert it as a `Span`
es: // Insértelo como un `Span`
fr: // Insérez-le sous la forme d'une 'Span'
id: //Masukkan sebagai sebuah ¤Spané
tr: // Span olarak ekle
zh_cn: / 插入为“span”

source: In this code snippet, the first thing we did was to create a new dictionary `d`. We want it to hold a `Nullable<Span>`. After that, we created an array and filled it with values.
es: En este fragmento de código, lo primero que hicimos fue crear un nuevo diccionario `d`. Queremos que tenga un `Nulable<Span®. Después de eso, creamos un array y lo llenamos de valores.
fr: Dans cet extrait de code, la première chose que nous avons faite était de créer un nouveau dictionnaire `d`. Nous voulons qu'il tienne un `Nullable<Span>`. Après cela, nous avons créé un tableau et l'avons rempli de valeurs.
id: Dalam snippet kode ini, hal pertama yang kami lakukan adalah membuat kamus baru. kami ingin agar dapat menyimpan <Span> yang dapat dibuang. setelah itu, kami membuat sebuah array dan mengisinya dengan nilai-nilai.
tr: Bu kod snippet'inde, yaptığımız ilk şey yeni bir sözlük d oluşturmaktı. Bir NulableSpan> tutmasını istiyoruz. Bundan sonra bir dizi oluşturduk ve değerlerle doldurduk.
zh_cn: 在这个代码片断中,我们做的第一件事就是创建一个新的字典 `d'。我们希望它能保持一个`Nullable<span>。 之后, 我们创建了一个阵列, 并填满了数值 。

source: The last step is inserting the array as a span inside the dictionary. Notice that we do this using the `new` function of the `NullableTrait`.
es: El último paso es insertar el array como un lapso dentro del diccionario. Note que lo hacemos usando la función `nuevo` del `Trait Nullable`.
fr: La dernière étape consiste à insérer le tableau comme une portée à l'intérieur du dictionnaire. Notez que nous le faisons en utilisant la fonction `new` de la `NullableTrait`.
id: Langkah terakhir adalah memasukkan array sebagai rentang di dalam kamus.
tr: Son adım, diziyi sözlüğün içine bir açıklık olarak yerleştirmektir. Bunu NulableTrait'nin new işlevini kullanarak yaptığımıza dikkat edin.
zh_cn: 最后一步是将阵列作为横幅插入字典中。请注意,我们使用`NullbleTrait'的`新'功能来这样做。

source: Once the element is inside the dictionary, and we want to get it, we follow the same steps but in reverse order. The following code shows how to achieve that:
es: Una vez que el elemento está dentro del diccionario, y queremos conseguirlo, seguimos los mismos pasos pero en orden inverso. El siguiente código muestra cómo lograrlo:
fr: Une fois que l'élément est à l'intérieur du dictionnaire, et que nous voulons l'obtenir, nous suivons les mêmes étapes mais en ordre inverse. Le code suivant montre comment y parvenir :
id: Setelah elemennya ada di dalam kamus, dan kita ingin mendapatkannya, kita mengikuti langkah yang sama tetapi secara terbalik.
tr: Element sözlüğün içine girdikten sonra ve onu elde etmek istediğimizde, aynı adımları takip ediyoruz ama ters sırayla. Aşağıdaki kod bunu nasıl başaracağımızı gösterir:
zh_cn: 一旦元素在字典中,我们想得到它, 我们遵循同样的步骤, 但以相反的顺序。 下面的代码显示如何实现这一点 :

source: // Get value back
es: // Recuperar valor
fr: // Récupérer la valeur
id: //Kembalikan nilai
tr: // Değeri geri al
zh_cn: / 将值调回

source: // Search the value and assert it is not null
es: // Buscar el valor y afirmar que no es nulo
fr: // Rechercher la valeur et l'affirmer n'est pas null
id: //Cari nilai dan tegaskan itu tidak kosong
tr: // Değeri arayın ve sıfır olmadığını iddia edin
zh_cn: // 搜索值并声明它并非无效

source: "No value found"
es: "No se encontró valor"
fr: "Aucune valeur trouvée"
id: "Tidak ada nilai yang ditemukan"
tr: "Değer bulunamadı"
zh_cn: “未找到值”

source: // Verify we are having the right values
es: // Verificar que estamos teniendo los valores correctos
fr: // Vérifier que nous avons les bonnes valeurs
id: //Perverifikasikan kita memiliki nilai yang benar
tr: // Doğru değerlere sahip olduğumuzu doğrulayın
zh_cn: /核查我们是否拥有正确的值

source: "Expecting 8"
es: "Esperando 8"
fr: "En attente de 8"
id: "Menduga 8"
tr: "Eksik 8"
zh_cn: "预期8"

source: "Expecting 9"
es: "Esperando 9"
fr: "En attente de 9"
id: "Menduga 9"
tr: "Beklenti 9"
zh_cn: "预期9"

source: "Expecting 10"
es: "Esperando 10"
fr: "En attente de 10"
id: "Menduga 10"
tr: "Beklenti 10"
zh_cn: "预期10"

source: Here we:
es: Aquí tenemos:
fr: Ici, nous:
id: Di sini kita:
tr: İşte biz:
zh_cn: 我们在此:

source: Read the value using `get`.
es: Lea el valor usando `get`.
fr: Lire la valeur en utilisant `get`.
id: Baca nilainya dengan menggunakan égeté.
tr: get kullanarak değeri okuyun.
zh_cn: 使用 `get' 读取值。

source: Verified it is non-null using the `match_nullable` function.
es: Verificado es no nulo utilizando la función `match_nullable`.
fr: Vérifié, il n'est pas null en utilisant la fonction `match_nullable`.
id: Diverifikasi itu non-null menggunakan fungsi cocok-nullable.
tr: Doğrulanmış match_nullable işlevini kullanan null değildir.
zh_cn: 使用“匹配_nellable' 函数验证为非null。

source: Unwrapped the value inside the box and asserted it was correct.
es: Desenvolver el valor dentro de la caja y afirmó que era correcto.
fr: Déballé la valeur à l'intérieur de la boîte et a affirmé qu'elle était correcte.
id: Unwrapped nilai dalam kotak dan menegaskan itu benar.
tr: Kutunun içindeki değeri açtı ve doğru olduğunu iddia etti.
zh_cn: 解开盒子内的价值,并声称它是正确的。

source: The complete script would look like this:
es: El guión completo se vería así:
fr: Le script complet ressemblerait à ceci:
id: Naskah lengkap akan terlihat seperti ini:
tr: Senaryonun tamamı şöyle görünürdü:
zh_cn: 完整的脚本会看起来像这样:

source: Using Arrays inside Dictionaries
es: Uso de archivos dentro de diccionarios
fr: Utilisation d'arrays à l'intérieur des dictionnaires
id: Menggunakan Larik di dalam Kamus
tr: Sözlüklerin içindeki dizileri kullanma
zh_cn: 使用词典中的数组

source: In the previous section, we explored how to store and retrieve complex types inside a dictionary using `Nullable<T>` and `Box<T>`. Now, let's take a look at how to store an array inside a dictionary and dynamically modify its contents.
es: En la sección anterior, exploramos cómo almacenar y recuperar tipos complejos dentro de un diccionario usando `Nulable<TÃ3 y `Box<TÃ3. Ahora, vamos a echar un vistazo a cómo almacenar un array dentro de un diccionario y modificar dinámicamente sus contenidos.
fr: Dans la section précédente, nous avons exploré comment stocker et récupérer des types complexes à l'intérieur d'un dictionnaire en utilisant `Nullable<T>` et `Box<T>`. Maintenant, regardons comment stocker un tableau à l'intérieur d'un dictionnaire et modifier dynamiquement son contenu.
id: Di bagian sebelumnya, kami menjelajahi cara menyimpan dan mengambil jenis kompleks di dalam kamus menggunakan <T> yang dapat diubah dan secara dinamis. Sekarang, mari kita lihat bagaimana menyimpan sebuah array di dalam kamus dan mengubah isinya secara dinamis.
tr: Önceki bölümde, NulableT> ve BoxT> kullanarak bir sözlük içindeki karmaşık türleri nasıl depolayacağımızı ve geri getireceğimizi araştırdık. Şimdi, bir sözlüğün içinde bir diziyi nasıl depolayacağımıza ve içeriğini dinamik olarak nasıl değiştireceğimize bir göz atalım.
zh_cn: 在前一节中,我们探讨了如何在词典中使用“Nullallble<T”和“Box<T”在词典中存储和检索复杂类型。现在,让我们来看看如何在词典中存储阵列并动态修改其内容。

source: Storing arrays in dictionaries in Cairo is slightly different from storing other types. This is because arrays are more complex data structures that require special handling to avoid issues with memory copying and references.
es: Almacenar matrices en diccionarios en El Cairo es ligeramente diferente de almacenar otros tipos. Esto se debe a que las matrices son estructuras de datos más complejas que requieren un manejo especial para evitar problemas con la copia de memoria y referencias.
fr: Le stockage des tableaux dans les dictionnaires du Caire est légèrement différent du stockage d'autres types. C'est parce que les tableaux sont des structures de données plus complexes qui nécessitent une manipulation spéciale pour éviter les problèmes avec la copie de mémoire et les références.
id: Menyimpan array dalam kamus di Kairo sedikit berbeda dengan menyimpan tipe lain. Ini karena array adalah struktur data yang lebih kompleks yang memerlukan penanganan khusus untuk menghindari masalah dengan penyalinan memori dan referensi.
tr: Kahire'deki sözlüklerde dizilerin depolanması, diğer türlerin depolanmasından biraz farklıdır. Bunun nedeni, dizilerin bellek kopyalama ve referanslarla ilgili sorunları önlemek için özel işlem gerektiren daha karmaşık veri yapıları olmasıdır.
zh_cn: 开罗词典中存储的阵列与其他类型的存储略有不同。 这是因为阵列是更复杂的数据结构, 需要特别处理, 以避免内存复制和引用方面的问题 。

source: First, let's look at how to create a dictionary and insert an array into it. This process is pretty straightforward and follows a similar pattern to inserting other types of data:
es: Primero, veamos cómo crear un diccionario e insertar un array en él. Este proceso es bastante sencillo y sigue un patrón similar al de insertar otros tipos de datos:
fr: Tout d'abord, examinons comment créer un dictionnaire et y insérer un tableau. Ce processus est assez simple et suit un modèle similaire pour insérer d'autres types de données :
id: Pertama, mari kita lihat bagaimana membuat kamus dan memasukkan sebuah array ke dalamnya. Proses ini cukup sederhana dan mengikuti pola serupa untuk menyisipkan tipe data lain:
tr: İlk olarak, bir sözlük nasıl oluşturulacağına ve içine bir dizi nasıl yerleştirileceğine bakalım. Bu işlem oldukça basittir ve diğer veri türlerini eklemek için benzer bir desen izler:
zh_cn: 首先,让我们看看如何创建字典, 并插入一个阵列。 这个过程非常直截了当, 并遵循类似的模式来插入其他类型的数据 :

source: "Array inserted successfully."
es: "Array insertado con éxito."
fr: "Array inséré avec succès."
id: "Array dimasukkan dengan sukses."
tr: "Array başarıyla yerleştirildi."
zh_cn: "光线成功插入"

source: However, attempting to read an array from the dictionary using the `get` method will result in a compiler error. This is because `get` tries to copy the array in memory, which is not possible for arrays (as we've already mentioned in the [previous section](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively), `Array<T>` does not implement the `Copy<T>` trait):
es: Sin embargo, intentar leer un array desde el diccionario usando el método `get` resultará en un error de compilador. Esto se debe a que `get` intenta copiar el array en memoria, lo cual no es posible para arrays (como ya hemos mencionado en la [sección anterior](./ch03-02-dictionarys.md#dictionarys-of-types-not-supported-natively), `Array<T»:
fr: Cependant, essayer de lire un tableau à partir du dictionnaire en utilisant la méthode `get` entraînera une erreur de compilateur. C'est parce que `get` essaie de copier le tableau en mémoire, ce qui n'est pas possible pour les tableaux (comme nous l'avons déjà mentionné dans la section précédente](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively), `Array<T>` n'implémente pas le caractère `Copy<T>`):
id: Namun, mencoba untuk membaca sebuah array dari kamus menggunakan metode yang sebelumnya akan menghasilkan kesalahan kompiler. Ini adalah karena iarier.md#dictionary-of-type-no-supported-native), --Array<T> tidak mengimplementasikan sifat <T>:
tr: Bununla birlikte, get yöntemini kullanarak sözlükten bir dizi okumaya çalışmak, bir derleyici hatasıyla sonuçlanacaktır. Bunun nedeni, get diziyi bellekte kopyalamaya çalışır, bu da diziler için mümkün değildir (daha önce [önceki bölümde belirttiğimiz gibi]. /ch03-02-dictionaries.md#dictionaries-of-types-not-natively), ArrayT> özelliği uygulanmaz.
zh_cn: 然而,试图使用`get' 方法从字典中读取一个阵列将导致编译器错误。 这是因为“ 开始尝试在记忆中复制阵列, 这对于阵列是不可能的( 正如我们在[前一节](./ch03-02- 字典. md# 词典- 类型- 不支持- 本地)中已经提到的, `Array < T} 不执行“ Copy < T 特性 ” :

source: "Array: {:?}"
zh_cn: (反射: {? })

source: // This will cause a compiler error
es: // Esto causará un error en el compilador
fr: // Cela provoquera une erreur de compilateur
id: //Ini akan menyebabkan kesalahan kompiler
tr: // Bu bir derleyici hatasına neden olur
zh_cn: / 这将导致编译器错误

source: "No value!"
es: "¡Sin valor!"
fr: "Pas de valeur!"
id: "Tidak ada nilai!"
tr: "Değersiz!"
zh_cn: "没有价值!"

source: ```shell $ scarb cairo-run Compiling no_listing_15_dict_of_array_attempt_get v0.1.0 (listings/ch03-common-collections/no_listing_15_dict_of_array_attempt_get/Scarb.toml) error: Trait has no implementation in context: core::traits::Copy::<core::nullable::Nullable::<core::array::Array::<core::integer::u8>>> --> listings/ch03-common-collections/no_listing_15_dict_of_array_attempt_get/src/lib.cairo:12:20 let val = dict.get(0); // This will cause a compiler error ^*^ error: could not compile `no_listing_15_dict_of_array_attempt_get` due to previous error error: `scarb metadata` exited with error ```
es: •shell $ scarb cairo-run Compilando no_listing_15_dict_of_array_attempt_get v0.1.0 (listas/ch03-common-collections/no_listing_15_dict_of_array_attempt_get/Scarb.toml) error: El rasgo no se aplica en el contexto: core:::Traits::::Copy:::<core:::nulable::::Nullable:::<core:::array::::Array::<core::integer:::u8• --> listings/ch03-common-collections/no_listing_15_dict_of_array_attempt_get/src/lib.cairo:12:20 let val = dict.get(0); // Esto causará un error de compilador ^*^^ error de salida con error de error de error de contraseña
fr: ``shell $ scarb cairo-run Compiling no_listing_15_dict_of_array_attempt_get v0.1.0 (listings/ch03-common-collections/no_listing_15_dict_of_array_attempt_get/Scarb.toml) error: Trait n'a pas d'implémentation dans le contexte: core::trats::Copy::<core:::nullable::<core:::array:::Array::<core:::integer::u8>>> --> listings/ch03-common-collections/no_listing_15_dict_of_array_attempt_get/src/lib.cairo:12:20 let val = dict.get(0); // Cela causera une erreur de compilateur ^*^ erreur: ne peut pas compiler `no_listing_15_dict_of_array_attempt_get en raison d'erreur précédente: `scarb`
id: Alih Bahasa Pulpy
tr: shell $ scarb cairo-run Compiling no_listing_15_dict_of_attempt_get v0.1.0 (listings/ch03-common-collections/no_listing_15_of_atray_attempt_get/Scarb.toml) hatası: Trait'in bağlam içinde hiçbir uygulaması yoktur: çekirdek: ras: copy:
zh_cn: 拼写 no_ list_ 15_ dict_of_ array_ prevention_ get_ get v0.1.0 (列表/ch03- common- communications/ no_ list_ 15_ dict_ preputy_ attle_ attle_ get_ Scarb.tol) 错误: Trait 在上下文中未执行 : 核心 : traits: coppy: 核心 : < nolleble: < colleple:: < colleple::: < core:: arrary:: Array: > cocle: integer: u8_ -- 列出/ch03- commoncounts/no_ list_ 15_ dict_ fread_ attlement_ lible: section_ droad

source: To correctly read an array from the dictionary, we need to use dictionary entries. This allows us to get a reference to the array value without copying it:
es: Para leer correctamente un array del diccionario, necesitamos usar entradas del diccionario. Esto nos permite obtener una referencia al valor del array sin copiarlo:
fr: Pour lire correctement un tableau à partir du dictionnaire, nous devons utiliser les entrées du dictionnaire. Cela nous permet d'obtenir une référence à la valeur du tableau sans le copier :
id: Untuk membaca sebuah array dari kamus, kita perlu menggunakan entri kamus. Hal ini memungkinkan kita untuk mendapatkan referensi ke nilai array tanpa menyalinnya:
tr: Bir diziyi sözlükten doğru okumak için sözlük girdilerini kullanmamız gerekir. Bu, dizi değerine kopyalamadan bir referans almamıza izin verir:
zh_cn: 要正确读取字典中的数组, 我们需要使用字典条目。 这样我们就可以在不复制数组值的情况下获得该数组值的引用 :

source: Note: We must convert the array to a `Span` before finalizing the entry, because calling `NullableTrait::new(arr)` moves the array, thus making it impossible to return it from the function.
es: Nota: Debemos convertir el array a un `Span` antes de finalizar la entrada, porque llamando a `NulableTrait::new(arr)` mueve el array, haciendo así imposible devolverlo de la función.
fr: Note : Nous devons convertir le tableau en un `Span` avant de finaliser l'entrée, car l'appel `NullableTrait::new(arr)` déplace le tableau, ce qui rend impossible de le renvoyer de la fonction.
id: Catatan: Kita harus mengubah arraynya menjadi ÁSpané sebelum menyelesaikan entrinya, karena memanggil NullableTrait:::new--arrr). Menggerakkan susunannya, sehingga mustahil untuk mengembalikannya dari fungsi.
tr: Not: NulableTrait::new(arr)'i çağırmak, diziyi işlevinden döndürmeyi imkansız hale getirdiğinden, girdiyi sonlandırmadan önce diziyi Span'ya dönüştürmeliyiz.
zh_cn: 注意 : 我们必须在最后敲定条目前将数组转换为 `span', 因为调用 `NullbleTrait:: new(rr)' 将数组移动, 从而无法从函数返回它 。

source: To modify the stored array, such as appending a new value, we can use a similar approach. The following `append_value` function demonstrates this:
es: Para modificar el array almacenado, como añadir un nuevo valor, podemos utilizar un enfoque similar. La siguiente función `append_value` demuestra esto:
fr: Pour modifier le tableau stocké, comme l'ajout d'une nouvelle valeur, nous pouvons utiliser une approche similaire. La fonction `append_value` suivante le démontre :
id: Untuk mengubah array yang tersimpan, seperti menambahkan nilai baru, kita dapat menggunakan pendekatan yang sama. Fungsi berikut ini adalah:
tr: Yeni bir değer eklemek gibi depolanan diziyi değiştirmek için benzer bir yaklaşım kullanabiliriz. Aşağıdaki append_value işlevi bunu gösterir:
zh_cn: 要修改存储的阵列,例如附加新值,我们可以使用类似的方法。

source: In the `append_value` function, we access the dictionary entry, dereference the array, append the new value, and finalize the entry with the updated array.
es: En la función `append_value`, accedemos a la entrada del diccionario, designamos el array, agregamos el nuevo valor y finalizamos la entrada con el array actualizado.
fr: Dans la fonction `append_value`, nous accédons à l'entrée du dictionnaire, déréférencer le tableau, ajouter la nouvelle valeur et finaliser l'entrée avec le tableau mis à jour.
id: Dalam fungsi åappend_value, kita mengakses entri kamus, dereferensi array, menambahkan nilai baru, dan menyelesaikan entri dengan array terbaru.
tr: append_value işlevinde, sözlük girdisine erişir, diziden çıkarım yapar, yeni değeri ekler ve güncellenmiş dizi ile girişi sonlandırırız.
zh_cn: 在`附录_value' 函数中,我们访问字典条目,删减数组,附加新值,并与更新的数组一起完成条目的定稿。

source: Note: Removing an item from a stored array can be implemented in a similar manner.
es: Nota: Eliminar un elemento de un array almacenado se puede implementar de manera similar.
fr: Note: La suppression d'un élément d'un tableau stocké peut être implémentée de la même manière.
id: Catatan: Menghapus suatu butir dari suatu array yang disimpan dapat diimplementasikan dengan cara yang sama.
tr: Not: Bir öğeyi depolanan bir diziden çıkarmak benzer bir şekilde uygulanabilir.
zh_cn: 注意: 从存储的数组中删除一项可以以类似方式执行 。

source: Below is the complete example demonstrating the creation, insertion, reading, and modification of an array in a dictionary:
es: A continuación se muestra el ejemplo completo que demuestra la creación, inserción, lectura y modificación de un array en un diccionario:
fr: Voici l'exemple complet de la création, de l'insertion, de la lecture et de la modification d'un tableau dans un dictionnaire :
id: Di bawah ini adalah contoh lengkap menunjukkan penciptaan, penyisipan, membaca, dan modifikasi sebuah array dalam kamus:
tr: Aşağıda bir sözlükte bir dizinin oluşturulmasını, eklenmesini, okunmasını ve değiştirilmesini gösteren tam örnek verilmiştir:
zh_cn: 下面是显示字典中数组的创建、插入、读取和修改的完整示例:

source: "Before insertion: {:?}"
es: "Antes de la inserción: {:?}"
fr: "Avant insertion: {:?}"
id: "Sebelum penyisipan: {:?}"
tr: "Eklenmeden önce: :?"
zh_cn: "之前插入:{{{{}}}"

source: "After insertion: {:?}"
es: "Después de la inserción: {:?}"
fr: "Après insertion: {:?}"
id: "Setelah penyisipan: {:?}"
tr: "Eklenmeden sonra: :?"
zh_cn: "插入后:{{{:}}"

source: {{#quiz ../quizzes/ch03-02-dictionaries.toml}}
es: quiz../quizzes/ch03-02-dictionarys.toml
fr: {{#quiz../quizes/ch03-02-dictionaries.toml}}
zh_cn: ///ch03-02 - 字典.toml

source: Understanding Cairo's Ownership system
es: Comprensión del sistema de propiedad de El Cairo
fr: Comprendre le système de propriété du Caire
id: Memahami sistem kepemilikan Kairo
tr: Kahire'nin Sahiplik Sistemini Anlamak
zh_cn: 理解开罗所有权制度
