Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: In Cairo, named parameters allow you to specify the names of arguments when you call a function. This makes the function calls more readable and self-descriptive. If you want to use named parameters, you need to specify the name of the parameter and the value you want to pass to it. The syntax is `parameter_name: value`. If you pass a variable that has the same name as the parameter, you can simply write `:parameter_name` instead of `parameter_name: variable_name`.
es: En El Cairo, los parámetros nombrados le permiten especificar los nombres de los argumentos cuando llama a una función. Esto hace que las llamadas a la función sean más legibles y autodescriptibles. Si desea utilizar parámetros nombrados, necesita especificar el nombre del parámetro y el valor que desea pasar a él. La sintaxis es `parameter_name: value`. Si pasa una variable que tiene el mismo nombre que el parámetro, puede simplemente escribir `:parameter_name` en lugar de `parameter_name: variable_name`.
fr: Au Caire, les paramètres nommés vous permettent de spécifier les noms des arguments lorsque vous appelez une fonction. Cela rend la fonction plus lisible et autodescriptive. Si vous voulez utiliser les paramètres nommés, vous devez spécifier le nom du paramètre et la valeur que vous voulez lui transmettre. La syntaxe est `parameter_name: value`. Si vous passez une variable qui a le même nom que le paramètre, vous pouvez simplement écrire `:parameter_name` au lieu de `parameter_name: variable_name`.
id: Di Kairo, parameter bernama memungkinkan Anda untuk menentukan nama dari parameter dan nilai yang ingin Anda masukkan. Ini membuat fungsi panggilan yang lebih dapat dibaca dan deskriptif. Jika Anda ingin menggunakan parameter bernama, Anda hanya perlu menentukan nama parameter dan nilai yang ingin Anda masukkan ke dalamnya. Sintaks adalah nilai: nilai. Jika Anda melewatkan variabel yang sama dengan parameter, Anda dapat menulis ▪:parameter_name: variable_name.
tr: Kahire'de, adlandırılmış parametreler, bir işlevi çağırdığınızda argümanların adlarını belirtmenize izin verir. Bu, işlevin daha okunabilir ve kendi kendini tanımlayıcı olmasını sağlar. Adlandırılmış parametreleri kullanmak istiyorsanız, parametrenin adını ve ona geçmek istediğiniz değeri belirtmeniz gerekir. Sözdizimi parametre_name: value'dir. Parametreyle aynı adı taşıyan bir değişkeni geçerseniz, basitçe parametresi_name'i yazabilirsiniz.
zh_cn: 在开罗, 命名参数允许您在调用函数时指定参数名称。 这会使函数调用更加可读和自我描述性。 如果您想要使用指定参数, 您需要指定参数的名称和要传递给参数的值。 语法是 ` 参数_ name: value'。 如果您通过一个与参数名称相同的变量, 您可以简单地写入 `: 参数_ name ', 而不是`参数_ name: 变量_ name' 。

source: Here is an example:
es: He aquí un ejemplo:
fr: Voici un exemple :
id: Ini contohnya:
tr: İşte bir örnek:
zh_cn: 以下是一个例子:

source: Statements and Expressions
es: Declaraciones y expresiones
fr: Déclarations et expressions
id: Pernyataan dan Pernyataan
tr: İfadeler ve İfadeler
zh_cn: 语句和表达式

source: Function bodies are made up of a series of statements optionally ending in an expression. So far, the functions we’ve covered haven’t included an ending expression, but you have seen an expression as part of a statement. Because Cairo is an expression-based language, this is an important distinction to understand. Other languages don’t have the same distinctions, so let’s look at what statements and expressions are and how their differences affect the bodies of functions.
es: Los cuerpos funcionales se componen de una serie de declaraciones opcionalmente que terminan en una expresión. Hasta ahora, las funciones que hemos cubierto no han incluido una expresión final, pero usted ha visto una expresión como parte de una declaración. Debido a que El Cairo es un lenguaje basado en la expresión, esta es una distinción importante para entender. Otros idiomas no tienen las mismas distinciones, así que vamos a ver qué declaraciones y expresiones son y cómo sus diferencias afectan a los cuerpos de funciones.
fr: Les corps de fonction sont constitués d'une série d'énoncés se terminant en option dans une expression. Jusqu'à présent, les fonctions que nous avons couvertes haven't comprenaient une expression de fin, mais vous avez vu une expression comme faisant partie d'une déclaration. Parce que le Caire est un langage basé sur l'expression, il s'agit d'une distinction importante à comprendre. D'autres langues n'ont pas les mêmes distinctions, alors regardons quelles sont les déclarations et les expressions et comment leurs différences affectent les corps de fonctions.
id: Fungsi tubuh terdiri dari serangkaian pernyataan yang mungkin berakhir dalam sebuah ekspresi. sejauh ini, fungsi-fungsi yang kita telah meliputi belum termasuk ekspresi akhir, tetapi Anda telah melihat ekspresi sebagai bagian dari pernyataan. karena Kairo adalah bahasa berbasis ekspresi, ini adalah perbedaan penting untuk dipahami. bahasa lain tidak memiliki perbedaan yang sama, sehingga biarkan orang melihat pernyataan dan ekspresi apa dan bagaimana perbedaan mereka mempengaruhi tubuh fungsi.
tr: Fonksiyon organları isteğe bağlı olarak bir ifade ile biten bir dizi ifadeden oluşur. Şimdiye kadar ele aldığımız işlevler bir bitiş ifadesi içermedi, ancak bir ifadenin bir parçası olarak bir ifade gördünüz. Kahire ifadeye dayalı bir dil olduğu için, bu anlaşılması gereken önemli bir ayrımdır. Diğer diller aynı ayrımlara sahip değildir, bu yüzden hangi ifadelerin ve ifadelerin ve farklılıklarının işlevlerin bedenlerini nasıl etkilediğine bakalım.
zh_cn: 功能机构由一系列可选以表达方式结尾的声明组成。 到目前为止,我们所覆盖的功能没有包含结束表达方式,但你把表达方式看作是声明的一部分。 由于开罗是一种以表达方式为基础的语言,这是理解的重要区别。 其他语言没有相同的区别,所以让我们看看什么是声明和表达方式,以及它们的差异如何影响职能体系。

source: **Statements** are instructions that perform some action and do not return a value.
es: **Las declaraciones** son instrucciones que realizan alguna acción y no devuelven un valor.
fr: **Les états** sont des instructions qui effectuent une action et ne retournent pas une valeur.
id: **Statements** adalah instruksi yang melakukan beberapa tindakan dan tidak kembali nilai.
tr: **Statements** bazı eylemler gerçekleştiren ve bir değer döndürmeyen talimatlardır.
zh_cn: ** 说明** 是指示,可采取某些行动,但不返回值。

source: **Expressions** evaluate to a resultant value. Let’s look at some examples.
es: **Expresiones** evaluar a un valor resultante. Echemos un vistazo a algunos ejemplos.
fr: **Expressions** évaluer à une valeur résultante. Laissez-nous regarder quelques exemples.
id: Coba kita lihat contoh-contohnya.
tr: **Ekspresyonlar** sonuç değerine göre değerlendirilir. Bazı örneklere bakalım.
zh_cn: ** 表达** 评估结果价值。让我们看看一些例子。

source: We’ve actually already used statements and expressions. Creating a variable and assigning a value to it with the `let` keyword is a statement. In Listing 2-1, `let y = 6;` is a statement.
es: En realidad ya hemos usado frases y expresiones. Crear una variable y asignarle un valor con la palabra clave `let` es una declaración. En Listado 2-1, `let y = 6;` es una declaración.
fr: Nous avons déjà utilisé des instructions et des expressions. Créer une variable et lui attribuer une valeur avec le mot-clé `let` est une instruction. Dans Listing 2-1, `let y = 6;` est une instruction.
id: Kami sebenarnya sudah menggunakan pernyataan dan ekspresi. membuat sebuah variabel dan memberikan nilai kepadanya dengan kata kunci adalah sebuah pernyataan. dalam daftar 2-1, biarkan y = 6; adalah sebuah pernyataan.
tr: Aslında ifade ve ifadeleri zaten kullandık. let anahtar kelimesi ile bir değişken oluşturmak ve ona bir değer atamak bir ifadedir. Listeleme 2-1'de let y = 6; bir ifadedir.
zh_cn: 我们实际上已经使用了语句和表达式。 创建一个变量, 用“ let' key is a statement. in listing 2- 1, `let y = 6;'是一个语句, 并给它指定一个值 。

source: <span class="caption">Listing 2-1: A `main` function declaration containing one statement</span>
es: <span class="caption">Lista 2-1: Una declaración de función `main` que contiene una declaración</span>
fr: <span class="caption">Liste 2-1: Une déclaration de fonction `main` contenant une déclaration</span>
id: <span class="caption">Listing 2-1: Sebuah deklarasi fungsi æmainæu berisi satu pernyataan</span>
tr: span class="caption">Listing 2-1: Bir ifade içeren bir main fonksiyon bildirimi/span>
zh_cn: <span类=“caption” > listing 2-1: 包含一个声明 </span>的“主要”功能声明

source: Function definitions are also statements; the entire preceding example is a statement in itself.
es: Las definiciones de funciones también son declaraciones; todo el ejemplo anterior es una declaración en sí misma.
fr: Les définitions de fonctions sont également des énoncés; l'exemple précédent est un énoncé en soi.
id: Definisi fungsi juga merupakan pernyataan; seluruh contoh sebelumnya adalah sebuah pernyataan.
tr: Fonksiyon tanımları aynı zamanda ifadelerdir; önceki örneğin tamamı kendi içinde bir ifadedir.
zh_cn: 功能定义也是一种说明;前一例子的全部是说明本身。

source: Statements do not return values. Therefore, you can’t assign a `let` statement to another variable, as the following code tries to do; you’ll get an error:
es: Las declaraciones no devuelven valores. Por lo tanto, no puede asignar una instrucción `let` a otra variable, como intenta hacer el siguiente código; obtendrá un error:
fr: Les instructions ne retournent pas les valeurs. Par conséquent, vous ne pouvez pas assigner une instruction `let` à une autre variable, comme le code suivant essaie de le faire; vous obtiendrez une erreur:
id: Pernyataan tidak mengembalikan nilai-nilai. Oleh karena itu, Anda tidak dapat menetapkan pernyataan åleté ke variabel lain, sebagai kode berikut mencoba untuk melakukan; Anda akan mendapatkan kesalahan:
tr: İfadeler değerleri döndürmez. Bu nedenle, aşağıdaki kodun yapmaya çalıştığı gibi başka bir değişkene let ifadesi atayamazsınız; bir hata alırsınız:
zh_cn: 语句不返回值。 因此, 您不能像以下代码试图做到的那样, 将“ let” 语句指定给另一个变量; 您会遇到错误 :

source: When you run this program, the error you’ll get looks like this:
es: Cuando ejecute este programa, el error que obtendrá se ve así:
fr: Lorsque vous exécutez ce programme, l'erreur que vous obtenez ressemble à ceci:
id: Ketika Anda menjalankan program ini, kesalahan Anda akan mendapatkan terlihat seperti ini:
tr: Bu programı çalıştırdığınızda, alacağınız hata şu şekilde görünür:
zh_cn: 当您运行此程序时, 错误会变成这个样子 :

source: The `let y = 6` statement does not return a value, so there isn’t anything for `x` to bind to. This is different from what happens in other languages, such as C and Ruby, where the assignment returns the value of the assignment. In those languages, you can write `x = y = 6` and have both `x` and `y` have the value `6`; that is not the case in Cairo.
es: La declaración `let y = 6` no devuelve un valor, por lo que no hay nada a lo que `x` deba vincularse. Esto es diferente de lo que ocurre en otros idiomas, como C y Ruby, donde la asignación devuelve el valor de la asignación. En esos idiomas, puede escribir `x = y = 6` y tener tanto `x` como `y` tienen el valor `6`; ese no es el caso en El Cairo.
fr: L'instruction `let y = 6` ne renvoie pas de valeur, donc il n'y a rien pour `x` à lier. Ceci est différent de ce qui se passe dans d'autres langues, comme C et Ruby, où l'assignation renvoie la valeur de l'assignation. Dans ces langues, vous pouvez écrire `x = y = 6` et avoir à la fois `x` et `y` la valeur `6`; ce n'est pas le cas au Caire.
id: Pernyataan y = 6) tidak mengembalikan nilai, sehingga tidak ada sesuatu untuk diikat. ini berbeda dari apa yang terjadi dalam bahasa lain, seperti C dan Ruby, di mana tugas tersebut kembali nilai dari tugas tersebut. dalam bahasa-bahasa itu, Anda dapat menulis ▪x = 6; dan memiliki keduanya ·x.
tr: let y = 6 ifadesi bir değer döndürmez, bu yüzden x'nin bağlanması için hiçbir şey yoktur. Bu, atamanın atamanın değerini döndürdüğü C ve Ruby gibi diğer dillerde olanlardan farklıdır. Bu dillerde, x = y = 6 yazabilir ve hem x hem de y değerine sahip olabilirsiniz 6; Kahire'de durum böyle değildir.
zh_cn: `let y = 6' 语句不返回一个值,所以`x' 没有任何东西可以约束。这与其他语言,如C和Ruby不同,在这两个语言中,任务返回了任务的价值。在这些语言中,您可以写“x = y = 6”,并且有`x'和`y'都有价值`6';开罗的情况并非如此。

source: Expressions evaluate to a value and make up most of the rest of the code that you’ll write in Cairo. Consider a math operation, such as `5 + 6`, which is an expression that evaluates to the value `11`. Expressions can be part of statements: in Listing 2-1, the `6` in the statement `let y = 6;` is an expression that evaluates to the value `6`.
es: Las expresiones evalúan a un valor y constituyen la mayor parte del resto del código que escribirá en El Cairo. Considere una operación matemática, como `5 + 6`, que es una expresión que evalúa al valor `11`. Las expresiones pueden ser parte de las declaraciones: en Listado 2-1, el `6` en la declaración `let y = 6;` es una expresión que evalúa al valor `6`.
fr: Les expressions évaluent à une valeur et constituent la plupart du reste du code que vous allez écrire au Caire. Considérez une opération mathématique, telle que `5 + 6`, qui est une expression qui évalue à la valeur `11`. Expressions peuvent faire partie d'énoncés: dans Listing 2-1, le `6` dans l'énoncé `let y = 6;` est une expression qui évalue à la valeur `6`.
id: Ekspresi dievaluasi ke nilai dan membentuk sebagian besar kode yang Anda tulis di Kairo.
tr: İfadeler bir değere değer verir ve Kahire'de yazacağınız kodun geri kalanının çoğunu oluşturur. 5 + 6 gibi bir matematik işlemi düşünün, bu 11 değerine değer veren bir ifadedir. İfadeler ifadelerin bir parçası olabilir: 2-1'in listelenmesinde, let y = 6; ifadesindeki 6 değeri değerlendiren bir ifadedir.
zh_cn: 表达式可以作为声明的一部分:在“列出2-1”、“列出”和“列出”中的“6”中,表示式可以是声明的一部分;在“列出”和“列出”中,表示式可以是“6”中的“6”表示式,也可以是“6”的表示式。

source: Calling a function is an expression since it always evaluates to a value: the function's explicit return value, if specified, or the 'unit' type `()` otherwise.
es: Llamar a una función es una expresión ya que siempre se evalúa a un valor: el valor de retorno explícito de la función, si se especifica, o el tipo "unidad" `()` de lo contrario.
fr: Appeler une fonction est une expression puisqu'elle évalue toujours à une valeur : la valeur de retour explicite de la fonction, si elle est spécifiée, ou le type d'unité `()` autrement.
id: Memanggil sebuah fungsi adalah sebuah ekspresi karena selalu dievaluasi ke suatu nilai: nilai kembali fungsi secara eksplisit, jika dispesifikasikan, atau tipe 'unit' quot; sebaliknya.
tr: Bir fonksiyonu çağırmak, her zaman bir değere değer verdiği için bir ifadedir: fonksiyonun açık getiri değeri, belirtilmişse veya 'birim' türü () aksi takdirde.
zh_cn: 调用函数是一个表达式,因为它总是对一个值进行评价:函数的明显返回值(如果有指定的话)或“单位”类型`()'。

source: A new scope block created with curly brackets is an expression, for example:
es: Un nuevo bloque de alcance creado con corchetes rizados es una expresión, por ejemplo:
fr: Un nouveau bloc de champ créé avec des crochets bouclés est une expression, par exemple:
id: Sebuah blok lingkup baru dibuat dengan braket keriting adalah ekspresi, misalnya:
tr: Kıvırcık parantezlerle oluşturulan yeni bir kapsam bloğu bir ifadedir, örneğin:
zh_cn: 以卷轴括号创建的新范围块是一个表达式,例如:

source: "The value of y is: {}"
es: "El valor de y es:
fr: "La valeur de y est: {}"
id: Nilai y adalah: {}"
tr: "Y'nin değeri: "
zh_cn: "y的价值是:"

source: This expression:
es: Esta expresión:
fr: Cette expression :
id: Ekspresi ini:
tr: Bu ifade:
zh_cn: 此表达式:

source: is a block that, in this case, evaluates to `4`. That value gets bound to `y` as part of the `let` statement. Note that the `x + 1` line doesn’t have a semicolon at the end, which is unlike most of the lines you’ve seen so far. Expressions do not include ending semicolons. If you add a semicolon to the end of an expression, you turn it into a statement, and it will then not return a value. Keep this in mind as you explore function return values and expressions next.
es: es un bloque que, en este caso, evalúa a `4`. Ese valor se fija en `y` como parte de la declaración `let`. Tenga en cuenta que la línea `x + 1` no tiene un punto y coma al final, que es diferente de la mayoría de las líneas que ha visto hasta ahora. Las expresiones no incluyen punto y coma. Si añade un punto y coma al final de una expresión, lo convierte en una declaración, y entonces no devolverá un valor. Tenga esto en cuenta mientras explora valores y expresiones de retorno de función siguiente.
fr: est un bloc qui, dans ce cas, évalue à `4`. Cette valeur se lie à `y` dans le cadre de l'instruction `let`. Notez que la ligne `x + 1` n'a pas de point-virgule à la fin, ce qui est différent de la plupart des lignes que vous avez vues jusqu'à présent. Expressions ne comprennent pas les points-virgule de fin. Si vous ajoutez un point-virgule à la fin d'une expression, vous le transformez en point-virgule, et il ne retournera pas une valeur. Gardez cela à l'esprit que vous explorez la fonction retourner les valeurs et les expressions à la fin d'une expression.
id: adalah sebuah blok yang, dalam hal ini, dievaluasi ke semikolon pada akhirnya, yang tidak seperti sebagian besar baris yang Anda lihat sejauh ini. ekspresi tidak termasuk akhir dari semicolon. jika Anda menambahkan semikolon ke ujung ekspresi, Anda mengubahnya menjadi sebuah pernyataan, dan kemudian tidak akan mengembalikan nilai. tetap pikirkan ini dalam pikiran saat Anda menjelajahi fungsi kembali dan selanjutnya.
tr: Bu durumda, 4 değerini değerlendiren bir bloktur. Bu değer, let ifadesinin bir parçası olarak y'ye bağlanır. x + 1 satırının sonunda noktalı bir virgül olmadığını unutmayın, bu da şu ana kadar gördüğünüz çizgilerin çoğundan farklı. İfadeler noktalı virgülleri sonlandırmayı içermez. Bir ifadenin sonuna noktalı virgül eklerseniz, bu ifadeyi bir ifadeye dönüştüreceksiniz.
zh_cn: 是一个块块,在此情况下,该值作为“ let” 语句的一部分被“ y” 绑在“ let” 语句中。 请注意, “ x+ 1” 线在结尾处没有分号, 这与您目前所看到的多数行不同。 表达式不包括结束分号。 如果您在表达式结尾处添加分号, 您将把它转换成一个语句, 这样它就不会返回一个值。 当您在探索下一个函数返回值和表达式时, 请记住这一点 。

source: Functions with Return Values
es: Funciones con valores de retorno
fr: Fonctions avec valeurs de retour
id: Fungsi dengan Nilai Kembali
tr: Dönüş Değerleri ile Fonksiyonlar
zh_cn: 具有返回值的函数

source: Functions can return values to the code that calls them. We don’t name return values, but we must declare their type after an arrow (`->`). In Cairo, the return value of the function is synonymous with the value of the final expression in the block of the body of a function. You can return early from a function by using the `return` keyword and specifying a value, but most functions return the last expression implicitly. Here’s an example of a function that returns a value:
es: Las funciones pueden devolver valores al código que los llama. No nombramos valores de retorno, pero debemos declarar su tipo después de una flecha (`-). En El Cairo, el valor de retorno de la función es sinónimo del valor de la expresión final en el bloque del cuerpo de una función. Puede volver temprano de una función utilizando la palabra clave `return` y especificando un valor, pero la mayoría de las funciones devuelven la última expresión implícitamente. Aquí hay un ejemplo de una función que devuelve un valor:
fr: Au Caire, la valeur de retour de la fonction est synonyme de la valeur de l'expression finale dans le bloc du corps d'une fonction. Vous pouvez retourner tôt d'une fonction en utilisant le mot-clé `retour` et en spécifiant une valeur, mais la plupart des fonctions retournent implicitement la dernière expression. Voici un exemple de fonction qui retourne une valeur:
id: Fungsi dapat mengembalikan nilai-nilai ke kode yang menyebut mereka. kita tidak dapat menyebutkan nilai-nilai pengembalian nama, tapi kita harus menyatakan tipe mereka setelah panah. di Kairo, nilai kembali fungsi identik dengan nilai dari ekspresi akhir dalam blok dari fungsi. Anda dapat kembali lebih awal dari sebuah fungsi dengan menggunakan kata kunci ▪ dan menspesifikasikan nilai, tetapi kebanyakan fungsi mengembalikan ekspresi terakhir secara implisit. Di sini contoh dari fungsi yang menghasilkan sebuah fungsi:
tr: Fonksiyonlar, onları çağıran koda değerleri döndürebilir. Dönüş değerlerini adlandırmıyoruz, ancak türlerini bir oktan sonra ilan etmeliyiz (->). Kahire'de, fonksiyonun dönüş değeri, bir fonksiyonun gövdesinin bloğundaki son ifadenin değeri ile eş anlamlıdır. return anahtar kelimesini kullanarak ve bir değer belirleyerek bir fonksiyondan erken dönebilirsiniz, ancak çoğu fonksiyon, bir fonksiyonun son ifadesini dolaylı olarak döndürür.
zh_cn: 函数可以返回到调用它们的代码中值。 我们不命名返回值, 但是我们必须在箭头后声明其类型 (`- \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: There are no function calls, or even `let` statements in the `five` function—just the number `5` by itself. That’s a perfectly valid function in Cairo. Note that the function’s return type is specified too, as `-> u32`. Try running this code; the output should look like this:
es: No hay llamadas a funciones, o incluso `let` instrucciones en la función `cinco`—sólo el número `5` por sí mismo. Esa es una función perfectamente válida en El Cairo. Tenga en cuenta que el tipo de retorno de la función se especifica también, como `-> u32`. Intente ejecutar este código; la salida debe verse así:
fr: Il n'y a pas d'appel de fonction, ni même d'instructions `let` dans la fonction `5' – juste le nombre `5` en soi. C'est une fonction parfaitement valide au Caire. Notez que le type de retour de fonction est également spécifié, comme `-> u32`. Essayez d'exécuter ce code; la sortie devrait ressembler à ceci:
id: Tidak ada panggilan fungsi, atau bahkan pernyataan ± lima fungsi hanya dengan sendirinya. itu adalah fungsi yang sangat valid di Kairo. perhatikan bahwa fungsi tipe kembali juga dispesifikasikan, seperti u32. coba jalankan kode ini; keluarannya harus terlihat seperti ini:
tr: beş fonksiyonunda fonksiyon çağrıları, hatta let ifadeleri yoktursadece 5 sayısı kendi başınadır. Kahire'de bu mükemmel geçerli bir fonksiyondur. -> u32 olarak fonksiyonun dönüş tipinin de belirtildiğini unutmayın. Bu kodu çalıştırmayı deneyin; çıktı şu şekilde görünmelidir:
zh_cn: ` 5' 函数中没有函数调用,甚至没有`let'mentions ',仅用数字'5'本身即可。在开罗,这是一个完全有效的函数。请注意,函数的返回类型也被指定为'- > u32'。尝试运行此代码;输出应该像这样显示 :
