Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Finally, if we want to add a field to `Wallet` representing its address and we want that field to be different than `T` but generic as well, we can simply add another generic type between the `<>`:
es: Por último, si queremos añadir un campo a `Wallet` que representa su dirección y queremos que ese campo sea diferente a `T` pero genérico también, podemos simplemente añadir otro tipo genérico entre el :
fr: Enfin, si nous voulons ajouter un champ à `Wallet` représentant son adresse et que nous voulons que ce champ soit différent de `T` mais aussi générique, nous pouvons simplement ajouter un autre type générique entre le `<>`:
id: Akhirnya, jika kita ingin menambahkan lapangan ke ▪Wallet yang mewakili alamatnya dan kita ingin medan itu berbeda dari biasanya, tapi juga umum, kita dapat menambahkan jenis umum lain antara <>:
tr: Son olarak, Wallet adresini temsil eden bir alan eklemek istersek ve bu alanın T'den farklı olmasını istersek, aynı zamanda jenerik de, > arasında başka bir genel tür ekleyebiliriz:
zh_cn: 最后,如果我们想在`瓦莱特'中增加一个代表其地址的字段,并且我们希望该字段与`T'不同,但同样是一般性的,我们可以简单地在_________之间增加另一个通用类型:_________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________

source: We add to the `Wallet` struct definition a new generic type `U` and then assign this type to the new field member `address`. Notice that the `derive` attribute for the `Drop` trait works for `U` as well.
es: Añadimos a la definición `Wallet` struct un nuevo tipo genérico `U` y luego asignamos este tipo a la `dirección` del nuevo miembro de campo. Note que el atributo `derive` para el rasgo `Drop` funciona también para `U`.
fr: Nous ajoutons à la définition de structure `Wallet` un nouveau type générique `U`, puis attribuons ce type au nouveau membre du champ `adresse`. Notez que l'attribut `derive` pour le caractère `Drop` fonctionne aussi pour `U`.
id: Kami menambahkan definisi struktur baru untuk tipe umum lalu memberikan tipe ini ke anggota lapangan yang baru.
tr: Wallet struct tanımına yeni bir jenerik tip U ekliyoruz ve daha sonra bu türü yeni alan üyesi address'e atıyoruz. Drop özelliği için derive özniteliğinin U için de işe yaradığına dikkat edin.
zh_cn: 在`瓦利特'结构定义中,我们加上一个新的通用类型`U',然后将这种类型分配给新的外地成员`地址',注意`耕地'特性的`衍生'属性也用于`U'。

source: As we did with structs, we can define enums to hold generic data types in their variants. For example the `Option<T>` enum provided by the Cairo core library:
es: Como hicimos con structs, podemos definir enums para mantener los tipos de datos genéricos en sus variantes. Por ejemplo, el `Option<T® enum proporcionado por la biblioteca principal de El Cairo:
fr: Comme nous l'avons fait avec les structures, nous pouvons définir des enums pour tenir des types de données génériques dans leurs variantes. Par exemple, l'enum `Option<T>` fourni par la bibliothèque centrale du Caire:
id: Seperti yang kita lakukan dengan struktur, kita dapat mendefinisikan enums untuk menyimpan tipe data generik dalam varian mereka. Sebagai contoh yang <T> enum disediakan oleh perpustakaan inti Kairo:
tr: Yapıtlarla yaptığımız gibi, varyantlarında genel veri türlerini tutmak için enumları tanımlayabiliriz. Örneğin, Kahire çekirdek kütüphanesi tarafından sağlanan OptionT> enum:
zh_cn: 正如我们对待树枝时所做的那样,我们可以将昆虫定义为在其变式中保留通用数据类型。 例如开罗核心图书馆提供的“Option<T enum ” :

source: The `Option<T>` enum is generic over a type `T` and has two variants: `Some`, which holds one value of type `T` and `None` that doesn't hold any value. By using the `Option<T>` enum, it is possible for us to express the abstract concept of an optional value and because the value has a generic type `T` we can use this abstraction with any type.
es: La opción T es genérica sobre un tipo T y tiene dos variantes: `Some`, que contiene un valor de tipo T y `Ninguno` que no contiene ningún valor. Al usar la opción T, es posible que expresemos el concepto abstracto de un valor opcional y porque el valor tiene un tipo genérico T podemos utilizar esta abstracción con cualquier tipo.
fr: L'enum `Option<T>` est générique sur un type `T` et possède deux variantes: `Some`, qui contient une valeur de type `T` et `None` qui ne détient aucune valeur. En utilisant l'enum `Option<T>`, il est possible pour nous d'exprimer le concept abstrait d'une valeur optionnelle et parce que la valeur a un type générique `T` nous pouvons utiliser cette abstraction avec n'importe quel type.
id: Enyam umum di atas sebuah tipe T dan memiliki dua varians: quot; yang memiliki satu nilai tipe (T) dan tidak ada yang memiliki nilai apapun. Dengan menggunakan enum (Option <T), mungkin bagi kita untuk mengekspresikan konsep abstrak tentang nilai opsional dan karena nilai tersebut memiliki tipe umum (st) kita dapat menggunakan abstrakisasi ini dengan tipe apapun.
tr: OptionT> enum bir T tipi üzerinde jeneriktir ve iki varyantı vardır: Some, herhangi bir değer taşımayan bir T ve None tipini tutar. OptionT> enum'u kullanarak, isteğe bağlı bir değerin soyut kavramını ifade etmemiz mümkündür ve değerin jenerik bir T tipine sahip olması nedeniyle bu soyutlamayı herhangi bir türle kullanabiliriz.
zh_cn: `Option<T'enum是属于`T'类的通用概念,有两种变式:`一些 ',它具有`T'类和`无'类的单一价值,不具有任何价值;通过`Option <T'和`无 ',我们有可能表达可选价值的抽象概念,并且因为该数值具有通用的`T'类,我们可以使用这种抽象,任何类型。

source: Enums can use multiple generic types as well, like the definition of the `Result<T, E>` enum that the core library provides:
es: Los enums también pueden utilizar varios tipos genéricos, como la definición del `Resultado<T, E® enum que proporciona la biblioteca principal:
fr: Les enums peuvent également utiliser plusieurs types génériques, comme la définition du enum `Résultat<T, E>` que la bibliothèque centrale fournit:
id: Enums dapat menggunakan multiple generic types juga, seperti definisi dari <T, E>) enum yang disediakan oleh perpustakaan inti:
tr: Enumlar, çekirdek kütüphanesinin sağladığı ResultT, E> enum tanımı gibi birden fazla jenerik türü de kullanabilir:
zh_cn: Enums也可以使用多种通用类型,例如核心图书馆提供的`Result<T,E enum'的定义:

source: The `Result<T, E>` enum has two generic types, `T` and `E`, and two variants: `Ok` which holds the value of type `T` and `Err` which holds the value of type `E`. This definition makes it convenient to use the `Result` enum anywhere we have an operation that might succeed (by returning a value of type `T`) or fail (by returning a value of type `E`).
es: El `Resultado<T, E® enum tiene dos tipos genéricos, `T` y `E`, y dos variantes: `Ok` que contiene el valor del tipo `T` y `Err` que contiene el valor del tipo `E`. Esta definición hace conveniente utilizar el `Resultado` enum en cualquier lugar donde tengamos una operación que pueda tener éxito (devolviendo un valor del tipo `T`) o fallar (devolviendo un valor del tipo `E`).
fr: L'enum `Result<T, E>` comporte deux types génériques, `T` et `E`, et deux variantes: `Ok` qui détient la valeur du type `T` et `Err` qui détient la valeur du type `E`. Cette définition permet d'utiliser l'enum `Result` où que nous ayons une opération qui pourrait réussir (en retournant une valeur du type `T`) ou échouer (en retournant une valeur du type `E`).
id: Result<T, E> enum memiliki dua tipe generic, dan dua varian, dan dua varians: yang memiliki nilai dari tipe ÁT dan (err). Definisi ini membuat kita lebih nyaman menggunakan operasi ini di mana saja kita bisa berhasil (dengan mengembalikan nilai dari tipe t) atau gagal (dengan mengembalikan nilai dari tipe ÉE).
tr: ResultT, E> enum, T ve E olmak üzere iki genel tipe ve iki varyanta sahiptir: Ok, T ve Err tipinin değerini tutar. Bu tanım, Result enum tipini başarılı olabilecek herhangi bir yerde kullanmayı kolaylaştırır (bir T değeri döndürerek).
zh_cn: `Result<T, E enum有两种通用类型,即`T'和`E ',还有两种变式:`Ok ',其价值为`T'和`Err ',其价值为`E ',这一定义方便地使用`Result'enum,只要我们有一个可能成功(返回`T'类价值)或失败(返回`E'类价值)的操作,即使用`Result'enum。

source: Generic Methods
es: Métodos genéricos
fr: Méthodes génériques
id: Metode Generik
tr: Genel Yöntemler
zh_cn: 通用方法

source: We can implement methods on structs and enums, and use the generic types in their definitions, too. Using our previous definition of `Wallet<T>` struct, we define a `balance` method for it:
es: Podemos implementar métodos en structs y enums, y utilizar los tipos genéricos en sus definiciones, también. Usando nuestra definición anterior de `Wallet<TÃ ́ struct, definimos un método `equilibrio` para ello:
fr: Nous pouvons appliquer des méthodes sur les structures et les enums, et utiliser les types génériques dans leurs définitions, aussi. En utilisant notre définition précédente de `Wallet<T>` struct, nous définissons une méthode `balance` pour elle:
id: Kita dapat mengimplementasikan metode pada struct dan enums, dan menggunakan tipe umum dalam definisi mereka, juga. Menggunakan definisi kita sebelumnya tentang struktur Wallet<T>, kita mendefinisikan metode keseimbangan untuk itu:
tr: Yapılar ve enumlar üzerinde yöntemler uygulayabilir ve tanımlarında da jenerik tipleri kullanabiliriz. WalletT> yapıtının önceki tanımını kullanarak, bunun için bir balans yöntemi tanımlarız:
zh_cn: 我们可以对建筑和建筑实施方法,并使用其定义中的通用类型。我们用我们先前的“瓦莱特”和“瓦莱特”的定义,为它界定了一种“平衡”方法:

source: We first define `WalletTrait<T>` trait using a generic type `T` which defines a method that returns the value of the field `balance` from `Wallet`. Then we give an implementation for the trait in `WalletImpl<T>`. Note that you need to include a generic type in both definitions of the trait and the implementation.
es: En primer lugar definimos `WalletTrait<TÃ3rrito usando un tipo genérico `T` que define un método que devuelve el valor del campo `equilibrio` de `Wallet`. A continuación, damos una implementaciÃ3n para el rasgo en `WalletImpl<TÃ3rmino. Tenga en cuenta que es necesario incluir un tipo genérico en ambas definiciones del rasgo y la implementaciÃ3n.
fr: Nous définissons d'abord le caractère `WalletTrait<T>` en utilisant un type générique `T` qui définit une méthode qui renvoie la valeur du champ `balance` de `Wallet`. Ensuite, nous donnons une implémentation pour le caractère dans `WalletImpl<T>`. Notez que vous devez inclure un type générique dans les définitions du caractère et de l'implémentation.
id: Pertama, kita mendefinisikan WalletTrait<T> dengan menggunakan tipe umum yang mendefinisikan suatu metode yang mengembalikan nilai dari bidang kesetaraan dari wallet, lalu kita memberikan sebuah implementasi untuk sifat dalam ▪Walletlpl<T>. Perhatikan bahwa Anda perlu memasukkan tipe umum dalam kedua definisi sifat dan implementasi.
tr: İlk olarak WalletTraitT> özelliğini, Wallet'den balance alanının değerini döndüren bir yöntemi tanımlayan genel bir T tipi kullanarak tanımlıyoruz. Daha sonra WalletImplT>'deki özellik için bir uygulama veriyoruz. Her iki özellik tanımına ve uygulamaya jenerik bir tür eklemeniz gerektiğini unutmayın.
zh_cn: 我们首先使用通用类型“T”来定义“WalletTrait<T”特性,界定一种从“Wallet”中返回字段“平衡”价值的方法,然后我们为“WalletImpl<T”中的特性提供一种执行方法。请注意,在特性定义和执行定义中,需要包括一种通用类型。

source: We can also specify constraints on generic types when defining methods on the type. We could, for example, implement methods only for `Wallet<u128>` instances rather than `Wallet<T>`. In the code example, we define an implementation for wallets which have a concrete type of `u128` for the `balance` field.
es: También podemos especificar limitaciones en los tipos genéricos al definir los métodos en el tipo. Podríamos, por ejemplo, implementar métodos sólo para `Wallet<u128'' instancias en lugar de `Wallet<T». En el ejemplo del código, definimos una implementación para carteras que tienen un tipo concreto de `u128` para el campo `equilibrio`.
fr: Nous pouvons également spécifier des contraintes sur les types génériques lors de la définition des méthodes sur le type. Nous pourrions, par exemple, mettre en œuvre des méthodes uniquement pour les instances `Wallet<u128>` plutôt que `Wallet<T>`. Dans l'exemple de code, nous définissons une implémentation pour les portefeuilles qui ont un type concret de `u128` pour le champ `balance`.
id: Kita juga dapat menentukan batasan pada tipe umum ketika mendefinisikan metode pada tipenya. Sebagai contoh, kita dapat, menerapkan metode hanya untuk ▪Wallet<u128>: contoh daripada ▪Wallet<T>. Dalam contoh kode, kita mendefinisikan sebuah implementasi untuk dompet yang memiliki tipe konkrit <u128) untuk bidang keseimbangan.
tr: Tür üzerinde yöntemler tanımlarken genel tiplere ilişkin kısıtlamaları da belirtebiliriz. Örneğin, Walletu128> yerine WalletT> örnekleri için yöntemler uygulayabiliriz. Kod örneğinde, balance alanı için somut bir u128 tipine sahip cüzdanlar için bir uygulama tanımlarız.
zh_cn: 在界定该类型方法时,我们还可以具体说明对通用类型的限制,例如,我们只能对“Wallet<u128}”案例而不是“Wallet<T}”案例实施方法。在代码中,我们定义了对“平衡”字段具体类型为“u128”的钱包实施方法。

source: /// Generic trait for wallets
es: /// Rasgo genérico de las carteras
fr: /// trait générique pour portefeuilles
id: / / sifat Generik untuk dompet
tr: /// Cüzdanlar için genel özellik
zh_cn: // 钱包的通用特性

source: /// Trait for wallets of type u128
es: /// Rasgo para carteras de tipo u128
fr: /// Trait pour portefeuilles de type u128
tr: /// u128 tipi cüzdanlar için trait
zh_cn: // 用于 u128 类型钱包的 trit

source: The new method `receive` increments the size of `balance` of any instance of a `Wallet<u128>`. Notice that we changed the `main` function making `w` a mutable variable in order for it to be able to update its balance. If we were to change the initialization of `w` by changing the type of `balance` the previous code wouldn't compile.
es: El nuevo método `recibir` incrementa el tamaño de `equilibrio` de cualquier instancia de un `Wallet<u128]. Observe que cambiamos la función `main` haciendo `w` una variable mutable para que pueda actualizar su saldo. Si `w` cambiara la inicialización de `w` cambiando el tipo de `equilibrio` el código anterior no se compilaría.
fr: La nouvelle méthode `receive` incréments la taille de `balance` de toute instance d'un `Wallet<u128>`. Notez que nous avons modifié la fonction `main` faisant `w` une variable mutable afin qu'elle puisse mettre à jour son équilibre. Si nous devions changer l'initialisation de `w` en changeant le type de `balance` le code précédent ne serait pas compilé.
id: Metode baru yang muncul secara bertahap membuat variabel yang dapat berubah agar dapat memperbarui keseimbangannya. Jika kita mengubah penginisialisasian atau pengimbangan kode sebelumnya tidak akan mengkombinasikannya.
tr: Yeni yöntem alıcı, bir Walletu128>'nin herhangi bir örneğinin balance boyutunu artırır. main fonksiyonunu, w dengesini güncelleyebilmesi için w değişkeni yaparak değiştirdiğimize dikkat edin. w'nin başlangıçını değiştirerek önceki kodun derlenmeyeceği şekilde değiştirirsek.
zh_cn: 新的方法`收到'增加`平衡'的大小,相当于`Wallet<u128'的任何实例`平衡'的大小,通知我们改变了`主要'功能,使`w'变异变量能够更新其平衡,如果我们改变`w'的初始化,改变`平衡'的类型,以前的代码不会编译。

source: Cairo allows us to define generic methods inside generic traits as well. Using the past implementation from `Wallet<U, V>` we are going to define a trait that picks two wallets of different generic types and creates a new one with a generic type of each. First, let's rewrite the struct definition:
es: El Cairo nos permite definir los métodos genéricos dentro de los rasgos genéricos también. Usando la implementación pasada de `Wallet<U, V® vamos a definir un rasgo que recoge dos carteras de diferentes tipos genéricos y crea una nueva con un tipo genérico de cada uno. Primero, vamos a reescribir la definición de estructura:
fr: Le Caire nous permet également de définir des méthodes génériques à l'intérieur de caractères génériques. En utilisant l'implémentation passée de `Wallet<U, V>` nous allons définir un trait qui choisit deux portefeuilles de différents types génériques et crée un nouveau avec un type générique de chacun.
id: Kairo memungkinkan kita untuk mendefinisikan metode generik di dalam sifat generik juga. Menggunakan implementasi masa lalu dari <U, V>-- kita akan mendefinisikan sifat yang mengambil dua dompet dari jenis generik yang berbeda dan menciptakan jenis baru dengan tipe umum masing-masing. Pertama, kita tulis ulang definisi struktur:
tr: Kahire, jenerik özelliklerin içindeki jenerik yöntemleri tanımlamamıza da olanak tanır. WalletU, V> geçmiş uygulamasını kullanarak, farklı jenerik türlerden iki cüzdan seçen ve her birinin jenerik tipi olan yeni bir cüzdan oluşturan bir özellik tanımlayacağız. İlk olarak, yapı tanımını yeniden yazalım:
zh_cn: 开罗也允许我们在通用特性内定义通用方法。 使用“ Wallet< U, V, V” 中的过去实施方法, 我们将定义一个特性, 选择两种不同通用类型的钱包, 并创建一个新的通用类型。 首先, 让我们重写结构定义 :

source: Next, we are going to naively define the mixup trait and implementation:
es: A continuación, vamos a definir ingenuamente el rasgo de confusión y la implementación:
fr: Ensuite, nous allons naïvement définir le caractère mixup et la mise en œuvre:
id: Selanjutnya, kita akan dengan naif mendefinisikan sifat dan implementasi mixup:
tr: Daha sonra, mixup özelliğini ve uygulamasını saf bir şekilde tanımlayacağız:
zh_cn: 接下来,我们将天真地界定混杂的特点和执行:

source: // This does not compile!
es: // ¡Esto no se compila!
fr: // Cela ne compile pas!
id: //Ini tidak dikompilasi!
tr: // Bu derlenmiyor!
zh_cn: /这没有汇编!

source: We are creating a trait `WalletMixTrait<T1, U1>` with the `mixup<T2, U2>` method which given an instance of `Wallet<T1, U1>` and `Wallet<T2, U2>` creates a new `Wallet<T1, U2>`. As `mixup` signature specifies, both `self` and `other` are getting dropped at the end of the function, which is why this code does not compile. If you have been following from the start until now you would know that we must add a requirement for all the generic types specifying that they will implement the `Drop` trait for the compiler to know how to drop instances of `Wallet<T, U>`. The updated implementation is as follows:
es: Estamos creando un rasgo `WalletMixTrait<T1, U1• con el método `mixup<T2, U2• que da una instancia de `Wallet<T1, U1• y `Wallet<T2, U2• crea un nuevo `Wallet<T1, U2•. Como especifica la firma `mixup`, tanto `self` como `other` se están soltando al final de la función, razón por la cual este código no se compila. Si usted ha estado siguiendo desde el principio hasta ahora, usted sabría que debemos añadir un requisito para todos los tipos genéricos que especifican que implementarán el rasgo `Drop` para que el compilador sepa cómo soltar las instancias de `Wallet<T, U®. La implementación actualizada es la siguiente:
fr: Nous créons un trait `WalletMixTrait<T1, U1>` avec la méthode `mixup<T2, U2>` qui a donné une instance de `Wallet<T1, U1>` et `Wallet<T2, U2>` crée une nouvelle `Wallet<T1, U2>`. Comme la signature `mixup` le spécifie, à la fois `self` et `other` sont supprimés à la fin de la fonction, c'est pourquoi ce code ne compile pas. Si vous avez suivi depuis le début jusqu'à présent, vous savez que nous devons ajouter une exigence pour tous les types génériques spécifiant qu'ils vont implémenter le trait `Drop` pour que le compilateur sache comment déposer des instances de `Wallet<T, U>`. La mise à jour de l'implémentation est la suivante:
id: Kami sedang membuat sebuah sifat WalletTrait<T1, U1> dengan metode baru U1> dengan metode <T2, U2> yang memberikan contoh khasiat <T1, U1> dan U1> Wallet dan UALlet<T2, U2> menciptakan sebuah kode baru yang baru, U2>. Sebagaimana yang diberikan sebuah tipe khusus menspesifikasikan diri sendiri dan lainnya akan diturunkan pada akhir fungsi, yang mana adalah mengapa kode ini tidak dikompilasi. Jika Anda telah mulai dari sekarang kita harus tahu bahwa kita harus menambahkan semua tipe yang mensifikasikan ciri-ciri yang dispesiifikasikan oleh UD untuk versi yang akan digambarkan untuk versi selanjutnya:
tr: WalletT1, U1> ile bir özellik oluşturuyoruz. WalletT1, U1> ve WalletT2, U2> bir özellik örneği verilen WalletT1, U1>, WalletT1, U2> için yeni bir WalletT1, U1> işaretinin neden mixupkendini ve diğerini oluşturmadığını belirten bir özellik oluşturuyor.
zh_cn: 我们正在创建一种特性“WalletMixTrait<T1, U1 ”和“Mixup<T2, U2 ”方法,其中给出了“Wallet<T1, U1 }和“Wallet<T2, U2 }”和“Wallet<T2, U2 }”的示例。正如“Wallet<T1, U2 }”的签名所指明的,“自我”和“其他”都在功能的结尾处被丢弃,这就是为什么本代码没有编译的原因。如果你从开始到现在一直遵循,你就会知道,我们必须对所有通用类型增加一项要求,说明它们将执行“Drop”特性,让编译者知道如何投放“Wallet<T, U ” 。更新后的执行情况如下:

source: We add the requirements for `T1` and `U1` to be droppable on `WalletMixImpl` declaration. Then we do the same for `T2` and `U2`, this time as part of `mixup` signature. We can now try the `mixup` function:
es: Añadimos los requisitos para que `T1` y `U1` sean goteables en la declaración `WalletMixImpl`. Entonces hacemos lo mismo para `T2` y `U2`, esta vez como parte de la firma `mixup`. Ahora podemos probar la función `mixup`:
fr: Nous ajoutons les exigences pour `T1` et `U1` pour être droppable sur la déclaration `WalletMixImpl`. Ensuite, nous faisons la même chose pour `T2` et `U2`, cette fois dans le cadre de la signature `mixup`. Nous pouvons maintenant essayer la fonction `mixup`:
id: Kami menambahkan persyaratan untuk T1 dan U1 yang dapat diturunkan pada deklarasi WalletMixmplpl.
tr: T1 ve U1 için gereksinimleri WalletMixImpl bildiriminde bırakılabilir olarak ekliyoruz. Daha sonra T2 ve U2 için aynı şeyi yapıyoruz, bu sefer mixup imzasının bir parçası olarak. Artık mixup işlevini deneyebiliriz:
zh_cn: 我们添加了“T1”和“U1”的要求,以便在“瓦利特混合化Impl”声明上可以删除。然后,我们作为“混合”签字的一部分,对“T2”和“U2”也这样做。我们现在可以尝试“混合”功能:

source: We first create two instances: one of `Wallet<bool, u128>` and the other of `Wallet<felt252, u8>`. Then, we call `mixup` and create a new `Wallet<bool, u8>` instance.
es: Primero creamos dos instancias: una de `Wallet<bool, u128-o y la otra de `Wallet<felt252, u8-o. Luego, llamamos a `mixup` y creamos una nueva instancia de `Wallet<bool, u8-o.
fr: Nous créons d'abord deux instances : l'une de `Wallet<bool, u128>` et l'autre de `Wallet<felt252, u8>`. Ensuite, nous appelons `mixup` et créons une nouvelle instance `Wallet<bool, u8>`.
id: Kami pertama kali membuat dua contoh: salah satu dari Walllet<bool, u128> dan yang lain dari Wallet<felt2, u8>. Kemudian, kita sebut thoseixup. dan membuat sebuah ▪Walllet<bool baru, u8> contoh.
tr: Önce iki örnek oluşturuyoruz: biri Walletbool, u128> ve diğeri Walletfelt252, u8>. Sonra mixup diyoruz ve yeni bir Walletbool, u8> örneği oluşturuyoruz.
zh_cn: 我们首先创造两个例子:一个是“Wallet<bool, u128”,另一个是“Wallet<felt252, u8”。然后,我们称之为“混合”并创建一个新的“Wallet<bool, u8”实例。
