Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The Unit Type ()
es: Tipo de unidad ()
fr: Le type d'unité ()
id: Satuan Tipe ()
tr: Birim Tipi ()
zh_cn: 单位类型(单位类型)

source: A _unit type_ is a type which has only one value `()`. It is represented by a tuple with no elements. Its size is always zero, and it is guaranteed to not exist in the compiled code.
es: Un _unidad type_ es un tipo que tiene sólo un valor `()`. Está representado por una tupla sin elementos. Su tamaño es siempre cero, y está garantizado que no existe en el código compilado.
fr: Un _unit type_ est un type qui n'a qu'une seule valeur `()`. Il est représenté par un tuple sans éléments. Sa taille est toujours zéro, et il est garanti de ne pas exister dans le code compilé.
id: Tipe _unit_ adalah sebuah tipe yang hanya memiliki satu nilai. Ini diwakili oleh sebuah tuple tanpa elemen. Ukurannya selalu nol, dan dijamin tidak ada dalam kode yang dikompilasi.
tr: Bir _unit type_ sadece bir değer () olan bir türdür. Elementsiz bir tuple ile temsil edilir. Boyutu her zaman sıfırdır ve derlenen kodda bulunmaması garanti edilir.
zh_cn: A_unittype_是一种只有一个值的“()”类型。它用一个没有元素的图普表示,其大小始终为零,并且保证在汇编的代码中不存在。

source: You might be wondering why you would even need a unit type? In Cairo, everything is an expression, and an expression that returns nothing actually returns `()` implicitly.
es: En El Cairo, todo es una expresión, y una expresión que no devuelve nada realmente devuelve `()` implícitamente.
fr: Vous vous demandez peut-être pourquoi vous auriez même besoin d'un type d'unité? Au Caire, tout est une expression, et une expression qui ne retourne rien ne retourne réellement `()` implicitement.
id: Di Kairo, semuanya adalah ekspresi, dan ekspresi yang tidak mengembalikan apapun secara implisit.
tr: Neden bir birim türüne ihtiyacınız olacağını merak ediyor olabilirsiniz? Kahire'de, her şey bir ifadedir ve hiçbir şey döndürmeyen bir ifade aslında ()'yi dolaylı olarak döndürür.
zh_cn: 你也许想知道为什么你甚至需要一个单位类型?在开罗,一切都是一个表达方式,一个没有任何实际返回`()'的表达方式。

source: {{#quiz ../quizzes/ch02-02-data-types.toml}}
fr: {{#quiz../quizes/ch02-02-data-types.toml}}
zh_cn: ./quizzes/ch02-02-data-types.toml

source: Functions are prevalent in Cairo code. You’ve already seen one of the most important functions in the language: the `main` function, which is the entry point of many programs. You’ve also seen the `fn` keyword, which allows you to declare new functions.
es: Las funciones son frecuentes en el código de El Cairo. Ya ha visto una de las funciones más importantes en el idioma: la función `main`, que es el punto de entrada de muchos programas. También ha visto la palabra clave `fn`, que le permite declarar nuevas funciones.
fr: Vous avez déjà vu l'une des fonctions les plus importantes dans la langue: la fonction `main`, qui est le point d'entrée de nombreux programmes. Vous avez également vu le mot-clé `fn`, qui vous permet de déclarer de nouvelles fonctions.
id: Fungsi-fungsi yang umum dalam kode Kairo. Anda juga telah melihat salah satu fungsi yang paling penting dalam bahasa: fungsi åmain, yang merupakan titik masuk dari banyak program. Anda juga telah melihat kata kunci yang memungkinkan Anda untuk menyatakan fungsi-fungsi baru.
tr: Fonksiyonlar Kahire kodunda yaygındır. Dildeki en önemli işlevlerden birini zaten gördünüz: birçok programın giriş noktası olan main işlevi. Ayrıca, yeni işlevler beyan etmenizi sağlayan fn anahtar kelimesini de gördünüz.
zh_cn: 函数在开罗代码中很普遍。 您已经看到语言中最重要的函数之一 : “ 主要” 函数, 这是许多程序的切入点 。 您也看到允许您声明新功能的“ fn” 关键字 。

source: Cairo code uses _snake case_ as the conventional style for function and variable names, in which all letters are lowercase and underscores separate words. Here’s a program that contains an example function definition:
es: El código de El Cairo utiliza _snake case_ como el estilo convencional para nombres de funciones y variables, en el que todas las letras son minúsculas y subraya palabras separadas. He aquí un programa que contiene una definición de función de ejemplo:
fr: Le code du Caire utilise _snake case_ comme style conventionnel pour les noms de fonction et de variable, dans lequel toutes les lettres sont minuscules et souligne des mots séparés. Voici un programme qui contient une définition de fonction d'exemple:
id: Kode Kairo menggunakan kotak _ular sebagai gaya konvensional untuk nama fungsi dan variabel, di mana semua huruf adalah huruf kecil dan garis bawah kata-kata terpisah. Ini adalah program yang berisi definisi fungsi contoh:
tr: Kahire kodu, tüm harflerin küçük olduğu ve ayrı kelimelerin altını çizdiği işlev ve değişken isimler için geleneksel stil olarak _snake case_ kullanır. İşte örnek bir işlev tanımı içeren bir program:
zh_cn: 开罗代码使用 _snake case_作为函数和变量名称的常规样式,其中所有字母都是小写,并突出单独的单词。这里有一个包含示例函数定义的程序 :

source: "Another function."
es: "Otra función".
fr: "Une autre fonction."
id: " Fungsi lain. "
tr: "Başka bir fonksiyon."
zh_cn: "另一个功能"

source: "Hello, world!"
es: "¡Hola, mundo!"
fr: "Bonjour, le monde!"
id: "Halo, dunia!"
tr: "Merhaba dünya!"
zh_cn: "你好,世界!"

source: We define a function in Cairo by entering `fn` followed by a function name and a set of parentheses. The curly brackets tell the compiler where the function body begins and ends.
es: Definimos una función en El Cairo introduciendo `fn` seguida de un nombre de función y un conjunto de paréntesis. Los corchetes rizados indican al compilador donde el cuerpo de función comienza y termina.
fr: Nous définissons une fonction au Caire en entrant `fn` suivi d'un nom de fonction et d'un ensemble de parenthèses. Les crochets bouclés indiquent au compilateur où le corps de fonction commence et se termine.
id: Kami mendefinisikan sebuah fungsi di Kairo dengan memasukinya dengan mengikuti sebuah nama fungsi dan satu set tanda kurung keriting mengatakan pada kompiler di mana tubuh fungsi dimulai dan berakhir.
tr: Kahire'de fn'ya girerek bir fonksiyon adı ve bir dizi parantez koyarak bir fonksiyon tanımlıyoruz. Kıvırcık parantezler, derleyiciye fonksiyon gövdesinin nerede başladığını ve bittiğini söyler.
zh_cn: 我们在开罗定义了函数,输入了“fn”,然后输入了一个函数名称和一组括号。圆括号告诉汇编者函数体的起点和终点。

source: We can call any function we’ve defined by entering its name followed by a set of parentheses. Because `another_function` is defined in the program, it can be called from inside the `main` function. Note that we defined `another_function` _before_ the `main` function in the source code; we could have defined it after as well. Cairo doesn’t care where you define your functions, only that they’re defined somewhere in a scope that can be seen by the caller.
es: Podemos llamar a cualquier función que hemos definido introduciendo su nombre seguido de un conjunto de paréntesis. Debido a que `other_function` se define en el programa, se puede llamar desde el interior de la función `main`. Tenga en cuenta que definimos `another_function` _before_ la función `main` en el código fuente; podríamos haberlo definido después también. El Cairo no le importa dónde define sus funciones, sólo que se definen en algún lugar en un ámbito que puede ser visto por el llamante.
fr: Nous pouvons appeler n'importe quelle fonction que nous avons définie en entrant son nom suivi d'un ensemble de parenthèses. Parce que `another_function` est défini dans le programme, il peut être appelé de l'intérieur de la fonction `main`. Notez que nous avons défini `another_function` _fore_ la fonction `main` dans le code source; nous aurions pu la définir après aussi. Le Caire ne se soucie pas où vous définissez vos fonctions, seulement qu'elles soient définies quelque part dans une portée qui peut être vue par l'appelant.
id: Kita dapat memanggil fungsi apapun yang kita definisikan dengan memasukkan namanya diikuti dengan satu set tanda kurung. karena fungsi lain_fungsi_fungsi lain didefinisikan dalam program ini, dapat dipanggil dari dalam fungsi thoseadiro. perhatikan bahwa kita mendefinisikan satu sama lain_fungsi_before_ fungsi dalam kode sumber; kita dapat mendefinisikannya juga. Kairo tidak peduli di mana Anda mendefinisikan fungsi-fungsi Anda, hanya mereka didefinisikan di suatu tempat yang dapat dilihat oleh si pemanggil.
tr: İsmini girerek tanımladığımız herhangi bir işlevi bir dizi parantezle çağırabiliriz. Another_function program içinde tanımlandığından, main fonksiyonunun içinden çağrılabilir. Kaynak koddaki another_function _before_ain fonksiyonunu tanımladığımızı unutmayın; daha sonra da tanımlayabilirdik. Kahire, fonksiyonlarınızı nerede tanımladığınızı, yalnızca bir yerde gördüklerini umursamaz.
zh_cn: 我们可以调用我们通过输入其名称而定义的任何函数, 并加上一组括号。 因为程序定义了 " 另一种功能 ", 它可以从`主要'函数中调用。 请注意, 我们在源代码中定义了`另一种功能'_ 之前的`主要'函数; 我们也可以在源代码中也定义它。 开罗并不关心您在哪里定义您的职能, 只是它们被定义在某个范围内, 来电者可以看到。

source: Let’s start a new project with Scarb named _functions_ to explore functions further. Place the `another_function` example in _src/lib.cairo_ and run it. You should see the following output:
es: Comencemos un nuevo proyecto con Scarb llamado _funciones_ para explorar más a fondo las funciones. Coloque el ejemplo `another_function` en _src/lib.cairo_ y ejecútelo. Debería ver la siguiente salida:
fr: Laissez démarrer un nouveau projet avec Scarb nommé _functions_ pour explorer les fonctions plus loin. Placez l'exemple `another_function` dans _src/lib.cairo_ et exécutez-le. Vous devriez voir la sortie suivante :
id: Mari kita mulai proyek baru dengan Scarb bernama _functions_ untuk mengeksplorasi fungsi lebih lanjut. Tempatkan contoh lain_fungsi di _sc/lib.cairo_ dan jalankan. Anda harus melihat keluaran berikut:
tr: Fonksiyonları daha fazla keşfetmek için Scarb adında _functions_ ile yeni bir projeye başlayalım. another_function örneğini _src/lib.cairo_ dosyasına yerleştirin ve çalıştırın. Aşağıdaki çıktıyı görmelisiniz:
zh_cn: 让我们用名为 _forms_ 的刀疤启动一个新工程,进一步探索函数。 将“ 另一功能” 示例放置到 _src/lib. cairo_ 并运行。 您应该看到以下输出 :

source: The lines execute in the order in which they appear in the `main` function. First the `Hello, world!` message prints, and then `another_function` is called and its message is printed.
es: Las líneas se ejecutan en el orden en que aparecen en la función `main`. Primero se imprime el mensaje `Hello, world!` y luego se llama `other_function` y se imprime su mensaje.
fr: Les lignes s'exécutent dans l'ordre dans lequel elles apparaissent dans la fonction `main`. D'abord les impressions de message `Hello, world!`, puis `une autre_fonction` est appelée et son message est imprimé.
id: Garis-garis yang dijalankan dalam urutan di mana mereka muncul dalam fungsi åmain.
tr: Satırlar, ana işlevinde göründükleri sırada çalışır. Önce Merhaba, dünya! mesaj baskıları ve daha sonra başka bir_fonksiyon çağrılır ve mesajı yazdırılır.
zh_cn: “主”函数中行执行顺序的行,首先是“哈罗、世界!” ; 信息指纹,然后是“另一种功能”,并打印其信息。

source: Parameters
es: Parámetros
fr: Paramètres
id: Parameter
tr: Parametreler
zh_cn: 参数参数

source: We can define functions to have _parameters_, which are special variables that are part of a function’s signature. When a function has parameters, you can provide it with concrete values for those parameters. Technically, the concrete values are called _arguments_, but in casual conversation, people tend to use the words _parameter_ and _argument_ interchangeably for either the variables in a function’s definition or the concrete values passed in when you call a function.
es: Podemos definir funciones para tener _parámetros_, que son variables especiales que forman parte de la firma de una función. Cuando una función tiene parámetros, se puede proporcionar valores concretos para esos parámetros. Técnicamente, los valores concretos se llaman _argumentos_, pero en la conversación casual, la gente tiende a utilizar las palabras _parametro_ y _argumento_ intercambiable para las variables en la definición de una función o los valores concretos pasados cuando se llama una función.
fr: Nous pouvons définir des fonctions pour avoir _parameters_, qui sont des variables spéciales qui font partie d'une signature de fonction. Lorsqu'une fonction a des paramètres, vous pouvez lui fournir des valeurs concrètes pour ces paramètres. Techniquement, les valeurs concrètes sont appelées _arguments_, mais dans une conversation occasionnelle, les gens ont tendance à utiliser les mots _parameter_ et _argument_ interchangeablement pour les variables d'une définition de fonction, ou les valeurs concrètes passées lorsque vous appelez une fonction.
id: Kita dapat mendefinisikan fungsi untuk memiliki _parameters_, yang merupakan variabel khusus yang merupakan bagian dari fungsi ·s signature. Ketika sebuah fungsi memiliki parameter, Anda dapat menyediakannya dengan nilai konkret untuk parameter tersebut. Secara teknis, nilai konkrit disebut _arguments_, tetapi dalam percakapan santai, orang cenderung menggunakan kata _parameter_ dan _argument_ secara bergantian untuk baik variabel dalam fungsi \uel definisi atau nilai beton lewat ketika Anda memanggil sebuah fungsi.
tr: Fonksiyonları, bir fonksiyonun imzasının bir parçası olan özel değişkenler olan _parametrelere sahip olarak tanımlayabiliriz. Bir fonksiyonun parametreleri olduğunda, bu parametreler için somut değerler sağlayabilirsiniz. Teknik olarak, somut değerler _arguments_ olarak adlandırılır, ancak gündelik konuşmada, insanlar bir fonksiyonun tanımındaki değişkenler veya bir işlevi çağırdığınızda geçen somut değerler için _parametre_ ve _argument_ kelimelerini birbirlerinin yerine kullanma eğilimindedirler.
zh_cn: 我们可以定义具有 _参数_ 的函数, 它们是作为函数签名一部分的特殊变量。 当函数有参数时, 您可以为参数提供这些参数的具体值。 从技术上讲, 具体值被称为 _ 参数_, 但是在随意交谈中, 人们往往对函数定义中的变量或调用函数时传递的具体值使用 _ 参数_ 和 _ 参数_ 可互换的词, 无论是函数定义中的变量, 还是在调用函数时传递的具体值 。

source: In this version of `another_function` we add a parameter:
es: En esta versión de `other_function` añadimos un parámetro:
fr: Dans cette version de `une autre_fonction` nous ajoutons un paramètre:
id: Dalam versi ini dari a_function lain kita menambahkan parameter:
tr: another_function'un bu sürümünde bir parametre ekliyoruz:
zh_cn: 在本版本的 " 另一种功能 " 中,我们添加一个参数:

source: Try running this program; you should get the following output:
es: Intente ejecutar este programa; debe obtener la siguiente salida:
fr: Essayez d'exécuter ce programme ; vous devriez obtenir la sortie suivante :
id: Coba jalankan program ini; Anda harus mendapat keluaran berikut:
tr: Bu programı çalıştırmayı deneyin; aşağıdaki çıktıyı almanız gerekir:
zh_cn: 尝试运行此程序; 您应该获得以下输出 :

source: The declaration of `another_function` has one parameter named `x`. The type of `x` is specified as `felt252`. When we pass `5` in to `another_function`, the `println!` macro puts `5` where the pair of curly brackets containing `x` was in the format string.
es: La declaración `other_function` tiene un parámetro llamado `x`. El tipo de `x` se especifica como `felt252`. Cuando pasamos `5` a `other_function`, la macro `println!` pone `5` donde el par de corchetes rizados que contiene `x` estaba en la cadena de formato.
fr: La déclaration de `une autre_fonction` a un paramètre nommé `x`. Le type de `x` est spécifié comme `felt252`. Lorsque nous passons `5` dans `une autre_fonction`, la macro `println!` met `5` où la paire de crochets contenant `x` était dans la chaîne de format.
id: Jenis deklarasi dari fungsi lain memiliki satu parameter yang bernama åx. Jenis dari makro yang dispesifikasikan sebagai 252.
tr: another_function deklarasyonunun x adında bir parametresi vardır. x türü felt252 olarak belirtilir. 5'yi another_function'ye geçtiğimizde, println! makro, x içeren kıvırcık parantez çiftinin format dizgesinde olduğu yere 5 koyar.
zh_cn: `另一功用'的申报有一个称为`x'的参数。`x'类型被定为`felt252'。当我们通过`5'到`另一功用'时,`println!' 宏将`5'放在格式字符串中包含`x'的卷括号对应处。

source: In function signatures, you _must_ declare the type of each parameter. This is a deliberate decision in Cairo’s design: requiring type annotations in function definitions means the compiler almost never needs you to use them elsewhere in the code to figure out what type you mean. The compiler is also able to give more helpful error messages if it knows what types the function expects.
es: En las firmas de funciones, usted _debe_ declarar el tipo de cada parámetro. Esta es una decisión deliberada en el diseño de El Cairo: requerir anotaciones de tipo en definiciones de funciones significa que el compilador casi nunca necesita que los use en otra parte del código para averiguar qué tipo quiere decir. El compilador también es capaz de dar mensajes de error más útiles si sabe qué tipos espera la función.
fr: Dans les signatures de fonction, vous _must_ déclarez le type de chaque paramètre. Il s'agit d'une décision délibérée dans la conception du Cairo: exiger des annotations de type dans les définitions de fonction signifie que le compilateur n'a presque jamais besoin de vous pour les utiliser ailleurs dans le code pour comprendre quel type vous voulez dire. Le compilateur est également en mesure de donner des messages d'erreur plus utiles s'il sait quels types la fonction attend.
id: Dalam signature fungsi, Anda _must_ menyatakan tipe dari setiap parameter. Ini adalah keputusan yang disengaja di Desain Kairoås: membutuhkan tipe anotasi dalam definisi fungsi berarti kompiler hampir tidak pernah membutuhkan Anda untuk menggunakannya di tempat lain dalam kode untuk mencari tahu tipe apa yang Anda maksud. compiler juga dapat memberikan pesan kesalahan yang lebih berguna jika ia tahu jenis fungsi yang diharapkan.
tr: Fonksiyon imzalarında, sen _must_ her parametrenin türünü beyan eder. Bu Kahire'nin tasarımında kasıtlı bir karardır: fonksiyon tanımlarında tip açıklamalarının yapılması, derleyicinin ne demek istediğinizi anlamak için kodun başka bir yerinde kullanmanıza neredeyse hiç ihtiyaç duymadığı anlamına gelir. Derleyici, işlevin ne tür bir hata beklediğini biliyorsa, daha yararlı hata mesajları da verebilir.
zh_cn: 在函数签名中,您必须声明每个参数的类型。这是开罗设计过程中有意决定的:要求函数定义中的字型说明意味着汇编者几乎从来不需要你在代码的其他地方使用它们来确定您指的是哪种类型。如果汇编者知道函数所期望的类型,也可以提供更有用的错误信息。

source: When defining multiple parameters, separate the parameter declarations with commas, like this:
es: Al definir varios parámetros, separe las declaraciones de parámetros con comas, así:
fr: Lors de la définition de plusieurs paramètres, séparer les déclarations de paramètres avec des virgules, comme ceci:
id: Ketika mendefinisikan beberapa parameter, pisahkan deklarasi parameter dengan koma, seperti ini:
tr: Birden fazla parametreyi tanımlarken, parametre bildirimlerini virgüllerle ayırın, şöyle:
zh_cn: 在定义多个参数时,将参数声明与逗号分开,例如:

source: "h"
zh_cn: "h" "h" "h"

source: "The measurement is: {value}{unit_label}"
es: "La medición es: {valor} {unit_label}"
fr: "La mesure est : {valeur}{unit_label}"
id: Pengukuran adalah: {nilai}{unit_label}"
tr: "Ölçüm: valueunit_label"
zh_cn: "衡量标准是:{价值{单位_标签}"

source: This example creates a function named `print_labeled_measurement` with two parameters. The first parameter is named `value` and is a `u128`. The second is named `unit_label` and is of type `ByteArray` - Cairo's internal type to represent string literals. The function then prints text containing both the `value` and the `unit_label`.
es: Este ejemplo crea una función llamada `print_labeled_measurement` con dos parámetros. El primer parámetro se llama `value` y es un `u128`. El segundo se llama `unit_label` y es de tipo `ByteArray` - El Cairo tipo interno para representar literales de cadena. La función entonces imprime texto que contiene tanto el `value` como el `unit_label`.
fr: Cet exemple crée une fonction nommée `print_labeled_measurement` avec deux paramètres. Le premier paramètre est nommé `value` et est un `u128`. Le second est nommé `unit_label` et est de type `ByteArray` - le type interne du Caire pour représenter les chaînes littérales. La fonction imprime ensuite du texte contenant à la fois la `value` et le `unit_label`.
id: Contoh ini menciptakan sebuah fungsi bernama enomelat_labeled_measurement) dengan dua parameter. Parameter pertama dinamakan enomavalue (nilai) dan merupakan sebuah ·u128. Yang kedua dinamakan æult_label) dan merupakan tipe tipe dari ByteArray - Cairo's internal untuk mewakili string literal. Fungsi itu kemudian mencetak teks yang berisi keduanya dan genit_label.
tr: Bu örnek, print_labeled_measurement adında iki parametreli bir fonksiyon oluşturur. İlk parametre value olarak adlandırılır ve u128'dir. İkincisi unit_label olarak adlandırılır ve ByteArray - Kahire'nin iç tipi dizgi harfini temsil eder. Fonksiyon daha sonra hem value hem de unit_label içeren metni yazdırır.
zh_cn: 此示例创建了名为“ print_ labeled_ 度量” 的函数, 有两个参数。 第一个参数名为“ value ”, 是一个“ u128 ”, 第二个称为“ unit_ label ”, 属于 type `ByteArray' - Cairo 的内部类型, 代表字符串字典。 该函数然后打印含有“value” 和“ unit_ label” 的文本。

source: Let’s try running this code. Replace the program currently in your _functions_ project’s _src/lib.cairo_ file with the preceding example and run it using `scarb cairo-run`:
es: Vamos a intentar ejecutar este código. Reemplace el programa actualmente en el archivo _src/lib.cairo_ de su proyecto _funciones_ con el ejemplo anterior y ejecutarlo usando `scarb cairo-run`:
fr: Essayez d'exécuter ce code. Remplacez le programme actuellement dans votre fichier _functions_ project.s _src/lib.cairo_ avec l'exemple précédent et exécutez-le en utilisant `scarb cairo-run`:
id: Mari kita coba menjalankan kode ini. Ganti program yang saat ini berada dalam _fungsi_ projek__mu; berkas _src/lib.cairo_ dengan contoh sebelumnya dan jalankan dengan cairo-run:
tr: Bu kodu çalıştırmayı deneyelim. Şu anda _functions_ projenizin _src/lib.cairo_ dosyasındaki programı önceki örnekle değiştirin ve scarb cairo-run kullanarak çalıştırın:
zh_cn: 让我们尝试运行此代码。 替换您在 _src/ lib. cairo_ 文件中的当前 _ 函数_ Project's _ src/lib. cairo_ 文件, 使用“ scarb cairo- run” 运行 :

source: Because we called the function with `5` as the value for value and `"h"` as the value for `unit_label`, the program output contains those values.
es: Debido a que llamamos a la función con `5` como el valor para el valor y `"h"` como el valor para `unit_label`, la salida del programa contiene esos valores.
fr: Parce que nous avons appelé la fonction avec `5` comme valeur pour la valeur et `"h"` comme valeur pour `unit_label`, la sortie du programme contient ces valeurs.
id: Karena kami menyebut fungsinya dengan 0,5 sebagai nilai untuk nilai dan "h" sebagai nilai dari program yang mengandung nilai-nilai tersebut.
tr: 5 ile fonksiyona değer değeri ve unit_label değeri olarak "h" adını verdiğimiz için, program çıktısı bu değerleri içerir.
zh_cn: 由于我们将函数“5”称为值值的值,将“h”称为`unit_ label'的值,因此程序输出包含这些值。

source: Named Parameters
es: Parámetros designados
fr: Paramètres nommés
id: Parameter Bernama
tr: Adlandırılmış Parametreler
zh_cn: 命名参数
