Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Define environment variable `CAIRO_ROOT` to point to the path where Cairo will store its data. `$HOME/.cairo` is the default. If you installed Cairo via Git checkout, we recommend to set it to the same location as where you cloned it.
es: Definir la variable de entorno `CAIRO_ROOT` para apuntar a la ruta donde El Cairo almacenará sus datos. `$HOME/.cairo` es el valor predeterminado. Si instaló El Cairo a través de Git checkout, le recomendamos que lo establezca en la misma ubicación que donde lo clonó.
fr: Définissez la variable d'environnement `CAIRO_ROOT` pour indiquer le chemin où le Caire stockera ses données. `$HOME/.cairo` est la valeur par défaut. Si vous avez installé Cairo via Git checkout, nous vous recommandons de le placer au même endroit que l'endroit où vous l'avez cloné.
id: Definisikan variabel lingkungan ▪CAIRO_ROOTé untuk menunjuk ke lokasi di mana Kairo akan menyimpan datanya..
tr: Kahire'nin verilerini saklayacağı yolu işaret etmek için CAIRO_ROOT ortam değişkenini tanımla. $HOME/.cairo varsayılandır. Git checkout üzerinden Kahire'yi kurduysanız, onu klonladığınız yerle aynı konuma ayarlamanızı tavsiye ederiz.
zh_cn: 定义环境变量“ CAIRO_ROOT” 以指向开罗存储其数据的路径。 $HOME/. cairo 默认为“ $HOME/. cairo ” 。 如果您通过 Git 检出安装开罗, 我们建议将其设置在与您克隆它的位置相同的位置 。

source: Add the `cairo-*` executables to your `PATH` if it's not already there
es: Añádanse los ejecutables `cairo-*` a su `PATH` si no está ya allí
fr: Ajouter les exécutables `cairo-*` à votre `PATH` s'il n'est pas déjà là
id: Tambahkan alat executables-*cairo ke åPATH-mu jika belum ada
tr: cairo-* çalıştırılabilirlerini PATH dosyanıza ekleyin, eğer zaten orada değilse
zh_cn: 添加“cairo- ” 可执行文件到您的“ PATH ” 中, 如果它不是已经存在的话 。

source: The below setup should work for the vast majority of users for common use cases.
es: La siguiente configuración debe funcionar para la gran mayoría de los usuarios para casos de uso común.
fr: La configuration ci-dessous devrait fonctionner pour la grande majorité des utilisateurs pour les cas d'utilisation courante.
id: Pengaturan di bawah ini harus bekerja untuk mayoritas pengguna untuk kasus penggunaan umum.
tr: Aşağıdaki kurulum, kullanıcıların büyük çoğunluğu için ortak kullanım durumları için çalışmalıdır.
zh_cn: 以下设置应适用于绝大多数用户的通用案例。

source: For **bash**:
es: En lugar de **bash**:
fr: Pour **bash**:
id: Untuk ** bash**:
tr: ** bash ** için:
zh_cn: **bash**:

source: Stock Bash startup files vary widely between distributions in which of them source which, under what circumstances, in what order and what additional configuration they perform. As such, the most reliable way to get Cairo in all environments is to append Cairo configuration commands to both `.bashrc` (for interactive shells) and the profile file that Bash would use (for login shells).
es: Los archivos de inicio de stock Bash varían ampliamente entre distribuciones en cuál de ellas es la fuente que, en qué circunstancias, en qué orden y qué configuración adicional realizan. Como tal, la forma más confiable de obtener El Cairo en todos los entornos es añadir comandos de configuración de El Cairo a `.bashrc` (para shells interactivos) y el archivo de perfil que Bash usaría (para shells de inicio de sesión).
fr: Stock Bash fichiers de démarrage varient considérablement entre les distributions dans lesquelles d'entre eux source qui, dans quelles circonstances, dans quel ordre et quelle configuration supplémentaire ils effectuent. Ainsi, le moyen le plus fiable pour obtenir le Caire dans tous les environnements est d'ajouter les commandes de configuration du Caire à la fois `.bashrc` (pour les shells interactifs) et le fichier de profil que Bash utiliserait (pour les shells de connexion).
id: Stock Bash startup file bervariasi secara luas antara distribusi di mana, dalam keadaan apa, dalam urutan apa dan apa konfigurasi tambahan yang mereka lakukan. Seperti itu, cara yang paling dapat diandalkan untuk mendapatkan Kairo di semua lingkungan adalah untuk menambahkan konfigurasi Kairo perintah untuk baik ▪.bassrcáne (untuk shell interaktif) dan berkas profil Bash yang akan menggunakan (untuk login kerang).
tr: Stock Bash başlangıç dosyaları, hangi koşullarda hangi sırayla ve hangi ek yapılandırmayı gerçekleştirdikleri konusunda kaynak olan dağıtımlar arasında büyük farklılıklar gösterir. Bu nedenle, Kahire'yi tüm ortamlarda almanın en güvenilir yolu, Kahire yapılandırma komutlarını hem.bashrc'ye (interaktif kabuklar için) hem de Bash'in kullanacağı profil dosyasına (giriş kabukları için) eklemektir.
zh_cn: 库存 Bash 启动文件在来源的分布上差异很大,在什么情况下、在什么情况下、在什么顺序上和在什么情况下,在什么额外配置下,它们的工作方式不同。 因此,在所有环境中获得开罗的最可靠方式是将开罗配置命令附加到“.bashrc” (用于交互式贝壳)和Bash将使用的配置文件(用于登录贝壳)上。

source: First, add the commands to `~/.bashrc` by running the following in your terminal:
es: En primer lugar, añada los comandos a â € /.bashrc` ejecutando lo siguiente en su terminal:
fr: Tout d'abord, ajoutez les commandes à `~/.bashrc` en exécutant ce qui suit dans votre terminal :
id: Pertama, tambahkan perintah untuk ~/.bassrcé dengan menjalankan berikut di terminal Anda:
tr: İlk olarak, terminalinizde aşağıdaki komutları çalıştırarak /.bashrc komutlarını ekleyin:
zh_cn: 首先,通过在终端中运行以下操作,将命令添加到 {{{/.bashrc> 中:

source: 'export CAIRO_ROOT="$HOME/.cairo"'
es: 'exportar CAIRO_ROOT="$HOME/.cairo"'
fr: "exporter CAIRO_ROOT" $HOME/.cairo"
tr: 'ihracat CAIRO_ROOT="$HOME/.cairo"
zh_cn: "出口CAIRO_ROOT=" $HOME/. cairo"

source: 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"'
fr: 'command -v cairo-compile >/dev/null="export PATH="$CAIRO_ROOT/cible/release:$PATH"'
id: 'command -v cairo-compile >/dev/null-nall expor PATH="$CAIRO_ROOT/target/release:$PATH"'
tr: 'command -v cairo-combile>/dev/null export PATH="$CAIRO_ROOT/target/release:$PATH"""
zh_cn: “指挥 -v cairo-complile >/dev/null = 出口 PATH=$CAIRO_ROOT/目标/释放:$PATH”

source: Then, if you have `~/.profile`, `~/.bash_profile` or `~/.bash_login`, add the commands there as well. If you have none of these, add them to `~/.profile`.
es: Luego, si tienes â € ¢/.profile`, â €/.bash_profile` o â €/.bash_login`, agrega las órdenes allí también. Si no tienes ninguna de estas, agrégalas a â €/.profile`.
fr: Ensuite, si vous avez `~/.profile`, `~/.bash_profile` ou `~/.bash_login`, ajoutez les commandes là aussi. Si vous n'en avez pas, ajoutez-les à `~/.profile`.
id: Kemudian, jika Anda memiliki ~/.profileé, ~/.bash_profileé atau ~/.bash_login, tambahkan perintah di sana juga. Jika Anda tidak memiliki satupun dari ini, tambahkan mereka ke ~/.profile..profile.
tr: Daha sonra, /.profile, /.bash_profile veya /.bash_login komutlarınız varsa, komutları da ekleyin. Bunlardan hiçbiriniz yoksa, bunları /.profile'e ekleyin.
zh_cn: 然后,如果你有/.profile,/bash_profile,/bash_profile, 或/bash_login, 也在那里添加命令。 如果您没有这些命令, 请在/profile中添加这些命令 。

source: to add to `~/.profile`:
es: añádase a «/.profile»:
fr: à ajouter à `~/.profile`:
id: untuk menambah ke ~/.profile:
tr: /.profile'a eklemek için:
zh_cn: 添加到 /. profile :

source: to add to `~/.bash_profile`:
es: para añadir a /.bash_profile`:
fr: à ajouter à `~/.bash_profile`:
id: untuk menambah ke ~/.bash_profile:
tr: /.bash_profile'a eklemek için:
zh_cn: 添加到%/.bash_ profile :

source: For **Zsh**:
es: En lugar de **Zsh**:
fr: Pour **Zsh**:
id: Untuk **Zsh**:
tr: **Zsh ** için:
zh_cn: @sh**:

source: If you wish to get Cairo in non-interactive login shells as well, also add the commands to `~/.zprofile` or `~/.zlogin`.
es: Si desea obtener El Cairo en shells de inicio de sesión no interactivos también, también agregue los comandos a â € /.zprofile` o â € /.zlogin`.
fr: Si vous souhaitez obtenir le Caire dans des shells de connexion non interactifs, ajoutez également les commandes `~/.zprofil` ou `~/.zlogin`.
id: Jika Anda ingin mendapatkan Kairo di kerang login non-interaktif juga, juga menambahkan perintah ke ~/.zprofileé atau ~ /.zgin.
tr: Kahire'yi etkileşimli olmayan giriş kabuklarında da almak istiyorsanız, komutları /.zprofile veya /.zlogin'ye de ekleyin.
zh_cn: 如果您也想在非互动登录贝壳中获取开罗, 请在 {{/ zprofile} 或/ zlogin 中添加命令 。

source: For **Fish shell**:
es: Para **Concha de pescado**:
fr: Pour **Coquille de poisson**:
id: Untuk ** Fish shell**:
tr: **Balık kabuğu **:
zh_cn: 对于 ** Fish shell** :

source: If you have Fish 3.2.0 or newer, execute this interactively:
es: Si tiene Fish 3.2.0 o más reciente, ejecute esto interactivamente:
fr: Si vous avez Fish 3.2.0 ou plus récent, exécutez ceci de manière interactive:
id: Jika Anda memiliki Fish 3,2.0 atau lebih baru, jalankan secara interaktif ini:
tr: Eğer Balık 3.2.0 veya daha yenisi varsa, bunu etkileşimli olarak gerçekleştirin:
zh_cn: 如果您有鱼3.2.0或新鱼,请交互执行:

source: Otherwise, execute the snippet below:
es: De lo contrario, ejecute el fragmento a continuación:
fr: Sinon, exécutez l'extrait ci-dessous :
id: Jika tidak, jalankan snippet di bawah:
tr: Aksi takdirde, aşağıdaki snippet'i çalıştırın:
zh_cn: 否则,执行下面的片段:

source: In MacOS, you might also want to install [Fig](https://fig.io/) which provides alternative shell completions for many command line tools with an IDE-like popup interface in the terminal window. (Note that their completions are independent of Cairo's codebase so they might be slightly out of sync for bleeding-edge interface changes.)
es: En MacOS, es posible que también desee instalar [Fig](https://fig.io/) que proporciona terminaciones de shell alternativas para muchas herramientas de línea de comandos con una interfaz emergente similar a IDE en la ventana de terminal. (Tenga en cuenta que sus terminaciones son independientes de la base de código de El Cairo, por lo que podrían estar un poco fuera de sincronización para cambios de interfaz de borde sangrante.)
fr: Dans MacOS, vous pourriez également vouloir installer [Fig](https://fig.io/) qui fournit des finitions de shell alternatives pour de nombreux outils en ligne de commande avec une interface popup de type IDE dans la fenêtre du terminal. (Notez que leurs finitions sont indépendantes de la base de code du Caire afin qu'elles puissent être légèrement hors de synchronisation pour les modifications de l'interface saignée.)
id: Di MacOS, Anda mungkin juga ingin menginstal [Fig][Fig][Figttps://fig.io/) yang menyediakan pelengkapan shell alternatif bagi banyak alat baris perintah dengan antarmuka popup IDE-seperti di jendela terminal. (Ketahuan bahwa penyelesaian mereka bebas dari codebase Kairo sehingga mereka mungkin sedikit keluar dari sinkronisasi untuk perubahan antar muka pendarahan.)
tr: MacOS'ta, terminal penceresinde IDE benzeri bir açılır arayüze sahip birçok komut satırı aracı için alternatif kabuk tamamlamaları sağlayan [Fig](https://fig.io/) 'yı da yüklemek isteyebilirsiniz. (Tamamlamalarının Kahire'nin kod tabanından bağımsız olduğunu unutmayın, böylece kanamalı kenar arayüzü değişiklikleri için biraz senkronize olmayabilirler.)
zh_cn: 在 MacOS 中, 您可能还要安装 [ fig] (https:// fig. io/), 提供许多命令行工具的替代弹壳补全, 在终端窗口中安装类似 IDE 的弹出界面 。 (注意它们的补全独立于开罗的代码库, 这样它们可能略为不同步, 以适应出血的界面变化 。 )

source: Restart your Shell
es: Reinicie su Shell
fr: Redémarrez votre Shell
id: Restart Shell Anda
tr: Kabuğunuzu Yeniden Başlatın
zh_cn: 重新开始你的壳牌

source: for the `PATH` changes to take effect.
es: para que surtan efecto los cambios del " PATH ".
fr: pour que les modifications de la «PATH» prennent effet.
id: Untuk perubahan yang berlaku.
tr: PATH değişikliklerinin yürürlüğe girmesi için.
zh_cn: 使`PATH'变化生效。

source: "$SHELL"
fr: "Passer"
zh_cn: "美元地狱"

source: Installing Cairo Manually ([Guide](https://github.com/auditless/cairo-template) by [Abdel](https://github.com/abdelhamidbakhta))
es: Instalación manual de El Cairo ([Guía](https://github.com/auditless/cairo-template) por [Abdel](https://github.com/abdelhamidbakhta))
fr: Installer le Caire manuellement ([Guide](https://github.com/auditless/cairo-template) par [Abdel](https://github.com/abdelhamidbakhta)
id: Instalasi Cairo Manually ([Guide] 2.0https://github.com/auditless/cairo-template) oleh [Abdel] Knuthttps://gitub.com/abdelhamidbakhta)
tr: Kahire'yi [Guide] [https://github.com/auitless/cairo-template] [Abdel] tarafından manuel olarak yüklemek (https://github.com/abdelhamidbakhta)
zh_cn: 由[Abdel](https://github.com/abdelhamidbakhta)介绍([指南](https://github.com/abdelhamidbakhta)),手动安装开罗([指南](https://github.com/audelhamidbakhta))(https://github.com/auditless/cairo-template)

source: Step 1: Install Cairo 1.0
es: Paso 1: Instalar Cairo 1.0
fr: Étape 1: Installer le Caire 1.0
id: Langkah 1: Pasang Kairo 1.0
tr: Adım 1: Kahire 1.0'ı yükleyin
zh_cn: 第1步:安装开罗1.0

source: If you are using an x86 Linux system and can use the release binary, download Cairo here: <https://github.com/starkware-libs/cairo/releases>.
es: Si está utilizando un sistema Linux x86 y puede utilizar el binario de liberación, descargue El Cairo aquí: <https://github.com/starkware-libs/cairo/releases>.
fr: Si vous utilisez un système Linux x86 et pouvez utiliser le binaire de sortie, téléchargez le Caire ici: <https://github.com/starkware-libs/cairo/releases>.
id: Jika Anda menggunakan sistem Linux x86 dan dapat menggunakan biner rilis, download Kairo di sini: <https://github.com/starkware-libs/cairo/releases>.
tr: Bir x86 Linux sistemi kullanıyorsanız ve sürüm ikilisini kullanabiliyorsanız, Kahire'yi buradan indirebilirsiniz: https://github.com/starkware-libs/cairo/releases>.
zh_cn: 如果您正在使用x86 Linux系统,并且可以使用释放二进制,请在此下载开罗:<https://github.com/starkware-libs/cairo/releases>。

source: For everyone else, we recommend compiling Cairo from source as follows:
es: Para todos los demás, recomendamos compilar El Cairo a partir de la fuente de la siguiente manera:
fr: Pour tous les autres, nous recommandons de compiler le Caire à partir de la source comme suit:
id: Untuk orang lain, kami menyarankan kompilasi Kairo dari sumber sebagai berikut:
tr: Diğer herkes için, Kahire'yi aşağıdaki gibi kaynaktan derlemenizi tavsiye ederiz:
zh_cn: 对于其他人,我们建议从以下来源将开罗汇编如下:

source: # Start by defining environment variable CAIRO_ROOT
es: # Comience definiendo la variable de entorno CAIRO_ROOT
fr: # Commencez par définir la variable d'environnement CAIRO_ROOT
id: # Mulai dengan mendefinisikan variabel lingkungan CAIRO_ROOT
tr: # Çevre değişkeni CAIRO_ROOT'u tanımlayarak başlayın
zh_cn: # 从定义环境变量 CAIRO_ROOT 开始

source: "${HOME}/.cairo"
tr: "$HOME/.cairo" (İngilizce).
zh_cn: "${HOME}/. cairo" (${HOME}/.cairo)

source: # Create .cairo folder if it doesn't exist yet
es: # Crear carpeta.cairo si no existe todavía
fr: # Créer un dossier.cairo s'il n'existe pas encore
id: # Buat folder.cairo jika belum ada
tr: # Henüz mevcut değilse.cairo klasörü oluştur
zh_cn: 创建.cairo文件夹,如果它还没有存在的话

source: # Clone the Cairo compiler in $CAIRO_ROOT (default root)
es: # Clon el compilador de El Cairo en $CAIRO_ROOT (raíz predeterminada)
fr: # Clone le compilateur du Caire dans $CAIRO_ROOT (root par défaut)
id: # Clone the Kairo compiler in $CAIRO_ROOT (default root)
tr: # Kahire derleyicisini $CAIRO_ROOT ile klonla (varsayılan kök)
zh_cn: # 以 $CAIRO_ROOT (默认根) 克隆开罗汇编器

source: # OPTIONAL/RECOMMENDED: If you want to install a specific version of the compiler # Fetch all tags (versions)
es: # OPCIONAL/RECOMENDADO: Si desea instalar una versión específica del compilador # Obtener todas las etiquetas (versiones)
fr: # OPTIONNEL/RECOMMANDÉ: Si vous voulez installer une version spécifique du compilateur # Saisissez toutes les balises (versions)
id: # OPSIAL/RECOMMENDED: Jika Anda ingin menginstal versi spesifik dari kompiler # Ambil semua tag (versi)
tr: # OPTIONAL/RECOMMENDED: Derleyicinin belirli bir sürümünü yüklemek istiyorsanız # Tüm etiketleri alın (sürümler)
zh_cn: # OPOPAL/RECOMMEND: 如果您想要安装一个编译器的具体版本 # 获取所有标签( 版本) #

source: # View tags (you can also do this in the Cairo compiler repository)
es: # Ver etiquetas (también puede hacer esto en el repositorio del compilador de El Cairo)
fr: # Afficher les balises (vous pouvez aussi le faire dans le dépôt du compilateur du Caire)
id: # Tilik tag (Anda juga dapat melakukan ini dalam repositori kompiler Kairo)
tr: # Etiketleri görüntüleyin (bunu Kahire derleyici deposunda da yapabilirsiniz)
zh_cn: # 查看标签( 您也可以在开罗编译器库中这样做 )

source: # Checkout the version you want
es: # Revisa la versión que quieras
fr: # Vérifiez la version que vous voulez
id: ¶ Checkout versi yang Anda inginkan
tr: # İstediğiniz versiyonu kontrol edin
zh_cn: # 查看您想要的版本

source: # Generate release binaries
es: # Generar binarios de liberación
fr: Générer des binaires de libération
id: # Hasilkan rilis binaries
tr: # Serbest bırakma ikilileri oluştur
zh_cn: 生成释放的二进制

source: **NOTE: Keeping Cairo up to date**
es: **NOTA: Mantener El Cairo actualizado**
fr: **NOTE: tenir le Caire à jour**
id: **NOTE: Menjaga Kairo up to date**
tr: **NOT: Kahire'yi güncel tutmak **
zh_cn: ** 注:不断更新开罗**

source: Now that your Cairo compiler is in a cloned repository, all you will need to do is pull the latest changes and rebuild as follows:
es: Ahora que su compilador de El Cairo está en un repositorio clonado, todo lo que tendrá que hacer es extraer los últimos cambios y reconstruir como sigue:
fr: Maintenant que votre compilateur du Caire est dans un dépôt cloné, tout ce que vous aurez à faire est de tirer les derniers changements et de reconstruire comme suit:
id: Sekarang bahwa kompiler Kairo Anda berada dalam repositori kloning, yang perlu Anda lakukan adalah menarik perubahan terbaru dan membangun kembali sebagai berikut:
tr: Artık Kahire derleyiciniz klonlanmış bir depoda olduğuna göre, yapmanız gereken tek şey en son değişiklikleri çekmek ve aşağıdaki gibi yeniden inşa etmektir:
zh_cn: 您的开罗编译器已经在一个克隆的仓库中, 您需要做的就是拉动最新的修改, 并重建如下 :

source: Step 2: Add Cairo 1.0 Executables to Your Path
es: Paso 2: Añadir El Cairo 1.0 Ejecutables a su camino
fr: Étape 2: Ajouter des exécutables du Caire 1.0 à votre chemin
id: Langkah 2: Tambah Cairo 1,0 Executables to Your Path
tr: Adım 2: Yolunuza Kahire 1.0 Executables ekleyin
zh_cn: 步骤2:在您的路径中添加开罗 1.0 执行文件

source: "$CAIRO_ROOT/target/release:$PATH"
fr: "$CAIRO_ROOT/cible/release:$PATH"
tr: "$CAIRO_ROOT/hedef/release:$PATH" (İngilizce).
zh_cn: “CAIRO_ROOT/目标/释放:$PATH”

source: **NOTE: If installing from a Linux binary, adapt the destination path accordingly.**
es: **NOTA: Si se instala desde un binario Linux, adapte la ruta de destino en consecuencia.**
fr: **NOTE: Si vous installez à partir d'un binaire Linux, adaptez le chemin de destination en conséquence.**
id: **NOTE: Jika dipasang dari biner Linux, menyesuaikan jalur tujuan sesuai.**
tr: **NOT: Bir Linux ikilisinden yükleniyorsa, hedef yolu buna göre uyarlayın. **
zh_cn: **注:如果从Linux二进制安装,则相应调整目的地路径。 **

source: Step 3: Setup Language Server
es: Paso 3: Configurar el servidor de lenguaje
fr: Étape 3: Configuration du serveur de langage
id: Langkah 3: Tata Server Bahasa
tr: Adım 3: Dil Sunucusu Kur
zh_cn: 第3步:建立语言服务器

source: VS Code Extension
es: Extensión de código VS
fr: Extension du code VS
id: Ekstensi Kode VS
tr: VS Kod Uzantısı
zh_cn: VS 代码扩展

source: If you have the previous Cairo 0 extension installed, you can disable/uninstall it.
es: Si tiene instalada la extensión anterior Cairo 0, puede desactivarla/desinstalarla.
fr: Si vous avez installé la précédente extension Cairo 0, vous pouvez la désactiver/désinstaller.
id: Jika Anda memasang ekstensi Kairo 0 sebelumnya, Anda dapat menonaktifkan/menyalakannya.
tr: Önceki Kahire 0 uzantısı yüklüyse, devre dışı bırakabilir / kaldırabilirsiniz.
zh_cn: 如果您安装了上一个开罗 0 扩展名, 您可以禁用/ 卸载它 。

source: Install the Cairo 1 extension for proper syntax highlighting and code navigation. You can find the link to the extension [here](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), or just search for "Cairo 1.0" in the VS Code marketplace.
es: Instale la extensión El Cairo 1 para resaltar correctamente la sintaxis y la navegación de código. Puede encontrar el enlace a la extensión [aquí](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), o simplemente busque "El Cairo 1.0" en el mercado de código VS.
fr: Installez l'extension Cairo 1 pour la mise en valeur de la syntaxe et la navigation du code. Vous pouvez trouver le lien vers l'extension [ici](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), ou simplement chercher "Cairo 1.0" sur le marché du code VS.
id: Instal ekstensi Kairo 1 untuk penandaan sintaks yang tepat dan navigasi kode. Anda dapat menemukan link ke ekstensi [di sini]bahttps://marketstudio.com/items?item=starkware.cairo1&sr=false), atau hanya mencari "Cairo 1.0" di pasar Kode VS.
tr: Uygun sözdizimi vurgulama ve kod navigasyonu için Kahire 1 uzantısını yükleyin. [burada] uzantısının bağlantısını bulabilirsiniz (https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), veya sadece VS Code pazarında "Cairo 1.0" için arama yapın.
zh_cn: 安装开罗 1 扩展名, 用于正确的语法加亮和代码导航 。 您可以找到此扩展名的链接 。 (https:// smarkedplace. visualstudio.com/ items? itemName=starkware. cairo1&sr=false), 或者在 VS 代码市场搜索“ Cairo 1.0 ” 。

source: The extension will work out of the box once you will have [Scarb](./ch01-03-hello-scarb.md) installed.
es: La extensión funcionará fuera de la caja una vez que usted tenga [Scarb](./ch01-03-hello-scarb.md) instalado.
fr: L'extension fonctionnera hors de la boîte une fois que vous aurez [Scarb](./ch01-03-hello-scarb.md) installé.
id: Extension akan bekerja dari kotak setelah Anda akan memiliki [Scarb] alb. /ch01-03-hello-scarb) dipasang.
tr: Uzantı, [Scarb](./ch01-03-hello-scarb.md) yüklendikten sonra kutudan çıkacak.
zh_cn: 一旦安装了[Scarb](./ch01-03-hello-scarb.md),扩展件将会从盒子中工作。

source: Cairo Language Server without Scarb
es: Servidor de idioma de El Cairo sin escarcha
fr: Serveur de langue du Caire sans écharpe
id: Cairo Language Server tanpa Scarb
tr: Scarb olmadan Kahire Dil Sunucusu
zh_cn: 没有疤痕的开罗语言服务器b

source: If you don't want to depend on Scarb, you can still use the Cairo Language Server with the compiler binary. From [Step 1](#installing-cairo-with-a-script-installer-by-fran), the `cairo-language-server` binary should be built and executing this command will copy its path into your clipboard.
es: Si no quieres depender de Scarb, puedes usar el servidor de idioma Cairo con el binario del compilador. Desde [Paso 1](#installing-cairo-with-a-script-installer-by-fran), el binario `cairo-language-server` debe ser construido y ejecutar este comando copiará su ruta en tu portapapeles.
fr: Si vous ne voulez pas dépendre de Scarb, vous pouvez toujours utiliser le serveur de langue Cairo avec le binaire compilateur. À partir de [Step 1](#installing-cairo-with-a-script-installer-by-fran), le binaire `cairo-language-server` doit être construit et l'exécution de cette commande va copier son chemin dans votre presse-papiers.
id: Jika Anda tidak ingin bergantung pada Scarb, Anda masih dapat menggunakan Server Bahasa Kairo dengan binari kompiler. Dari [Langkah 1] [Step 1][installing-cairo-with-a-script-installer-by-fran), biner ▪cairo-language-server harus dibangun dan melaksanakan perintah ini akan menyalin jalan ke dalam clipboard Anda.
tr: Scarb'a bağlı kalmak istemiyorsanız, yine de derleyici ikilisiyle Kahire Dil Sunucusu'nu kullanabilirsiniz. [Adım 1](#installing-cairo-with-a-script-installer-by-fran), cairo-language-server ikilisi oluşturulmalı ve bu komutun çalıştırılması yolunu panonuza kopyalayacaktır.
zh_cn: 如果您不想依赖刀疤, 您仍然可以用编译器二进制使用开罗语言服务器 。 从 [ step 1] (# 安装- cairo- 手稿- 安装- 安装- by- fran), 应该建立“ cairo- 语言服务器” 二进制, 执行此命令时将把路径复制到您的剪贴板 。
