Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Consider the code in Listing 7-6 that models the situation in which a chef fixes an incorrect order and personally brings it out to the customer. The function `fix_incorrect_order` defined in the `back_of_house` module calls the function `deliver_order` defined in the parent module by specifying the path to `deliver_order` starting with `super`:
es: Considerar el código en la Lista 7-6 que modela la situación en la que un chef corrige un pedido incorrecto y lo lleva personalmente al cliente. La función `fix_incorrect_order` definida en el módulo `back_of_house` llama a la función `deliver_order` definida en el módulo padre especificando la ruta a `deliver_order` comenzando por `super`:
fr: Considérez le code dans Listing 7-6 qui modélise la situation dans laquelle un chef corrige un ordre incorrect et l'apporte personnellement au client. La fonction `fix_incorred_order` définie dans le module `back_of_house` appelle la fonction `deliver_order` définie dans le module parent en spécifiant le chemin vers `deliver_order` en commençant par `super`:
id: Pertimbangkan kode dalam Listing 7-6 yang model situasi di mana seorang koki memperbaiki urutan yang salah dan secara pribadi membawanya ke pelanggan. Fungsi ▪fix_incord_orderdedededect dalam ▪back_of_house#house modul panggilan fungsi ▪deliver_orderal didefinisikan dalam modul induk dengan menspesifikasikan jalur ke Édeliver_ preserve:
tr: Listeleme 7-6'da bir şefin yanlış bir düzeni düzelttiği ve şahsen müşteriye getirdiği durumu modelleyen kodu düşünün. back_of_house modülünde tanımlanan fix_incorrect_order işlevi, ana modülde tanımlanan deliver_order fonksiyonunu super ile başlayan deliver_order yolunu belirterek çağırır:
zh_cn: 列表 7-6 中的代码可以模拟厨师设置错误顺序并亲自将其带给客户的情形。 “ 后院” 模块中定义的函数“ fix_ in 更正_ order ” 将父模块中定义的函数“ deliver_order”称为“ deliver_order ”, 具体指明“ deliver_order” 的路径, 以“ 超级” 开头的路径 :

source: <span class="caption">Listing 7-6: Calling a function using a relative path starting with `super`</span>
es: <span class="caption">Lista 7-6: Llamar a una función usando una ruta relativa que comienza con `super/span>
fr: <span class="caption">Liste 7-6: Appeler une fonction en utilisant un chemin relatif commençant par `super`</span>
id: <span class="caption">Listing 7-6: Memanggil sebuah fungsi menggunakan jalur relatif dimulai dengan super</span>
tr: span class="caption">Liste 7-6: super/span> ile başlayan göreceli bir yol kullanarak bir işlevi çağırmak
zh_cn: <span类=“ caption” > listing 7-6: 使用从“ europe_\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Here you can see directly that you access a parent's module easily using `super`, which wasn't the case previously. Note that the `back_of_house` is kept private, as external users are not supposed to interact with the back of house directly.
es: Aquí puedes ver directamente que accedes al módulo de un padre fácilmente usando `super`, que no era el caso anteriormente. Ten en cuenta que el `back_of_house` se mantiene privado, ya que los usuarios externos no se supone que interactúan directamente con la parte posterior de la casa.
fr: Ici, vous pouvez voir directement que vous accédez au module d'un parent facilement en utilisant `super`, ce qui n'était pas le cas auparavant. Notez que le `back_of_house` est gardé privé, car les utilisateurs externes ne sont pas censés interagir directement avec l'arrière de la maison.
id: Di sini Anda dapat melihat secara langsung bahwa Anda mengakses modul orang tua dengan mudah menggunakan superepsi, yang tidak pernah terjadi sebelumnya.
tr: Burada doğrudan bir ebeveyn modülüne daha önce böyle olmayan super kullanarak kolayca eriştiğinizi görebilirsiniz. Dış kullanıcıların doğrudan evin arkasıyla etkileşime girmemesi gerektiği için back_of_house'un gizli tutulduğunu unutmayın.
zh_cn: 这里您可以直接看到您使用“ 超级” 很容易地访问父/母模块, 而以前的情况并非如此。 请注意, ` 后院' 是私密的, 因为外部用户不应该直接与家庭后院互动 。

source: Making Structs and Enums Public
es: Hacer públicos los estructs y los enums
fr: Faire en sorte que les structures et les Enums soient publics
id: Membuat Struktur dan Publik Enums
tr: Yapıtları ve Enumları Kamulaştırma
zh_cn: 公诸于众

source: We can also use `pub` to designate structs and enums as public, but there are a few extra details to consider when using `pub` with structs and enums.
es: También podemos utilizar `pub` para designar structs y enums como públicos, pero hay algunos detalles adicionales que considerar al utilizar `pub` con structs y enums.
fr: Nous pouvons également utiliser `pub` pour désigner les structures et les enums comme publics, mais il y a quelques détails supplémentaires à considérer lors de l'utilisation de `pub` avec des structures et des enums.
id: Kita juga dapat menggunakan åpub) untuk mengartikan struktur dan enums sebagai publik, tetapi ada beberapa rincian tambahan untuk dipertimbangkan sewaktu menggunakan ·pub dengan struct dan enums.
tr: Ayrıca pub'yi struct'ları ve enum'ları kamuya açık olarak belirlemek için de kullanabiliriz, ancak pub'yi struct'lar ve enum'larla kullanırken dikkate alınması gereken birkaç ekstra ayrıntı vardır.
zh_cn: 我们还可以使用`插件'来指定构件和钉子为公开的,但在使用构件和钉子的`构件'时,还可以考虑一些额外的细节。

source: If we use `pub` before a struct definition, we make the struct public, but the struct’s fields will still be private. We can make each field public or not on a case-by-case basis.
es: Si usamos `pub` antes de una definición de estructura, hacemos pública la estructura, pero los campos de la estructura seguirán siendo privados. Podemos hacer cada campo público o no sobre una base caso por caso.
fr: Si nous utilisons `pub` avant une définition de structure, nous rendons la structure publique, mais les champs de structure seront encore privés. Nous pouvons rendre chaque champ public ou non au cas par cas.
id: Jika kita menggunakan °pub sebelum definisi struct, kita membuat struct publik, tetapi structing fields masih akan menjadi pribadi. kita dapat membuat setiap lapangan publik atau tidak pada kasus-per-kasus.
tr: Bir yapısal tanımdan önce pub kullanırsak, yapıyı halka açık hale getiririz, ancak yapının alanları hala özel olacaktır. Her alanı duruma göre kamuya açık hale getirebiliriz veya olmayabiliriz.
zh_cn: 如果我们在结构定义之前使用`插件 ',我们就将结构公之于众,但结构的字段仍将是私有的,我们可以在个案基础上将每个领域公之于众或不公之于众。

source: In contrast, if we make an enum public, all of its variants are then public. We only need the `pub` before the `enum` keyword.
es: En cambio, si hacemos público un enum, todas sus variantes son entonces públicas. Sólo necesitamos el `pub` antes de la palabra clave `enum`.
fr: En revanche, si nous rendons un enum public, toutes ses variantes sont alors publiques. Nous avons seulement besoin du `pub` avant le mot-clé `enum`.
id: Sebaliknya, jika kita membuat publik enum, semua varian maka publik.
tr: Buna karşılık, bir enum halka açık hale getirirsek, tüm varyantları halka açıktır. enum anahtar kelimesinden önce sadece pub'ya ihtiyacımız var.
zh_cn: 与此相反,如果我们将一个大通版公诸于众,它的所有变异版就都公开了,我们只需要在“大通”关键字之前的`pub'。

source: There’s one more situation involving `pub` that we haven’t covered, and that is our last module system feature: the `use` keyword. We’ll cover `use` by itself first, and then we’ll show how to combine `pub` and `use`.
es: Hay una situación más que involucra `pub` que no hemos cubierto, y esa es nuestra última característica del sistema de módulo: la palabra clave `use`. Primero cubriremos `use` por sí mismo, y luego mostraremos cómo combinar `pub` y `use`.
fr: Il ya une autre situation impliquant `pub` que nous n'avons pas couvert, et c'est notre dernière fonctionnalité de système de module: le mot-clé `use`. Nous allons couvrir `use` d'abord, puis nous allons montrer comment combiner `pub` et `use`.
id: Ada satu situasi lagi yang melibatkan diri sendiri, dan itu adalah fitur sistem modul terakhir kita: kata kunci.
tr: pub'nin kapsamadığı bir durum daha var ve bu bizim son modül sistem özelliğimiz: use anahtar kelimesi. Önce use'yi tek başına ele alacağız ve daha sonra pub ve use'yi nasıl birleştireceğimizi göstereceğiz.
zh_cn: 还有一种情况涉及 " 我们尚未覆盖的 " 插件,这是我们模块系统最后一个特点: " 使用关键词 ",我们先自行覆盖 " 使用 ",然后展示如何将 " 插件 " 和 " 使用 " 结合起来。

source: {{#quiz ../quizzes/ch07-03-paths-in-module-tree-2.toml}}
es: quiz../quizzes/ch07-03-paths-in-módule-tree-2.toml
fr: {{#quiz../quizes/ch07-03-paths-in-module-tree-2.toml}}
zh_cn: Quiz./quizzes/ch07-03-paths-in-module-toml-toml__BAR__BAR__BAR_ /quizzes/ch07-03-paths-in-module-tree-2.toml_BAR__BAR_ /quiz/quizzes/ch07-03-paths- in-module-tree-2.toml_BAR_

source: Having to write out the paths to call functions can feel inconvenient and repetitive. Fortunately, there’s a way to simplify this process: we can create a shortcut to a path with the `use` keyword once, and then use the shorter name everywhere else in the scope.
es: Tener que escribir las rutas a las funciones de llamada puede sentirse incómodo y repetitivo. Afortunadamente, hay una manera de simplificar este proceso: podemos crear un atajo a una ruta con la palabra clave `use` una vez, y luego utilizar el nombre más corto en todas partes en el ámbito.
fr: Le fait d'écrire les chemins des fonctions d'appel peut sembler gênant et répétitif. Heureusement, il y a un moyen de simplifier ce processus : nous pouvons créer un raccourci vers un chemin avec le mot-clé `use` une fois, puis utiliser le nom plus court partout ailleurs dans la portée.
id: Setelah menuliskan jalan untuk memanggil fungsi dapat merasa tidak nyaman dan berulang-ulang. untungnya, ada cara untuk menyederhanakan proses ini: kita dapat membuat jalan pintas dengan kata kunci yang digunakan sekali, dan kemudian menggunakan nama pendek di mana-mana dalam lingkup.
tr: Fonksiyonları aramak için yollar yazmak zorunda kalmak rahatsız edici ve tekrarlayan hissedebilir. Neyse ki, bu işlemi basitleştirmenin bir yolu var: use anahtar kelimesi ile bir kez bir yola kısayol oluşturabilir ve daha sonra kapsamdaki diğer her yerde daha kısa adı kullanabiliriz.
zh_cn: 写出调用函数的路径可能会感到不方便和重复。 幸运的是,有一个方法可以简化这个过程:我们可以创造一条通往使用“使用”关键字的路径的捷径,然后在范围中的任何地方使用较短的名称。

source: In Listing 7-7, we bring the `restaurant::front_of_house::hosting` module into the scope of the `eat_at_restaurant` function so we only have to specify `hosting::add_to_waitlist` to call the `add_to_waitlist` function in `eat_at_restaurant`.
es: En la lista 7-7, traemos el `restaurante::front_of_house::hosting` módulo al alcance de la función `eat_at_restaurante` por lo que sólo tenemos que especificar `hosting::add_to_waitlist` para llamar a la función `add_to_waitlist` en `eat_at_restaurante`.
fr: Dans Listing 7-7, nous apportons le module `restaurant::front_of_house::hosting` dans la portée de la fonction `eat_at_restaurant` de sorte que nous n'avons qu'à spécifier `hosting::add_to_waitlist` pour appeler la fonction `add_to_waitlist` dans `eat_at_restaurant`.
id: Di Listing 7-7, kami membawa ·restaurant:front_of_house::hosing those module into the scope of the · eat_at_restaurantá jadi kami hanya perlu menentukan Ásting: add_to_waitlist to call the ·ad_to waitlist fungsi in ▪at_reater_stoatent_stourantá.
tr: Listeleme 7-7'de restaurant::front_of_house::hosting modülünü eat_at_restaurant işlevinin kapsamına getiriyoruz, bu nedenle sadece add_to_waitlist fonksiyonunu eat_at_restaurant olarak adlandırmak için hosting::add_to_waitlist fonksiyonunu belirtmemiz gerekiyor.
zh_cn: 在清单7-7中,我们把`restaurant::front_of_house:: hosting'模块纳入`eat_at_restaurant'功能的范围,因此我们只需具体说明`东道:add_to_waitlist'即可在`eat_at_restaurant'中称为`add_to_waitlist'函数。

source: // Assuming "front_of_house" module is contained in a crate called "restaurant", as mentioned in the section "Defining Modules to Control Scope" // If the path is created in the same crate, "restaurant" is optional in the use statement
es: // Suponiendo que el módulo "front_of_house" está contenido en una caja llamada "restaurante", como se menciona en la sección "Definir módulos para controlar el alcance" // Si la ruta se crea en la misma caja, "restaurante" es opcional en la declaración de uso
fr: // En supposant que le module "front_of_house" soit contenu dans une caisse appelée "restaurant", comme mentionné dans la section "Définition des modules pour contrôler la portée" // Si le chemin est créé dans la même caisse, "restaurant" est optionnel dans la déclaration d'utilisation
id: /// Asumsikan modul "front_of_house" terkandung dalam peti yang disebut "restourant", seperti disebutkan dalam bagian "Defining Modules to Control Scope" / Jika jalur dibuat dalam peti yang sama, "restoran" adalah opsional dalam pernyataan penggunaan
tr: // "Prens_of_house" modülünün "Restaurant" olarak adlandırılan bir sandıkta bulunduğunu varsayarsak, "Defining Modules to Control Scope" bölümünde belirtildiği gibi // Yol aynı sandıkta oluşturulursa, kullanım ifadesinde "restaurant" isteğe bağlıdır.
zh_cn: / 假设“家用前方”模块包含在“确定控制范围模块”一节中提到的称为“雷斯塔乌兰特”的箱中/如果路径是在同一箱中创建的,则“雷斯塔乌兰特”在使用语句中是可选的。

source: // ✅ Shorter path
es: // • Ruta más corta
fr: // -Shorter le chemin
id: // Jalan Shorter
tr: // Daha kısa yol
zh_cn: / / 缩短路径

source: <span class="caption">Listing 7-7: Bringing a module into scope with `use`</span>
es: <span class="caption">Lista 7-7: Llevar un módulo al alcance con `use/span>
fr: <span class="caption">Liste 7-7: Apporter un module dans la portée avec `use`</span>
id: <span class="caption">Listing 7-7: Membawa sebuah modul ke dalam lingkup dengan </span>
tr: span class="caption">Liste 7-7: use/span> ile bir modülün kapsamına alınması
zh_cn: <span类=“caption” > listing 7-7: 将模块带入“ use_/span” 的范围

source: Adding `use` and a path in a scope is similar to creating a symbolic link in the filesystem. By adding `use restaurant::front_of_house::hosting;` in the crate root, `hosting` is now a valid name in that scope, just as though the `hosting` module had been defined in the crate root.
es: La adición de `uso` y una ruta en un ámbito es similar a la creación de un enlace simbólico en el sistema de archivos. Al añadir `uso de restaurante::front_of_house::hosting;` en la raíz de la caja, `hosting'es ahora un nombre válido en ese ámbito, como si el módulo `hosting'se hubiera definido en la raíz de la caja.
fr: Ajouter `use` et un chemin dans une portée est similaire à créer un lien symbolique dans le système de fichiers. En ajoutant `use restaurant::front_of_house::hosting;` dans la racine de caisse, `hosting` est maintenant un nom valide dans cette portée, tout comme si le module `hosting` avait été défini dans la racine de caisse.
id: Menambahkan åuseé dan sebuah jalur dalam sebuah lingkup mirip dengan membuat link simbolik dalam sistem berkas. Dengan menambahkan restoran ·us::front_of_house:::hosting; (hosting) dalam akar peti, thosehosting) sekarang merupakan nama yang valid dalam lingkup itu, sama seperti modul yang didefinisikan dalam akar peti.
tr: Bir kapsamda use ve bir yol eklemek, dosya sisteminde sembolik bir bağlantı oluşturmaya benzer. use restoran::front_of_house::hosting; sandık kökünde, hosting, tıpkı hosting modülü sandık kökünde tanımlanmış gibi, artık bu kapsamda geçerli bir isimdir.
zh_cn: 添加“使用”和“范围中的路径”类似于在文件系统中创建符号链接。通过添加“使用餐厅:Front_of_house:: hosting”;`在箱根中,`托管'现在在此范围内是一个有效名称,就像在箱根中定义了`托管'模块一样。

source: Note that `use` only creates the shortcut for the particular scope in which the `use` occurs. Listing 7-8 moves the `eat_at_restaurant` function into a new child module named `customer`, which is then a different scope than the `use` statement, so the function body won’t compile:
es: Tenga en cuenta que `use` sólo crea el acceso directo para el ámbito particular en el que se produce el `uso`. El listado 7-8 mueve la función `eat_at_restaurant` a un nuevo módulo secundario llamado `cliente`, que es entonces un ámbito diferente al de la declaración `use`, por lo que el cuerpo de funciones no compilará:
fr: Notez que `use` crée seulement le raccourci pour la portée particulière dans laquelle se produit `use`. Listing 7-8 déplace la fonction `eat_at_restaurant` dans un nouveau module enfant nommé `client`, qui est alors une portée différente de l'instruction `use`, de sorte que le corps de la fonction n'a pas compilé:
id: Perhatikan bahwa hanya menciptakan jalan pintas untuk lingkup tertentu yang kemudian merupakan ruang lingkup yang berbeda dari pernyataan thoseuse, sehingga fungsi tubuh memenangkan kompilasi:
tr: use'un yalnızca use'nin gerçekleştiği belirli kapsam için kısayol oluşturduğunu unutmayın. Listeleme 7-8, eat_at_restaurant işlevini customer adlı yeni bir çocuk modülüne taşır, bu da use ifadesinden farklı bir kapsamdır, bu nedenle işlev gövdesi derlenmez:
zh_cn: 请注意,`使用'只为`使用'发生的特定范围创造捷径。列出 7-8 将`eat_at_restaurant'函数移动为名为`客户'的新儿童模块,该模块的范围与`使用'语句不同,因此函数体不会汇编:

source: <span class="caption">Listing 7-8: A `use` statement only applies in the scope it’s in.</span>
es: <span class="caption">Lista 7-8: Una declaración `use` sólo se aplica en el ámbito en el que está.</span>
fr: <span class="caption">Liste 7-8: Une mention `use` ne s'applique que dans le champ d'application où elle se trouve.</span>
id: <span class="caption">Listing 7-8: Sebuah pernyataan yang digunakan hanya berlaku dalam lingkup itu masuk.</span>
tr: span class="caption">Listing 7-8: A use ifadesi yalnızca içinde bulunduğu kapsamda geçerlidir./span>
zh_cn: <span类=“caption” > listing 7-8:`使用'说明仅适用于其范围。 </span>

source: The compiler error shows that the shortcut no longer applies within the `customer` module:
es: El error del compilador muestra que el acceso directo ya no se aplica dentro del módulo `cliente`:
fr: L'erreur du compilateur montre que le raccourci ne s'applique plus dans le module `client`:
id: Kesalahan kompiler menunjukkan bahwa jalan pintas tidak lagi berlaku dalam modul åcustomerå:
tr: Derleyici hatası, kısayolun artık müşteri modülü içinde geçerli olmadığını gösterir:
zh_cn: 编译器错误显示快捷键不再适用于“客户”模块:

source: Creating Idiomatic `use` Paths
es: Creación de rutas idiomáticas de `uso`
fr: Créer des chemins d'utilisation idiomatiques
id: Membuat Path yang Idiomatik
tr: Idiomatic use Paths Oluşturma
zh_cn: 创建“使用”路径

source: In Listing 7-7, you might have wondered why we specified `use restaurant::front_of_house::hosting` and then called `hosting::add_to_waitlist` in `eat_at_restaurant` rather than specifying the `use` path all the way out to the `add_to_waitlist` function to achieve the same result, as in Listing 7-9.
es: En la lista 7-7, puede que se haya preguntado por qué especificamos `use restaurant::front_of_house::hosting` y luego llamado `hosting:::add_to_waitlist` en `eat_at_restaurant` en lugar de especificar la ruta `use` hasta la función `addd_to_waitlist` para lograr el mismo resultado, como en la lista 7-9.
fr: Dans Listing 7-7, vous vous êtes peut-être demandé pourquoi nous avons spécifié `use restaurant::front_of_house::hosting` et ensuite appelé `hosting::add_to_waitlist` dans `eat_at_restaurant` plutôt que de spécifier le chemin `use` jusqu`à la fonction `add_to_waitlist` pour obtenir le même résultat, comme dans Listing 7-9.
id: Di Listing 7-7, Anda mungkin bertanya-tanya mengapa kami menyatakan restoran ·eat_resturant:front_of_house::hostingé and then calling {::::: add_to_waitlist in ▪ eat_rest_resturantâ than dispesifikasikan jalur óuse_out to the ▪ad_towaitlistite fungsi untuk mencapai hasil yang sama, seperti dalam Listing 7-9.
tr: Listeleme 7-7'de, neden use restoran::front_of_house::hosting belirttiğimizi ve daha sonra hosting::add_to_waitlist olarak adlandırılan eat_at_restaurant'da use_to_waitlist yolunu listeleme 7-9'da olduğu gibi aynı sonucu elde etmek için neden add_to_waitlist işlevini belirlediğimizi merak etmiş olabilirsiniz.
zh_cn: 在清单7-7中,你可能想知道我们为什么在`eat_at_restaurant'中指定`使用餐厅:前门:接待 ',然后称之为`托管:add_to_waitlist ',而不是像在清单7-9中指明`add_to_waitlist'功能那样,通过`add_to_waitlist'通向`add_to_waitlist'功能的`使用'路径来实现同样的结果。

source: <span class="caption">Listing 7-9: Bringing the `add_to_waitlist` function into scope with `use`, which is unidiomatic</span>
es: <span class="caption">Lista 7-9: Llevar la función `add_to_waitlist` al ámbito con `use`, que es unidiomático</span>
fr: <span class="caption">Liste 7-9: Apporter la fonction `add_to_waitlist` dans la portée avec `use`, qui est unidiomatique</span>
id: <span class="caption">Listing 7-9: Membawa fungsi </span> yang tidak terdidik
tr: span class="caption">Listeleme 7-9: add_to_waitlist fonksiyonunu use ile kapsamına sokmak, unidiomatic/span>
zh_cn: <span类=“caption” > listing 7-9: 将`add_to_to_waitlist' 功能带入`use'的范围,即单元 </span>

source: Although both Listing 7-7 and 7-9 accomplish the same task, Listing 7-7 is the idiomatic way to bring a function into scope with `use`. Bringing the function’s parent module into scope with `use` means we have to specify the parent module when calling the function. Specifying the parent module when calling the function makes it clear that the function isn’t locally defined while still minimizing repetition of the full path. The code in Listing 7-9 is unclear as to where `add_to_waitlist` is defined.
es: Aunque tanto el listado 7-7 como el 7-9 realizan la misma tarea, el listado 7-7 es la forma idiomática de introducir una función en el ámbito de aplicación con `use`. Al introducir el módulo padre de la función en el ámbito de aplicación con `use` significa que tenemos que especificar el módulo padre al llamar a la función. Especificar el módulo padre al llamar a la función deja claro que la función no está definida localmente mientras se minimiza la repetición de la ruta completa. El código en el listado 7-9 no está claro en cuanto a dónde se define `add_to_waitlist`.
fr: Bien que les deux Listing 7-7 et 7-9 accomplissent la même tâche, Listing 7-7 est la manière idiomatique d'introduire une fonction dans la portée avec `use`. Apporter le module parent de la fonction dans la portée avec `use` signifie que nous devons spécifier le module parent lors de l'appel de la fonction. Spécifier le module parent lors de l'appel de la fonction indique clairement que la fonction n'est pas localement définie tout en minimisant la répétition du chemin complet. Le code dans Listing 7-9 n'est pas clair quant à l'endroit où `add_to_waitlist` est défini.
id: Meskipun Listing 7-7 dan 7-9 mencapai tugas yang sama, Listing 7-7 adalah cara terdiomatitik untuk membawa sebuah fungsi ke dalam lingkup dengan åuse. Membawa modul induk ke ruang lingkup dengan thoseuse yang sama berarti kita harus menentukan modul induk ketika memanggil fungsi. Spesifikasikan modul induk ketika memanggil fungsi membuat jelas bahwa fungsi secara lokal tidak didefinisikan secara lokal sementara masih meminimalkan pengulangan dari jalur penuh. Kode dalam List 7-9 tidak jelas seperti di mana fmad_dto_warrylist didefinisikan.
tr: Her iki Listeleme 7-7 ve 7-9 aynı görevi yerine getirse de, Listeleme 7-7, use ile bir işlevi kapsam içine getirmenin deyimsel yoludur. Fonksiyonun ana modülünü use ile kapsam içine getirmek, işlevi çağırırken ana modülü belirtmemiz gerektiği anlamına gelir. Fonksiyonu çağırırken ana modülün belirtilmesi, tam yolun tekrarını en aza indirirken fonksiyonun yerel olarak tanımlanmadığını açıkça gösterir. Liste 7-9'daki koddur.
zh_cn: 虽然列出7-7和7-9的任务都相同,但列出7-7是将函数带入“使用”范围的独特方式。将函数的母模块带入“使用”意味着我们必须在调用该函数时指定母模块。调用该函数时指定母模块,表明该函数不是本地定义的,同时仍然尽量减少完整路径的重复。列出7-9中的代码不清楚“添加_to_waitlist”在哪里定义。
