Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: When `PartialEq` is derived on structs, two instances are equal only if all their fields are equal; they are not equal if any field is different. When derived for enums, each variant is equal to itself and not equal to the other variants.
es: Cuando `PartialEq` se deriva de structs, dos instancias son iguales sólo si todos sus campos son iguales; no son iguales si cualquier campo es diferente. Cuando se deriva de enums, cada variante es igual a sí misma y no igual a las otras variantes.
fr: Lorsque `PartialEq` est dérivé sur structs, deux instances ne sont égales que si tous leurs champs sont égaux; elles ne sont pas égales si un champ est différent. Lorsqu'il est dérivé pour les enums, chaque variante est égale à elle-même et non pas égale aux autres variantes.
id: Ketika ada daerah yang berbeda. ketika berasal dari enum, setiap varian sama dengan dirinya sendiri dan tidak sama dengan varian lainnya.
tr: PartialEq yapıtlar üzerinde türetildiğinde, iki örnek sadece tüm alanları eşitse eşittir; herhangi bir alan farklıysa eşit değildir. Enumlar için türetildiğinde, her varyant kendine eşittir ve diğer varyantlara eşit değildir.
zh_cn: 当`partialEq'来源于建筑时,只有其所有领域都平等时,两例是平等的;如果任何领域不同,则两例是平等的;如果任何领域不同,则两例是平等的。当对树脂产生时,每种变式都与其本身相同,而不是与其他变式相同。

source: You can write your own implementation of the `PartialEq` trait for your type, if you can't derive it or if you want to implement your custom rules. In the following example, we write an implementation for `PartialEq` in which we consider that two rectangles are equal if they have the same area:
es: Puede escribir su propia implementación del rasgo `PartialEq` para su tipo, si no lo puede derivar o si desea implementar sus reglas personalizadas. En el siguiente ejemplo, escribimos una implementación para `PartialEq` en la que consideramos que dos rectángulos son iguales si tienen el mismo área:
fr: Vous pouvez écrire votre propre implémentation du caractère `PartialEq` pour votre type, si vous ne pouvez pas le dériver ou si vous voulez implémenter vos règles personnalisées. Dans l'exemple suivant, nous écrivons une implémentation pour `PartialEq` dans laquelle nous considérons que deux rectangles sont égaux s'ils ont la même zone :
id: Anda dapat menulis implementasi anda sendiri dari sifat åPartialEqé untuk tipe anda, jika anda tidak dapat memperolehnya atau jika anda ingin mengimplementasikan aturan anda sendiri. Dalam contoh berikut, kami menulis implementasi untuk thosePartialEq di mana kita menganggap bahwa dua persegi panjang sama jika mereka memiliki area yang sama:
tr: Türünüz için PartialEq özelliğinin kendi uygulamanızı yazabilirsiniz, eğer türetemezseniz veya özel kurallarınızı uygulamak istiyorsanız. Aşağıdaki örnekte, iki dikdörtgenin aynı alana sahip olması durumunda eşit olduğunu düşündüğümüz PartialEq için bir uygulama yazıyoruz:
zh_cn: 您可以自己写出类型“PartialEq”特性的“PartialEq”特性,如果无法从中得出,或者如果你想执行自己的习惯规则,您可以自己写出。在下面的例子中,我们为“partialEq” 编写一个“PartialEq” 执行文件,其中我们认为,如果两个矩形具有相同的区域,这两个矩形是相等的:

source: "Are rect1 and rect2 equal? {}"
es: "¿Son iguales el recto1 y el recto2?"
fr: "Est-ce que rect1 et rect2 sont égaux? {}"
id: "Apakah rect1 dan rect2 sama? [}"
tr: "Rekt1 ve rekt2 eşit mi?"
zh_cn: 直肠1和直肠2相等吗?

source: The `PartialEq` trait is required when using the `assert_eq!` macro in tests, which needs to be able to compare two instances of a type for equality.
es: El rasgo `PartialEq` se requiere cuando se utiliza la macro `assert_eq!'en las pruebas, que necesita ser capaz de comparar dos instancias de un tipo para la igualdad.
fr: Le caractère `PartialEq` est requis lors de l'utilisation de la macro `assert_eq!` dans les tests, qui doit pouvoir comparer deux instances d'un type pour l'égalité.
id: Sifat yang diperlukan untuk menggunakan makro dalam tes, yang perlu dapat membandingkan dua contoh dari jenis persamaan hak.
tr: PartialEq özelliği, assert_eq! makrosunu testlerde kullanırken gereklidir, bu da eşitlik için bir türün iki örneğini karşılaştırabilmelidir.
zh_cn: 在测试中使用`Assert_eq!'宏时需要`partialEq'特性,这需要能够比较一种平等类型的两种情况。

source: "Structs are different"
es: "Las estructuras son diferentes"
fr: "Les structures sont différentes"
tr: "Yapılar farklı"
zh_cn: "真相不同"

source: Serializing with `Serde`
es: Serialización con `Serde`
fr: Serializing avec `Serde`
id: Serialisasi dengan Serde
tr: Serde ile serileştirme
zh_cn: 与`Serde'序列

source: `Serde` provides trait implementations for `serialize` and `deserialize` functions for data structures defined in your crate. It allows you to transform your structure into an array (or the opposite).
es: `Serde` proporciona implementaciones de rasgos para `serialize` y `deserialize` funciones para estructuras de datos definidas en su caja. Le permite transformar su estructura en una matriz (o lo contrario).
fr: `Serde` fournit des implémentations de caractères pour les fonctions `sérialize` et `désérialize` pour les structures de données définies dans votre caisse. Il vous permet de transformer votre structure en tableau (ou inversement).
id: Ini memungkinkan Anda mengubah struktur Anda menjadi sebuah array (atau sebaliknya).
tr: Serde, kasanızda tanımlanan veri yapıları için serialize ve deserialize işlevleri için özellik uygulamaları sağlar. Yapınızı bir diziye (veya tam tersi) dönüştürmenizi sağlar.
zh_cn: `Serde'为您箱内定义的数据结构提供`序列化'和`序列化'功能的特性执行,使您能够将您的结构转换成一个阵列(或相反的阵列)。

source: **[Serialization](https://en.wikipedia.org/wiki/Serialization)** is a process of transforming data structures into a format that can be easily stored or transmitted. Let's say you are running a program and would like to persist its state to be able to resume it later. To do this, you could take each of the objects your program is using and save their information, for example in a file. This is a simplified version of serialization. Now if you want to resume your program with this saved state, you would perform **deserialization**, which means loading the state of the objects from the saved source.
es: **[Serialization](https://en.wikipedia.org/wiki/Serialization)** es un proceso de transformación de estructuras de datos en un formato que se puede almacenar o transmitir fácilmente. Digamos que está ejecutando un programa y le gustaría persistir en su estado para poder reanudarlo más tarde. Para ello, podría tomar cada uno de los objetos que su programa está utilizando y guardar su información, por ejemplo en un archivo. Esta es una versión simplificada de la serialización. Ahora, si desea reanudar su programa con este estado guardado, realizaría **deserialización**, lo que significa cargar el estado de los objetos desde la fuente guardada.
fr: **[Serialization](https://en.wikipedia.org/wiki/Serialization)** est un processus de transformation des structures de données en un format qui peut être facilement stocké ou transmis. Supposons que vous exécutez un programme et que vous vouliez persister dans son état pour pouvoir le reprendre plus tard. Pour ce faire, vous pouvez prendre chacun des objets que votre programme utilise et enregistre leurs informations, par exemple dans un fichier. Il s'agit d'une version simplifiée de serialization. Maintenant, si vous voulez reprendre votre programme avec cet état sauvegardé, vous effectuerez **désérialisation**, ce qui signifie charger l'état des objets à partir de la source sauvegardée.
id: **[Serialization][Serialization]://en.wikipedia.org/wiki/Serialization)** adalah proses transformasi struktur data menjadi sebuah format yang dapat dengan mudah disimpan atau ditransmisikan. Anggaplah Anda menjalankan sebuah program dan ingin mempertahankan kondisinya agar dapat melanjutkan lagi nanti. Untuk melakukan ini, Anda dapat mengambil setiap objek yang digunakan dan menyimpan informasi mereka, sebagai contoh. Ini adalah versi serialisasi yang disederhanakan. Sekarang jika Anda ingin melanjutkan program Anda dengan keadaan ini, Anda akan melakukan *desertialisasi, yang berarti memuat objek dari sumber yang disimpan.
tr: **[Serialization](https://en.wikipedia.org/wiki/Serialization)** veri yapılarını kolayca saklanabilen veya iletilebilen bir formata dönüştürme işlemidir. Diyelim ki bir program çalıştırıyorsunuz ve daha sonra devam edebilmek için durumunu sürdürmek istiyorsunuz. Şimdi bunu yapmak için, programınızın kullandığı her bir nesneyi alıp, örneğin bir dosyadaki bilgileri kaydetmek isteyebilirsiniz.
zh_cn: ** [序列化] (https://en.wikipedia.org/wiki/sirization)** 是一个将数据结构转换成易于存储或传输的格式的过程。让我们假设您正在运行一个程序,并希望坚持其状态以便稍后能够恢复它。 为此,您可以将您程序正在使用的各个对象都带走并保存它们的信息, 例如在文件中。 这是一个简化的序列化版本。 如果您想要在此保存状态下恢复您的程序, 您将会执行 ** desericalization**, 这意味着从保存的来源装入对象的状态 。

source: For example:
es: Por ejemplo:
fr: Par exemple:
id: Misalnya:
tr: Örneğin:
zh_cn: 例如:

source: If you run the `main` function, the output will be:
es: Si ejecuta la función `main`, la salida será:
fr: Si vous exécutez la fonction `main`, la sortie sera :
id: Jika Anda menjalankan fungsi åmain, keluaran akan:
tr: main işlevini çalıştırırsanız, çıkış şöyle olacaktır:
zh_cn: 如果您运行“主要”函数,输出将是:

source: We can see here that our struct `A` has been serialized into the output array. Note that the `serialize` function takes as argument a snapshot of the type you want to convert into an array. This is why deriving `Drop` for `A` is required here, as the `main` function keeps ownership of the `first_struct` struct.
es: Podemos ver aquí que nuestra estructura `A` ha sido seriada en el array de salida. Tenga en cuenta que la función `serialize` toma como argumento una instantánea del tipo que desea convertir en un array. Es por eso que se requiere derivar `Drop` para `A` aquí, ya que la función `main` mantiene la propiedad de la estructura `first_struct`.
fr: Nous pouvons voir ici que notre struct `A` a été sérialisé dans le tableau de sortie. Notez que la fonction `serialize` prend comme argument un instantané du type que vous voulez convertir en un tableau. C'est pourquoi dérivant `Drop` pour `A` est nécessaire ici, car la fonction `main` garde la propriété de la struct `first_struct`.
id: Kita dapat melihat di sini bahwa struct kita telah serial ke dalam array output. Perhatikan bahwa fungsi ·serializeé mengambil sebagai argumen sebagai snapshot dari tipe yang ingin Anda ubah menjadi sebuah array. Inilah sebabnya mengapa turunan untuk Apropose diperlukan di sini, sebagai fungsi thosemainmain tetap kepemilikan dari struktur pertama_struct.
tr: Burada A yapımızın çıktı dizisine seri hale getirildiğini görebiliriz. serialize fonksiyonunun, bir diziye dönüştürmek istediğiniz türün bir anlık görüntüsünü argüman olarak aldığını unutmayın. A için Drop türevinin burada gerekli olmasının nedeni budur, çünkü main işlevi first_struct yapısının mülkiyetini korur.
zh_cn: 我们在这里可以看到,我们的“A”结构已被序列化为输出矩阵。请注意,“序列化”函数将您想要转换成阵列的类型的快照作为参数。这就是为什么这里需要为`A'得出`Drop',因为`主要'功能保留了`第一支`struct'结构的所有权。

source: Also, we can use the `deserialize` function to convert the serialized array back into our `A` struct.
es: Además, podemos utilizar la función `deserialize` para convertir el array serializado de nuevo en nuestra estructura `A`.
fr: En outre, nous pouvons utiliser la fonction `désérialize` pour convertir le tableau sérialisé de nouveau dans notre `A` struct.
id: Juga, kita dapat menggunakan fungsi yang berdeserialisasi untuk mengubah array serial kembali ke struktur kita.
tr: Ayrıca, serileştirilmiş diziyi A yapımıza geri dönüştürmek için deserialize işlevini kullanabiliriz.
zh_cn: 此外,我们还可以利用`无战略化'功能,将序列式阵列转换回我们的`A'支架。

source: Here we are converting a serialized array span back to the struct `A`. `deserialize` returns an `Option` so we need to unwrap it. When using `deserialize` we also need to specify the type we want to deserialize into.
es: Aquí estamos convirtiendo un array serializado que se remonta a la estructura `A`. `deserialize` devuelve una `Opción` por lo que tenemos que desenvolverlo. Al usar `deserialize` también tenemos que especificar el tipo en el que queremos deserializar.
fr: Ici, nous convertissons un tableau sérialisé s'étend en arrière à la structure `A`. `désérialize` retourne une `Option` afin que nous ayons besoin de le déballer. Lorsque nous utilisons `désérialize` nous devons également spécifier le type dans lequel nous voulons désérialiser.
id: Di sini kita mengubah rentang array serial kembali ke struct A. Kita juga perlu menspesifikasikan tipe yang ingin kita deserialisasikan ke dalam.
tr: Burada serileştirilmiş bir dizi aralığını A yapısına geri dönüştürüyoruz. deserialize bir Option döndürür, bu yüzden onu açmamız gerekir. deserialize kullanırken, deserialize etmek istediğimiz türü de belirtmemiz gerekir.
zh_cn: 在这里,我们正在将一个序列数组转换为“A”。`序列化'返回`选项',所以我们需要解开它。在使用`序列化'时,我们还需要具体说明我们想要淡化的型号。

source: Hashing with `Hash`
es: Hashing con `Hash`
fr: Hashing avec "Hash"
id: Hashing with those Hash--
tr: Hash ile karıştırma
zh_cn: 使用`Hash'混杂

source: It is possible to derive the `Hash` trait on structs and enums. This allows them to be hashed easily using any available hash function. For a struct or an enum to derive the `Hash` attribute, all fields or variants need to be hashable themselves.
es: Es posible derivar el rasgo `Hash` en structs y enums. Esto les permite ser hashed fácilmente usando cualquier función de hash disponible. Para que una struct o un enum de derivar el atributo `Hash`, todos los campos o variantes necesitan ser hashable ellos mismos.
fr: Il est possible de dériver le caractère `Hash` sur les structures et les enums. Cela leur permet d'être hashés facilement en utilisant n'importe quelle fonction de hachage disponible. Pour une structure ou un enum pour dériver l'attribut `Hash`, tous les champs ou variantes doivent être hashables eux-mêmes.
id: Dapat diperoleh sifat pada struktur dan enum. Hal ini memungkinkan mereka untuk diratakan dengan mudah menggunakan fungsi hash yang tersedia. Untuk sebuah struktur atau enum untuk memperoleh atribut ·Hash--, semua bidang atau varian perlu diawetkan sendiri.
tr: Hash özelliğini structlar ve enumlar üzerinde türetmek mümkündür. Bu, mevcut herhangi bir hash fonksiyonu kullanılarak kolayca haşlanmalarını sağlar. Bir struct veya enum için Hash özniteliğini türetmek için, tüm alanların veya varyantların kendilerinin haşlanabilir olması gerekir.
zh_cn: 可以在支架和支架上得出`Hash'特性,这样就可以很容易地使用任何可用的散列函数进行散列。要让支架或支架产生`Hash'属性,所有字段或变体本身都必须是可仓促的。

source: You can refer to the [Hashes section](ch11-04-hash.md) to get more information about how to hash complex data types.
es: Puede consultar la sección [Hashes](ch11-04-hash.md) para obtener más información sobre cómo hash tipos de datos complejos.
fr: Vous pouvez vous référer à la section [Hashes](ch11-04-hash.md) pour obtenir plus d'informations sur la façon de hacher des types de données complexes.
id: Anda dapat mengacu pada bagian [Hashes] (Hashes section) 139ch11-04-hash.md) untuk mendapatkan lebih banyak informasi tentang bagaimana untuk tipe data kompleks hash.
tr: Karmaşık veri türlerinin nasıl özetleneceği hakkında daha fazla bilgi edinmek için [Hashes bölümüne] (ch11-04-hash.md) başvurabilirsiniz.
zh_cn: 您可以查询 [Hashes 区域] (ch11-04-hash.md),以获得更多关于如何散列复杂数据类型的信息。

source: Starknet Storage with `starknet::Store`
es: Almacenamiento Starknet con `starknet::Store`
fr: Stockage Starknet avec `starknet::Store`
id: Penyimpanan Starknet dengan Éstarknet::Store
tr: starknet ile Starknet Depolama::Store
zh_cn: Starknet 以“史塔克网:斯托雷”储存

source: The `starknet::Store` trait is relevant only when building on [Starknet](ch13-00-introduction-to-starknet-smart-contracts.md). It allows for a type to be used in smart contract storage by automatically implementing the necessary read and write functions.
es: El `starknet::Store` rasgo es relevante sólo cuando se construye en [Starknet] (ch13-00-introducción-a-starknet-smart-contracts.md). Permite que un tipo se utilice en el almacenamiento de contratos inteligentes mediante la implementación automática de las funciones de lectura y escritura necesarias.
fr: Le caractère `starknet::Store` n'est pertinent que lorsqu'il s'agit de construire sur [Starknet] (ch13-00-introduction-to-starknet-smart-contracts.md). Il permet d'utiliser un type dans le stockage smart contract en implémentant automatiquement les fonctions de lecture et d'écriture nécessaires.
id: The åstarknet: Sifat yang berkaitan hanya ketika membangun di [Starknet][Starknet][1300-introduction-to-starknet-smart-contracts.md). Hal ini memungkinkan sebuah tipe untuk digunakan dalam penyimpanan kontrak pintar dengan secara otomatis menerapkan fungsi baca dan tulis.
tr: starknet::Store özelliği yalnızca [Starknet](ch13-00-introduction-to-starknet-smart-contracts.md) üzerinde kurulurken geçerlidir. Gerekli okuma ve yazma işlevlerini otomatik olarak uygulayarak akıllı sözleşme depolamasında bir türün kullanılmasını sağlar.
zh_cn: `Starknet::Store'特性只有在建立[Starknet](ch13-00- intoto-starknet-smart-contracts.md)的基础上才具有相关性。 它允许通过自动执行必要的读写功能,在智能合同储存中使用某种类型。

source: You can find detailed information about the inner workings of Starknet storage in the [Contract storage section](ch14-01-contract-storage.md).
es: Puede encontrar información detallada sobre el funcionamiento interno del almacenamiento de Starknet en la [sección de almacenamiento del contrato] (ch14-01-contract-storage.md).
fr: Vous trouverez des informations détaillées sur le fonctionnement intérieur du stockage Starknet dans la section [Contract stockage] (ch14-01-contract-stockage.md).
id: Anda dapat menemukan informasi rinci tentang bagian dalam penyimpanan Starknet di bagian penyimpanan [Kontract][14-01-contract-storage.md).
tr: Starknet depolamasının iç işleyişi hakkında ayrıntılı bilgileri [Contract depolama bölümünde] (ch14-01-contract-storage.md) bulabilirsiniz.
zh_cn: 您可以在[合同存储区](ch14-01-合同存储区.md)找到关于斯塔克内储存的内部工作的详细信息。

source: Appendix D - The Cairo Prelude
es: Apéndice D - El Preludio de El Cairo
fr: Annexe D - Prélude du Caire
id: Lampiran D - Prelude Kairo
tr: Ek D - Kahire Prelüd
zh_cn: 附录D - 开罗序言

source: Prelude
es: Preludio
fr: Prélude
zh_cn: 预 酸

source: The Cairo prelude is a collection of commonly used modules, functions, data types, and traits that are automatically brought into scope of every module in a Cairo crate without needing explicit import statements. Cairo's prelude provides the basic building blocks developers need to start Cairo programs and writing smart contracts.
es: El preludio de El Cairo es una colección de módulos, funciones, tipos de datos y rasgos de uso común que se introducen automáticamente en el alcance de cada módulo en una caja de El Cairo sin necesidad de declaraciones de importación explícitas. El preludio de El Cairo proporciona los componentes básicos que los desarrolladores necesitan para iniciar los programas de El Cairo y escribir contratos inteligentes.
fr: Le prélude du Caire est une collection de modules, de fonctions, de types de données et de traits couramment utilisés qui sont automatiquement introduits dans la portée de chaque module dans une caisse du Caire sans avoir besoin de déclarations d'importation explicites. Le prélude du Caire fournit les éléments de base dont les développeurs ont besoin pour démarrer les programmes du Caire et écrire des contrats intelligents.
id: Praluda Kairo adalah koleksi modul, fungsi, tipe data, dan ciri-ciri yang secara otomatis dibawa ke ruang lingkup setiap modul di peti Kairo tanpa memerlukan pernyataan impor eksplisit. Pembuka blok bangunan dasar perlu memulai program Kairo dan menulis kontrak cerdas.
tr: Kahire prelüd, açık ithalat ifadelerine ihtiyaç duymadan Kahire kasasındaki her modülün kapsamına otomatik olarak getirilen yaygın olarak kullanılan modüller, işlevler, veri türleri ve özelliklerin bir koleksiyonudur. Kahire prelüd, geliştiricilerin Kahire programlarını başlatması ve akıllı sözleşmeler yazması için ihtiyaç duydukları temel yapı bloklarını sağlar.
zh_cn: 开罗前奏集集了通用模块、功能、数据类型和特性,这些模块自动纳入开罗箱中每个模块的范畴,而不需要明确的进口说明。 开罗的前奏提供了基本构件开发者启动开罗程序并签订智能合同所需要的基本构件。

source: The core library prelude is defined in the _[lib.cairo](https://github.com/starkware-libs/cairo/blob/main/corelib/src/lib.cairo)_ file of the corelib crate and contains Cairo's primitive data types, traits, operators, and utility functions. This includes:
es: El preludio de la biblioteca principal se define en el archivo _[lib.cairo](https://github.com/starkware-libs/cairo/blob/main/corelib/src/lib.cairo)_ de la caja de corelib y contiene los tipos de datos primitivos, rasgos, operadores y funciones de utilidad de El Cairo. Esto incluye:
fr: Le prélude de la bibliothèque centrale est défini dans le fichier _[lib.cairo](https://github.com/starkware-libs/cairo/blob/main/corelib/src/lib.cairo)_ de la caisse du noyau et contient les types de données primitives, les traits, les opérateurs et les fonctions d'utilité du Caire.
id: Perpustakaan inti prelude didefinisikan dalam _[lib.cairo][lib.cairo][ghttps://github.com/starkware-libs/cairo/cairo/main/core/src/lib.cairo)_ berkas dari peti intilib dan berisi tipe data primitif Kairo, sifat, operator, dan fungsi utilitas. Ini termasuk:
tr: Çekirdek kütüphane prelüd _[lib.cairo](https://github.com/starkware-libs/cairo/blob/main/corelib/src/lib.cairo)_ dosyasında tanımlanmıştır ve Kahire'nin ilkel veri türlerini, özelliklerini, operatörlerini ve yardımcı işlevlerini içerir. Buna şunlar dahildir:
zh_cn: 核心图书馆前奏的定义见核心图书馆箱的档案_[lib.cairo] (https://github.com/starkware-libs/cairo/blob/main/corelib/src/lib.cairo),其中载有开罗原始数据类型、特性、操作员和实用功能。

source: Data types: integers, bools, arrays, dicts, etc.
es: Tipos de datos: enteros, boos, arrays, dictados, etc.
fr: Types de données: entiers, bools, tableaux, dictons, etc.
id: Tipe data: integer, bools, array, dicts, dsb.
tr: Veri türleri: tam sayılar, bools, diziler, dicts, vb.
zh_cn: 数据类型:整数、布尔、数组、编辑等。

source: Traits: behaviors for arithmetic, comparison, and serialization operations
es: Rasgos: comportamientos para operaciones de aritmética, comparación y serialización
fr: Traits : comportements pour les opérations d'arithmétique, de comparaison et de sérialisation
id: Traits: perilaku untuk operasi aritmetik, perbandingan, dan serialisasi
tr: Özellikleri: Aritmetik, karşılaştırma ve serileştirme işlemleri için davranışlar
zh_cn: 轨迹:计算、比较和序列化操作的行为

source: Operators: arithmetic, logical, bitwise
es: Operadores: aritmética, lógica, bitwise
fr: Opérateurs: arithmétique, logique, bitwise
id: Operator: aritmatika, logis, bitwise
tr: Operatörler: aritmetik, mantıksal, bitwise
zh_cn: 运算符:算术、逻辑、比特

source: Utility functions - helpers for arrays, maps, boxing, etc.
es: Funciones de utilidad - ayudantes para arrays, mapas, boxeo, etc.
fr: Fonctions Utilitaires - helpers for arrays, maps, boxing, etc.
id: Utilitas fungsi - pembantu untuk array, peta, tinju, dll.
tr: Yardımcı fonksiyonlar - diziler, haritalar, boks vb. için yardımcılar.
zh_cn: 工具功能 - 阵列、地图、拳击等的助手。
