Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Pedersen hash functions are cryptographic algorithms that rely on [elliptic curve cryptography](https://en.wikipedia.org/wiki/Elliptic-curve_cryptography). These functions perform operations on points along an elliptic curve — essentially, doing math with the locations of these points — which are easy to do in one direction and hard to undo. This one-way difficulty is based on the Elliptic Curve Discrete Logarithm Problem (ECDLP), which is a problem so hard to solve that it ensures the security of the hash function. The difficulty of reversing these operations is what makes the Pedersen hash function secure and reliable for cryptographic purposes.
es: Las funciones de hash de Pedersen son algoritmos criptográficos que se basan en [criptografía de curva elíptica] (https://en.wikipedia.org/wiki/Elliptic-curve_cryptography). Estas funciones realizan operaciones en puntos a lo largo de una curva elíptica —en esencia, haciendo matemáticas con las ubicaciones de estos puntos— que son fáciles de hacer en una dirección y difíciles de deshacer. Esta dificultad de un solo sentido se basa en el Problema de Logaritmo Discreto de Curva Elíptica (ECDLP), que es un problema tan difícil de resolver que asegura la seguridad de la función de hash. La dificultad de revertir estas operaciones es lo que hace que la función de hash de Pedersen sea segura y fiable para fines criptográficos.
fr: Les fonctions de hachage de Pedersen sont des algorithmes cryptographiques qui dépendent de [cryptographie de courbe elliptique](https://en.wikipedia.org/wiki/Elliptic-curve_cryptography). Ces fonctions effectuent des opérations sur des points le long d'une courbe elliptique — essentiellement en faisant des calculs avec les emplacements de ces points — qui sont faciles à faire dans une direction et difficiles à faire. Cette difficulté à sens unique est basée sur le problème de logarithme discret de la courbe elliptique (ECDLP), qui est un problème si difficile à résoudre qu'il assure la sécurité de la fonction de hachage.
id: Fungsi ini bekerja pada titik-titik sepanjang kurva elliptik kriptografis] pada dasarnya, melakukan matematika dengan lokasi-lokasi titik-titik ini <wiki.org/wilipptic-curve_cryptography) yang mudah dilakukan dalam satu arah dan sulit untuk membatalkan. Kesulitan satu arah ini didasarkan pada Elliptic Discarrim Problem Logarim (ECDLP), yang merupakan masalah yang sangat sulit untuk menyelesaikan fungsi keamanan tersebut.
tr: Pedersen hash fonksiyonları, [eliptik eğri kriptografisi](https://en.wikipedia.org/wiki/elliptik-curve_cryptography)'ye dayanan kriptografik algoritmalardır. Bu işlevler, eliptik eğri boyunca noktalar üzerinde işlem yapar - esasen, bu noktaların konumlarıyla matematik yapmak - ki bu, tek yönlü bir zorluktur.
zh_cn: Pedersen hash 函数是依赖于[椭圆曲线加密法](https://en.wikipedia.org/wiki/Elliptic-curve_cryptography)的加密算法算法。这些函数在椭圆曲线沿线的点上运行,主要是用这些点的位置进行数学计算,这很容易朝一个方向做,很难解开。这个单向的难题基于“ELliptic Curve Discrete Logarithm 问题 ”(ECDLP),这是一个很难解决的问题,因此难以解决,无法确保散列函数的安全。扭转这些操作的困难在于使Pedersen能够安全可靠地进行加密。

source: Poseidon is a family of hash functions designed to be very efficient as algebraic circuits. Its design is particularly efficient for Zero-Knowledge proof systems, including STARKs (so, Cairo). Poseidon uses a method called a 'sponge construction,' which soaks up data and transforms it securely using a process known as the Hades permutation. Cairo's version of Poseidon is based on a three-element state permutation with [specific parameters](https://github.com/starkware-industries/poseidon/blob/main/poseidon3.txt).
es: Poseidón es una familia de funciones de hash diseñadas para ser muy eficientes como circuitos algebraicos. Su diseño es particularmente eficiente para sistemas de prueba de conocimiento cero, incluyendo STARKs (así, El Cairo). Poseidón utiliza un método llamado "construcción de esponjas", que absorbe datos y los transforma de forma segura utilizando un proceso conocido como la permutación Hades. La versión de El Cairo de Poseidón se basa en una permutación de tres elementos con [parámetros específicos] (https://github.com/starkware-industries/poseidon/blob/main/poseidon3.txt).
fr: Poseidon est une famille de fonctions de hachage conçues pour être très efficaces en tant que circuits algébriques. Sa conception est particulièrement efficace pour les systèmes d'épreuve Zero-Knowledge, y compris STARKs (c'est-à-dire le Caire). Poseidon utilise une méthode appelée « construction de penge », qui absorbe les données et les transforme en toute sécurité à l'aide d'un processus connu sous le nom de permutation Hadès. La version du Caire de Poseidon est basée sur une permutation à trois éléments avec [paramètres spécifiques] (https://github.com/starkware-industries/poseidon/blob/main/poseidon3.txt).
id: Poseidon adalah sebuah keluarga dari fungsi hash yang dirancang untuk menjadi sangat efisien sebagai sirkuit aljabar. desainnya sangat efisien untuk sistem bukti pengetahuan-Zero, termasuk STARKs (So, Kairo). Poseidon menggunakan metode yang disebut 'konstruksi ponge', yang menyerap data dan mengubahnya dengan aman menggunakan proses yang dikenal sebagai permutasi Hades. Versi Poseidon Kairo didasarkan pada tiga-elmen negara pertumen pertasi dengan [speficicficic parameter]://ghttps.com/startwrib/feaperries/pose/bdon/bdon/depose/dont).
tr: Poseidon, cebirsel devreler olarak çok verimli olacak şekilde tasarlanmış bir hash fonksiyonları ailesidir. Tasarımı, STARK'lar (yani Kahire) dahil olmak üzere Sıfır-Bilgi geçirmez sistemler için özellikle etkilidir. Poseidon, verileri ıslatan ve Hades permütasyonu olarak bilinen bir işlem kullanarak güvenli bir şekilde dönüştüren bir'sponge yapısı' adı verilen bir yöntem kullanır. Kahire'nin Poseidon sürümü [spesifik parametrelerle] üç elemanlı bir durum permutasyonuna dayanmaktadır.
zh_cn: Poseidon是一个散列函数组,其设计非常高效,作为代数电路,其设计对零知识验证系统(包括STARKs(so,开罗))特别高效。波塞冬使用一种称为“海绵构造”的方法,用一个称为哈迪斯变异的过程将数据浸泡起来并进行安全变换。开罗版本的波塞冬基于三个要素的状态变换,并具有[具体参数](https://github.com/starkware-industry/poseidon/blob/main/poseidon3.txt)。

source: When to Use Them?
es: ¿ Cuándo usarlos?
fr: Quand les utiliser?
id: Kapan Menggunakannya?
tr: Onları ne zaman kullanmalıyım?
zh_cn: 什么时候用他们?

source: Pedersen was the first hash function used on Starknet, and is still used to compute the addresses of variables in storage (for example, `LegacyMap` uses Pedersen to hash the keys of a storage mapping on Starknet). However, as Poseidon is cheaper and faster than Pedersen when working with STARK proofs system, it's now the recommended hash function to use in Cairo programs.
es: Pedersen fue la primera función de hash utilizada en Starknet, y todavía se utiliza para calcular las direcciones de las variables en el almacenamiento (por ejemplo, `LegacyMap` utiliza Pedersen para hash las claves de una asignación de almacenamiento en Starknet). Sin embargo, como Poseidón es más barato y más rápido que Pedersen cuando se trabaja con el sistema de pruebas STARK, ahora es la función de hash recomendada para usar en los programas de El Cairo.
fr: Pedersen a été la première fonction de hachage utilisée sur Starknet, et est toujours utilisé pour calculer les adresses des variables dans le stockage (par exemple, `LegacyMap` utilise Pedersen pour hacher les clés d'une cartographie de stockage sur Starknet). Cependant, comme Poseidon est moins cher et plus rapide que Pedersen lorsque vous travaillez avec STARK système d'épreuves, il est maintenant la fonction de hachage recommandée à utiliser dans les programmes du Caire.
id: Pederen adalah fungsi hash pertama yang digunakan di Starknet, dan masih digunakan untuk menghitung alamat dari variabel dalam penyimpanan (misalnya, legacyMap) menggunakan Pederen untuk hash kunci pemetaan penyimpanan di Starknet). Namun, Poseidon lebih murah dan lebih cepat daripada Pedersen ketika bekerja dengan sistem bukti STARK, sekarang fungsi hash dianjurkan untuk digunakan dalam program Kairo.
tr: Pedersen, Starknet'te kullanılan ilk hash fonksiyonuydu ve depolamadaki değişkenlerin adreslerini hesaplamak için hala kullanılır (örneğin, LegacyMap, Starknet'te bir depolama haritasının anahtarlarını hash etmek için Pedersen'i kullanır). Bununla birlikte, Poseidon, STARK ispat sistemiyle çalışırken Pedersen'den daha ucuz ve daha hızlı olduğu için, şimdi Kahire programlarında kullanılması önerilen hash işlevidir.
zh_cn: Pedersen 是史塔克内特第一个使用的散列函数, 仍然用于计算存储变量的地址( 例如, “ LegacyMap” 使用 Pedersen 来收集斯塔克内特存储映射的密钥 ) 。 然而, 由于波塞顿在使用STARK 验证系统时比佩德森更便宜、更快, 因此现在开罗程序建议使用的散列函数 。

source: The core library makes it easy to work with hashes. The `Hash` trait is implemented for all types that can be converted to `felt252`, including `felt252` itself. For more complex types like structs, deriving `Hash` allows them to be hashed easily using the hash function of your choice - given that all of the struct's fields are themselves hashable. You cannot derive the `Hash` trait on a struct that contains un-hashable values, such as `Array<T>` or `Felt252Dict<T>`, even if `T` itself is hashable.
es: La biblioteca central facilita el trabajo con hashes. El rasgo `Hash` se aplica a todos los tipos que se pueden convertir a `felt252`, incluido `felt252` en sí mismo. Para tipos más complejos como structs, derivando `Hash` permite que se fastidien fácilmente utilizando la función hash de su elección, dado que todos los campos de la estructura son hashables en sí mismos. No se puede derivar el rasgo `Hash` en una estructura que contiene valores in-hashables, como `Array<T' o `Felt252Dict<T', incluso si `T` en sí mismo es hashable.
fr: Le caractère `Hash` est implémenté pour tous les types qui peuvent être convertis en `felt252`, y compris `felt252` lui-même. Pour les types plus complexes comme les structs, le dérivant `Hash` permet d'être hashés facilement en utilisant la fonction de hachage de votre choix - étant donné que tous les champs de la struct sont eux-mêmes hashables. Vous ne pouvez pas dériver le caractère `Hash` sur une struct qui contient des valeurs non hashables, telles que `Array<T>` ou `Felt252Dict<T>`, même si `T` lui-même est hashable.
id: Perpustakaan inti membuatnya mudah untuk bekerja dengan hashhes. sifat yang diimplementasikan untuk semua jenis yang dapat diubah menjadi 252, termasuk TINGGAL 252. Untuk jenis yang lebih kompleks seperti struktur, menghambatnya, memungkinkan mereka untuk menjadi terhimpit dengan mudah menggunakan fungsi hash pilihan Anda - mengingat bahwa semua bidang struc's sendiri dapat dimiliki.
tr: Çekirdek kitaplığı hash'lerle çalışmayı kolaylaştırır. Felt252'nin kendisi de dahil olmak üzere Felt252'ye dönüştürülebilen tüm türler için Felt252 özelliği uygulanır. Yapıtlar gibi daha karmaşık türler için, Hash'ı türetmek, seçtiğiniz hash fonksiyonunu kullanarak kolayca haşhaşlanmalarını sağlar - tüm yapıt alanlarının kendi kendine haslaşamayacağı göz önüne alındığında.
zh_cn: 核心图书馆便于与大麻打交道。 “ Hash” 特性针对所有可以转换为“ felt252” 的种类,包括“ felt252” 本身。对于更复杂的种类,如树枝,产生“ Hash”,允许它们容易地使用你选择的散列函数,因为所有树枝的字段本身都是易散的。您无法从含有不可磨损的值,如“Array<T}或“Felt252Dict<T” 的树枝上获取“ Hash” 特性,即使`T'本身也是易散的。

source: The `Hash` trait is accompanied by the `HashStateTrait` and `HashStateExTrait` that define the basic methods to work with hashes. They allow you to initialize a hash state that will contain the temporary values of the hash after each application of the hash function, update the hash state and finalize it when the computation is completed. `HashStateTrait` and `HashStateExTrait` are defined as follows:
es: El rasgo `Hash` va acompañado del `HashStateTrait` y `HashStateExTrait` que definen los métodos básicos para trabajar con hashes. Permiten inicializar un estado hash que contendrá los valores temporales del hash después de cada aplicación de la función hash, actualizar el estado hash y finalizarlo cuando se complete el cálculo. `HashStateTrait` y `HashStateExTrait` se definen como sigue:
fr: Le caractère `Hash` est accompagné du caractère `HashStateTrait` et `HashStateExTrait` qui définissent les méthodes de base pour travailler avec les hachages. Ils vous permettent d'initialiser un état de hachage qui contiendra les valeurs temporaires du hachage après chaque application de la fonction de hachage, de mettre à jour l'état de hachage et de le finaliser lorsque le calcul est terminé. `HashStateTrait` et `HashStateExTrait` sont définis comme suit:
id: Sifat HasyTrait disertai dengan hastateTrait sementara dan setelah setiap aplikasi dari fungsi hashstateExrait, mendefinisikan metode dasar untuk bekerja dengan hashes. Mereka memungkinkan Anda untuk menginisialisasi sebuah negara hashtrate yang akan berisi nilai-nilai sementara dari hash setelah setiap aplikasi dari fungsi hash, memperbarui keadaan hash dan menyelesaikannya ketika komputasi selesai.
tr: Hash özelliği, hash'lerle çalışmak için temel yöntemleri tanımlayan HashStateTrait ve HashStateExTrait ile birlikte gelir. Hash fonksiyonunun her uygulamasından sonra hash'in geçici değerlerini içerecek bir hash durumunu başlatmanıza, hash durumunu güncellemenize ve hesaplama tamamlandığında sonlandırmanıza izin verirler. HashStateTrait ve HashState aşağıdaki gibidir:
zh_cn: `Hash'特性附有`Hash StateTrait'和`Hash StateExtrait ',这两个特性界定了与hashes合作的基本方法,允许您在每次应用hash函数后初始化一个含有hash临时值的散列状态,更新hash状态,并在计算完成后最终确定。

source: /// A trait for hash state accumulators.
es: /// Un rasgo para acumuladores de estado de hash.
fr: /// Un trait pour les accumulateurs à l'état de hachage.
id: / Sebuah sifat untuk hash state akumulator.
tr: /// Hash state akümülatörleri için bir özellik.
zh_cn: 大麻国家蓄积器的特征

source: /// Extension trait for hash state accumulators.
es: /// Rasgo de extensión para acumuladores de estado de hash.
fr: /// Trait d'extension pour les accumulateurs à l'état de hachage.
id: / /Tekstensi sifat untuk hash state akumulator.
tr: /// Hash state akümülatörleri için eklenti özelliği.
zh_cn: // 散列状态蓄积器的扩展特性。

source: /// Updates the hash state with the given value.
es: /// Actualiza el estado hash con el valor dado.
fr: /// Mettre à jour l'état de hachage avec la valeur donnée.
id: //Perbarui keadaan hash dengan nilai yang diberikan.
tr: /// Verilen değerle hash durumunu günceller.
zh_cn: // 以给定值更新散列状态。

source: /// A trait for values that can be hashed.
es: /// Un rasgo de los valores que se pueden hashed.
fr: /// Un trait pour les valeurs qui peuvent être hashées.
id: / Sebuah sifat untuk nilai-nilai yang dapat dihancurkan.
tr: /// Haşhaşlanabilen değerler için bir özellik.
zh_cn: / 一种可以散列的价值特征。

source: To use hashes in your code, you must first import the relevant traits and functions. In the following example, we will demonstrate how to hash a struct using both the Pedersen and Poseidon hash functions.
es: Para usar hashes en su código, primero debe importar los rasgos y funciones relevantes. En el siguiente ejemplo, demostraremos cómo hash una estructura usando las funciones de hash de Pedersen y Poseidón.
fr: Pour utiliser des hachages dans votre code, vous devez d'abord importer les caractéristiques et fonctions pertinentes. Dans l'exemple suivant, nous allons démontrer comment hacher une structure en utilisant les fonctions de hachage Pedersen et Poseidon.
id: Untuk menggunakan hash dalam kode Anda, pertama-tama Anda harus mengimpor sifat dan fungsi yang relevan. dalam contoh berikut, kita akan menunjukkan bagaimana hash struktur menggunakan baik fungsi Pederen dan Poseidon.
tr: Kodunuzda hash'leri kullanmak için öncelikle ilgili özellikleri ve işlevleri içe aktarmanız gerekir. Aşağıdaki örnekte, hem Pedersen hem de Poseidon hash işlevlerini kullanarak bir yapıyı nasıl haşlayacağınızı göstereceğiz.
zh_cn: 要在代码中使用hashes, 您必须首先导入相关的特性和函数。 在下面的例子中, 我们将演示如何使用 Pedersen 和 Poseidon hash 函数来进行支架 。

source: The first step is to initialize the hash with either `PoseidonTrait::new() -> HashState` or `PedersenTrait::new(base: felt252) -> HashState` depending on which hash function we want to work with. Then the hash state can be updated with the `update(self: HashState, value: felt252) -> HashState` or `update_with(self: S, value: T) -> S` functions as many times as required. Then the function `finalize(self: HashState) -> felt252` is called on the hash state and it returns the value of the hash as a `felt252`.
es: El primer paso es inicializar el hash con `PoseidonTrait::new() -> HashState` o `PedersenTrait::new(base: feeld252) -> HashState` dependiendo de la función de hash con la que queramos trabajar. Entonces el estado de hash puede actualizarse con el `update(self: HashState, valor: feeld252) -> HashState` o `update_with(self: S, valor: T) -> S` funciona tantas veces como sea necesario. Entonces la función `finalice(self: HashState) -> feeld252` es llamada al estado de hash y devuelve el valor del hash como un `felt252`.
fr: La première étape consiste à initialiser le hachage avec `PoseidonTrait::new() -> HashState` ou `PedersenTrait::new(base: feel252) -> HashState` selon la fonction de hachage avec laquelle nous voulons travailler. Ensuite, l'état de hachage peut être mis à jour avec le `update(self: HashState, value: feel252) -> HashState` ou `update_with(self: S, value: T) -> S` fonctionne autant de fois que nécessaire. Ensuite, la fonction `finalise(self: HashState) -> feel252` est appelée sur l'état de hachage et retourne la valeur du hachage comme un `felt252`.
id: Langkah pertama adalah menginisialisasi hash dengan baik poseidonTrait:: new Allah) -> Hashstate atau ▪PedersenTrait: baru: felt252) -> Hastate_Untate bergantung pada fungsi hash yang ingin kita kerjakan. Kemudian status hash dapat diperbarui dengan sendirinya: Hastlatate, feltate:252) -> Hashatate atau ãwate_Uzateself: S, nilai T,> S,> S,> S,> S, sebagai fungsi yang diperlukan.
tr: İlk adım, hash değerini PoseidonTrait::new()> HashState veya PedersenTrait::new(base: felt252)> HashState ile birlikte çalışmak istediğimiz hash fonksiyonuna bağlı olarak başlatmaktır. Daha sonra hash durumu, update(self: HashState, value: feel252) ile güncellenebilir.
zh_cn: 第一步是先用`海神:New() - > Hash State'或`PedersenTrait::new(基础: fel252) - > Hash State'启动大麻,这取决于我们想与哪个海神一起工作的大麻功能。然后,海神国家可以更新`更新(本身:海神国家,价值: fel252) - > Hash State` 或`更新_(自己:S,价值:T) - > S` 函数,需要多少次。然后,“最终(自己:海神) > felth252”功能被调用在海神状态上,它返回散神作为`felt252'的价值。

source: Pedersen is different from Poseidon, as it starts with a base state. This base state must be of `felt252` type, which forces us to either hash the struct with an arbitrary base state using the `update_with` method, or serialize the struct into an array to loop through all of its fields and hash its elements together.
es: Pedersen es diferente de Poseidón, ya que comienza con un estado base. Este estado base debe ser de tipo `felt252`, lo que nos obliga a o bien hash la estructura con un estado base arbitrario utilizando el método `update_with`, o serializar la estructura en un array para lazo a través de todos sus campos y hash sus elementos juntos.
fr: Pedersen est différent de Poseidon, car il commence par un état de base. Cet état de base doit être de type `felt252`, ce qui nous oblige à hacher la structure avec un état de base arbitraire en utilisant la méthode `update_with`, ou à sérialiser la structure en un tableau pour boucler tous ses champs et hacher ses éléments ensemble.
id: Pederen berbeda dari Poseidon, karena dimulai dengan sebuah kondisi dasar. Kondisi dasar ini harus berupa tipe ▪felt252, yang memaksa kita untuk membuat struktur dengan keadaan dasar yang sewenang-wenang menggunakan metode ·update_with--, atau serialkan struktur ke dalam array untuk memutar melalui semua bidang dan hash elemen bersama-sama.
tr: Pedersen, bir temel durumla başladığı gibi Poseidon'dan farklıdır. Bu temel durum, felt252 tipinde olmalıdır, bu da update_with yöntemini kullanarak struct'u keyfi bir temel durumla ya da struct'u tüm alanları arasında döngü yapmak ve elementlerini birlikte haşlamak için bir diziye seri hale getirmeye zorlar.
zh_cn: Pedersen不同于Poseidon, 因为它是从一个基点状态开始的。 这个基点状态必须是“ felt252 ” 类型, 迫使我们要么使用“ 更新” 方法, 用任意基点状态支架, 要么将支架序列成一个阵列, 以绕过其所有字段, 并集合其元素 。

source: Here is a short example of Pedersen hashing:
es: He aquí un breve ejemplo del hashing de Pedersen:
fr: Voici un court exemple de hachage de Pedersen:
id: Berikut adalah contoh pendek dari hasing Pedersen:
tr: İşte Pedersen hashing'in kısa bir örneği:
zh_cn: 以下是Pedersenhing的简短例子:

source: // hash1 is the result of hashing a struct with a base state of 0
es: // hash1 es el resultado del hashing de una estructura con un estado de base de 0
fr: // hash1 est le résultat d'un hachage d'une struct avec un état de base de 0
id: //Hash1 adalah hasil hashing sebuah struktur dengan keadaan dasar 0
tr: // hash1, bir yapıyı 0 baz durumuyla haşlamanın sonucudur.
zh_cn: / hash1 是按0的基状态为0的块状散列的结果 / hash1

source: // hash2 is the result of hashing only the fields of the struct
es: // hash2 es el resultado de hashing sólo los campos de la estructura
fr: // hash2 est le résultat du hachage seulement les champs de la structure
id: //Hash2 adalah hasil dari hashing hanya bidang dari struktur
tr: // hash2 sadece struct alanlarının hash edilmesinin sonucudur.
zh_cn: / hash2 仅仅是草原田间散列的结果

source: Advanced Hashing: Hashing Arrays with Poseidon
es: Hashing avanzado: Arrays de hashing con Poseidón
fr: Hashing avancé: Hashing Arrays avec Poséidon
tr: Gelişmiş Hashing: Poseidon ile Hashing Dizileri
zh_cn: 高级散列: 配有波塞冬的散列阵列

source: Let us look at an example of hashing a struct that contains a `Span<felt252>`. To hash a `Span<felt252>` or a struct that contains a `Span<felt252>` you can use the built-in function `poseidon_hash_span(mut span: Span<felt252>) -> felt252`. Similarly, you can hash `Array<felt252>` by calling `poseidon_hash_span` on its span.
es: Echemos un vistazo a un ejemplo de hashing de una estructura que contiene un `Span<felt252''. Para hash un `Span<felt252'' o una estructura que contiene un `Span<felt252'' se puede utilizar la función incorporada `poseidon_hash_span(múltiplo: Span<felt252>) -> feel252`. Del mismo modo, se puede hash `Array<felt252'' llamando a `poseidon_hash_span` en su espacio.
fr: Examinons un exemple de hachage d'une structure qui contient un `Span<felt252>`. Pour hachage d'une `Span<felt252>` ou d'une structure qui contient un `Span<felt252>` vous pouvez utiliser la fonction intégrée `positidon_hash_span(mut span: Span<felt252>) -> feat252`. De même, vous pouvez hachage `Array<felt252>` en appelant `positidon_hash_span` sur son span.
id: Mari kita lihat sebuah contoh dari hashing sebuah struktur yang berisi sebuah struktur yang berisi sebuah batang yang memiliki fungsi bawaan <rasat2> -> merasa 2525. Demikian pula, Anda dapat memiliki array<felt252> dengan memanggil posidon_hash_span_sh_spanmut pada rentangnya.
tr: Spanfelt252> içeren bir yapıyı ya da Spanfelt252> içeren bir yapıyı hash etmek için poseidon_hash_span(mut span: Spanfelt252>) yerleşik işlevini kullanabilirsiniz.
zh_cn: 让我们来看看一个散列的示例,其中含有“span<felt252} ” 的支架。 使用“ span<felt252}” 或含有“span<felt252}” 的支架, 您可以使用“ plaidon_ hash_ span( 范围: span<felt252> ) - > feelt252 ” 的内置函数。 同样, 您也可以使用“ poseidon_ hash_span” 在其间用 。

source: First, let us import the following traits and function:
es: En primer lugar, vamos a importar los siguientes rasgos y función:
fr: Tout d'abord, importons les caractéristiques et fonctions suivantes :
id: Pertama, mari kita impor sifat dan fungsi berikut:
tr: Öncelikle, aşağıdaki özellikleri ve işlevi içe aktaralım:
zh_cn: 首先,让我们输入以下特征和功能:
