Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: We can achieve the behavior we want in Listing 4-4 by using a _mutable reference_ instead of a snapshot. Mutable references are actually mutable values passed to a function that are implicitly returned at the end of the function, returning ownership to the calling context. By doing so, they allow you to mutate the value passed while keeping ownership of it by returning it automatically at the end of the execution. In Cairo, a parameter can be passed as _mutable reference_ using the `ref` modifier.
es: Podemos lograr el comportamiento que queremos en Listar 4-4 usando una referencia _mutable_ en lugar de una instantánea. Las referencias mutables son valores mutables pasados a una función que se devuelven implícitamente al final de la función, devolviendo la propiedad al contexto de llamada. Al hacerlo, le permiten mutar el valor pasado mientras mantiene la propiedad de ella devolviéndola automáticamente al final de la ejecución. En El Cairo, un parámetro se puede pasar como referencia _mutable_ usando el modificador `ref`.
fr: Nous pouvons réaliser le comportement que nous voulons dans Listing 4-4 en utilisant une référence _mutable_ au lieu d'un instantané. Les références mutables sont en fait des valeurs mutables transmises à une fonction qui sont implicitement retournées à la fin de la fonction, en retournant la propriété au contexte d'appel. Ce faisant, elles vous permettent de muter la valeur passée tout en conservant la propriété en la renvoyant automatiquement à la fin de l'exécution. Au Caire, un paramètre peut être passé comme référence _mutable_ en utilisant le modificateur `ref`.
id: Kita dapat mencapai perilaku yang kita inginkan di Listing 4-4 dengan menggunakan referensi _mutable_ bukan sebuah snapshot. referensi yang dapat diubah sebenarnya dilewatkan ke sebuah fungsi yang secara implisit dikembalikan pada akhir fungsi, mengembalikan kepemilikan ke konteks panggilan. Dengan melakukan itu, mereka memungkinkan Anda untuk mengubah nilai yang diberikan saat menjaga kepemilikannya dengan mengembalikannya secara otomatis pada akhir eksekusi. Di Kairo, parameter dapat dilewatkan sebagai _muable reference_ menggunakan pemodifikasi.
tr: Listeleme 4-4'te istediğimiz davranışı anlık görüntü yerine bir _mutable reference_ kullanarak elde edebiliriz. Değiştirilebilir referanslar aslında fonksiyonun sonunda dolaylı olarak döndürülen bir fonksiyona aktarılan, sahipliğini çağrı bağlamına geri dönen değişken değerlerdir. Bunu yaparak, yürütmenin sonunda otomatik olarak geri döndürerek geçirilen değeri değiştirmenize izin verirler. Kahire'de, bir parametre mut ref reference kullanılarak geçirilebilir.
zh_cn: 我们可以通过使用 modable reference 而不是一个快照来实现我们在列表 4 - 4 中想要的行为。 Mudable reference 实际上是向函数结尾处暗含返回的函数传递变异值, 将所有权返回到调用上下文。 这样, 它们允许您转换所传递的值, 同时通过在执行结束时自动返回它的所有权 。 在开罗, 参数可以使用 ` ref' 修饰符作为可变参考通过 。

source: **Note**: In Cairo, a parameter can only be passed as _mutable reference_ using the `ref` modifier if the variable is declared as mutable with `mut`.
es: **Nota**: En El Cairo, un parámetro sólo puede pasarse como _mutable reference_ utilizando el modificador `ref` si la variable se declara mutable con `mut`.
fr: **Note**: Au Caire, un paramètre ne peut être passé que comme référence _mutable en utilisant le modificateur `ref` si la variable est déclarée mutable avec `mut`.
id: **Note**: Di Kairo, sebuah parameter hanya dapat dilewatkan sebagai referensi _mutable_ menggunakan pemodifikasi ·refé jika variabel dideklarasikan dapat dimutasi dengan thosemuté.
tr: **Not**: Kahire'de, değişken mut ile değiştirilebilir olarak ilan edilirse, bir parametre sadece ref değiştiricisi kullanılarak _mutable reference_ olarak geçirilebilir.
zh_cn: ** 注**:在开罗,如果变量与`mut'被宣布为可变变量,则只能使用`ref'修饰符,将参数作为可变参引_modable reference_通过。

source: In Listing 4-5, we use a mutable reference to modify the value of the `height` and `width` fields of the `Rectangle` instance in the `flip` function.
es: En la lista 4-5, utilizamos una referencia mutable para modificar el valor de los campos `altura` y `ancho` de la instancia `Rectángle` en la función `flap`.
fr: Dans Listing 4-5, nous utilisons une référence mutable pour modifier la valeur des champs `hauteur` et `largeur` de l'instance `Rectangle` dans la fonction `flip`.
id: Di Listing 4-5, kami menggunakan referensi yang dapat berubah untuk mengubah nilai dari fungsi åflip.
tr: Listeleme 4-5'te, flip işlevindeki height ve width alanlarının değerini değiştirmek için değişken bir referans kullanırız.
zh_cn: 在清单4-5中,我们使用一个可变引用,以修改`翻转'函数中`矩形'实例的`高'和`宽'字段的价值。

source: "height: {}, width: {}"
es: "Altura: ", anchura: "
fr: "hauteur: {}, largeur: {}"
id: "tinggi: {}, lebar: {}"
tr: "yükseklik:, genişlik: "
zh_cn: "高度:,宽度: "

source: <span class="caption">Listing 4-5: Use of a mutable reference to modify a value</span>
es: <span class="caption">Lista 4-5: Uso de una referencia mutable para modificar un valor</span>
fr: <span class="caption">Liste 4-5: Utilisation d'une référence mutable pour modifier une valeur</span>
id: <span class="caption">Listing 4-5: Gunakan dari sebuah referensi mutable untuk mengubah nilai</span>
tr: span class="caption">Liste 4-5: Bir değeri değiştirmek için değiştirilebilir bir referans kullanımı/span>
zh_cn: <span类=“caption” >Listing 4-5:使用可变引用修改值 </span>

source: First, we change `rec` to be `mut`. Then we pass a mutable reference of `rec` into `flip` with `ref rec`, and update the function signature to accept a mutable reference with `ref rec: Rectangle`. This makes it very clear that the `flip` function will mutate the value of the `Rectangle` instance passed as parameter.
es: En primer lugar, cambiamos `rec` por `mut`. Luego pasamos una referencia mutable de `rec` a `flip` con `ref rec`, y actualizamos la firma de la función para aceptar una referencia mutable con `ref rec: Rectángulo`. Esto deja muy claro que la función `flip'mutará el valor de la instancia `rectángulo` pasada como parámetro.
fr: Tout d'abord, nous changeons `rec` pour être `mut`. Ensuite, nous passons une référence mutable de `rec` dans `flip` avec `ref rec`, et mettons à jour la signature de la fonction pour accepter une référence mutable avec `ref rec: Rectangle`. Cela indique très clairement que la fonction `flip` va muter la valeur de l'instance `Rectangle` passée en paramètre.
id: Pertama-tama, kita mengubah diri kita menjadi mutét. lalu kita menyampaikan referensi yang dapat diubah dari ·recé ke dalam ·flip dengan recé, dan memperbarui tanda tangan fungsi untuk menerima referensi mutabel dengan recref: rectangle. Hal ini membuat sangat jelas bahwa fungsi flip yang akan bermutasi nilai dari ÁRectle yang telah diberikan sebagai parameter.
tr: İlk olarak, rec'yi mut olarak değiştiririz. Sonra rec'nin değişken bir referansını ref rec ile flip'ye geçiririz ve ref rec: Dikdörtgen ile değişken bir referansı kabul etmek için fonksiyon imzasını güncelleriz. Bu, flip fonksiyonunun parametre olarak geçen Rectangle örneğinin değerini değiştireceğini çok net bir şekilde ortaya koymaktadır.
zh_cn: 首先,我们把`rec'改为`mut',然后我们把`rec'变换为`flip',加上`ref recourt',并更新功能签名,以接受`ref rec:矩形'的变换引用,这非常清楚地表明,`flip'函数将把`recangle'实例作为参数通过的数值变换。

source: The output of the program is:
es: La salida del programa es:
fr: La sortie du programme est :
id: Keluaran program ini adalah:
tr: Programın çıktısı:
zh_cn: 程序输出为 :

source: As expected, the `height` and `width` fields of the `rec` variable have been swapped.
es: Como era de esperar, se han intercambiado los campos " altura " y " anchura " de la variable " rec ".
fr: Comme prévu, les champs `hauteur` et `largeur` de la variable `rec` ont été échangés.
id: Seperti yang diharapkan, luas dan lebar bidang dari variabel recés telah ditukar.
tr: Beklendiği gibi, rec değişkeninin height ve width alanları değiştirilmiştir.
zh_cn: 如预期的那样,`rec'变量的`高度'和`边缘'字段已被互换。

source: {{#quiz ../quizzes/ch04-02-references-and-snapshots.toml}}
fr: {{#quiz../quizes/ch04-02-references-and-snapshots.toml}}
id: {{#quiz../quizzes/ch04-02-references-and-snapsshots.toml}}}
zh_cn: Quiz./quizzes/ch04-02 - 参考 - - - - - 笔记本.toml

source: Small Recap
es: Recapitulo pequeño
fr: Petite récapitulation
id: Kecil Recap
tr: Küçük Özet
zh_cn: 小型冲积

source: Let’s recap what we’ve discussed about the linear type system, ownership, snapshots, and references:
es: Recapitulemos lo que hemos discutido sobre el sistema de tipo lineal, propiedad, instantáneas y referencias:
fr: Laissez-nous récapituler ce que nous avons discuté sur le système de type linéaire, la propriété, les instantanés et les références:
id: Mari kita ulangi apa yang telah kita bahas tentang sistem linear, kepemilikan, snapshot, dan referensi:
tr: Lineer tip sistemi, sahiplik, anlık görüntüler ve referanslar hakkında tartıştığımız şeyleri özetleyelim:
zh_cn: 让我们回顾一下我们讨论的线性类型系统、所有权、快照和参考资料:

source: At any given time, a variable can only have one owner.
es: En cualquier momento dado, una variable sólo puede tener un propietario.
fr: À tout moment, une variable ne peut avoir qu'un seul propriétaire.
id: Pada setiap waktu, variabel hanya dapat memiliki satu pemilik.
tr: Herhangi bir zamanda, bir değişkenin yalnızca bir sahibi olabilir.
zh_cn: 在任何特定时间,变量只能有一个所有人。

source: You can pass a variable by-value, by-snapshot, or by-reference to a function.
es: Puede pasar una variable por valor, por instantánea o por referencia a una función.
fr: Vous pouvez passer une variable par valeur, par snapshot ou par référence à une fonction.
id: Anda dapat melewati variabel dengan nilai, dengan-snapshot, atau dengan-referensi ke sebuah fungsi.
tr: Değişken bir by-value, by-snapshot veya by-reference'i bir fonksiyona aktarabilirsiniz.
zh_cn: 您可以通过变量的副值、副发照或引用函数。

source: If you pass-by-value, ownership of the variable is transferred to the function.
es: Si pasa por valor, la propiedad de la variable se transfiere a la función.
fr: Si vous passez par la valeur, la propriété de la variable est transférée à la fonction.
id: Jika Anda lulus-oleh-nilai, kepemilikan variabel ditransfer ke fungsi.
tr: Eğer değer üzerinden geçerseniz, değişkenin mülkiyeti fonksiyona aktarılır.
zh_cn: 如果按切换值计算,变量的所有权将转移到函数中。

source: If you want to keep ownership of the variable and know that your function won’t mutate it, you can pass it as a snapshot with `@`.
es: Si desea mantener la propiedad de la variable y saber que su función no muta, se puede pasar como una instantánea con.
fr: Si vous voulez garder la propriété de la variable et savoir que votre fonction ne la mute pas, vous pouvez la passer comme un instantané avec `@`.
id: Jika Anda ingin tetap memiliki variabel dan tahu bahwa fungsi Anda tidak akan bermutasi itu, Anda dapat melewatinya sebagai snapshot dengan@awi.
tr: Değişkenin mülkiyetini korumak ve işlevinizin mutasyona uğramayacağını bilmek istiyorsanız, ile anlık görüntü olarak aktarabilirsiniz.
zh_cn: 如果您想要保留变量的所有权, 并且知道您的函数不会变异, 您可以通过@_@@@@@@wit:which

source: If you want to keep ownership of the variable and know that your function will mutate it, you can pass it as a mutable reference with `ref`.
es: Si desea mantener la propiedad de la variable y saber que su función la muta, puede pasarla como una referencia mutable con `ref`.
fr: Si vous voulez garder la propriété de la variable et savoir que votre fonction va la muter, vous pouvez la passer comme une référence mutable avec `ref`.
id: Jika Anda ingin tetap memiliki variabel dan tahu bahwa fungsi Anda akan bermutasi itu, Anda dapat melewatinya sebagai referensi yang dapat berubah dengan ·refé.
tr: Değişkenin mülkiyetini korumak ve işlevinizin onu mutasyona uğratacağını bilmek istiyorsanız, bunu ref ile değiştirilebilir bir referans olarak geçebilirsiniz.
zh_cn: 如果您想要保留变量的所有权, 并且知道您函数会改变变量, 您可以将变量作为“ ref” 的可变引用传递 。

source: A struct, or structure, is a custom data type that lets you package together and name multiple related values that make up a meaningful group. If you’re familiar with an object-oriented language, a struct is like an object’s data attributes. In this chapter, we’ll compare and contrast tuples with structs to build on what you already know and demonstrate when structs are a better way to group data.
es: Una estructura, o estructura, es un tipo de datos personalizado que le permite empaquetar juntos y nombrar varios valores relacionados que componen un grupo significativo. Si está familiarizado con un lenguaje orientado a objetos, una estructura es como los atributos de datos de un objeto. En este capítulo, compararemos y contrastaremos tuplas con structs para construir en lo que ya sabe y demostrar cuando las estructuras son una mejor manera de agrupar datos.
fr: Un struct, ou structure, est un type de données personnalisé qui vous permet d'emballer ensemble et de nommer plusieurs valeurs apparentées qui composent un groupe significatif. Si vous êtes familier avec un langage orienté objet, un struct est comme un objet. Dans ce chapitre, nous allons comparer et contraster des tuples avec des structs pour construire sur ce que vous connaissez déjà et démontrer quand les structs sont un meilleur moyen de grouper des données.
id: Sebuah struktur, atau struktur, adalah tipe data gubahan yang memungkinkan Anda mempack bersama-sama dan menyebutkan beberapa nilai terkait yang membentuk grup yang bermakna. Jika Anda terbiasa dengan bahasa yang berorientasi objek, sebuah struktur adalah seperti objek yang atribut data. Dalam bab ini, kita akan membandingkan dan mengontraskan tuples dengan struktur untuk membangun pada apa yang sudah Anda ketahui dan menunjukkan ketika struktur adalah cara yang lebih baik untuk grup data.
tr: Bir yapı veya yapı, anlamlı bir grup oluşturan birden fazla ilgili değeri birlikte paketlemenizi ve adlandırmanızı sağlayan özel bir veri türüdür. Nesne yönelimli bir dile aşinaysanız, bir yapı bir nesnenin veri nitelikleri gibidir. Bu bölümde, yapıtların veriyi gruplandırmanın daha iyi bir yolu olduğunda, zaten bildiklerinizi inşa etmek ve göstermek için yapıtlarla karşılaştıracağız.
zh_cn: 结构或结构是一种自定义的数据类型,它使您能够组合在一起,并命名组成一个有意义的组合的多个相关值。如果您熟悉一个面向对象的语言,则结构就像一个对象的数据属性。在本章中,我们将比较和比较图例和图例,以建立您已经知道的情况,并演示在构造是更好地组合数据的方法时。

source: We’ll demonstrate how to define and instantiate structs. We’ll discuss how to define associated functions, especially the kind of associated functions called methods, to specify behavior associated with a struct type. Structs and enums (discussed in the [next chapter](ch06-01-enums.md)) are the building blocks for creating new types in your program’s domain to take full advantage of Cairo's compile-time type checking.
es: Demostraremos cómo definir y instanciar las estructuras. Discutiremos cómo definir las funciones asociadas, especialmente el tipo de funciones asociadas llamadas métodos, para especificar el comportamiento asociado a un tipo de estructura. Estructuras y enums (discutido en el [siguiente capítulo](ch06-01-enums.md)) son los bloques de construcción para crear nuevos tipos en el dominio de su programa para aprovechar al máximo la verificación de tipo de compilación de El Cairo.
fr: Nous allons discuter de la façon de définir les fonctions associées, en particulier le type de fonctions associées appelées méthodes, pour spécifier le comportement associé à un type de struct. Les structures et les enums (examinés dans le [chapitre suivant](ch06-01-enums.md)) sont les éléments de construction pour créer de nouveaux types dans votre domaine de programme.
id: Kami akan mendemonstrasikan bagaimana mendefinisikan dan menstruktur instan. kami akan membahas bagaimana mendefinisikan fungsi yang terkait, khususnya jenis fungsi yang terkait yang disebut metode, untuk menentukan perilaku yang terkait dengan tipe struktur. Struktur dan enums (didiskusikan dalam bab berikutnya][wreums-01-enums.md) adalah blok bangunan untuk menciptakan jenis baru dalam program anda domain untuk mengambil keuntungan penuh dari pengesahan tipe waktu kompilasi Kairo.
tr: Yapıtların nasıl tanımlanacağını ve hazırlanacağını göstereceğiz. Bir yapı tipiyle ilişkili davranışları belirtmek için ilişkili işlevlerin, özellikle de yöntemler olarak adlandırılan ilişkili işlevlerin nasıl tanımlanacağını tartışacağız. Yapıtlar ve enumlar (bir sonraki bölümde tartışılmıştır) (ch06-01-enums.md) programınızın alanında Kahire'nin tam zamanlı derlemesinden yararlanmak için yeni türler oluşturmak için yapı taşlarıdır.
zh_cn: 我们将展示如何定义和即时配置结构。 我们将讨论如何定义相关功能, 特别是被称为方法的相关功能, 以指定与结构类型相关的行为。 Structs and enums (在[下一章] (ch06-01-enums.md) 中讨论) 是创建新类型的基础, 以便充分利用开罗的编译时间类型检查 。

source: Structs are similar to tuples, discussed in the [Data Types](ch02-02-data-types.md) section, in that both hold multiple related values. Like tuples, the pieces of a struct can be different types. Unlike with tuples, in a struct you’ll name each piece of data so it’s clear what the values mean. Adding these names means that structs are more flexible than tuples: you don’t have to rely on the order of the data to specify or access the values of an instance.
es: Los estructs son similares a los tuplas, discutidos en la sección [Tipos de datos](ch02-02-data-types.md), en la que ambos contienen múltiples valores relacionados. Al igual que las tuplas, las piezas de una estructura pueden ser diferentes tipos. A diferencia de las tuplas, en una estructura nombrarás cada pieza de datos por lo que está claro lo que significan los valores. Agregar estos nombres significa que las estructuras son más flexibles que las tuplas: no tienes que confiar en el orden de los datos para especificar o acceder a los valores de una instancia.
fr: Les structures sont similaires aux tuples, discutées dans la section [Types de données](ch02-02-data-types.md), en ce sens que les deux contiennent plusieurs valeurs liées. Comme les tuples, les morceaux d'une structure peuvent être différents types. Contrairement aux tuples, dans une structure vous nommez chaque morceau de données de sorte qu'il soit clair ce que signifient les valeurs. Ajouter ces noms signifie que les structures sont plus flexibles que les tuples: vous n'avez pas à compter sur l'ordre des données pour spécifier ou accéder aux valeurs d'une instance.
id: Structs mirip dengan tuples, yang dibahas di bagian [Data Types] (Data Types] (Data-02-data-types.md), dalam hal kedua nilai yang terkait. Seperti tuples, potongan-potongan struktur dapat berbeda. Tidak seperti dengan tuples, dalam structural nama anda setiap bagian dari data sehingga itu jelas apa arti nilai-nilai. Menambahkan nama-nama ini berarti bahwa struktur lebih fleksibel dari tuples: anda tidak harus mengandalkan urutan data untuk menentukan atau menspesifikasikan nilai-nilai suatu contoh.
tr: Structs, [Veri Türleri] (ch02-02-data-types.md) bölümünde tartışılan tuples'e benzer, her ikisi de birden fazla ilgili değer taşır. Tuples gibi, bir struct'un parçaları farklı türlerde olabilir. Tuples'ın aksine, bir struct'ta her bir veri parçasını adlandırırsınız, böylece değerlerin ne anlama geldiğini açıkça belirtirsiniz. Bu isimlerin eklenmesi, struct'lerin tuple'lerden daha esnek olduğu anlamına gelir.
zh_cn: Structs 与 [数据类型] (ch02-02-dd-datatype.md) 一节中讨论的tuples 类似 tiples 。 两者都有多个相关值。 像 tuples 一样, 支架的碎片可以是不同的类型 。 与 tuples 不同, 在 支架中, 您会给每个数据命名名称, 这样可以清楚显示值的含义 。 添加这些名称意味着支架比tuples 更灵活: 您不必依靠数据的顺序来指定或访问实例的值 。

source: To define a struct, we enter the keyword `struct` and name the entire struct. A struct’s name should describe the significance of the pieces of data being grouped together. Then, inside curly brackets, we define the names and types of the pieces of data, which we call fields. For example, Listing 5-1 shows a struct that stores information about a user account.
es: Para definir una estructura, ingresamos la palabra clave `struct` y nombramos toda la estructura. El nombre de una estructura debe describir la importancia de las piezas de datos agrupadas. Luego, dentro de corchetes rizados, definimos los nombres y tipos de las piezas de datos, a las que llamamos campos. Por ejemplo, Listar 5-1 muestra una estructura que almacena información sobre una cuenta de usuario.
fr: Pour définir une structure, nous entrons le mot clé `struct` et nommons la structure entière. Un nom de structure doit décrire la signification des éléments de données groupés. Ensuite, à l'intérieur des crochets, nous définissons les noms et les types des éléments de données, que nous appelons les champs. Par exemple, Listing 5-1 montre une structure qui stocke des informations sur un compte utilisateur.
id: Untuk mendefinisikan sebuah struktur, kita masukkan kata kunci ·structé dan namakan seluruh struktur. Nama struct harus menjelaskan arti penting dari potongan-potongan data yang dikelompokkan bersama-sama. Kemudian, di dalam braket keriting, kita mendefinisikan nama dan jenis-jenis dari potongan data, yang kita sebut field. Sebagai contoh, Mendaftar 5-1 menunjukkan struktur informasi tentang akun pengguna.
tr: Bir yapıyı tanımlamak için, struct anahtar kelimesini girer ve tüm yapıyı adlandırırız. Bir yapıtın adı, birlikte gruplanan veri parçalarının önemini tanımlamalıdır. Daha sonra, kıvırcık parantezlerin içinde, alan dediğimiz veri parçalarının adlarını ve türlerini tanımlarız. Örneğin, Listeleme 5-1, bir kullanıcı hesabı hakkındaki bilgileri depolayan bir yapıyı gösterir.
zh_cn: 为了定义结构,我们输入关键字“支线”并命名整个支线。 支线的名称应描述将数据组合在一起的意义。 然后, 在卷括号内, 我们定义了我们称之为字段的数据的单位的名称和类型。 例如, 列出 5-1 显示存储用户账户信息的支线 。

source: <span class="caption">Listing 5-1: A `User` struct definition</span>
es: <span class="caption">Lista 5-1: Una definición de estructura `Usuario`</span>
fr: <span class="caption">Liste 5-1: Une définition de structure `User`</span>
id: <span class="caption">Listing 5-1: Sebuah definisi struktur </span>
tr: span class="caption">Listing 5-1: A User struct description/span>
zh_cn: <span类=“Caption” > listing 5-1:`用户'结构定义 </span>
