Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The code in Listing 5-7 also creates an instance of `user2` that has a different value for `email` but has the same values for the `username`, `active`, and `sign_in_count` fields as `user1`. The `..user1` part must come last to specify that any remaining fields should get their values from the corresponding fields in `user1`, but we can choose to specify values for as many fields as we want in any order, regardless of the order of the fields in the struct’s definition.
es: El código en la Lista 5-7 también crea una instancia de `user2` que tiene un valor diferente para `email` pero tiene los mismos valores para el `username`, `active`, y `sign_in_count` campos como `user1`. La parte `.user1` debe venir en último lugar para especificar que cualquier campo restante debe obtener sus valores de los campos correspondientes en `user1`, pero podemos elegir especificar valores para tantos campos como queramos en cualquier orden, independientemente del orden de los campos en la definición de la estructura.
fr: Le code dans Listing 5-7 crée également une instance de `user2` qui a une valeur différente pour `email` mais qui a les mêmes valeurs pour les champs `username`, `active` et `sign_in_count` comme `user1`. La partie `.user1` doit venir en dernier pour spécifier que tous les champs restants devraient obtenir leurs valeurs à partir des champs correspondants dans `user1`, mais nous pouvons choisir de spécifier des valeurs pour autant de champs que nous voulons dans n'importe quel ordre, quel que soit l'ordre des champs dans la définition de struct=s.
id: Kode di Listing 5-7 juga menciptakan sebuah contoh dari Án_in_count bidang yang memiliki nilai yang berbeda untuk åemail..user1 bagian harus datang terakhir untuk menentukan bahwa setiap bidang yang tersisa harus mendapatkan nilai-nilai mereka dari ▪ Áuser1, tapi kita dapat memilih untuk menentukan nilai-nilai sebanyak yang kita inginkan, terlepas dari urutan struktur bidang.
tr: Listeleme 5-7'deki kod, email için farklı bir değere sahip olan, ancak username, active ve sign_in_count alanları için user1 ile aynı değerlere sahip olan user2 örneğini de oluşturur..user1 bölümündeki tanım, kalan alanların user1'deki karşılık gelen alanlardan kendi değerlerini almasını istemek için son sırada gelmelidir, ancak user1user1'deki değerleri seçebiliriz.
zh_cn: 列表 5-7 中的代码还创建了一个“用户2”的例子,该例子对“电子邮件”有不同的价值,但对“用户名称”、“活动”和“签名_in_count”字段的数值与“用户1”相同。 `.用户1'部分必须放在最后,以具体说明任何剩余的字段都应从`用户1'中的相应字段中获取其值,但我们可以选择按任何顺序为尽可能多的字段指定值,而不管结构定义中字段的顺序如何。

source: Note that the struct update syntax uses `=` like an assignment; this is because it moves the data, just as we saw in the ["Moving Values"](ch04-01-what-is-ownership.md#moving-values)<!-- ignore --> section. In this example, we can no longer use `user1` as a whole after creating `user2` because the `ByteArray` in the `username` field of `user1` was moved into `user2`. If we had given `user2` new `ByteArray` values for both `email` and `username`, and thus only used the `active` and `sign_in_count` values from `user1`, then `user1` would still be valid after creating `user2`. Both `active` and `sign_in_count` are types that implement the `Copy` trait, so the behavior we discussed in the ["`Copy` Trait"](ch04-01-what-is-ownership.md#the-copy-trait)<!-- ignore --> section would apply.
es: Obsérvese que la sintaxis de actualización de la estructura utiliza `=` como una asignación; esto se debe a que mueve los datos, tal como vimos en la sección ["Moving Values"] (ch04-01-what-is-ownership.md#moving-values)<!; ignore -->. En este ejemplo, ya no podemos utilizar `user1` como un todo después de crear `user2` porque el `ByteArray` en el campo `username` de `user1` se movió a `user2`. Si hubiéramos dado `user2` nuevos valores `ByteArray` tanto para `email` como para `username`, y por lo tanto sólo hemos utilizado los valores `active` y `sign_in_count` de `user1`, entonces `user1` seguiría siendo válidos después de crear `user2`.
fr: Notez que la syntaxe de mise à jour de structure utilise `=` comme une affectation; c'est parce qu'elle déplace les données, comme nous l'avons vu dans la section ["Moving Values"](ch04-01- what-is-ownership.md#moving-values)<!-- ignore -->. Dans cet exemple, nous ne pouvons plus utiliser `user1` dans son ensemble après la création de `user2` parce que le `ByteArray` dans le champ `username` de `user1` a été déplacé dans `user2`. Si nous avions donné `user2` nouvelles `ByteArray` pour `email` et `username`, et donc seulement les valeurs `active` et `sign_in_count` de `user1`, alors `user1` serait toujours valide après la création de `user2`. Les deux types `active` et `sign_in_count` sont des types qui implémentent le trait `Copy`, de sorte que le comportement que nous avons discuté dans le ["Copier`"](ch04-01-is-ownership)<.
id: Perhatikan bahwa struct update syntax menggunakan sintaks.=seperti sebuah tugas; ini adalah karena ia memindahkan data, seperti yang kita lihat dalam ["Moving Vales"] (Ukraych04-01-what-is-ownership.md#moving-nilai)<!-- abaikan --> bagian. Dalam contoh ini, kita tidak dapat lagi menggunakan thoseer1 user1 setelah menciptakan nilai-nilai ías2] karena aluncheArray di bidang auxername íauser1;
tr: Yapıt güncelleme sözdiziminin = bir ödev gibi kullandığını unutmayın; bunun nedeni, verileri, ["Moving Values"] [ch04-01-is-ownership.md#moving-values] bölümünde gördüğümüz gibi, user1 değerini bir bütün olarak Byteray'i oluşturduktan sonra, user2'yi kullanamayacağımızı belirtmektir.
zh_cn: 请注意, 树枝更新语法使用 类似任务 ; 这是因为它移动了数据, 正如我们在 [“ 移动值 ” (ch04-01-what- what- is- own- own- value) <. md# moving- ignion- value) <! - 忽略 - > 一节中看到的那样。 在此示例中, 在创建“ 用户2” 之后, 我们不能再使用整个“ 用户1”, 因为“ 用户1 ” 的“ 用户名” 字段中的“ 用户 ” 被移动到“ 用户2 ” 。 如果我们给“ 电子邮件” 和“ 用户名” (ch04-01- what- byarray) 提供了“ ” 新的“ 用户2 新的“ ytearray” 值, 并且因此只使用了“ 用户1” 的` 和` 信号_ 计算'值'。 用户1 创建用户2 之后, “ 用户1'用户1'将仍然有效。 “ 。 “ 和` 发送_ 计'是实施` 的“ 的“ 类型, 因此我们在“ IP IP IP IP - IP- IP- IP IP 中讨论的“ 中讨论 - IPS- h- h) IPS- h) 节中讨论的行为—— 。

source: {{#quiz ../quizzes/ch05-01-defining-and-instantiating-structs.toml}}
es: quiz../quizzes/ch05-01-definiting-and-instantiating-structs.toml
fr: {{#quiz../quizes/ch05-01-définissant-et-instantiant-structs.toml}}
id: {{#quiz../quizzes/ch05-01-defining-and-instansi-struct.toml}}}
tr: #quiz../quizzes/ch05-01-defining-ve-intifiating-structs.toml
zh_cn: Quiz./quizzes/ch05-01-定义和确认-结构.toml_

source: To understand when we might want to use structs, let’s write a program that calculates the area of a rectangle. We’ll start by using single variables, and then refactor the program until we’re using structs instead.
es: Para entender cuándo podríamos querer usar structs, vamos a escribir un programa que calcula el área de un rectángulo. Comenzaremos usando variables individuales, y luego refactorizar el programa hasta que estemos usando structs en su lugar.
fr: Pour comprendre quand nous pourrions vouloir utiliser des structs, laissez-nous écrire un programme qui calcule la zone d'un rectangle. Nous allons commencer par utiliser des variables uniques, puis refactorer le programme jusqu'à ce que nous utilisions des structs à la place.
id: Untuk memahami kapan kita mungkin ingin menggunakan struct, mari kita tulis sebuah program yang menghitung area dari persegi panjang. kita akan mulai dengan menggunakan variabel tunggal, dan kemudian merefaktor program sampai kita menggunakan struktur sebagai gantinya.
tr: Yapıtları ne zaman kullanmak isteyebileceğimizi anlamak için, bir dikdörtgenin alanını hesaplayan bir program yazalım. Tek değişkenler kullanarak başlayacağız ve bunun yerine yapıtları kullanana kadar programı yeniden düzenleyeceğiz.
zh_cn: 为了了解我们何时可能想要使用支架,让我们写一个计算矩形区域的程序。 我们从使用单一变量开始,然后重新构思这个程序,直到我们使用支架。

source: Let’s make a new project with Scarb called _rectangles_ that will take the width and height of a rectangle specified in pixels and calculate the area of the rectangle. Listing 5-8 shows a short program with one way of doing exactly that in our project’s _src/lib.cairo_.
es: Vamos a hacer un nuevo proyecto con Scarb llamado _rectángulos_ que tomará el ancho y la altura de un rectángulo especificado en píxeles y calcular el área del rectángulo. Listar 5-8 muestra un programa corto con una forma de hacer exactamente eso en nuestro proyecto _src/lib.cairo_.
fr: Laissez faire un nouveau projet avec Scarb appelé _rectangles_ qui prendra la largeur et la hauteur d'un rectangle spécifié dans les pixels et calculera la zone du rectangle. Listing 5-8 affiche un programme court avec une façon de faire exactement cela dans notre projet_src/lib.cairo_.
id: Lets make a new project with Scarb calling _rectangles_ that will take the wide and height of a recntangle dispesifikasikan dalam piksel dan menghitung area of the recntangle. Listing 5-8 shows a short program with one way of doing extect that in our projectbahes _src/lib.cairo_.
tr: Scarb ile piksel cinsinden belirtilen bir dikdörtgenin genişliğini ve yüksekliğini alacak ve dikdörtgenin alanını hesaplayacak _rectangles_ adlı yeni bir proje yapalım. 5-8'i listelemek, projemizin _src/lib.cairo_ bölümünde tam olarak bunu yapmanın bir yolu olan kısa bir programı gösterir.
zh_cn: 让我们用刀疤来做一个新工程,称为_rectangles_,它将以像素表示矩形的宽度和高度,并计算矩形的面积。列出 5-8 将显示一个短程序, 其一种方法就是在项目_src/lib.cairo_中这样做 。

source: "Area is {}"
es: "Area es "
fr: "La zone est {}"
id: "Area adalah [}"
tr: "Area is " (İngilizce).
zh_cn: "区域是"

source: <span class="caption">Listing 5-8: Calculating the area of a rectangle specified by separate width and height variables.</span>
es: <span class="caption">Lista 5-8: Calculando el área de un rectángulo especificada por variables separadas de anchura y altura.</span>
fr: <span class="caption">Liste 5-8: Calcul de la surface d'un rectangle spécifié par des variables de largeur et de hauteur distinctes.</span>
id: <span class="caption">Listing 5-8: Menghitung area dari sebuah persegi panjang dispesifikasikan dengan variabel lebar dan tinggi terpisah.</span>
tr: span class="caption">Listeleme 5-8: Ayrı genişlik ve yükseklik değişkenleriyle belirtilen bir dikdörtgenin alanını hesaplamak./span>
zh_cn: <span class="Caption" > listing 5-8: 以不同的宽度和高度变量计算矩形区域。 </span>

source: Now run the program with `scarb cairo-run`:
es: Ahora ejecute el programa con `scarb cairo-run`:
fr: Maintenant exécutez le programme avec `scarb cairo-run`:
id: Sekarang jalankan programnya dengan cairo-run:
tr: Şimdi scarb cairo-run ile programı çalıştırın:
zh_cn: 现在用“scarb cairo-run”运行程序:

source: This code succeeds in figuring out the area of the rectangle by calling the `area` function with each dimension, but we can do more to make this code clear and readable.
es: Este código logra averiguar el área del rectángulo llamando a la función `área` con cada dimensión, pero podemos hacer más para que este código sea claro y legible.
fr: Ce code réussit à déterminer la zone du rectangle en appelant la fonction `area` avec chaque dimension, mais nous pouvons faire plus pour rendre ce code clair et lisible.
id: Kode ini berhasil dalam mencari tahu luas persegi panjang dengan memanggil fungsi åareaé dengan setiap dimensi, tetapi kita dapat berbuat lebih banyak untuk membuat kode ini jelas dan dapat dibaca.
tr: Bu kod, her boyuttaki area fonksiyonunu çağırarak dikdörtgenin alanını bulmayı başarır, ancak bu kodu net ve okunabilir hale getirmek için daha fazlasını yapabiliriz.
zh_cn: 该代码成功地找出矩形区域,将每个维度都称为`地区'功能,但我们可以做更多工作,使该代码清晰易读。

source: The issue with this code is evident in the signature of `area`:
es: La cuestión de este código se pone de manifiesto en la firma de `área`:
fr: La question de ce code est évidente dans la signature de la zone:
id: Masalah dengan kode ini jelas terlihat dalam tanda tangan åarea--
tr: Bu kodla ilgili sorun area imzasında açıkça görülmektedir:
zh_cn: " 地区 " 的签字明显表明了这一代码的问题:

source: The `area` function is supposed to calculate the area of one rectangle, but the function we wrote has two parameters, and it’s not clear anywhere in our program that the parameters are related. It would be more readable and more manageable to group width and height together. We’ve already discussed one way we might do that in the [Tuple Section of Chapter 2](ch02-02-data-types.html#the-tuple-type).
es: La función `área` se supone que calcula el área de un rectángulo, pero la función que escribimos tiene dos parámetros, y no está claro en ninguna parte de nuestro programa que los parámetros están relacionados. Sería más legible y más manejable para agrupar ancho y altura juntos. Ya hemos discutido una manera de hacerlo en la [Sección del Tuple del Capítulo 2](ch02-02-data-types.html#the-tuple-type).
fr: La fonction `area` est censée calculer la zone d'un rectangle, mais la fonction que nous avons écrite a deux paramètres, et il n'est pas clair nulle part dans notre programme que les paramètres sont liés. Il serait plus lisible et plus gérable pour grouper la largeur et la hauteur ensemble. Nous avons déjà discuté d'une manière que nous pourrions faire dans la [Section Tuple du Chapitre 2](ch02-02-data-types.html#the-tuple-type).
id: Fungsi ini seharusnya dapat dihitung dari satu segi persegi panjang, tetapi fungsi yang kita tulis memiliki dua parameter, dan tidak jelas di mana saja dalam program kita bahwa parameter terkait. akan lebih mudah dibaca dan lebih mudah dikelola pada lebar dan tinggi kelompok. kita sudah membahas satu cara kita dapat melakukannya dalam [Tuple Bagian Bab 2.34ch02-types.html#tu-type).
tr: area işlevinin bir dikdörtgenin alanını hesaplaması gerekir, ancak yazdığımız fonksiyonun iki parametresi vardır ve programımızın hiçbir yerinde parametrelerin ilgili olduğu net değildir. Grup genişliği ve yüksekliği birlikte daha okunabilir ve daha yönetilebilir olurdu. Bunu [Bölüm 2'nin Tuple Bölümünde] (ch02-02-data-types.html#the-tuple-type) yapabiliriz.
zh_cn: ` 区域' 函数应该计算一个矩形的面积, 但是我们写的函数有两个参数, 而在我们的程式中任何地方都不清楚这些参数是相关的。 将宽度和高度组合在一起比较容易读, 比较容易管理。 我们已经在 [第2章图解部分] (ch02-02- data- types.html#the-tumple- type- type) 中讨论过一种方法可以做到这一点 。

source: Refactoring with Tuples
es: Refactorización con Tuples
fr: Refacturation avec Tuples
id: Refaktor dengan Tuples
tr: Tuples ile refactoring
zh_cn: 与图例重构

source: Listing 5-9 shows another version of our program that uses tuples.
es: El listado 5-9 muestra otra versión de nuestro programa que usa tuplas.
fr: Listing 5-9 montre une autre version de notre programme qui utilise des tuples.
id: Daftar 5-9 menunjukkan versi lain dari program kami yang menggunakan tuples.
tr: 5-9'u listelemek, programımızın tuples kullanan başka bir sürümünü gösterir.
zh_cn: 列出5 -9显示另一个使用图普尔的节目版本。

source: <span class="caption">Listing 5-9: Specifying the width and height of the rectangle with a tuple.</span>
es: <span class="caption">Lista 5-9: Especificación de la anchura y la altura del rectángulo con una tupla.</span>
fr: <span class="caption">Liste 5-9: Spécifier la largeur et la hauteur du rectangle avec un tuple.</span>
id: <span class="caption">Listing 5-9: Spesifikasikan lebar dan tinggi dari persegi panjang dengan sebuah tuple.</span>
tr: span class="caption">Listing 5-9: Dikdörtgenin genişliğini ve yüksekliğini bir tuple ile belirtmek./span>
zh_cn: <span class="Caption" > listing 5- 9: 指定矩形的宽度和高度 。 </span>

source: In one way, this program is better. Tuples let us add a bit of structure, and we’re now passing just one argument. But in another way, this version is less clear: tuples don’t name their elements, so we have to index into the parts of the tuple, making our calculation less obvious.
es: De una manera, este programa es mejor. Tuples vamos a añadir un poco de estructura, y ahora estamos pasando sólo un argumento. Pero de otra manera, esta versión es menos clara: tuples no nombran sus elementos, por lo que tenemos que indexar en las partes de la tuple, haciendo nuestro cálculo menos obvio.
fr: D'une manière, ce programme est meilleur. Tuples ajoutons un peu de structure, et nous passons maintenant un seul argument. Mais d'une autre manière, cette version est moins claire: tuples ne nomment pas leurs éléments, donc nous devons indexer dans les parties du tuple, rendant notre calcul moins évident.
id: Dengan satu cara, program ini lebih baik. dan sekarang kita hanya melewati satu argumen. tapi dengan cara lain, versi ini kurang jelas: tuples tidak menyebutkan elemen mereka, jadi kita harus mengindeks ke bagian-bagian tuple, membuat perhitungan kita kurang jelas.
tr: Bir bakıma, bu program daha iyi. Tuples biraz yapı ekleyelim ve şimdi sadece bir argümanı geçiyoruz. Ancak başka bir şekilde, bu sürüm daha az açıktır: tuples elementlerini adlandırmıyor, bu yüzden tuple'ın parçalarına endekslenmemiz gerekiyor, böylece hesaplamamız daha az belirgin hale geliyor.
zh_cn: 以某种方式说,这个程序更好。 图例让我们添加一点结构,我们现在只通过一个论点。 但另一种方式是,这个说法不太清楚:图例不列出其元素,所以我们必须在图例中加入索引,使我们的计算变得不那么明显。

source: Mixing up the width and height wouldn’t matter for the area calculation, but if we want to calculate the difference, it would matter! We would have to keep in mind that `width` is the tuple index `0` and `height` is the tuple index `1`. This would be even harder for someone else to figure out and keep in mind if they were to use our code. Because we haven’t conveyed the meaning of our data in our code, it’s now easier to introduce errors.
es: Mezclar la anchura y la altura no importaría para el cálculo del área, pero si queremos calcular la diferencia, ¡sería importante! Tendríamos que tener en cuenta que `ancho` es el índice de tupla `0` y `altura` es el índice de tupla `1`. Esto sería aún más difícil para alguien más para averiguar y tener en cuenta si van a utilizar nuestro código. Debido a que no hemos transmitido el significado de nuestros datos en nuestro código, ahora es más fácil introducir errores.
fr: Mélanger la largeur et la hauteur n'aurait pas d'importance pour le calcul de la zone, mais si nous voulons calculer la différence, cela aurait de l'importance! Nous devrions garder à l'esprit que `largeur` est l'indice de tuple `0` et `hauteur` est l'indice de tuple `1`. Cela serait encore plus difficile pour quelqu'un d'autre de comprendre et de garder à l'esprit s'ils devaient utiliser notre code. Parce que nous n'avons pas transmis le sens de nos données dans notre code, il est maintenant plus facile d'introduire des erreurs.
id: Mencampur lebar dan tinggi tidak akan peduli untuk perhitungan daerah, tetapi jika kita ingin menghitung perbedaan, itu akan penting! karena kita belum menyampaikan makna data kita dalam kode kita, ini akan lebih mudah untuk menyampaikan kesalahan.
tr: Genişliği ve yüksekliği karıştırmak alan hesaplaması için önemli olmazdı, ancak farkı hesaplamak istiyorsak, önemli olurdu! width'nin tuple indeksi 0 ve height'nin tuple indeksi 1 olduğunu akılda tutmak zorundayız. Bu, bir başkasının kodumuzu kullanması durumunda hatalarını anlaması ve akılda tutması daha da zor olurdu. Çünkü şimdi kodumuzun anlamını iletmedik.
zh_cn: 混合宽度和高度对于计算区域并不重要,但如果我们想计算差异,那将很重要! 我们必须记住,`宽'是图普尔指数`0 ',`高'是图普尔指数`1'。 如果有人使用我们的代码,就更难弄清楚并记住。因为我们没有传达我们数据在代码中的含义,因此现在更容易引入错误。

source: Refactoring with Structs: Adding More Meaning
es: Refactorización con Estructuras: Añadiendo Más Significado
fr: Refactoring avec des structures : ajouter plus de signification
id: Refaktor dengan Structs: Menambahkan Lebih banyak Arti
tr: Structs ile Refactoring: Daha Fazla Anlam Eklemek
zh_cn: 使用 Structs 重新描述: 添加更多含义

source: We use structs to add meaning by labeling the data. We can transform the tuple we’re using into a struct with a name for the whole as well as names for the parts.
es: Utilizamos estructuras para añadir significado etiquetando los datos. Podemos transformar la tupla que estamos usando en una estructura con un nombre para el conjunto, así como nombres para las partes.
fr: Nous utilisons des structures pour ajouter du sens en étiquetant les données. Nous pouvons transformer le tuple que nous utilisons en une structure avec un nom pour l'ensemble ainsi que des noms pour les parties.
id: Kita dapat mengubah tuple yang kita gunakan menjadi struct dengan nama untuk keseluruhan dan juga nama untuk bagian-bagiannya.
tr: Verileri etiketleyerek anlam eklemek için yapılar kullanıyoruz. Kullandığımız tümülü, parçaların adları kadar bütün için de bir isim olan bir yapıya dönüştürebiliriz.
zh_cn: 我们用支架来给数据贴上标签来添加含义。 我们可以将我们使用的象牙变成一个支架,上面有整个名称和零件名称。

source: <span class="caption">Listing 5-10: Defining a `Rectangle` struct.</span>
es: <span class="caption">Lista 5-10: Definir una estructura `Rectangle`.</span>
fr: <span class="caption">Liste 5-10: Définition d`une structure `Rectangle`.</span>
id: <span class="caption">Listing 5-10: Definisi sebuah ▪Rectangleáne struct.</span>
tr: span class="caption="Listing 5-10: Defining a Rectangle struct./span> (İngilizce).
zh_cn: <span类=“Caption” > listing 5-10: 定义“矩形”结构。 </span>

source: Here we’ve defined a struct and named it `Rectangle`. Inside the curly brackets, we defined the fields as `width` and `height`, both of which have type `u64`. Then, in `main`, we created a particular instance of `Rectangle` that has a width of `30` and a height of `10`. Our `area` function is now defined with one parameter, which we’ve named `rectangle` which is of type `Rectangle` struct. We can then access the fields of the instance with dot notation, and it gives descriptive names to the values rather than using the tuple index values of `0` and `1`.
es: Aquí hemos definido una estructura y la hemos llamado `Rectangle`. Dentro de los corchetes rizados, hemos definido los campos como `ancho` y `altura`, ambos de los cuales tienen tipo `u64`. Luego, en `main`, hemos creado una instancia particular de `Rectangle` que tiene una anchura de `30` y una altura de `10`. Nuestra función `área` se define ahora con un parámetro, que hemos llamado `rectangle` que es de tipo `Rectangle` struct. A continuación, podemos acceder a los campos de la instancia con notación de puntos, y da nombres descriptivos a los valores en lugar de utilizar los valores de índice de tupla de `0` y `1`.
fr: Ici, nous avons défini une structure et l'avons nommée `Rectangle`. À l'intérieur des crochets, nous avons défini les champs comme `largeur` et `hauteur`, tous deux ayant le type `u64`. Ensuite, dans `main`, nous avons créé une instance particulière de `Rectangle` qui a une largeur de `30` et une hauteur de `10`. Notre fonction `area` est maintenant définie avec un paramètre, que nous avons nommé `rectangle` qui est de type `Rectangle` struct. Nous pouvons alors accéder aux champs de l'instance avec la notation, et il donne des noms descriptifs aux valeurs plutôt que d'utiliser les valeurs de l'index de tuple `0` et `1`.
id: Di sini kita mendefinisikan struct dan menamainya Rectangle. di dalam braket keriting, kita mendefinisikan bidang-bidangnya sebagai struktur yang dapat didefinisikan sebagai struktur, yang keduanya memiliki tipe dan dinamainya. Kemudian, di thosemain, kita membuat contoh khusus dari thoserangle yang memiliki lebar 30 dan tinggi medan yang sama dengan 10. Fungsi kita sekarang didefinisikan dengan satu parameter, yang kita namai rectgle yang merupakan tipe Rectangle.
tr: Burada bir yapı tanımladık ve ona Rectangle adını verdik. Kıvırcık parantez içinde, alanları width ve height olarak tanımladık, her ikisi de u64 tipine sahip olan alanlar. Sonra, main cinsinden, 30 genişliğinde ve 10 yüksekliğinde olmayan belirli bir Rectangle dizisi oluşturduk. area fonksiyonu
zh_cn: 在此,我们定义了“矩形”并命名为“矩形”。在卷轴括号内,我们将字段定义为“圆形”和“高”,两者都有`64'类型。然后,在`主要'中,我们创建了一个“矩形”的特例,其宽度为`30',高度为`10'。我们的`区域'功能现在用一个参数来定义,我们称之为`矩形',该参数属于`矩形'类型。然后,我们可以用点记号访问实例的字段,它给数值提供描述性的名称,而不是使用`0'和`1'的图普指数值。
