Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Classes are typically identified by a [class hash](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/class-hash). When declaring a class, the network registers it and assigns a unique hash used to identify the class and deploy contract instances from it.
es: Las clases suelen ser identificadas por un hash [clase] (https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/class-hash). Al declarar una clase, la red la registra y asigna un hash único utilizado para identificar la clase y desplegar instancias de contrato desde ella.
fr: Les classes sont généralement identifiées par [class hash] (https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/class-hash). Lorsqu'il déclare une classe, le réseau l'enregistre et attribue un hash unique utilisé pour identifier la classe et déployer des instances contractuelles à partir de celle-ci.
id: Kelas biasanya diidentifikasi oleh sebuah hash] [kelas][https://docs.starknet.io/dokumentation/archicture_and_concepts/Smart_Contracts/class-hash). Ketika menyatakan sebuah kelas, jaringan register itu dan menetapkan hash unik digunakan untuk mengidentifikasi kelas dan menyebarkan instansi kontrak dari itu.
tr: Sınıflar tipik olarak bir [class hash] (https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/class-hash) ile tanımlanır. Bir sınıfı ilan ederken, ağ bunu kaydeder ve sınıfı tanımlamak ve sözleşme örneklerini dağıtmak için kullanılan benzersiz bir hash atar.
zh_cn: 课程通常由[类散列 (https://docs.starknet.io/document/architecture_and_concepts/Smart_contracts/leg-hash) 确定,在宣布一个类别时,网络登记并指定一个独特的散列,用于确定类别和从中部署合同实例。

source: A contract instance is a deployed contract corresponding to a class, with its own storage.
es: Una instancia de contrato es un contrato desplegado que corresponde a una clase, con su propio almacenamiento.
fr: Une instance contractuelle est un contrat déployé correspondant à une classe, avec son propre stockage.
id: Sebuah kontrak adalah kontrak yang dikerahkan sesuai dengan kelas, dengan penyimpanan sendiri.
tr: Sözleşme örneği, bir sınıfa karşılık gelen, kendi depolama alanına sahip, konuşlandırılmış bir sözleşmedir.
zh_cn: 合同实例是相当于某一类的部署合同,有其本身的储存。

source: Starknet natively supports upgradeable contracts through the `replace_class_syscall` [system call](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/), enabling simple contract upgrades without affecting the contract's state.
es: Starknet apoya de forma nativa los contratos actualizables a través del `replace_class_syscall` [llamada al sistema] (https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/), permitiendo mejoras simples de contratos sin afectar el estado del contrato.
fr: Starknet prend en charge nativement les contrats à mise à niveau via le `replace_class_syscall` [system call](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/), permettant des mises à niveau simples sans affecter l'état du contrat.
id: Starknet secara alami mendukung peningkatan kontrak melalui kontrak yang dapat diupgrade melalui ·replace_class_syscall--system call]bahhttps://docs.starknet.io/documentation/archicture_and_concepts/Smart_Contracts/system-cairo1/), mengaktifkan peningkatan kontrak sederhana tanpa mempengaruhi keadaan kontrak.
tr: Starknet, replace_class_syscall [sistem çağrısı] aracılığıyla yükseltilebilir sözleşmeleri destekler(https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/), sözleşmenin durumunu etkilemeden basit sözleşme yükseltmelerini sağlar.
zh_cn: Starknet本地支持通过“系统呼叫”(https://docs.starknet.io/document/architecture_and_concepts/Smart_contracts/system-calls-cairo1/)更新可升级的合同,使简单的合同升级能够在不影响合同状态的情况下进行。

source: Upgrading Contracts
es: Mejora de los contratos
fr: Modernisation des contrats
id: Memperbarui Kontrak
tr: Sözleşmelerin Yükseltilmesi
zh_cn: 升级合同

source: To upgrade a contract, expose an entry point that executes `replace_class_syscall` with the new class hash as an argument:
es: Para actualizar un contrato, exponga un punto de entrada que ejecute `replace_class_syscall` con el nuevo hash de clase como argumento:
fr: Pour mettre à niveau un contrat, exposez un point d'entrée qui exécute `remplace_class_syscall` avec le nouveau hachage de classe comme argument :
id: Untuk meng-upgrade kontrak, mengekspos titik masuk yang menjalankan kembali 'class_syscall' dengan hash kelas baru sebagai argumen:
tr: Bir sözleşmeyi yükseltmek için, argüman olarak yeni sınıf hash ile replace_class_syscall çalıştıran bir giriş noktasını ortaya çıkarın:
zh_cn: 为了提升合同,将执行`替换'类叙级呼叫'的切入点与新的类散列作为论据:

source: <span class="caption">Listing 16-3: Exposing `replace_class_syscall` to update the contract's class</span>
es: <span class="caption">Lista 16-3: Exponiendo `replace_class_syscall` para actualizar la clase del contrato</span>
fr: <span class="caption">Liste 16-3: Exposer `remplace_class_syscall` pour mettre à jour la classe du contrat</span>
id: <span class="caption">Listing 16-3: Exposing ▪replace_class_syscall_syscallé untuk memperbarui kelas kontrak</span>
tr: span class="caption">Listeleme 16-3: Sözleşmenin sınıfını güncellemek için replace_class_syscall'i ifşa etmek/span>
zh_cn: <span类=“Caption” > listing 16-3: 披露`替换_level_syscall'更新合同的等级 </span>

source: Note: Thoroughly review changes and potential impacts before upgrading, as it's a delicate procedure with security implications. Don't allow arbitrary addresses to upgrade your contract.
es: Nota: Revise a fondo los cambios e impactos potenciales antes de actualizar, ya que es un procedimiento delicado con implicaciones de seguridad. No permita que las direcciones arbitrarias actualicen su contrato.
fr: Note: Examiner attentivement les changements et les impacts potentiels avant de mettre à niveau, car c'est une procédure délicate avec des implications de sécurité. Ne pas permettre des adresses arbitraires pour mettre à niveau votre contrat.
id: Catatan: Periksa secara menyeluruh perubahan dan dampak potensial sebelum meng-upgrade, karena itu adalah prosedur yang rumit dengan implikasi keamanan. jangan ijinkan alamat sewenang-wenang untuk meningkatkan kontrak Anda.
tr: Not: Güvenlik etkileri olan hassas bir prosedür olduğu için yükseltmeden önce değişiklikleri ve potansiyel etkileri iyice gözden geçirin. Sözleşmenizi yükseltmek için keyfi adreslere izin vermeyin.
zh_cn: 注:在升级前彻底审查变化和潜在影响,因为这是一个微妙的程序,涉及安全问题。不允许任意地址升级合同。

source: Upgradeable Component
es: Componente actualizable
fr: Composante à mettre à jour
id: Komponen Upgradeable
tr: Yükseltilebilir Bileşen
zh_cn: 可升级的构成部分

source: OpenZeppelin Contracts for Cairo provides the `Upgradeable` component that can be embedded into your contract to make it upgradeable. This component is a simple way to add upgradeability to your contract while relying on an audited library. It can be combined with the `Ownable` component to restrict the upgradeability to a single address, so that the contract owner has the exclusive right to upgrade the contract.
es: OpenZeppelin Contracts for Cairo proporciona el componente `Upgradeable` que se puede incorporar en su contrato para que sea actualizable. Este componente es una forma sencilla de añadir upgradeability a su contrato mientras confía en una biblioteca auditada. Se puede combinar con el componente `Ownable` para restringir la upgradeability a una sola dirección, de modo que el propietario del contrato tiene el derecho exclusivo de actualizar el contrato.
fr: OpenZeppelin Contracts for Cairo fournit le composant `Upgradeable` qui peut être intégré dans votre contrat pour le rendre upgradeable. Ce composant est un moyen simple d'ajouter la mise à niveau à votre contrat tout en s'appuyant sur une bibliothèque vérifiée. Il peut être combiné avec le composant `Ownable` pour limiter la mise à niveau à une seule adresse, de sorte que le propriétaire du contrat a le droit exclusif de mettre à niveau le contrat.
id: OpenZeppelin Contractions for Kairo menyediakan komponen yang dapat ditingkatkan ke dalam kontrak Anda untuk membuatnya dapat diupgrade. Komponen ini adalah cara sederhana untuk menambah kemampuan peningkatan kontrak Anda saat mengandalkan sebuah perpustakaan audit. Komponen yang dapat dikombinasikan dengan komponen yang dapat ditingkatkan untuk membatasi peningkatan ke satu alamat, sehingga pemilik kontrak memiliki hak eksklusif untuk meningkatkan kontrak.
tr: OpenZeppelin Contracts for Cairo, yükseltilebilir hale getirmek için sözleşmenize eklenebilecek Upgradeable bileşenini sağlar. Bu bileşen, denetlenmiş bir kütüphaneye güvenirken sözleşmenize yükseltilebilirlik eklemenin basit bir yoludur. Tek bir adrese yükseltilebilirliği kısıtlamak için Ownable bileşeni ile birleştirilebilir, böylece sözleşme sahibi sözleşmeyi yükseltme hakkına sahiptir.
zh_cn: 开罗OpenZepperin合同提供`升级'部分,可以嵌入合同,使之升级,这是在依赖经审计的图书馆的同时增加合同升级的简单方式,可以与`可更新'部分相结合,将升级限制在单一地址,以便合同所有人有升级合同的专属权利。

source: /// Ownable
es: /// Propiedad
fr: /// Possible
tr: /// Sahiplenilebilir
zh_cn: ///可拥有

source: /// Upgradeable
es: /// Actualizable
fr: /// Mise à jour
tr: /// Yükseltilebilir
zh_cn: //可升级

source: // This function can only be called by the owner
es: // Esta función sólo puede ser llamada por el propietario
fr: // Cette fonction ne peut être appelée que par le propriétaire
id: /Ini fungsi hanya dapat dipanggil oleh pemilik
tr: // Bu fonksiyon sadece sahibi tarafından çağrılabilir
zh_cn: / 此函数只能由所有人调用。

source: // Replace the class hash upgrading the contract
es: // Reemplazar el hash de clase que mejora el contrato
fr: // Remplacer le hachage de classe par la mise à niveau du contrat
id: //Ganti kelas meningkatkan kontrak
tr: // Sözleşmeyi yükselten sınıf hash'ini değiştirin
zh_cn: 替换类散列的升级合同

source: <span class="caption">Listing 16-4 Integrating OpenZeppelin's Upgradeable component in a contract</span>
es: <span class="caption">Lista 16-4 Integrar el componente actualizable de OpenZeppelin en un contrato</span>
fr: <span class="caption">Liste 16-4 Intégration de la composante de mise à niveau d'OpenZeppelin dans un contrat</span>
id: <span class="caption">Listing 16-4 Integrating OpenZeppelin's Upgradeable komponen dalam sebuah kontrak</span>
tr: span class="caption">Bir sözleşmede 16-4 OpenZeppelin'in Yükseltilebilir bileşenini listeleme/span>
zh_cn: <span类=“caption” > listing 16-4 将 OpenZepperin 的可升级组件纳入合同 </span>

source: For more information, please refer to the [OpenZeppelin docs API reference](https://docs.openzeppelin.com/contracts-cairo/0.9.0/api/upgrades).
es: Para más información, consulte la [Referencia API OpenZeppelin docs](https://docs.openzeppelin.com/contracts-cairo/0.9.0/api/upgrades).
fr: Pour plus d'informations, veuillez vous référer à l'API [OpenZeppelin docs reference] (https://docs.openzeppelin.com/contracts-cairo/0.9.0/api/upgrades).
id: Untuk informasi lebih lanjut, silakan merujuk ke [Referensi API Docs BukaZeppelin]][Nichttps://doccs.openzepectin.com/contracts-cairo/0.9.0/api/upgrades).
tr: Daha fazla bilgi için lütfen [OpenZeppelin docs API referansı](https://docs.openzeppelin.com/contracts-cairo/0.0.0/api/upgrades) adresine bakın.
zh_cn: 详情请查阅[开放Zeppelin docs API参考](https://docs.openzeppelin.com/contracts-cairo/0.9.0/api/upgrations)。

source: L1-L2 Messaging
es: Mensajería L1-L2
fr: L1-L2 Messagerie
id: Pesan L1-L2
tr: L1-L2 Mesajlaşma
zh_cn: L1-L2 通信

source: A crucial feature of a Layer 2 is its ability to interact with Layer 1.
es: Una característica crucial de una capa 2 es su capacidad de interactuar con la capa 1.
fr: Une caractéristique essentielle d'un calque 2 est sa capacité à interagir avec le calque 1.
id: Fitur penting dari Lapis 2 adalah kemampuannya untuk berinteraksi dengan Lapis 1.
tr: Layer 2'nin önemli bir özelliği, Layer 1 ile etkileşime girme yeteneğidir.
zh_cn: 第2层的一个关键特征是它与第1层相互作用的能力。

source: Starknet has its own `L1-L2` messaging system, which is different from its consensus mechanism and the submission of state updates on L1. Messaging is a way for smart-contracts on L1 to interact with smart-contracts on L2 (or the other way around), allowing us to do "cross-chain" transactions. For example, we can do some computations on a chain and use the result of this computation on the other chain.
es: Starknet tiene su propio sistema de mensajería `L1-L2`, que es diferente de su mecanismo de consenso y la presentación de actualizaciones de estado en L1. La mensajería es una manera para que los contratos inteligentes en L1 interactúen con contratos inteligentes en L2 (o al revés), permitiéndonos hacer transacciones de "cadena cruzada". Por ejemplo, podemos hacer algunos cálculos en una cadena y utilizar el resultado de este cálculo en la otra cadena.
fr: Starknet dispose de son propre système de messagerie `L1-L2`, qui est différent de son mécanisme de consensus et la soumission de mises à jour d'état sur L1. Messagerie est un moyen pour les contrats intelligents sur L1 d'interagir avec les contrats intelligents sur L2 (ou l'autre manière), nous permettant de faire des transactions "cross-chain". Par exemple, nous pouvons faire certains calculs sur une chaîne et utiliser le résultat de ce calcul sur l'autre chaîne.
id: Starknet memiliki sistem pesan sendiri L1-L2, yang berbeda dari mekanisme konsensusnya dan penyerahan pemutakhiran negara pada L1. Pesan adalah cara untuk kontrak cerdas pada L1 untuk berinteraksi dengan cerdas-kontrak pada L2 (atau sebaliknya), memungkinkan kita untuk melakukan transaksi "cross-chain". Sebagai contoh, kita dapat melakukan beberapa komputasi pada rantai dan menggunakan hasil dari komputasi ini pada rantai lain.
tr: Starknet, fikir birliği mekanizmasından ve devlet güncellemelerinin L1'e sunulmasından farklı olan kendi L1-L2 mesajlaşma sistemine sahiptir. Mesajlaşma, L1'deki akıllı sözleşmelerin L2 üzerindeki akıllı sözleşmelerle (veya başka bir şekilde) etkileşime girmesinin bir yoludur ve "çapraz zincir" işlemleri yapmamızı sağlar. Örneğin, bir zincir üzerinde bazı hesaplamalar yapabilir ve bu hesaplamanın sonucunu diğer zincirde kullanabiliriz.
zh_cn: Starknet有自己的“L1-L2”信息系统,与它的协商一致机制不同,提交有关L1的国家最新情况。 通信是L1的智能合同与L2(或其他途径)的智能合同互动的一种方式,使我们能够进行“跨链”交易。例如,我们可以在链条上进行一些计算,并在另一链条上使用计算结果。

source: Bridges on Starknet all use `L1-L2` messaging. Let's say that you want to bridge tokens from Ethereum to Starknet. You will simply have to deposit your tokens in the L1 bridge contract, which will automatically trigger the minting of the same token on L2. Another good use case for `L1-L2` messaging would be [DeFi pooling](https://starkware.co/resource/defi-pooling/).
es: Puentes en Starknet todos usan mensajería `L1-L2`. Digamos que usted quiere puentear tokens de Ethereum a Starknet. Usted tendrá que simplemente depositar sus tokens en el contrato del puente L1, que activará automáticamente la acuñación del mismo token en L2. Otro buen caso de uso para mensajería `L1-L2` sería [la puesta en común de DeFi] (https://starkware.co/resource/defi-pooling/).
fr: Les ponts sur Starknet utilisent tous la messagerie `L1-L2`. Disons que vous voulez relier les jetons d'Ethereum à Starknet. Il vous suffit de déposer vos jetons dans le contrat de pont L1, ce qui déclenchera automatiquement la fusion du même jeton sur L2. Un autre cas de bonne utilisation pour la messagerie `L1-L2` serait [DeFi pooling](https://starkware.co/resource/defi-pooling/).
id: Jembatan di Starknet semua menggunakan pesan L1-L2. katakanlah Anda ingin menjembatani token dari Etherum ke Starknet. Anda hanya perlu menyimpan token Anda di kontrak L1 bridge, yang secara otomatis akan memicu pemanenan token yang sama pada L2.
tr: Starknet üzerindeki köprülerin hepsi L1-L2 mesajlaşmasını kullanır. Diyelim ki, tokenlerinizi Ethereum'dan Starknet'e köprülemek istiyorsunuz. Jetonlarınızı L1 köprü sözleşmesine yatırmanız gerekecek, bu da aynı tokenin L2'ye basılmasını otomatik olarak tetikleyecektir. L1-L2 mesajlaşması için bir başka iyi kullanım durumu [DeFi havuzu] olacaktır [https://starkware.co/resource/fi-de].
zh_cn: Starknet上的桥梁都使用“L1-L2”信息。让我们假设你想将标志从Etherom连接到Starknet。你只需在L1桥合同中交存您的标志,这将自动触发L2上的相同标志的混合。 “L1-L2”信息的另一个有用实例是[DeFi 信息(DeFi 集合)(https://starkware.co/resource/defi-pooling/)。

source: On Starknet, it's important to note that the messaging system is **asynchronous** and **asymmetric**.
es: En Starknet, es importante notar que el sistema de mensajería es **asíncrono** y **asimétrico**.
fr: Sur Starknet, il est important de noter que le système de messagerie est **asynchrone** et **asymétrique**.
id: Di Starknet, sangatlah penting untuk mencatat bahwa sistem pesan-pesan adalah (*asynchronous*** dan *asymetric**.
tr: Starknet'te, mesajlaşma sisteminin ** asenkron ** ve ** asimetrik ** olduğunu not etmek önemlidir.
zh_cn: 在史塔克内特,重要的是要指出, 信息系统是**非同步** 和**非对称** 。

source: **Asynchronous**: this means that in your contract code (being Solidity or Cairo), you can't wait the result of the message being sent on the other chain within your contract code execution.
es: **Asíncrono**: esto significa que en su código de contrato (siendo Solidity o El Cairo), no puede esperar el resultado del mensaje que se envía en la otra cadena dentro de la ejecución del código de contrato.
fr: **Asynchrone**: cela signifie que dans votre code de contrat (étant Solidité ou Le Caire), vous ne pouvez pas attendre le résultat du message envoyé sur l'autre chaîne dans l'exécution de votre code de contrat.
id: **Asynchronous**: ini berarti bahwa dalam kode kontrak Anda (menjadi Soliditas atau Kairo), Anda tidak bisa menunggu hasil dari pesan yang dikirim pada rantai lain dalam eksekusi kode kontrak Anda.
tr: ** Asenkron**: Bu, sözleşme kodunuzda (Solidity veya Kahire olmak üzere) sözleşme kodu yürütmenizdeki diğer zincire gönderilen mesajın sonucunu bekleyemeyeceğiniz anlamına gelir.
zh_cn: ** 同步**:这意味着在您的合同代码(即“团结”或“开罗”)中,您不能等待在合同代码执行中发送到另一条链条的信息的结果。

source: **Asymmetric**: sending a message from Ethereum to Starknet (`L1->L2`) is fully automated by the Starknet sequencer, which means that the message is being automatically delivered to the target contract on L2. However, when sending a message from Starknet to Ethereum (`L2->L1`), only the hash of the message is sent on L1 by the Starknet sequencer. You must then consume the message manually via a transaction on L1.
es: ** Asimétrico**: enviar un mensaje de Ethereum a Starknet (`L1->L2`) está completamente automatizado por el secuenciador Starknet, lo que significa que el mensaje se está entregando automáticamente al contrato de destino en L2. Sin embargo, cuando se envía un mensaje de Starknet a Ethereum (`L2->L1`), sólo el hash del mensaje es enviado en L1 por el secuenciador Starknet. Debe consumir el mensaje manualmente a través de una transacción en L1.
fr: **Asymétrique**: l'envoi d'un message d'Ethereum à Starknet (`L1->L2`) est entièrement automatisé par le séquenceur Starknet, ce qui signifie que le message est automatiquement livré au contrat cible sur L2. Cependant, lors de l'envoi d'un message de Starknet à Ethereum (`L2->L1`), seul le hachage du message est envoyé sur L1 par le séquenceur Starknet. Vous devez ensuite le consommer manuellement via une transaction sur L1.
id: **Asymmetric**: mengirim pesan dari Etherum ke Starknet (Nekat 1->L2) sepenuhnya otomatis oleh pengurut Starknet, yang berarti bahwa pesan secara otomatis disampaikan ke kontrak target pada L2. Namun, ketika mengirim pesan dari Starknet ke Ethereum (al->L1), hanya hash pesan yang dikirim ke L1 oleh pengurut Starknet. Anda kemudian harus mengkonsumsi pesan secara manual melalui transaksi pada L1.
tr: ** Asimetrik**: Ethereum'dan Starknet'e (L1->L2) bir mesaj göndermek Starknet sekanslayıcı tarafından tamamen otomatikleştirilir, bu da mesajın L2'deki hedef sözleşmeye otomatik olarak iletildiği anlamına gelir. Ancak, Starknet'ten Ethereum'a (L2->L1) bir mesaj gönderirken, mesajın sadece hash'i Starknet sekanslayıcı tarafından L1'e gönderilir. Daha sonra mesajı L1 işlemi üzerinden manuel olarak tüketmelisiniz.
zh_cn: ** 对称**:从Etheum向Starknet(`L1->L2')发送电文,由斯塔克内特测序器完全自动化,这意味着电文正在自动传送到L2的目标合同上,但是,在从Starknet向Etheum(`L2->L1')发送电文时,只有电文的散列由斯塔克内特测序器在L1上发出。然后,您必须通过L1的交易手动使用电文。

source: Let's dive into the details.
es: Vamos a sumergirnos en los detalles.
fr: Plongons dans les détails.
id: Mari kita menyelam ke dalam rincian.
tr: Ayrıntılara dalalım.
zh_cn: 让我们深入探讨细节。

source: The StarknetMessaging Contract
es: El contrato StarknetMessaging
fr: Le contrat StarknetMessage
id: Kontrak StarknetMessaging
tr: StarknetMesaj Sözleşmesi
zh_cn: StarknetMessignMessating 合同

source: The crucial component of the `L1-L2` Messaging system is the [`StarknetCore`](https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4) contract. It is a set of Solidity contracts deployed on Ethereum that allows Starknet to function properly. One of the contracts of `StarknetCore` is called `StarknetMessaging` and it is the contract responsible for passing messages between Starknet and Ethereum. `StarknetMessaging` follows an [interface](https://github.com/starkware-libs/cairo-lang/blob/4e233516f52477ad158bc81a86ec2760471c1b65/src/starkware/starknet/eth/IStarknetMessaging.sol#L6) with functions allowing to send message to L2, receiving messages on L1 from L2 and canceling messages.
es: El componente crucial del sistema de mensajería `L1-L2` es el contrato [`StarknetCore`] (https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4), que es un conjunto de contratos de solidez implementados en Ethereum que permite a Starknet funcionar correctamente. Uno de los contratos de `StarknetCore` se llama `StarknetMessaging` y es el contrato responsable de transmitir mensajes entre Starknet y Ethereum. `StarknetMessag` sigue una [interfaz](https://github.com/starkware-libs/cairo-lang/blob/4e233516f52477ad158b81a86ec27601c1b65/src/starkware/starknet/IStarknetMessaging.sol#L6) con funciones que permiten enviar mensajes a L2, recibir mensajes de L1 y cancelar mensajes de L1.
fr: L'élément crucial du système de messagerie `L1-L2` est le contrat [`StarknetCore`](https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4). Il s'agit d'un ensemble de contrats de solidarité déployés sur Ethereum qui permet à Starknet de fonctionner correctement. L'un des contrats de `StarknetCore` s'appelle `StarknetMessage` et c'est le contrat responsable de la transmission des messages entre Starknet et Ethereum. `StarknetMessage` suit une [interface](https://github.com/starkware-libs/cairo-lang/brob/4e233516f52477ad158bc81a86ec2760471c1b65/src/starkware/starknet/eth/IStarknetMessage.sol#L6) avec des fonctions permettant d'envoyer des messages à L2 et d'annuler des messages sur des messages.
id: Komponen penting dari sistem Messaging [NeknetCore]://etherscan.io/alamatkan/0xC2C0C0E775444B90B6BD9C4) kontrak yang diekspansikan di Etherum yang memungkinkan Stark untuk berfungsi dengan baik. Salah satu kontrak dari 50,000CNCNNNCNCBBBBBBBLLBBLLCBLCBBBB dan itu adalah kontrak yang bertanggung jawab antara pesan-pesan Stark dan Eumcnet.
tr: L1-L2 Mesajlaşma sisteminin önemli bileşeni [Starknet-Core] (https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4) iletileri ile Starnet'in düzgün çalışmasını sağlayan bir dizi Solidity sözleşmesidir.
zh_cn: `L1-L2'通信系统的关键组成部分是[StarknetCore'合同[https://etherscan.io/adest/0xc662c410C0ECf747543f5bA909660f6ABeBD9C8c4],这是在Etheum上部署的一套固态合同,使Starknet能够正常运作。`StarknetCore'合同之一是`StarknetMessagage'合同之一,它负责Starknet和Eeenum之间传递信息。`StarknetMessageing'遵循[Interface](https://github.com/starkware-libs/cairo-lang/b/42335f45477b158c81c86c2747471c165/src/starkware/starknet/eth/IstarknetMessageing.solL6),其功能允许向L2发送信息,从L2接收L1和取消信息。
