Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: In Cairo, if you don't specify the type of a variable or argument, its type defaults to a field element, represented by the keyword `felt252`. In the context of Cairo, when we say “a field element” we mean an integer in the range \\( 0 \leq x \< P \\), where \\( P \\) is a very large prime number currently equal to \\( {2^{251}} + 17 \cdot {2^{192}} + 1 \\). When adding, subtracting, or multiplying, if the result falls outside the specified range of the prime number, an overflow (or underflow) occurs, and an appropriate multiple of \\( P \\) is added or subtracted to bring the result back within the range (i.e., the result is computed \\( \mod P \\) ).
es: En El Cairo, si no se especifica el tipo de variable o argumento, su tipo por defecto a un elemento de campo, representado por la palabra clave `felt252`. En el contexto de El Cairo, cuando decimos "un elemento de campo" nos referimos a un entero en el rango
fr: Au Caire, si vous ne spécifiez pas le type d'une variable ou d'un argument, son type par défaut à un élément de champ, représenté par le mot-clé `felt252`. Dans le contexte du Caire, lorsque nous disons "un élément de champ" nous entendons un entier dans la plage \\( 0 \leq x \< P \\), où \\( P \\) est un très grand nombre primaire actuellement égal à \\( {2^{251}} + 17 \cdot {2^{192}}} + 1 \\). Lors de l'ajout, de la soustraction ou de la multiplication, si le résultat sort de la plage spécifiée du nombre principal, il se produit un débordement (ou un sous-écoulement) et un multiple approprié de \\( P \\) est ajouté ou soustrait pour ramener le résultat dans la plage (c'est-à-dire, le résultat est calculé \\( \mod P \\) ).
id: Di Kairo, jika Anda tidak menspesifikasikan tipe variabel atau argumen, tipenya default ke sebuah elemen lapangan, yang diwakili oleh kata kunci \<P\\\\ P\\) adalah bilangan prima yang sangat besar saat ini sama dengan \\[2{251} +17 \cdot {{[1}. Ketika menambahkan, penambahan, atau hasil luar dari bilangan prima (atau overflow) dan menghasilkan p\\d kembali.
tr: Kahire'de, bir değişkenin veya argümanın türünü belirtmezseniz, türü varsayılan olarak felt252 anahtar kelimesi ile temsil edilen bir alan elemanına dönüşür. Kahire bağlamında, "bir alan elemanı" dediğimizde, ( 0 leq x P ) aralığındaki bir tamsayıyı kastediyoruz, burada ( P ) şu anda ( 2 2c)'ye eşit çok büyük bir asal sayıdır.
zh_cn: 在开罗, 如果您没有指定变量或参数的类型, 则其类型默认为以关键字 `felt252' 表示的字段元素。 在开罗, 当我们说“ 字段元素” 时, 我们指范围\\\ ( 0\leq x \ \ \ P\\ ) 的整数, 其中\\ (P\\\ ) 的质数非常大, 目前等于\\ ( {2\\ 251\ + 17\ cdot {2\\\ 192\ + 1\\ \ ) 。 当添加、 减去或乘数时, 如果结果超出质数的指定范围, 就会发生溢出( 或下流), 和 \\\ (P\\ \ \ ) 的适当倍数被加或减, 使结果回到范围( 即, 结果是计算\\\ (\ mod P\\ ) 。

source: The most important difference between integers and field elements is division: Division of field elements (and therefore division in Cairo) is unlike regular CPUs division, where integer division \\( \frac{x}{y} \\) is defined as \\( \left\lfloor \frac{x}{y} \right\rfloor \\) where the integer part of the quotient is returned (so you get \\( \frac{7}{3} = 2 \\)) and it may or may not satisfy the equation \\( \frac{x}{y} \cdot y == x \\), depending on the divisibility of `x` by `y`.
es: La diferencia más importante entre los enteros y los elementos de campo es la división: la división de elementos de campo (y por lo tanto la división en El Cairo) es diferente a la división regular de CPUs, donde la división de enteros
fr: La différence la plus importante entre les entiers et les éléments de champ est la division: La division des éléments de champ (et donc la division au Caire) est différente de la division CPU régulière, où la division entière \\( \frac{x}{y} \\) est définie comme étant \\( \left\lfloor \frac{x}{y} \right\rfloor \\) où la partie entière du quotient est retournée (de sorte que vous obtenez \\( \frac{7}{3} = 2 \\)) et elle peut ou non satisfaire à l'équation \\( \frac{x}{y} \cdot y == x \\), selon la divisibilité de `x` par `y`.
id: Perbedaan yang paling penting antara integer dan elemen lapangan adalah division of field elemens (dan karena itu pembagian di Kairo) adalah tidak seperti pembagian CPU biasa, di mana pembagian integer \frac{y}{y}\\y) didefinisikan sebagai \left\l floor \frac{y}{y} \rstandar \r di mana bagian integer dari quotient dikembalikan (sehingga Anda mendapatkan \frac{7}{3}}) dan mungkin atau mungkin tidak dapat memuaskan persamaan \x\{x}\d0\y \t\y), yvis) tergantung pada di sini.
tr: Tamsayılar ve alan elemanları arasındaki en önemli fark bölmedir: Alan elemanlarının bölünmesi (ve bu nedenle Kahire'de bölünme) normal CPU'ların bölünmesinden farklıdır, burada tamsayı bölmesi ( fracxy) ( leftlfloor fracxy) 3 veya rightrfloor olarak tanımlanır.
zh_cn: 整数和字段元素之间的最重要的区别是分割: 字段元素的分割( 因此在开罗的分割) 不同于常规 CPU 分割, 其整数分割\\ (\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: In Cairo, the result of \\( \frac{x}{y} \\) is defined to always satisfy the equation \\( \frac{x}{y} \cdot y == x \\). If y divides x as integers, you will get the expected result in Cairo (for example \\( \frac{6}{2} \\) will indeed result in `3`). But when y does not divide x, you may get a surprising result: for example, since \\( 2 \cdot \frac{P + 1}{2} = P + 1 \equiv 1 \mod P \\), the value of \\( \frac{1}{2} \\) in Cairo is \\( \frac{P + 1}{2} \\) (and not 0 or 0.5), as it satisfies the above equation.
es: En El Cairo, se define el resultado de ♥( \frac{xÃ3y} l) para satisfacer siempre la ecuaciÃ3n tambiÃ©n ( \frac{xÃ3y} \cdot y == x Ã3. Si y divide x como números enteros, obtendrá el resultado esperado en El Cairo (por ejemplo, Ãfrac{6Ã32} lÃ¡s efectivamente dar lugar a `3`). Pero cuando y no divide x, usted puede obtener un resultado sorprendente: por ejemplo, puesto que Ã2 \cdot \frac{P + 1Ã32} = P + 1 \equiv 1 \mod PÃ3), el valor de
fr: Au Caire, le résultat de \\( \frac{x}{y} \\) est défini de manière à satisfaire toujours l'équation \\( \frac{x}{y} \cdot y == x \\). Si y divise x comme entiers, vous obtiendrez le résultat attendu au Caire (par exemple \\( \frac{6}{2} \\) se traduira en effet par `3`). Mais lorsque y ne divise pas x, vous obtiendrez un résultat surprenant: par exemple, puisque \\( 2 \cdot \frac{P + 1}{2} = P + 1 \equiv 1 \mod P \\\), la valeur de \\( \frac{1}{2} \\) au Caire est \\( \frac{P + 1}{2} \\) (et non 0 ou 0,5), car elle satisfait à l'équation ci-dessus.
id: Di Kairo, hasil dari \frac{x}\\y} \\\) didefinisikan untuk selalu memenuhi persamaan \\frac{x}{y}{y} \cdot y == x \\). Jika y membagi x sebagai integers, Anda akan mendapatkan hasil yang diharapkan di Kairo (misalnya \\fak{6}\\) memang akan menghasilkan dalam Á3). Tapi ketika y tidak membagi x, Anda mungkin mendapatkan hasil yang mengejutkan: karena \\ánct\\\\2} 1} 1= 1\\\\\\\\\\\ \\\\\ \\ \\ \\ \\\\,\ \\ \\ \\ \\ \\ \\}
tr: Kahire'de, ( fracxy)'nin sonucu her zaman ( fracxy 0.5 cdot y == x ) denklemini tatmin edecek şekilde tanımlanır. Eğer y x'i tam sayı olarak bölerse, Kahire'de beklenen sonucu elde edersiniz (örneğin ( frac62 ) için).
zh_cn: 在开罗,\\ (\\\ frac{ x\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Integer Types
es: Tipos enteros
fr: Types entiers
id: Tipe Integer
tr: Integer Türleri
zh_cn: 整数类型

source: The felt252 type is a fundamental type that serves as the basis for creating all types in the core library. However, it is highly recommended for programmers to use the integer types instead of the `felt252` type whenever possible, as the `integer` types come with added security features that provide extra protection against potential vulnerabilities in the code, such as overflow and underflow checks. By using these integer types, programmers can ensure that their programs are more secure and less susceptible to attacks or other security threats. An `integer` is a number without a fractional component. This type declaration indicates the number of bits the programmer can use to store the integer. Table 3-1 shows the built-in integer types in Cairo. We can use any of these variants to declare the type of an integer value.
es: El tipo feed252 es un tipo fundamental que sirve de base para crear todos los tipos en la biblioteca central. Sin embargo, es muy recomendable que los programadores utilicen los tipos enteros en lugar del tipo `felt252` siempre que sea posible, ya que los tipos `integer` vienen con características de seguridad añadidas que proporcionan protección adicional contra vulnerabilidades potenciales en el código, tales como controles de desbordamiento y subflujo. Al utilizar estos tipos enteros, los programadores pueden asegurarse de que sus programas son más seguros y menos susceptibles a ataques u otras amenazas de seguridad. Un `integer` es un número sin componente fraccionario. Esta declaración de tipo indica el número de bits que el programador puede utilizar para almacenar el entero. El cuadro 3-1 muestra los tipos enteros incorporados en El Cairo. Podemos utilizar cualquiera de estas variantes para declarar el tipo de valor entero.
fr: Le type Feel252 est un type fondamental qui sert de base à la création de tous les types dans la bibliothèque centrale. Cependant, il est fortement recommandé pour les programmeurs d'utiliser les types entiers au lieu du type "felt252" chaque fois que possible, car les types entiers sont dotés de fonctionnalités de sécurité supplémentaires qui offrent une protection supplémentaire contre les vulnérabilités potentielles dans le code, telles que les contrôles de débordement et de sous-flux. En utilisant ces types entiers, les programmeurs peuvent s'assurer que leurs programmes sont plus sûrs et moins sensibles aux attaques ou autres menaces de sécurité. Un "integer" est un nombre sans composant fractionnel. Cette déclaration de type indique le nombre de bits que le programmeur peut utiliser pour stocker l'entier. Le tableau 3-1 montre les types entiers intégrés au Caire. Nous pouvons utiliser n'importe quelle variante pour déclarer le type de valeur entière.
id: Tipe integer adalah tipe fundamental yang berfungsi sebagai dasar untuk membuat semua jenis di perpustakaan inti. Namun, sangat dianjurkan bagi programmer untuk menggunakan tipe integer sebagai ganti tipe ÁN252 (jenis integer) sebisa mungkin, sebagai jenis Áinteger yang datang dengan fitur keamanan tambahan yang memberikan perlindungan ekstra terhadap potensi kerentanan dalam kode, seperti overflow dan underflow checking. Dengan menggunakan tipe integer ini, program dapat memastikan bahwa program mereka lebih aman dan kurang rentan terhadap serangan atau ancaman keamanan lainnya. Sebuah grointeger atau keamanan adalah nomor tanpa komponen fraksional. Ini menunjukkan tipe yang dapat digunakan oleh program pemerogram di Tabletete-tetete.
tr: Keçe252 türü, çekirdek kitaplığındaki tüm türleri oluşturmak için temel olarak hizmet veren temel bir türdür. Bununla birlikte, programcıların felt252 türü yerine tamsayı türlerini kullanmaları şiddetle tavsiye edilir. integer türleri, koddaki potansiyel güvenlik açıklarına karşı ekstra koruma sağlayan ek güvenlik özellikleri ile birlikte geldiğinden, bu tamsayı türlerini kullanarak, programcıların programlarının daha fazla veya daha az güvenli olmasını sağlayabilir.
zh_cn: 感觉252类型是一种基本类型,可作为在核心图书馆创建所有类型的基础,然而,高度建议程序员尽可能使用整数类型,而不是“felt252”类型,因为“整数”类型中增加了安全特征,为防范代码中的潜在脆弱性提供了额外的保护,如溢出和下流检查。通过使用这些整数类型,程序员可以确保其程序更加安全,更容易受到攻击或其他安全威胁。“整数”是一个没有分数部分成分的数字。这种类型声明表明程序员可以用来存储整数的位数。表3-1显示开罗的内建整数类型。我们可以使用任何这些变式来申报整数值的类型。

source: Length
es: Longitud
fr: Longueur
id: Panjang
tr: Uzunluk
zh_cn: 长长

source: Unsigned
es: Sin firmar
fr: Non signé
tr: İmzasız
zh_cn: 无签名

source: 8-bit
es: 8 bits
fr: 8 bits
zh_cn: 8 位数

source: 16-bit
fr: 16 bits
zh_cn: 16 位数

source: 32-bit
fr: 32 bits
zh_cn: 32 位数

source: 64-bit
fr: 64 bits
zh_cn: 64 位数

source: 128-bit
fr: 128 bits
zh_cn: 128 位数

source: 256-bit
fr: 256 bits
zh_cn: 256比特

source: `usize`
es: `usar`
fr: «viser à l'usage»
id: Gunakanlah.
zh_cn: `使用 '

source: Each variant has an explicit size. Note that for now, the `usize` type is just an alias for `u32`; however, it might be useful when in the future Cairo can be compiled to MLIR. As variables are unsigned, they can't contain a negative number. This code will cause the program to panic:
es: Cada variante tiene un tamaño explícito. Tenga en cuenta que por ahora, el tipo `usize` es sólo un alias para `u32`; sin embargo, podría ser útil cuando en el futuro El Cairo se puede compilar a MLIR. Como las variables no están firmadas, no pueden contener un número negativo. Este código hará que el programa entre en pánico:
fr: Chaque variante a une taille explicite. Notez que pour l'instant, le type `usize` n'est qu'un alias pour `u32`; cependant, il pourrait être utile lorsque dans le futur Caire peut être compilé à MLIR. Comme les variables ne sont pas signées, ils ne peuvent pas contenir un nombre négatif. Ce code fera paniquer le programme:
id: Setiap varian memiliki ukuran eksplisit. Perhatikan bahwa untuk saat ini, tipe åusizeé hanyalah alias untuk åu32; namun, mungkin berguna ketika di Kairo masa depan dapat dikompilasi ke MLIR. Sebagai variabel unsigned, mereka tidak dapat berisi nomor negatif. Kode ini akan menyebabkan program panik:
tr: Her varyantın açık bir boyutu vardır. Şimdilik, usize tipinin sadece u32 için bir takma ad olduğunu unutmayın; ancak, gelecekte Kahire MLIR'a derlenebildiğinde yararlı olabilir. Değişkenler imzasız olduğu için, negatif bir sayı içeremezler. Bu kod programın paniğe neden olacaktır:
zh_cn: 每个变量都有明确的大小。 请注意, 目前, “ 启用” 类型只是“ u32” 的别名; 但是, 在未来开罗可以编译为 MLIR 时, 可能有用 。 由于变量没有符号, 它们不能包含负数 。 此代码会使程序产生恐慌 :

source: All integer types previously mentioned fit into a `felt252`, except for `u256` which needs 4 more bits to be stored. Under the hood, `u256` is basically a struct with 2 fields: `u256 {low: u128, high: u128}`.
es: Todos los tipos enteros mencionados anteriormente encajan en un `felt252`, a excepción de `u256` que necesita 4 bits más para almacenarse. Bajo el capó, `u256` es básicamente una estructura con 2 campos: `u256 {bajo: u128, alto: u128.
fr: Tous les types entiers mentionnés précédemment s'intègrent dans un `felt252`, à l'exception de `u256` qui nécessite 4 bits de plus à stocker. Sous le capot, `u256` est essentiellement une structure avec 2 champs: `u256 {low: u128, high: u128}`.
id: Semua tipe integer yang sebelumnya disebutkan cocok menjadi sebuah ±252, kecuali untuk u256 yang membutuhkan 4 bit lebih untuk disimpan di bawah kap mobil, pada dasarnya adalah sebuah struktur dengan 2 bidang: ·u256 {low: u128, high: u128}.
tr: Daha önce bahsedilen tüm tam sayı türleri, depolanacak 4 bit daha gereken u256 hariç, bir felt252'ye sığar. Başlık altında, u256 temelde 2 alanlı bir yapıdır: u256 low: u128, high: u128.
zh_cn: 前面提到的所有整数类型都适合“felt252”,但“u256”除外,“u256”需要再储存4位元。在头罩下,“u256”基本上是一个有2个字段的支架:`u256 {以下:u128,高:u128}。

source: Cairo also provides support for signed integers, starting with the prefix `i`. These integers can represent both positive and negative values, with sizes ranging from `i8` to `i128`. Each signed variant can store numbers from \\( -({2^{n - 1}}) \\) to \\( {2^{n - 1}} - 1 \\) inclusive, where `n` is the number of bits that variant uses. So an i8 can store numbers from \\( -({2^7}) \\) to \\( {2^7} - 1 \\), which equals `-128` to `127`.
es: El Cairo también presta apoyo a los números enteros firmados, empezando por el prefijo `i`. Estos números enteros pueden representar valores positivos y negativos, con tamaños que van de `i8` a `i128`. Cada variante firmada puede almacenar números de فارسى(({2»), a فارسى({2}, a 1 y 1 inclusive, donde `n` es el número de bits que utiliza la variante. Por lo tanto, un i8 puede almacenar números de فارسى({2^7}) a ♥({2^7} - 1 فارسى), lo que equivale a `-128` a `127.
fr: Le Caire fournit également un support pour les entiers signés, en commençant par le préfixe `i`. Ces entiers peuvent représenter à la fois des valeurs positives et négatives, avec des tailles allant de `i8` à `i128`. Chaque variante signée peut stocker des numéros de \\( {2^{n - 1}}) \\) à \\( {2^{n - 1}} - 1 \\) inclusivement, où `n` est le nombre de bits que la variante utilise. Ainsi, un i8 peut stocker des numéros de \\( -({2^7}) \\) à \\( {2^7} - 1 \\), ce qui équivaut à `-128` à `127`.
id: Integer ini dapat mewakili nilai positif dan negatif, dengan ukuran mulai dari Éi8, mulai dengan prefiksnya. Integer ini dapat mewakili nilai positif dan negatif, dengan ukuran yang berkisar dari ▪128. mulai dengan bilangan awalan yang ditandatangani dapat menyimpan angka dari \\baha~{n - 1}}) \\) ke \\ (\\2^{n {{n - 1} - 1\\) incluive, di mana \n adalah jumlah bit varian yang digunakan. Jadi sebuah i8 dapat menyimpan nomor dari \8 -{2)
tr: Kahire ayrıca, i öneki ile başlayan imzalı tamsayılar için destek sağlar. Bu tamsayılar, i8 ile i128 arasında değişen boyutlara sahip hem pozitif hem de negatif değerleri temsil edebilir. Her imzalı varyant, sayıları (2n - 1) (2n - 1) ile (2n - 1) arasında saklayabilir.
zh_cn: 开罗还支持签名的整数, 从前缀`i' 开始。 这些整数可以代表正值和负值, 大小从`i8' 至`i128'不等。 每个签名的变异体都可以存储以下数字:\\ (- ({2n - 1) 至\\\ ({2n - 1 - 1\\), 其中`n' 是变量使用的位数。 因此, i8 可以存储\\ (- ({{27})\\\) 至\\\ ({27} - 1\\), 等号为`-128'至`127'。

source: You can write integer literals in any of the forms shown in Table 3-2. Note that number literals that can be multiple numeric types allow a type suffix, such as `57_u8`, to designate the type. It is also possible to use a visual separator `_` for number literals, in order to improve code readability.
es: Puede escribir literales enteros en cualquiera de las formas mostradas en la Tabla 3-2. Tenga en cuenta que los literales numerales que pueden ser múltiples tipos numéricos permiten que un sufijo de tipo, como `57_u8`, designe el tipo. También es posible utilizar un separador visual `_` para números literales, con el fin de mejorar la legibilidad del código.
fr: Vous pouvez écrire des nombres entiers littéraux dans n'importe lequel des formulaires indiqués dans le tableau 3-2. Notez que les nombres littéraux qui peuvent être des types numériques multiples permettent à un suffixe de type, comme `57_u8`, de désigner le type. Il est également possible d'utiliser un séparateur visuel `_` pour les nombres littéraux, afin d'améliorer la lisibilité du code.
id: Anda dapat menulis integer literal dalam salah satu bentuk yang ditampilkan di Tabel 3-2. Perhatikan bahwa angka literal yang dapat menjadi beberapa tipe numerik memungkinkan sebuah akhiran tipe, seperti å57_u8, untuk menunjukkan tipenya. Hal ini juga mungkin untuk menggunakan pemisah visual untuk nomor literal, untuk meningkatkan kemampuan baca kode.
tr: Tablo 3-2'de gösterilen formlardan herhangi birine tamsayılı literaller yazabilirsiniz. Birden fazla sayısal tip olabilen sayı literalleri, türü belirtmek için 57_u8 gibi bir tip son ekine izin verir. Kod okunabilirliğini artırmak için, sayı literalleri için görsel bir ayırıcı _ kullanmak da mümkündür.
zh_cn: 您可以在表 3-2 中显示的任何表格中写入整数字。 请注意, 数字字数可以是多个数字类型, 允许类型后缀, 如 `57_ u8', 来指定该类型。 也可以对数字字数使用视觉分隔符 {}, 以便改进代码可读性 。

source: Numeric literals
es: literales numéricos
fr: Littérales numériques
id: Literal numerik
tr: Sayısal literaller
zh_cn: 数值字数

source: Example
es: Ejemplo
fr: Exemple
id: Contoh
tr: Örnek
zh_cn: 示例示例示例示例

source: Decimal
fr: Décimal
id: Desimal
tr: Ondalık
zh_cn: 十进制

source: Hex
zh_cn: 十六进

source: Octal
id: Oktal
zh_cn: 八进

source: Binary
es: Binario
fr: Binaire
id: Biner
tr: İkili
zh_cn: 二进二进

source: So how do you know which type of integer to use? Try to estimate the max value your int can have and choose the good size. The primary situation in which you’d use `usize` is when indexing some sort of collection.
es: Así que, ¿cómo sabes qué tipo de entero a utilizar? Trate de estimar el valor máximo que su int puede tener y elegir el buen tamaño. La situación primaria en la que se utiliza `usize` es al indexar algún tipo de colección.
fr: Alors comment savez-vous quel type d'entier à utiliser? Essayez d'estimer la valeur maximale que votre int peut avoir et choisissez la bonne taille. La situation principale dans laquelle vous avez utilisé `usize` est lors de l'indexation d'une sorte de collection.
id: Jadi bagaimana Anda tahu tipe integer mana yang akan Anda gunakan? Cobalah untuk memperkirakan nilai maksimal yang dapat dimiliki dan memilih ukuran yang baik.
tr: Peki hangi tamsayı türünü kullanacağınızı nasıl biliyorsunuz? İnt'inizin sahip olabileceği maksimum değeri tahmin etmeye çalışın ve iyi boyutu seçin. usize'yi kullanacağınız birincil durum, bir tür koleksiyonu indekslerken.
zh_cn: 你怎么知道要使用哪类整数? 尝试估计您能拥有的最大值, 并选择好的大小。 您使用“ usize” 的主要情形是将某种收藏索引化 。

source: Numeric Operations
es: Operaciones numéricas
fr: Opérations numériques
id: Operasi Numerik
tr: Sayısal İşlemler
zh_cn: 数值操作

source: Cairo supports the basic mathematical operations you’d expect for all the integer types: addition, subtraction, multiplication, division, and remainder. Integer division truncates toward zero to the nearest integer. The following code shows how you’d use each numeric operation in a `let` statement:
es: El Cairo soporta las operaciones matemáticas básicas que usted esperaría para todos los tipos enteros: suma, resta, multiplicación, división, y el resto. La división enteger trunca hacia cero al entero más cercano. El siguiente código muestra cómo usted usaría cada operación numérica en una declaración `let`:
fr: Le Caire prend en charge les opérations mathématiques de base que vous attendez pour tous les types entiers : addition, soustraction, multiplication, division et reste. La division entière tronque vers zéro à l'entier le plus proche. Le code suivant montre comment vous avez utilisé chaque opération numérique dans un état `let` :
id: Kairo mendukung operasi matematika dasar yang Anda harapkan untuk semua tipe integer: penambahan, pengurangan, perkalian, pembagian, dan sisanya.
tr: Kahire, tüm tam sayı türleri için beklediğiniz temel matematiksel işlemleri destekler: toplama, çıkarma, çarpma, bölme ve geri kalan. Integer bölmesi en yakın tam sayıya doğru sıfıra doğru keser. Aşağıdaki kod, her sayısal işlemi bir let ifadesinde nasıl kullanacağınızı gösterir:
zh_cn: 开罗支持所有整数类型的基本数学操作:添加、减法、乘法、除法和剩余。整数分裂向零向最接近的整数划线。以下代码显示您如何在“let”语句中使用每个数字操作:

source: // addition
es: // adición
fr: // ajout
id: //tambahan
tr: // ekleme
zh_cn: / 增加/增加

source: // subtraction
es: // resta
fr: // soustraction
id: // pengurangan
tr: // çıkarma
zh_cn: 减/减

source: // multiplication
es: // multiplicación
id: // multiplikasi
tr: // çarpma
zh_cn: / 乘法

source: // division
es: // división
id: /Bagian
tr: // bölme
zh_cn: / 司/司

source: //result is 1
es: //resultado es 1
fr: //Le résultat est 1
id: //hasil adalah 1
tr: //sonuç 1
zh_cn: /结果为1

source: //result is 2
es: //resultado es 2
fr: //le résultat est 2
id: //hasil adalah 2
tr: //sonuç 2
zh_cn: /结果为2

source: // remainder
es: // Resto
fr: // restant
id: //tersisa
tr: // kalan
zh_cn: / 剩余 /

source: // result is 3
es: // resultado es 3
fr: // le résultat est 3
id: //hasilnya adalah 3
tr: // sonuç 3
zh_cn: /结果为3
