Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Naming hardcoded values used throughout your program as constants is useful in conveying the meaning of that value to future maintainers of the code. It also helps to have only one place in your code you would need to change if the hardcoded value needed to be updated in the future.
es: Nombrar valores codificados utilizados en todo el programa como constantes es útil para transmitir el significado de ese valor a los futuros mantenedores del código. También ayuda tener un solo lugar en el código que necesitarías cambiar si el valor codificado necesitara ser actualizado en el futuro.
fr: Nommer des valeurs codées en dur utilisées tout au long de votre programme comme constantes est utile pour transmettre le sens de cette valeur aux futurs responsables du code. Il aide également à avoir une seule place dans votre code que vous auriez besoin de changer si la valeur codée en dur devait être mise à jour à l'avenir.
id: Nama nilai hardcode yang digunakan di seluruh program Anda sebagai konstanta berguna untuk menyampaikan arti dari nilai tersebut kepada pengelola kode di masa depan. Hal ini juga membantu untuk memiliki hanya satu tempat dalam kode Anda Anda akan perlu berubah jika nilai hardcoded diperlukan untuk diperbarui di masa depan.
tr: Programınız boyunca sabit olarak kullanılan sabit kodlu değerleri adlandırmak, bu değerin anlamını kodun gelecekteki geliştiricilerine iletmede yararlıdır. Ayrıca, gelecekte güncellenmesi gereken sabit kodlu değer gerekiyorsa, kodunuzda değiştirmeniz gereken tek bir yere sahip olmanıza yardımcı olur.
zh_cn: 将整个程序中使用的硬编码值命名为常数对向未来的代码维护者传达该值的意义很有用。 如果硬编码值今后需要更新, 在您的代码中只保留一个位置, 您也需要更改 。

source: Shadowing
es: Sombras
fr: L'ombre
id: Membayangi
tr: Gölgeleme
zh_cn: 阴影

source: Variable shadowing refers to the declaration of a new variable with the same name as a previous variable. Caironautes say that the first variable is _shadowed_ by the second, which means that the second variable is what the compiler will see when you use the name of the variable. In effect, the second variable overshadows the first, taking any uses of the variable name to itself until either it itself is shadowed or the scope ends. We can shadow a variable by using the same variable’s name and repeating the use of the `let` keyword as follows:
es: El Caironautes dice que la primera variable es _shadowed_ por la segunda, lo que significa que la segunda variable es lo que el compilador verá cuando use el nombre de la variable. En efecto, la segunda variable eclipsa a la primera, tomando cualquier uso del nombre de la variable para sí mismo hasta que sea en la sombra o el alcance termina. Podemos sombra una variable usando el nombre de la misma variable y repitiendo el uso de la palabra clave `let` como sigue:
fr: Les Caironautes disent que la première variable est _shadowed_ par la seconde, ce qui signifie que la deuxième variable est ce que le compilateur verra lorsque vous utiliserez le nom de la variable. En effet, la deuxième variable recouvre la première, prenant toutes les utilisations du nom de la variable à elle-même jusqu'à ce qu'elle soit elle-même ombragée ou que la portée se termine. Nous pouvons ombrer une variable en utilisant le même nom de variable et en répétant l'utilisation du mot-clé `let` comme suit:
id: Variabel membayangkan sebuah deklarasi dari variabel baru dengan nama yang sama sebagai variabel sebelumnya. Kaironautes mengatakan bahwa variabel pertama adalah _shadowed_ oleh yang kedua, yang berarti bahwa variabel kedua adalah apa yang akan dilihat kompiler ketika Anda menggunakan nama variabel yang sama. Pada efek, variabel kedua mengaburkan pertama, mengambil penggunaan apapun dari nama variabel untuk dirinya sendiri sampai baik itu sendiri dibayangi atau lingkup berakhir. Kita dapat bayangankan variabel dengan menggunakan variabel yang sama dan mengulangi penggunaan kata kunci {1}let Allah sebagai berikut:
tr: Değişken gölgeleme, önceki bir değişkenle aynı adı taşıyan yeni bir değişkenin deklarasyonuna atıfta bulunur. Caironautes, birinci değişkenin ikinci değişken tarafından _shadowed_ olduğunu söyler, bu da ikinci değişkenin, değişkenin adını kullandığınızda derleyicinin göreceği şey olduğu anlamına gelir. Aslında, ikinci değişken, ilk değişkeni gölgelendirir, değişkenin herhangi bir kullanımını kendisi gölgelenene veya kapsam bitene kadar kendi başına izler. Değişkenin bir değişkenini kullanarak gölgeleyebiliriz.
zh_cn: 变量阴影是指与前一个变量名称相同的新变量的宣布。开罗瑙特斯说第一个变量在第二个变量下是 _shadowed_,这意味着第二个变量是汇编者在使用变量名称时会看到的东西。实际上,第二个变量将第一个变量遮盖起来,在变量名称本身被阴影化或范围结束之前,将变量名称的任何用途都用在自己身上。我们可以使用同一个变量的名称来阴影变量,并重复使用“let'let”关键字如下:

source: "Inner scope x value is: {}"
es: "Ámbito de visión interior x valor es:
fr: "La valeur de la portée interne x est : {}"
tr: "İç kapsam x değeri: "
zh_cn: “内部范围 x 值是 : ”

source: "Outer scope x value is: {}"
es: "Ámbito de visión exterior x valor es:
tr: "Dış kapsam x değeri: "
zh_cn: “外部范围x值是:___________________________________________________________________________________________________________________________________________________________________________________

source: This program first binds `x` to a value of `5`. Then it creates a new variable `x` by repeating `let x =`, taking the original value and adding `1` so the value of `x` is then `6`. Then, within an inner scope created with the curly brackets, the third `let` statement also shadows `x` and creates a new variable, multiplying the previous value by `2` to give `x` a value of `12`. When that scope is over, the inner shadowing ends and `x` returns to being `6`. When we run this program, it will output the following:
es: Este programa primero une `x` a un valor de `5`. Luego crea una nueva variable `x` repitiendo `let x =`, tomando el valor original y añadiendo `1` por lo que el valor de `x` es entonces `6`. Luego, dentro de un ámbito interno creado con los corchetes rizados, la tercera declaración `let` también sombras `x` y crea una nueva variable, multiplicando el valor anterior por `2` para dar `x` un valor de `12`. Cuando ese alcance haya terminado, el sombra interior termina y `x` vuelve a ser `6`. Cuando ejecutemos este programa, producirá lo siguiente:
fr: Ce programme lie d'abord `x` à une valeur de `5`. Ensuite, il crée une nouvelle variable `x` en répétant `let x=`, en prenant la valeur d'origine et en ajoutant `1` de sorte que la valeur de `x` est alors `6`. Ensuite, dans une portée intérieure créée avec les crochets bouclés, la troisième instruction `let` aussi ombres `x` et crée une nouvelle variable, en multipliant la valeur précédente par `2` pour donner `x` une valeur de `12`. Lorsque cette portée est terminée, les extrémités de l'ombre intérieure et `x` reviennent à être `6`. Lorsque nous exécutons ce programme, il affichera ce qui suit:
id: Program ini pertama-tama mengikatkan nilai åx. lalu, ia menciptakan variabel baru dengan mengulangi x = 1, mengambil nilai asli dan menambahkan nilai sebelumnya dengan nilai ·x. lalu, dalam ruang lingkup dalam yang dibuat dengan braket keriting, pernyataan ketiga, juga bayangan xx, dan menciptakan variabel baru, melipatgandakan nilai sebelumnya dengan 0,2, untuk memberikan nilai sebesar 12.
tr: Bu program önce x değerini 5 değerine bağlar. Daha sonra let x = tekrarlayarak yeni bir x değişkeni oluşturur, orijinal değeri alır ve 1 ekler, böylece x değeri 6 olur. Sonra, bu kıvırcık parantez ile oluşturulan bir iç kapsam içinde, üçüncü let ifadesi de x değerini çarparak yeni bir değişken oluşturur.
zh_cn: 本程序首先将`x'与`5'值捆绑在一起,然后通过重复`let x'创造一个新的变量`x ',重复`let x ',以原值并增加`1 ',因此`x'值即为`6'。然后,在以圆括号创建的内部范围内,第三个`let'语句也将阴影'x'并创建一个新的变量,将以前的值乘以`2 ',以给`x'12'值。当范围结束时,内阴影端和`x'返回为`6'。当我们运行此程序时,它将输出以下内容:

source: Shadowing is different from marking a variable as `mut` because we’ll get a compile-time error if we accidentally try to reassign to this variable without using the `let` keyword. By using `let`, we can perform a few transformations on a value but have the variable be immutable after those transformations have been completed.
es: El sombreado es diferente de marcar una variable como `mut` porque obtendremos un error de tiempo de compilación si accidentalmente intentamos reasignar a esta variable sin usar la palabra clave `let`. Al usar `let`, podemos realizar algunas transformaciones en un valor pero tener la variable inmutable después de que esas transformaciones hayan sido completadas.
fr: Shadowing est différent de marquer une variable comme `mut` parce que nous allons obtenir une erreur de compilation-temps si nous essayons accidentellement de réassigner à cette variable sans utiliser le mot-clé `let`. En utilisant `let`, nous pouvons effectuer quelques transformations sur une valeur mais avons la variable être immuable après que ces transformations ont été terminées.
id: Pembayangan berbeda dengan menandai variabel sebagai ·muté karena kita akan mendapatkan kesalahan kompilasi-waktu jika kita tidak sengaja mencoba untuk mengubah variabel ini tanpa menggunakan kata kunci. Dengan menggunakan ·letâ, kita dapat melakukan beberapa transformasi pada suatu nilai tetapi memiliki variabel dapat berubah setelah transformasi tersebut telah selesai.
tr: Gölgeleme, bir değişkeni mut olarak işaretlemekten farklıdır, çünkü yanlışlıkla let anahtar kelimesini kullanmadan bu değişkene yeniden atamaya çalışırsak bir derleme-zaman hatası alırız. let kullanarak, bir değer üzerinde birkaç dönüşüm gerçekleştirebiliriz, ancak bu dönüşümler tamamlandıktan sonra değişkenin değiştirilemez olmasını sağlayabiliriz.
zh_cn: 阴影不同于将变量标记为“ mut ”, 因为如果我们不小心试图在不使用“ let let” 关键字的情况下改派到该变量, 我们就会有编译时间错误。 通过使用 `let', 我们可以对一个值执行一些变换, 但变量在这些变换完成后不可更改 。

source: Another distinction between `mut` and shadowing is that when we use the `let` keyword again, we are effectively creating a new variable, which allows us to change the type of the value while reusing the same name. As mentioned before, variable shadowing and mutable variables are equivalent at the lower level. The only difference is that by shadowing a variable, the compiler will not complain if you change its type. For example, say our program performs a type conversion between the `u64` and `felt252` types.
es: Otra distinción entre `mut` y sombra es que cuando usamos la palabra clave `let` de nuevo, estamos creando efectivamente una nueva variable, que nos permite cambiar el tipo de valor mientras reutilizamos el mismo nombre. Como se mencionó anteriormente, la sombra variable y las variables mutables son equivalentes en el nivel inferior. La única diferencia es que al sombrar una variable, el compilador no se quejará si cambia su tipo. Por ejemplo, digamos que nuestro programa realiza una conversión de tipo entre los tipos `u64` y `felt252`.
fr: Une autre distinction entre `mut` et ombre est que lorsque nous utilisons le mot clé `let` à nouveau, nous créons effectivement une nouvelle variable, ce qui nous permet de changer le type de la valeur tout en réutilisant le même nom. Comme mentionné précédemment, variable ombre et variables mutables sont équivalentes au niveau inférieur. La seule différence est que par ombre d'une variable, le compilateur ne se plaindra pas si vous changez son type. Par exemple, notre programme effectue une conversion de type entre les types `u64` et `felt252`.
id: Perbedaan lain antara °M dan bayangan adalah bahwa ketika kita menggunakan kata kunci lagi, kita secara efektif membuat variabel baru, yang memungkinkan kita untuk mengubah tipe nilai ketika menggunakan kembali nama yang sama. Seperti disebutkan sebelumnya, variabel bayangan dan variabel mutable setara pada tingkat yang lebih rendah. Perbedaannya adalah bahwa hanya dengan membayangi variabel, kompiler tidak akan mengeluh jika Anda mengubah tipenya. Misalnya, katakanlah program kami melakukan konversi tipe antara tipe É64 dan tipe 25°2.
tr: mut ve gölgeleme arasındaki diğer bir fark, let anahtar kelimesini tekrar kullandığımızda, aynı adı tekrar kullanırken değerin türünü değiştirmemize izin veren yeni bir değişken oluşturmamızdır. Daha önce de belirtildiği gibi, değişken gölgeleme ve değişkenler alt seviyede eşdeğerdir. Tek fark, bir değişkenin gölgelenmesiyle derleyicinin türünü değiştirirseniz şikayet etmeyeceğidir. Örneğin, programımızın 25 ve bir dönüşüm gerçekleştirdiğini varsayalım.
zh_cn: `mut'和阴影之间的另一个区别是,当我们再次使用`let'关键字时,我们实际上正在创建一个新的变量,允许我们在重复使用同一名称的同时改变数值的类型。如前所述,在较低层次,可变阴影变量和可变变量等值。唯一的区别是,通过阴影变量,如果您更改变量的类型,编纂者不会抱怨。例如,我们的程序在`u64'和`felt252'类型之间进行类型转换。

source: "The value of x is {} of type u64"
es: "El valor de x es de tipo u64"
fr: "La valeur de x est {} du type u64"
id: "Harta x adalah {} tipe u64"
tr: "x'in değeri tipi u64'tür"
zh_cn: "x的值是_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________

source: // converts x to a felt, type annotation is required.
es: // convierte x a un fieltro, se requiere anotación de tipo.
fr: // convertit x en feutre, une annotation de type est requise.
id: /// ubah x ke sebuah felt, tipe anotasi diperlukan.
tr: // x'i bir keçeye dönüştürür, tip annotasyonu gereklidir.
zh_cn: /将x转换为感觉,需要类型注解。

source: "The value of x is {} of type felt252"
es: "El valor de x es de tipo fieltro252"
fr: "La valeur de x est {} du type feutre252"
id: "Harta x adalah {} tipe merasa 252"
tr: "x'in değeri tipi keçe252"
zh_cn: "x的值是... 感觉252型的"

source: The first `x` variable has a `u64` type while the second `x` variable has a `felt252` type. Shadowing thus spares us from having to come up with different names, such as `x_u64` and `x_felt252`; instead, we can reuse the simpler `x` name. However, if we try to use `mut` for this, as shown here, we’ll get a compile-time error:
es: La primera variable `x` tiene un tipo `u64`, mientras que la segunda variable `x` tiene un tipo `felt252`. Sombreado por lo tanto nos ahorra de tener que llegar a diferentes nombres, tales como `x_u64` y `x_felt252`; en cambio, podemos reutilizar el nombre `x` más simple. Sin embargo, si tratamos de utilizar `mut` para esto, como se muestra aquí, vamos a obtener un error de tiempo de compilación:
fr: La première variable `x` a un type `u64` tandis que la deuxième variable `x` a un type `felt252`. Shadowing nous évite ainsi d'avoir à trouver des noms différents, tels que `x_u64` et `x_felt252`; au lieu de cela, nous pouvons réutiliser le nom `x` plus simple. Cependant, si nous essayons d'utiliser `mut` pour cela, comme montré ici, nous allons obtenir une erreur de compilation-temps:
id: Variabel pertama memiliki tipe ·u64 ketika variabel kedua memiliki tipe enomx252. Dengan demikian, bayangan menghindarkan kita dari datang dengan nama yang berbeda, seperti x_u64 dan variabel kedua memiliki jenis 25; sebagai gantinya, kita dapat menggunakan kembali nama sederhana. Namun, jika kita mencoba menggunakan Émutía untuk ini, seperti ditunjukkan di sini, kita akan mendapatkan kesalahan kompilasi:
tr: İlk x değişkeni u64 tipine sahipken, ikinci x değişkeni felt252 tipine sahiptir. Gölgelendirme böylece x_u64 ve x_felt252 gibi farklı isimlerle gelmek zorunda kalmaktan kurtulur; bunun yerine, daha basit x adını yeniden kullanabiliriz. Ancak, bunun için mut kullanmaya çalışırsak, burada derleyeceğiz.
zh_cn: 第一个`x'变量有`u64'类型,而第二个`x'变量有`felt252'类型,因此阴影使我们不必提出不同的名称,例如`x_u64'和`x_felt252';相反,我们可以重新使用更简单的`x'名称。然而,如果我们试图为此使用`m`,如此处所示,我们会发现一个编译时间错误:

source: The error says we were expecting a `u64` (the original type) but we got a different type:
es: El error dice que estábamos esperando un `u64` (el tipo original) pero tenemos un tipo diferente:
fr: L'erreur dit que nous nous attendions à un `u64` (le type original) mais nous avons un type différent:
id: Kesalahan mengatakan kami mengharapkan sebuah ·u64) (tipe aslinya) tapi kami mendapat tipe yang berbeda:
tr: Hata, u64 (orijinal tip) beklediğimizi söylüyor, ancak farklı bir tipimiz var:
zh_cn: 错误表示我们预期会有一个`u64'(原型),

source: {{#quiz ../quizzes/ch02-01-variables-and-mutability.toml}}
es: quiz../quizzes/ch02-01-variables-y-mutabilidad.toml
fr: {{#quiz../quizes/ch02-01-variables-et-mutabilité.toml}}
zh_cn: Quiz./quizzes/ch02-01-可变性和可变性.toml

source: Now that we’ve explored how variables work, let’s look at more data types they can have.
es: Ahora que hemos explorado cómo funcionan las variables, vamos a ver más tipos de datos que pueden tener.
fr: Maintenant que nous avons exploré comment les variables fonctionnent, laissons-nous regarder plus de types de données qu'ils peuvent avoir.
id: Sekarang kita sudah menjelajahi bagaimana variabel bekerja, mari kita lihat lebih banyak tipe data yang dapat mereka miliki.
tr: Şimdi değişkenlerin nasıl çalıştığını araştırdığımıza göre, sahip olabilecekleri daha fazla veri türüne bakalım.
zh_cn: 既然我们已经探索了变数是如何运作的, 让我们来看看它们能拥有的更多数据类型。

source: Every value in Cairo is of a certain _data type_, which tells Cairo what kind of data is being specified so it knows how to work with that data. This section covers two subsets of data types: scalars and compounds.
es: Cada valor en El Cairo es de cierto _data type_, que le dice a El Cairo qué tipo de datos se están especificando para que sepa cómo trabajar con esos datos. Esta sección cubre dos subconjuntos de tipos de datos: escalares y compuestos.
fr: Chaque valeur au Caire est d'un certain type de _données_, qui indique au Caire quel type de données est spécifié afin qu'il sache travailler avec ces données. Cette section couvre deux sous-ensembles de types de données : scalars et composés.
id: Setiap nilai di Kairo adalah tipe _data_ tertentu, yang memberitahu Kairo jenis data apa yang sedang dispesifikasikan sehingga ia tahu bagaimana bekerja dengan data itu. Bagian ini mencakup dua subset tipe data: skalar dan senyawa.
tr: Kahire'deki her değer, Kahire'ye bu verilerle nasıl çalışacağını bilmesi için ne tür verilerin belirtildiğini söyleyen belirli bir _data type_ değeridir. Bu bölüm, veri türlerinin iki alt kümesini kapsar: skalerlerler ve bileşikler.
zh_cn: 开罗的每个值都具有一定的 _data类型_,它告诉开罗具体指定了何种数据,以便它知道如何使用这些数据。本节涵盖两类数据类型:卡路里和化合物。

source: Keep in mind that Cairo is a _statically typed_ language, which means that it must know the types of all variables at compile time. The compiler can usually infer the desired type based on the value and its usage. In cases when many types are possible, we can use a cast method where we specify the desired output type.
es: Tenga en cuenta que El Cairo es un lenguaje _statically typed_, lo que significa que debe conocer los tipos de todas las variables en el momento de la compilación. El compilador puede generalmente inferir el tipo deseado basado en el valor y su uso. En los casos en que muchos tipos son posibles, podemos utilizar un método de reparto donde especificamos el tipo de salida deseado.
fr: Gardez à l'esprit que le Caire est un langage _statically dactylographié, ce qui signifie qu'il doit connaître les types de toutes les variables au moment de la compilation. Le compilateur peut généralement déduire le type désiré en fonction de la valeur et de son utilisation.
id: Perlu diingat bahwa Kairo adalah _statis mengetik_ bahasa, yang berarti bahwa ia harus tahu tipe dari semua variabel pada waktu kompilasi. Komiler biasanya dapat infer tipe yang diinginkan berdasarkan nilai dan penggunaannya. Dalam kasus ketika banyak tipe mungkin, kita dapat menggunakan metode cast di mana kita menentukan tipe keluaran yang diinginkan.
tr: Kahire'nin _statik olarak yazılmış bir dil olduğunu unutmayın, bu da derleme zamanında tüm değişkenlerin türlerini bilmesi gerektiği anlamına gelir. Derleyici genellikle değere ve kullanımına göre istenen türü çıkarabilir. Birçok türün mümkün olduğu durumlarda, istenen çıktı türünü belirttiğimiz bir döküm yöntemini kullanabiliriz.
zh_cn: 记住开罗是一种以统计形式打字的语言, 这意味着它必须在编译时知道所有变量的类型。 编译者通常可以根据数值及其使用量推断理想类型。 在可以使用多种类型的情况下, 我们可以使用一种手动方法, 来指定想要的输出类型 。

source: You’ll see different type annotations for other data types.
es: Verás diferentes anotaciones de tipo para otros tipos de datos.
fr: Vous verrez différentes annotations de type pour d'autres types de données.
id: Anda akan melihat notasi tipe yang berbeda untuk tipe data lain.
tr: Diğer veri türleri için farklı tip ek açıklamalar göreceksiniz.
zh_cn: 您将会看到其他数据类型的不同类型注释 。

source: Scalar Types
es: Tipos escalares
fr: Types scalaires
id: Tipe Scalar
tr: Scalar Türleri
zh_cn: Scalar 类型

source: A _scalar_ type represents a single value. Cairo has three primary scalar types: felts, integers, and booleans. You may recognize these from other programming languages. Let’s jump into how they work in Cairo.
es: Un tipo _scalar_ representa un solo valor. El Cairo tiene tres tipos de escalar primarios: fieltros, enteros y booleanos. Usted puede reconocer estos de otros lenguajes de programación. Vamos a saltar en cómo funcionan en El Cairo.
fr: Un type _scalar_ représente une valeur unique. Le Caire a trois types de scalaires primaires : les feutres, les entiers et les booléens. Vous pouvez les reconnaître à partir d'autres langages de programmation.
id: Tipe _skalar merupakan satu nilai. Kairo memiliki tiga tipe skalar primer: merasa, integer, dan booleans. Anda mungkin mengenali ini dari bahasa pemrograman lain. Biarkan mereka melompat ke bagaimana mereka bekerja di Kairo.
tr: Bir _scalar_ tipi tek bir değeri temsil eder. Kahire'nin üç ana skaler tipi vardır: keçeler, tam sayılar ve booleanlar. Bunları diğer programlama dillerinden tanıyabilirsiniz. Kahire'de nasıl çalıştıklarına atlayalım.
zh_cn: 一种 _scalar_ 类型代表一个单一值。 开罗有三种主要的标度类型:感觉、整数和布尔语。 你可以从其他编程语言中认出这些。 让我们跳入开罗的操作方式 。

source: Felt Type
es: Tipo de fieltro
fr: Type de feutre
id: Tipe Merasa
tr: Keçe Tipi
zh_cn: felt 类型
