Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: In `match` expressions, you can match multiple patterns using the `|` syntax, which is the pattern _or_ operator.
es: En expresiones `match`, puede coincidir con múltiples patrones usando la sintaxis, que es el operador pattern _or_.
fr: Dans les expressions `match`, vous pouvez faire correspondre plusieurs patrons en utilisant la syntaxe `=" qui est l'opérateur_ou_ patron.
id: Dalam ekspresi yang cocok, Anda dapat mencocokkan beberapa pola menggunakan sintaks those, yang merupakan pola operator _or_.
tr: match ifadelerinde, sözdizimini kullanarak birden fazla örüntü eşleştirebilirsiniz, bu örüntü _or_ operatörüdür.
zh_cn: 在“匹配”表达式中,您可以使用 \\ 语法来匹配多个模式,即模式 _ or_ 运算符。

source: For example, in the following code we modified the `vending_machine_accept` function to accept both `Dime` and `Quarter` coins in a single arm:
es: Por ejemplo, en el siguiente código modificamos la función `vending_machine_acept` para aceptar las monedas `Dime` y `Quarter` en un solo brazo:
fr: Par exemple, dans le code suivant, nous avons modifié la fonction `vending_machine_accept` pour accepter les pièces `Dime` et `Quarter` dans un seul bras:
id: Sebagai contoh, dalam kode berikut kami memodifikasi koin ivending_machine_accepté fungsi untuk menerima baik åDimeán dan quarrter; dalam satu lengan:
tr: Örneğin, aşağıdaki kodda, otomat_makine_kabul işlevini hem Dime hem de Quarter paralarını tek bir kolda kabul etmek için değiştirdik:
zh_cn: 例如,在以下代码中,我们修改了`自动机能'功能,以接受单臂中的`硬币'和`硬币':

source: Matching Tuples
es: Tuples coincidentes
fr: Tuples assortis
id: Tuples Cocok
tr: Eşleşen Tuples
zh_cn: 匹配图例

source: It is possible to match tuples. Let's introduce a new `DayType` enum:
es: Es posible emparejar tuples. Vamos a introducir un nuevo enum `DayType`:
fr: Il est possible de faire correspondre des tuples. Introduisons un nouvel enum `DayType`:
id: Hal ini dimungkinkan untuk mencocokkan tuples. mari kita memperkenalkan sebuah hari baru enum:
tr: Tuples eşleştirmek mümkündür. Yeni bir DayType enum tanıtalım:
zh_cn: 我们来介绍一个新的“DayType' enum:

source: Now, let's suppose that our vending machine accepts any coin on weekdays, but only accepts quarters and dimes on weekends and holidays. We can modify the `vending_machine_accept` function to accept a tuple of a `Coin` and a `Weekday` and return `true` only if the given coin is accepted on the specified day:
es: Ahora, supongamos que nuestra máquina expendedora acepta cualquier moneda en días laborables, pero sólo acepta cuartos y monedas en fines de semana y días festivos. Podemos modificar la función `vending_machine_acept` para aceptar un tuple de un `Coin` y un `Semana` y devolver `verdadero` sólo si la moneda dada es aceptada en el día especificado:
fr: Maintenant, supposons que notre distributeur accepte n'importe quelle pièce en semaine, mais n'accepte que les quartiers et les dimes le week-end et les jours fériés. Nous pouvons modifier la fonction `vending_machine_accept` pour accepter une tuple d'une `Coin` et d'une `Weekday` et retourner `true` seulement si la pièce donnée est acceptée le jour spécifié:
id: Sekarang, mari kita asumsikan bahwa mesin penjual kita menerima koin apapun pada hari kerja, tetapi hanya menerima seperempat dan sepeser pun pada akhir pekan dan liburan.
tr: Şimdi, otomatımızın hafta içi herhangi bir parayı kabul ettiğini varsayalım, ancak hafta sonları ve tatillerde sadece çeyreklik ve kuruşları kabul ediyoruz. otomat_machine_accept işlevini, bir Coin ve Weekday'in bir tutamını kabul etmek için değiştirebilir ve true'yi yalnızca verilen para belirtilen günde kabul edilirse geri verebiliriz:
zh_cn: 现在,让我们假设我们的自动售货机在工作日接受任何硬币,但在周末和节假日只接受硬币和硬币。我们可以修改`自动机 接受'功能,以接受`coin'和`weekday'的金币,只有特定硬币在规定日期被接受时才能返回`正':

source: Writing `(_, _)` for the last arm of a tuple matching pattern might feel superfluous. Hence, we can use the `_ =>` syntax if we want, for example, that our vending machine only accepts quarters on weekdays:
es: Escribir `(_, _)` para el último brazo de un patrón de coincidencia de tuplas puede parecer superfluo. Por lo tanto, podemos usar la sintaxis `_ =+ si queremos, por ejemplo, que nuestra máquina expendedora sólo acepta cuartos en días laborables:
fr: Par conséquent, nous pouvons utiliser la syntaxe `_ =>` si nous voulons, par exemple, que notre distributeur n'accepte que les quartiers en semaine :
id: Oleh karena itu, kita dapat menggunakan sintaks yang terakhir jika kita ingin, misalnya, bahwa mesin penjual kita hanya menerima seperempat pada hari kerja:
tr: (_, _) bir tuple eşleme deseninin son kolu için yazmak gereksiz hissedebilir. Bu nedenle, _> sözdizimini, örneğin, otomatımızın hafta içi yalnızca çeyrekleri kabul etmesini istersek kullanabiliriz:
zh_cn: 写'(_,_)'表示图普匹配模式最后一臂可能感到多余。 因此,如果我们想要,比如说,我们的自动售货机在工作日只接受季度, 我们可以使用 语法 :

source: Matching `felt252` and Integer Variables
es: Coincidiendo con las variables `felt252` y entero
fr: Correspondance entre les variables "felt252" et "entier"
id: Variabel Integer dan Integer yang sesuai dengan 252
tr: Eşleştirme felt252 ve Integer Değişkenleri
zh_cn: 匹配“felt252”和整数变量

source: You can also match `felt252` and integer variables. This is useful when you want to match against a range of values. However, there are some restrictions:
es: También puede coincidir con `felt252` y variables enteras. Esto es útil cuando desea coincidir con un rango de valores. Sin embargo, hay algunas restricciones:
fr: Vous pouvez également correspondre à des variables `felt252` et integer. Ceci est utile lorsque vous voulez correspondre à une plage de valeurs. Cependant, il y a quelques restrictions:
id: Anda juga dapat mencocokkan variabel integer dengan 252 dan variabel integer. namun, ada beberapa pembatasan:
tr: Ayrıca felt252 ve tamsayı değişkenlerini de eşleştirebilirsiniz. Bu, bir dizi değerle eşleştirmek istediğinizde kullanışlıdır. Ancak, bazı kısıtlamalar vardır:
zh_cn: 您也可以匹配“felt252” 和整数变量。当您想要匹配一系列数值时,这有用。但是,有些限制是:

source: Only integers that fit into a single `felt252` are supported (i.e. `u256` is not supported).
es: Sólo se admiten los números enteros que encajen en un único `felt252` (es decir, `u256` no está soportado).
fr: Seuls les nombres entiers qui entrent dans un seul "felt252" sont pris en charge (c'est-à-dire "u256" n'est pas pris en charge).
id: Hanya bilangan integer yang cocok dengan satu angka 252, yang didukung (misalnya u256).
tr: Sadece tek bir felt252 ye uyan tamsayılar desteklenir (yani u256 desteklenmez).
zh_cn: 只支持适合单一`felt252'的整数(即`u256'不支持)。

source: The first arm must be 0.
es: El primer brazo debe ser 0.
fr: Le premier bras doit être 0.
id: Lengan pertama harus 0.
tr: İlk kol 0 olmalıdır.
zh_cn: 第一个手臂必须是0。

source: Each arm must cover a sequential segment, contiguously with other arms.
es: Cada brazo debe cubrir un segmento secuencial, contiguamente con otros brazos.
fr: Chaque bras doit couvrir un segment séquentiel, contiguëment avec d'autres bras.
id: Setiap lengan harus mencakup segmen sequential, kontiguously dengan lengan lain.
tr: Her kol, diğer kollarla uyumlu olarak sıralı bir segmenti kaplamalıdır.
zh_cn: 每个手臂必须覆盖相继部分,与其他手臂相连。

source: Imagine we’re implementing a game where you roll a six-sided die to get a number between 0 and 5. If you have 0, 1 or 2 you win. If you have 3, you can roll again. For all other values you lose.
es: Imagina que estamos implementando un juego en el que haces rodar un dado de seis lados para obtener un número entre 0 y 5. Si tienes 0, 1 o 2 ganas. Si tienes 3, puedes volver a rodar. Para todos los demás valores que pierdes.
fr: Imaginez que nous implémentons un jeu où vous roulez une matrice à six côtés pour obtenir un nombre entre 0 et 5. Si vous avez 0, 1 ou 2 vous gagnez. Si vous avez 3, vous pouvez rouler à nouveau. Pour toutes les autres valeurs que vous perdez.
id: Bayangkan kita menerapkan sebuah permainan di mana Anda memutar enam kali mati untuk mendapatkan angka antara 0 dan 5. jika Anda memiliki 0, 1 atau 2 Anda menang. jika Anda memiliki 3, Anda dapat roll lagi. untuk semua nilai-nilai lain Anda kehilangan.
tr: Diyelim ki, 0 ile 5 arasında bir sayı elde etmek için altı taraflı bir kalıp yuvarladığınız bir oyun uyguluyoruz. Eğer 0, 1 veya 2 varsa kazanırsınız. 3'ünüz varsa, tekrar yuvarlayabilirsiniz. Diğer tüm değerler için kaybedersiniz.
zh_cn: 想象一下,我们正在玩一个游戏,在游戏中,你滚动一个六面式的死,以获得一个0到5之间的数字。如果你赢了 0, 1 或 2。如果你有 3, 你可以再次滚动。 对于所有其他失去的数值,你都会输掉。

source: Here's a match that implements that logic:
es: Aquí hay una coincidencia que implementa esa lógica:
fr: Voici une correspondance qui implémente cette logique :
id: Inilah kecocokan yang menerapkan logika itu:
tr: İşte bu mantığı uygulayan bir eşleşme:
zh_cn: 这是符合逻辑的一对:

source: "you won!"
es: "¡Ganaste!"
fr: "Tu as gagné!"
id: "Kau menang!"
tr: "Sen kazandın!"
zh_cn: "你赢了!"

source: "you can roll again!"
es: "¡Puedes rodar de nuevo!"
fr: "Tu peux encore rouler!"
id: "Kau bisa berguling lagi!"
tr: "Tekrar yuvarlanabilirsin!"
zh_cn: "你可以再次滚动!"

source: "you lost..."
es: "Perdiste..."
fr: "tu as perdu..."
id: "Kau kalah..."
tr: "kaybettin..."
zh_cn: "你迷路了..." "你迷路了..."

source: These restrictions are planned to be relaxed in future versions of Cairo.
es: Estas restricciones están planeadas para ser relajadas en futuras versiones de El Cairo.
fr: Ces restrictions devraient être assouplies dans les futures versions du Caire.
id: Pembatasan ini direncanakan untuk santai di masa depan versi Kairo.
tr: Bu kısıtlamaların Kahire'nin gelecekteki versiyonlarında gevşetilmesi planlanmaktadır.
zh_cn: 计划在今后版本的开罗会议上放宽这些限制。

source: `if let`
es: `Si se lo permite`
fr: 'si l'on le laisse'
id: Jika kita biarkan saja.
tr: eğer izin verirse
zh_cn: `如果`

source: The `if let` syntax lets you combine `if` and `let` into a less verbose way to handle values that match one pattern while ignoring the rest. Consider the program in Listing 6-4 that matches on an `Option::Some<u8>` value in the `config_max` variable but only wants to execute code if the value is `Option::Some` variant.
es: La sintaxis `if let` le permite combinar `if` y `let` en una forma menos verbosa de manejar valores que coincidan con un patrón mientras ignora el resto. Considere el programa en Listar 6-4 que coincida con una `Opción::Algunos < u8â € valor en la variable `config_max` pero sólo quiere ejecutar código si el valor es `Opción::Algunos'variante.
fr: La syntaxe `si let` vous permet de combiner `if` et `let` dans une manière moins verbeuse de gérer les valeurs qui correspondent à un motif tout en ignorant le reste. Considérez le programme dans Listing 6-4 qui correspond à une valeur `Option::Some<u8>` dans la variable `config_max` mais veut seulement exécuter le code si la valeur est `Option::Some`.
id: Sintaks memungkinkan Anda menggabungkannya menjadi cara yang kurang verbose untuk menangani nilai-nilai yang cocok dengan satu pola ketika mengabaikan sisanya. Pertimbangkan program di Listing 6-4 yang cocok dengan sebuah opsi: Beberapa nilai <u8> dalam variabel ▪config_max tetapi hanya ingin mengeksekusi kode jika nilai adalah Option: Beberapa varian.
tr: if let sözdizimi, if ve let'yi, gerisini göz ardı ederken tek bir kalıpla eşleşen değerleri ele almak için daha az fiili bir şekilde birleştirmenizi sağlar. Option::Someu8> config_max değişkenindeki değerle eşleşen 6-4 listelemedeki programı düşünün, ancak değer Option:Some varyantıysa sadece kodu çalıştırmak ister.
zh_cn: `如果'语法允许您将`if'和`let'合并为一种较不含糊的方式来处理匹配一个模式而忽略其他模式的值。在“选项:`配置'变量中的某些<u8'值”中,在列出 6-4 中考虑匹配该选项的程序,但只有在值为`选项:某些`变量:某些`变量”时,才想要执行代码。

source: "The maximum is configured to be {}"
es: "El máximo está configurado para que sea "#"
fr: "Le maximum est configuré pour être {}"
id: "Maksimum dikonfigurasikan untuk {}"
tr: "Maksimum olacak şekilde yapılandırıldı"
zh_cn: "最大值被配置为"

source: <span class="caption">Listing 6-4: A `match` that only cares about executing code when the value is `Option::Some`</span>
es: <span class="caption">Lista 6-4: Un `match` que sólo se preocupa por ejecutar código cuando el valor es `Opción::Some/span>
fr: <span class="caption">Liste 6-4: Un `match` qui se soucie seulement de l'exécution du code lorsque la valeur est `Option::Some`</span>
id: <span class="caption">Listing 6-4: A åmatché yang hanya peduli tentang eksekusi kode ketika nilai adalah ▪Opsi:: Beberapa</span>
tr: span class="caption">Listing 6-4: A match sadece değer Option::Some/span> olduğunda kodu çalıştırmayı önemseyen bir match
zh_cn: <span类=“caption” > listing 6-4: 只在值为`可选值: Some/span> 时才关注执行代码的“匹配”

source: If the value is `Option::Some`, we print out the value in the `Option::Some` variant by binding the value to the variable `max` in the pattern. We don’t want to do anything with the `None` value. To satisfy the `match` expression, we have to add `_ => ()` after processing just one variant, which is annoying boilerplate code to add.
es: Si el valor es `Opción::Some`, imprimimos el valor en la `Opción::Some` variante mediante la unión del valor a la variable `max` en el patrón. No queremos hacer nada con el valor `Ninguno`. Para satisfacer la expresión `match`, tenemos que añadir `_ => ()` después de procesar sólo una variante, que es molesto código de placa de caldera para añadir.
fr: Si la valeur est `Option::Some`, nous imprimons la valeur dans la variante `Option::Some` en liant la valeur à la variable `max` dans le motif. Nous ne voulons pas faire quoi que ce soit avec la valeur `None`. Pour satisfaire l'expression `match`, nous devons ajouter `_ => ()` après avoir traité une seule variante, qui est un code de plaque de chaudière ennuyeux à ajouter.
id: Jika nilainya adalah: "Beberapa, kami mencetak nilai dalam ukuran tersebut: "Beberapa varian dengan mengikat nilai ke variabel maksimal dalam pola. kami tidak ingin melakukan apa-apa dengan nilai ▪None. Untuk memenuhi ekspresi thosematch," kami harus menambahkan satu varian saja, yang merupakan kode ketelitian yang mengganggu untuk ditambahkan.
tr: Eğer değer Option::Some ise, Option::Some varyantındaki değeri max değişkenine bağlayarak yazdırırız. None değeri ile bir şey yapmak istemiyoruz. match ifadesini karşılamak için, eklemek için can sıkıcı kazan plakası kodu olan sadece bir varyantı işledikten sonra _> () eklemek zorundayız.
zh_cn: 如果值是`可选的:某些人',我们打印出`可选的:某些人'中的值,将该值与该图案中的`最大'变量捆绑在一起。我们不想用`无'值做任何事情。为了满足`匹配'表达式,我们必须在只处理一个变方后添加 () `,这是一个令人烦恼的锅炉代码。

source: Instead, we could write this in a shorter way using `if let`. The following code behaves the same as the `match` in Listing 6-4:
es: En su lugar, podríamos escribir esto de una manera más corta usando `if let`. El siguiente código se comporta igual que el `match` en la Lista 6-4:
fr: Au lieu de cela, nous pourrions écrire ceci d'une manière plus courte en utilisant `si let`. Le code suivant se comporte comme le `match` dans Listing 6-4:
id: Sebaliknya, kita bisa menulis ini dengan cara yang lebih singkat dengan menggunakan jika memungkinkan. kode berikut berperilaku sama dengan yang cocok dalam Listing 6-4:
tr: Bunun yerine, bunu if let kullanarak daha kısa bir şekilde yazabiliriz. Aşağıdaki kod, Listeleme 6-4'teki match ile aynı şekilde davranır:
zh_cn: 相反,我们可以用`如果允许'用更短的写法。以下代码的行为与6-4清单中的`匹配'相同:

source: The syntax `if let` takes a pattern and an expression separated by an equal sign. It works the same way as a `match`, where the expression is given to the `match` and the pattern is its first arm. In this case, the pattern is `Option::Some(max)`, and `max` binds to the value inside `Option::Some`. We can then use `max` in the body of the `if let` block in the same way we used `max` in the corresponding `match` arm. The code in the `if let` block isn’t run if the value doesn’t match the pattern.
es: La sintaxis `if let` toma un patrón y una expresión separada por un signo igual. Funciona de la misma manera que un `match`, donde la expresión se da al `match` y el patrón es su primer brazo. En este caso, el patrón es `Opción::Some(max)`, y `max` se une al valor dentro de `Opción:Some`. A continuación, podemos utilizar `max` en el cuerpo del bloque `if let` de la misma manera que usamos `max` en el brazo correspondiente `match`. El código en el bloque `if let` no se ejecuta si el valor no coincide con el patrón.
fr: La syntaxe `si let` prend un motif et une expression séparées par un signe égal. Elle fonctionne de la même manière qu'un `match`, où l'expression est donnée à l'`match` et le motif est son premier bras. Dans ce cas, le motif est `Option::Some(max)`, et `max` se lie à la valeur à l'intérieur de `Option::Some`. Nous pouvons alors utiliser `max` dans le corps du bloc `if let` de la même manière que nous avons utilisé `max` dans le bras `match` correspondant. Le code dans le bloc `if let` n'est pas exécuté si la valeur ne correspond pas au motif.
id: Sintaksnya adalah pola dan ekspresi yang dipisahkan oleh tanda yang sama. ia bekerja dengan cara yang sama dengan sebuah ekspresi yang diberikan kepada lengan pertama dan pola yang sama. dalam hal ini, polanya sama: Beberapa majemuk, dan terikat pada nilai di dalam tubuh.
tr: Sözdizimi if let eşit bir işaretle ayrılmış bir kalıp ve bir ifade alır. İfadenin match'ye verildiği ve desenin ilk kolu olduğu bir match ile aynı şekilde çalışır. Bu durumda, kalıp Option:Some(max) ve max'ın içindeki değere bağlanır. Option:Some.
zh_cn: 语法 `如果让我们' 采用一个模式和一个以等号分隔的表达式,它与`匹配'相同,“匹配'的表达式为`匹配 ',而该模式是其第一个臂,在此情况下,该模式是`可选的:某些(最大) ',“最大”与`可选的:某些'内值相关。然后,我们可以在`如果'的体中使用`最大 ',与我们在相应的`匹配'臂中使用的`最大'相同。如果`允许'区号的代码不运行,如果值与该模式不匹配,则该`允许'区内的代码不运行。

source: Using `if let` means less typing, less indentation, and less boilerplate code. However, you lose the exhaustive checking that `match` enforces. Choosing between `match` and `if let` depends on what you’re doing in your particular situation and whether gaining conciseness is an appropriate trade-off for losing exhaustive checking.
es: Usar " if let " significa menos mecanografía, menos hendidura y menos código de placa de caldera. Sin embargo, se pierde la comprobación exhaustiva de que " match " hace cumplir. La elección entre " match " y " if let " depende de lo que usted está haciendo en su situación particular y si ganar concisión es una compensación adecuada para perder verificación exhaustiva.
fr: L'utilisation de `si let` signifie moins de frappe, moins d'indentation et moins de code de plaque de chaudière. Cependant, vous perdez la vérification exhaustive que `match` force. Choisir entre `match` et `si let` dépend de ce que vous faites dans votre situation particulière et si gagner la concision est un compromis approprié pour perdre la vérification exhaustive.
id: Namun, Anda kehilangan pemeriksaan yang melelahkan yang cocok untuk berlaku. memilih antara ketidakcocokan dan biarkan bergantung pada apa yang Anda lakukan dalam situasi tertentu dan apakah mendapatkan konsisensi adalah pertukaran yang sesuai untuk kehilangan pemeriksaan menyeluruh.
tr: if let kullanmak, daha az yazma, daha az girinti ve daha az kazan plakası kodu anlamına gelir. Bununla birlikte, match uygulamasının uyguladığı kapsamlı denetimi kaybedersiniz. match ve if let arasında seçim yapmak, özel durumunuzda ne yaptığınıza ve özlük kazanmanın kapsamlı kontrolü kaybetmek için uygun bir takas olup olmadığına bağlıdır.
zh_cn: 使用`如果'的意思是减少打字、减少缩进和减少锅炉牌码,但是,你失去了`匹配'强制执行的详尽检查,在`匹配'和`如果'之间作出选择取决于你在特定情况下正在做些什么,以及取得简洁是否是对失去彻底检查的适当权衡。

source: In other words, you can think of `if let` as syntactic sugar for a `match` that runs code when the value matches one pattern and then ignores all other values.
es: En otras palabras, se puede pensar en `if let` como azúcar sintáctica para un `match` que ejecuta código cuando el valor coincide con un patrón y luego ignora todos los demás valores.
fr: En d'autres termes, vous pouvez penser à `si let` comme sucre syntaxique pour un `match` qui exécute le code lorsque la valeur correspond à un motif, puis ignore toutes les autres valeurs.
id: Dengan kata lain, Anda dapat membayangkan jika membiarkan gula sintaktik untuk sebuah åmatch yang menjalankan kode ketika nilai cocok dengan satu pola dan kemudian mengabaikan semua nilai lainnya.
tr: Başka bir deyişle, değer bir kalıpla eşleştiğinde kod çalıştıran ve daha sonra diğer tüm değerleri göz ardı eden bir match için if let'i syntactic şeker olarak düşünebilirsiniz.
zh_cn: 换句话说,你可以将“如果”视为“配对”的同义糖,当值符合一种模式,然后忽略所有其他的值时,该配对会运行代码。

source: We can include an `else` with an `if let`. The block of code that goes with `else` is the same as the block of code that would go with the `_` case in the `match` expression. Recall the `Coin` enum definition in Listing 6-2, where the `Quarter` variant also held a `UsState` value. If we wanted to count all non-quarter coins we see while also announcing the state of the quarters, we could do that with a `match` expression, like this:
es: Podemos incluir un `else` con un `if let`. El bloque de código que va con `else` es el mismo que el bloque de código que iría con el caso `_` en la expresión `match`. Recordemos la definición de `Coin` enum en la Lista 6-2, donde la variante `Cuarter` también tenía un valor `UsState`. Si quisiéramos contar todas las monedas que no sean monedas de cuarto que vemos mientras anunciamos el estado de los cuartos, podríamos hacerlo con una expresión `match`, como esta:
fr: Nous pouvons inclure un 'else` avec un 'if let`. Le bloc de code qui va avec `else` est le même que le bloc de code qui irait avec le cas `_` dans l'expression `match`. Rappelez-vous la définition `Coin` enum dans Listing 6-2, où la variante `Quarter` contenait également une valeur `UsState`. Si nous voulions compter toutes les pièces non-quartier que nous voyons en annonçant également l'état des quartiers, nous pourrions le faire avec une expression `match`, comme ceci:
id: Kita dapat menyertakan sebuah blok dari kode yang akan masuk ke dalam ekspresi yang tidak tertandingi. ingat lagi definisi kode tersebut dalam daftar 6-2, di mana varian árse yang juga memiliki nilai yang sama. jika kita ingin menghitung semua koin bukan seperempat yang kita lihat sambil mengumumkan negara bagian, kita dapat melakukannya dengan ekspresi yang cocok, seperti ini:
tr: Bir else let ile bir else ekleyebiliriz. else ile birlikte gelen kod bloğu, match ifadesinde _ durumu ile gidecek kod bloğu ile aynıdır. Quarter ifadesinin de bir UsState değeri tuttuğu Listeleme 6-2'deki Coin enum tanımını hatırlayın.
zh_cn: 我们可以包括`如果`的话'`else'的`else'。配有`else'的编码块与`match'表达式中与`catch'表达式中的`couin'enum 定义的编码块相同。回顾第6-2号列表中的`coin'enum定义,其中`sstate'变体也持有`Us State'价值。如果我们想计算我们所看到的所有非季度硬币,同时宣布季度状态,我们可以使用“match'表达式,例如:

source: "You got a quarter!"
es: "¡Tienes una moneda!"
fr: "Tu as un quart!"
id: "Kau punya seperempat!"
tr: "Bir çeyrekliğin var!"
zh_cn: "你得到了一个25美分!"

source: Or we could use an `if let` and `else` expression, like this:
es: O podríamos usar una expresión `si let` y `else`, como esta:
fr: Ou nous pourrions utiliser une expression `si let` et `else`, comme ceci:
id: Atau kita bisa menggunakan ekspresi æif biarkan dan élse, seperti ini:
tr: Ya da şöyle bir if let ve else ifadesi kullanabiliriz:
zh_cn: 或者我们可以使用`如果'和`else'的表达方式,像这样:
