Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: In this example, we've defined an enum called `Direction` with four variants: `North`, `East`, `South`, and `West`. The naming convention is to use PascalCase for enum variants. Each variant represents a distinct value of the `Direction` type. In this particular example, variants don't have any associated value. One variant can be instantiated using this syntax:
es: En este ejemplo, hemos definido un enum llamado `Dirección` con cuatro variantes: `Norte`, `Este`, `Sur` y `Oeste`. La convención de nombres es utilizar PascalCase para variantes de enum. Cada variante representa un valor distinto del tipo `Dirección`. En este ejemplo particular, las variantes no tienen ningún valor asociado. Una variante se puede instanciar usando esta sintaxis:
fr: Dans cet exemple, nous avons défini un enum appelé `Direction` avec quatre variantes: `North`, `East`, `South` et `West`. La convention de nommage est d'utiliser PascalCase pour les variantes enum. Chaque variante représente une valeur distincte du type `Direction`. Dans cet exemple particulier, les variantes n'ont aucune valeur associée. Une variante peut être instantanée en utilisant cette syntaxe:
id: Dalam contoh ini, kami telah mendefinisikan sebuah enum yang disebut direction (Direction) dengan empat varian: (Direction), Timur, dan West). Konvensi penamaan adalah untuk menggunakan PascalCase untuk varian: setiap varian mewakili nilai yang berbeda dari tipe direction (Direction). Dalam contoh tertentu, varian tidak memiliki nilai terkait. Satu varian dapat langsung menggunakan sintaks ini:
tr: Bu örnekte, Direction adlı bir enum'u dört varyantla tanımladık: North, East, South ve West. Adlandırma kuralı, PascalCase'i enum varyantları için kullanmaktır. Her varyant, Direction tipinin farklı bir değerini temsil eder. Bu özel örnekte, varyantların herhangi bir ilişkili değeri yoktur. Bir varyant, bu sözdisyonu kullanarak hazırlanabilir:
zh_cn: 在这个例子中,我们用四个变式界定了称为`方向'的昆虫:`北'、`东'、`南方'和`西'。命名公约是使用帕斯卡尔-卡西格来表示昆虫变异。每种变式代表`方向'类型的独特价值。在这一具体例子中,变式没有任何相关价值。一个变式可以使用这一语法即时转换:

source: Now let's imagine that our variants have associated values, that store the exact degree of the direction. We can define a new `Direction` enum:
es: Ahora imaginemos que nuestras variantes tienen valores asociados, que almacenan el grado exacto de la dirección. Podemos definir un nuevo enum `Dirección`:
fr: Imaginons maintenant que nos variantes ont des valeurs associées, qui stockent le degré exact de la direction. Nous pouvons définir un nouvel enum `Direction`:
id: Sekarang mari kita bayangkan bahwa varian kita memiliki nilai-nilai yang terkait, bahwa menyimpan tingkat yang tepat arah.
tr: Şimdi varyantlarımızın, yönün tam derecesini depolayan ilişkili değerlere sahip olduğunu varsayalım. Yeni bir Direction enum tanımlayabiliriz:
zh_cn: 现在让我们想象一下,我们的变体有相关的值, 储存方向的确切程度。 我们可以定义一个新的“ 方向” 指针 :

source: and instantiate it as follows:
es: y la instancia de la siguiente manera:
fr: et l'actualiser comme suit:
id: dan seketika itu sebagai berikut:
tr: ve şu şekilde anons edin:
zh_cn: 并按下列方式进行即时处理:

source: In this code, each variant is associated with a `u128` value, representing the direction in degrees. In the next example, we will see that it is also possible to associate different data types with each variant.
es: En este código, cada variante se asocia con un valor `u128`, que representa la dirección en grados. En el siguiente ejemplo, veremos que también es posible asociar diferentes tipos de datos con cada variante.
fr: Dans ce code, chaque variante est associée à une valeur "u128`, représentant la direction en degrés. Dans l'exemple suivant, nous verrons qu'il est également possible d'associer différents types de données à chaque variante.
id: Dalam kode ini, setiap varian dikaitkan dengan nilai ·u128, mewakili arah dalam derajat. Pada contoh berikutnya, kita akan melihat bahwa mungkin juga untuk mengasosiasikan tipe data yang berbeda dengan setiap varian.
tr: Bu kodda, her varyant, derece yönünü temsil eden bir u128 değeri ile ilişkilidir. Bir sonraki örnekte, farklı veri türlerini her varyantla ilişkilendirmenin de mümkün olduğunu göreceğiz.
zh_cn: 在本代码中,每个变量都与`u128'值相关联,代表了度的方向,在下一个实例中,我们将看到也可以将不同数据类型与每个变量联系起来。

source: It's easy to write code that acts differently depending on the variant of an enum instance, in this example to run specific code according to a direction. You can learn more about it in the [Match Control Flow Construct](./ch06-02-the-match-control-flow-construct.md) section.
es: Es fácil escribir código que actúa de manera diferente dependiendo de la variante de una instancia de enum, en este ejemplo para ejecutar código específico de acuerdo a una dirección. Puede aprender más sobre él en la sección [Match Control Flow Construct](./ch06-02-the-match-control-flow-construct.md).
fr: Il est facile d'écrire un code qui agit différemment selon la variante d'une instance enum, dans cet exemple pour exécuter un code spécifique selon une direction. Vous pouvez en apprendre plus à ce sujet dans la section [Match Control Flow Construct](./ch06-02-the-match-control-flow-construct.md).
id: Sangat mudah untuk menulis kode yang bertindak berbeda tergantung pada varian dari sebuah enum, dalam contoh ini untuk menjalankan kode spesifik sesuai dengan sebuah arah. Anda dapat belajar lebih lanjut tentang hal itu di bagian [Motch Control Flow Construct]./ch06-02-the-match-concract-flow-construct.md).
tr: Bir enum örneğinin varyantına bağlı olarak farklı davranan kod yazmak kolaydır, bu örnekte belirli kodu bir yöne göre çalıştırmak için. [Match Control Flow Construct](./ch06-02-the-match-control-flow-construct.md) bölümünde bu konuda daha fazla bilgi edinebilirsiniz.
zh_cn: 很容易根据昆虫实例的变体, 写出不同动作的代码。 在这个示例中, 您可以按照一个方向运行特定的代码。 您可以在 [ Match Control Struit] (./ ch06-02- the- match- control- flow- construct. md) 部分了解更多关于它的信息 。

source: Enums Combined with Custom Types
es: Enumes combinados con tipos personalizados
fr: Enums combinés avec des types personnalisés
id: Enum Dikombinasikan dengan Tipe Gubahan
tr: Özel Tiplerle Birleştirilmiş Enumlar
zh_cn: 与自定义类型合并

source: Enums can also be used to store more interesting custom data associated with each variant. For example:
es: Los enums también se pueden utilizar para almacenar datos personalizados más interesantes asociados con cada variante. Por ejemplo:
fr: Les enums peuvent également être utilisés pour stocker des données personnalisées plus intéressantes associées à chaque variante. Par exemple:
id: Enums juga dapat digunakan untuk menyimpan data gubahan yang lebih menarik yang berhubungan dengan setiap varian. Sebagai contoh:
tr: Enumlar, her varyantla ilişkili daha ilginç özel verileri depolamak için de kullanılabilir. Örneğin:
zh_cn: Enums也可以用来储存与每种变式相关的更有趣的自定义数据。

source: In this example, the `Message` enum has three variants: `Quit`, `Echo`, and `Move`, all with different types:
es: En este ejemplo, el `Mensaje` enum tiene tres variantes: `Quit`, `Echo` y `Move`, todas con diferentes tipos:
fr: Dans cet exemple, l'enum `Message` a trois variantes: `Quit`, `Echo` et `Move`, toutes avec différents types:
id: Dalam contoh ini, email memiliki tiga varian:
tr: Bu örnekte, Message enum'un üç varyantı vardır: Quit, Echo ve Move, hepsi farklı tiptedir:
zh_cn: 在这个例子中,`Message'enum有三种变式:`iit'、`Echo'和`move ',所有这些变式都具有不同类型:

source: `Quit` doesn't have any associated value.
es: `Quit` no tiene ningún valor asociado.
fr: `Quit` n'a aucune valeur associée.
id: Berhenti tidak memiliki nilai terkait.
tr: Quit'nin herhangi bir ilişkili değeri yoktur.
zh_cn: `不'没有任何相关价值。

source: `Echo` is a single `felt252`.
es: `Echo` es un solo `felt252`.
fr: `Echo` est un seul `felt252`.
id: Echo adalah satu-satunya yang berjumlah 252.
tr: Echo tek bir felt252 dir.
zh_cn: `Echo'是一个单一的`felt252'。

source: `Move` is a tuple of two `u128` values.
es: `Move` es una tupla de dos valores `u128`.
fr: `Move` est une tuple de deux valeurs 'u128`.
id: Pindah adalah salah satu dari dua nilai yang sama.
tr: Move iki u128 değerinden oluşur.
zh_cn: " 移动 " 是两个`u128'价值的图例。

source: You could even use a Struct or another enum you defined inside one of your enum variants.
es: Incluso podrías usar un Struct u otro enum que definiste dentro de una de tus variantes de enum.
fr: Vous pourriez même utiliser un Struct ou un autre enum que vous avez défini à l'intérieur d'une de vos variantes d'enum.
id: Anda bahkan bisa menggunakan Struct atau enum lain Anda didefinisikan dalam salah satu varian enum Anda.
tr: Enum varyantlarınızdan birinin içinde tanımladığınız bir Struct veya başka bir enum bile kullanabilirsiniz.
zh_cn: 您甚至可以使用您在其中一种昆虫变体中定义的 struct 或其它昆虫 。

source: Trait Implementations for Enums
es: Implementaciones de rasgos para Enums
fr: Implémentations de caractères pour les Enums
id: Implementasi Trait bagi Enums
tr: Enumlar için Trait Uygulamaları
zh_cn: Enums 轨迹实施

source: In Cairo, you can define traits and implement them for your custom enums. This allows you to define methods and behaviors associated with the enum. Here's an example of defining a trait and implementing it for the previous `Message` enum:
es: En El Cairo, usted puede definir rasgos e implementarlos para sus enums personalizados. Esto le permite definir métodos y comportamientos asociados con el enum. He aquí un ejemplo de definir un rasgo e implementarlo para el enum anterior `Mensaje`:
fr: Au Caire, vous pouvez définir des traits et les implémenter pour vos enums personnalisés. Cela vous permet de définir des méthodes et des comportements associés à l'enum. Voici un exemple de définir un trait et de l'implémenter pour le précédent `Message` enum:
id: Di Kairo, Anda dapat mendefinisikan sifat-sifat dan menerapkannya untuk enums gubahan Anda. Hal ini memungkinkan Anda untuk mendefinisikan metode dan perilaku yang terkait dengan enum. ini adalah contoh dari mendefinisikan suatu sifat dan mengimplementasikannya untuk enum EMSage sebelumnya:
tr: Kahire'de, özellikleri tanımlayabilir ve bunları özel enumlarınız için uygulayabilirsiniz. Bu, enum ile ilişkili yöntemleri ve davranışları tanımlamanızı sağlar. İşte bir özelliği tanımlamanın ve önceki Message enum için uygulamanın bir örneği:
zh_cn: 在开罗, 您可以定义特性, 并用于您的自定义 。 这样您就可以定义 与 enum 相关的方法和行为 。 下面是用来定义特性, 并将其用于 以前的 “ Message ’ enum ” 的示例 :

source: "quitting"
es: "Renunciando"
fr: "soutir"
id: "Menyingkir"
tr: "tavsiye"
zh_cn: "告别"

source: "echoing {}"
fr: "choisir {}"
id: "Menggema []"
zh_cn: "选择" "选择"

source: "moving from {} to {}"
es: "pasando de "a"
fr: "déplacement de {} à {}"
id: " pindah dari {} ke {}"
tr: "'dan 'ya geçiş"
zh_cn: "从到"

source: In this example, we implemented the `Processing` trait for `Message`. Here is how it could be used to process a Quit message:
es: En este ejemplo, implementamos el rasgo `Procesamiento` para `Mensaje`. He aquí cómo se podría utilizar para procesar un mensaje de Renuncia:
fr: Dans cet exemple, nous avons mis en œuvre le caractère `Processing` pour `Message`. Voici comment il pourrait être utilisé pour traiter un message Quitter:
id: Dalam contoh ini, kami menerapkan sifat yang meng-Proses-kan untuk pesan keluar:
tr: Bu örnekte, Message için Processing özelliğini uyguladık. İşte bir Çıkış iletisini işlemek için nasıl kullanılabileceği:
zh_cn: 在这个例子中,我们实施了`信件'的`处理'特性。

source: Running this code would print `quitting`.
es: La ejecución de este código imprimiría `basta`.
fr: L'exécution de ce code serait l'impression d'un "quitting".
id: Menjalankan kode ini akan mencetaknya.
tr: Bu kodu çalıştırmak quitting yazdırır.
zh_cn: 运行此代码将打印“ 降级 ” 。

source: The `Option` Enum and Its Advantages
es: El enum `opción'y sus ventajas
fr: L'Enum "Option" et ses avantages
id: Enum dan Keuntungannya
tr: Seçenek Enum ve Avantajları
zh_cn: `可选'环境及其优势

source: The `Option` enum is a standard Cairo enum that represents the concept of an optional value. It has two variants: `Some: T` and `None`. `Some: T` indicates that there's a value of type `T`, while `None` represents the absence of a value.
es: El enum `Opción` es un enum estándar de El Cairo que representa el concepto de un valor opcional y tiene dos variantes: `Algunos: T` y `Ninguno`. `Algunos: T` indica que hay un valor de tipo `T`, mientras que `Ninguno` representa la ausencia de un valor.
fr: L'enum `Option` est un enum standard du Caire qui représente le concept d'une valeur optionnelle. Il a deux variantes: `Some: T` et `None`. `Some: T` indique qu'il y a une valeur de type `T`, alors que `None` représente l'absence d'une valeur.
id: Enum standar Kairo yang mewakili konsep nilai opsional. memiliki dua varian: T Rasule.
tr: Option enum, isteğe bağlı bir değer kavramını temsil eden standart bir Kahire enumudur. İki varyantı vardır: Some: T ve None. Some: T, T tipinin bir değeri olduğunu belirtirken, None bir değerin yokluğunu temsil eder.
zh_cn: “可选”是代表可选价值概念的一个标准开罗会议,有两个变式:`某些:T'和`无'。 “有些:T'表示`T'类有价值,而`无'则表示没有价值。

source: The `Option` enum is helpful because it allows you to explicitly represent the possibility of a value being absent, making your code more expressive and easier to reason about. Using `Option` can also help prevent bugs caused by using uninitialized or unexpected `null` values.
es: El enum `Option` es útil porque le permite representar explícitamente la posibilidad de que un valor esté ausente, haciendo su código más expresivo y más fácil de razonar. Usar `Option` también puede ayudar a prevenir errores causados por el uso de valores `null` no iniciados o inesperados.
fr: L'enum `Option` est utile car il vous permet de représenter explicitement la possibilité qu'une valeur soit absente, ce qui rend votre code plus expressif et plus facile à raisonner. L'utilisation de `Option` peut également aider à prévenir les bogues causés par l'utilisation de valeurs `null` non initialisées ou inattendues.
id: Enum enum sangat membantu karena memungkinkan Anda untuk secara eksplisit mewakili kemungkinan nilai yang tidak hadir, membuat kode Anda lebih ekspresif dan lebih mudah untuk dipikirkan. menggunakan Opsi dapat juga membantu mencegah bug yang disebabkan dengan menggunakan nilai-nilai yang tidak terinisialisasi atau tidak terduga.
tr: Option enum, bir değerin eksik olma olasılığını açıkça temsil etmenize izin verdiği için yararlıdır, kodunuzu daha etkileyici ve daha kolay akla getirir. Option kullanmak, başlatılmamış veya beklenmedik null değerlerinin kullanılmasının neden olduğu hataların önlenmesine de yardımcı olabilir.
zh_cn: “Option' enum”很有帮助,因为它使您能够明确表达缺少值的可能性,从而使您的代码更能表达,更便于解释。使用“Option”也可以帮助防止由于使用未初始化或意外的“null”值而导致的错误。

source: To give you an example, here is a function which returns the index of the first element of an array with a given value, or `None` if the element is not present.
es: Para darle un ejemplo, aquí está una función que devuelve el índice del primer elemento de un array con un valor dado, o `Ninguno` si el elemento no está presente.
fr: Pour vous donner un exemple, voici une fonction qui renvoie l'index du premier élément d'un tableau avec une valeur donnée, ou `Aucun` si l'élément n'est pas présent.
id: Sebagai contoh, ini adalah fungsi yang mengembalikan indeks elemen pertama array dengan nilai tertentu, atau åNONA jika elemennya tidak ada.
tr: Size bir örnek vermek gerekirse, burada bir dizinin ilk elemanının endeksini belirli bir değerle döndüren bir fonksiyon var, ya da eğer eleman yoksa None.
zh_cn: 要给您举一个例子, 这里是一个函数, 它返回一个数组的第一个元素的索引, 并带有给定值, 如果元素不存在, 则返回“ 无 ” 。

source: We are demonstrating two approaches for the above function:
es: Estamos demostrando dos enfoques para la función anterior:
fr: Nous démontrons deux approches pour la fonction ci-dessus:
id: Kami menunjukkan dua pendekatan untuk fungsi di atas:
tr: Yukarıdaki fonksiyon için iki yaklaşım gösteriyoruz:
zh_cn: 为履行上述职能,我们正在展示两种办法:

source: Recursive approach with `find_value_recursive`.
es: Enfoque recursivo con `find_value_recursive`.
fr: Approche récursive avec `find_value_recursive`.
id: Pendekatan rekursif dengan 'find_value_recursive'.
tr: find_value_recursive ile tekrarlayıcı yaklaşım.
zh_cn: 使用“find_value_recursive”的递归方法。

source: Iterative approach with `find_value_iterative`.
es: Enfoque iterativo con `find_value_terative`.
fr: Approche itérative avec `find_value_iterative`.
id: Pendekatan iteratif dengan æfind_value_iteratif those.
tr: find_value_iterative ile iteratif yaklaşım.
zh_cn: " 确定价值 " 的迭代方法。

source: Enums can be useful in many situations, especially when using the `match` flow construct that we just used. We will describe it in the next section.
es: Los enums pueden ser útiles en muchas situaciones, especialmente cuando usamos la construcción de flujo `match` que acabamos de usar. Lo describiremos en la siguiente sección.
fr: Les enums peuvent être utiles dans de nombreuses situations, en particulier lors de l'utilisation de la construction de flux `match` que nous venons d'utiliser. Nous allons le décrire dans la section suivante.
id: Enums dapat berguna dalam banyak situasi, khususnya ketika menggunakan konstruk aliran åmatché yang baru saja kita gunakan.
tr: Enumlar birçok durumda yararlı olabilir, özellikle de yeni kullandığımız match akış yapısını kullanırken. Bir sonraki bölümde açıklayacağız.
zh_cn: 在许多情况下,特别是当使用我们刚刚使用的“匹配”流量结构时,Enums可能是有用的,我们将在下一节加以描述。

source: Other enums are used very often, such as the `Result` enum, allowing to handle errors gracefully. We will explain the `Result` enum in detail in the ["Error Handling"](./ch09-02-recoverable-errors.md#the-result-enum) chapter.
es: Otros enums se usan muy a menudo, como el enum `Resultado`, permitiendo manejar errores con gracia. Explicaremos el enum `Resultado` en detalle en el capítulo ["Manejo del error"](./ch09-02-recuperable-errors.md#the-resulto-enum).
fr: D'autres enums sont utilisés très souvent, comme le `Result` enum, permettant de gérer les erreurs gracieusement. Nous allons expliquer le `Result` enum en détail dans le chapitre ["Error Handling"](./ch09-02-recoverable-errors.md#the-result-enum).
id: Enum lain sering digunakan, seperti enum result, yang memungkinkan untuk menangani kesalahan dengan anggun. Kami akan menjelaskan enum resolult di bab ["Error Handling"]]./ch09-02-coverable-error.md#the-result-enum).
tr: Diğer enumlar çok sık kullanılır, örneğin Result enum, hataları zarifçe işlemeye izin verir. Result enum'u ["Hata Taşıma"] (./ch09-02-geri kazanılabilir-hatalar.md#the-result-enum) bölümünde ayrıntılı olarak açıklayacağız.
zh_cn: 其他昆虫经常使用,例如`Result' enum, 允许优雅地处理错误。我们将在[“错误处理”]章(./ch09-02-可恢复-errors. md#the- 结果-enum)中详细解释`Result' enum。

source: Cairo has an extremely powerful control flow construct called `match` that allows you to compare a value against a series of patterns and then execute code based on which pattern matches. Patterns can be made up of literal values, variable names, wildcards, and many other things. The power of `match` comes from the expressiveness of the patterns and the fact that the compiler confirms that all possible cases are handled.
es: El Cairo tiene una construcción de flujo de control extremadamente potente llamada `match` que le permite comparar un valor con una serie de patrones y luego ejecutar código basado en el que el patrón coincide. Los patrones se pueden componer de valores literales, nombres de variables, comodines, y muchas otras cosas. El poder de `match` proviene de la expresividad de los patrones y el hecho de que el compilador confirma que todos los casos posibles se manejan.
fr: Le Caire dispose d'une construction de flux de contrôle extrêmement puissante appelée `match` qui vous permet de comparer une valeur à une série de motifs et d'exécuter le code basé sur lequel les motifs correspondent. Patterns peuvent être constitués de valeurs littérales, noms de variables, wildcards, et beaucoup d'autres choses. La puissance de `match` vient de l'expressivité des motifs et le fait que le compilateur confirme que tous les cas possibles sont traités.
id: Kairo memiliki sebuah konstruk arus kontrol yang sangat kuat yang disebut æmatché yang memungkinkan Anda untuk membandingkan nilai dari serangkaian pola dan kemudian menjalankan kode berdasarkan pola yang cocok. pola dapat terdiri dari nilai harfiah, nama variabel, huruf liar, dan banyak hal lainnya. kekuatan ketidakcocokan berasal dari ekspresif pola dan fakta bahwa kompiler dapat memastikan bahwa semua kasus mungkin ditangani.
tr: Kahire, bir dizi örüntüye karşı bir değer karşılaştırmasına ve ardından hangi örüntünün eşleştiğine göre kod çalıştırmaya izin veren match adlı son derece güçlü bir kontrol akışı yapısına sahiptir. Desenler, gerçek değerlerden, değişken isimlerden, joker kartlarından ve daha birçok şeyden oluşabilir. match'nin gücü, kalıpların ifade edilmesinden ve derleyicinin olası tüm vakaların ele alındığını doğruladığı gerçeğinden gelir.
zh_cn: 开罗有一个叫“匹配”的极强控制流程结构,使您能够将一个数值与一系列模式进行比较,然后执行基于模式匹配的代码。模式可以由字面价值、变量名称、通配符和许多其他事物组成。“匹配”的力量来自模式的清晰度以及编译者确认所有可能的案件都得到处理的事实。

source: Think of a `match` expression as being like a coin-sorting machine: coins slide down a track with variously sized holes along it, and each coin falls through the first hole it encounters that it fits into. In the same way, values go through each pattern in a match, and at the first pattern the value “fits”, the value falls into the associated code block to be used during execution.
es: Piense en una expresión `match` como una máquina de clasificación de monedas: las monedas se deslizan por una pista con agujeros de varios tamaños a lo largo de ella, y cada moneda cae a través del primer agujero en el que se encuentra. De la misma manera, los valores van a través de cada patrón en una coincidencia, y en el primer patrón el valor "ajusta", el valor cae en el bloque de código asociado a ser utilizado durante la ejecución.
fr: Pensez à une expression `match` comme étant une machine de tri de pièces: les pièces glissent sur une piste avec des trous de différentes tailles le long, et chaque pièce tombe à travers le premier trou qu'il rencontre qu'il s'intègre. De la même manière, les valeurs passent par chaque motif dans un match, et au premier motif la valeur --fits--, la valeur tombe dans le bloc de code associé à utiliser pendant l'exécution.
id: Pikirkan ekspresi yang cocok seperti mesin pemecah koin: koin meluncur ke bawah trek dengan berbagai lubang berukuran, dan setiap koin jatuh melalui lubang pertama yang bertemu dengannya. dengan cara yang sama, nilai melalui setiap pola dalam pertandingan, dan pada pola pertama, nilai tersebut jatuh ke dalam blok kode yang terkait untuk digunakan selama eksekusi.
tr: Bir match ifadesini bir madeni para sayma makinesi gibi düşünün: madeni paralar, üzerinde çeşitli büyüklükte delikler bulunan bir parçadan aşağı doğru kayar ve her madeni para, karşılaştığı ilk delikten düşer. Aynı şekilde, değerler bir maçta her bir desenden geçer ve ilk desende değer "uygun" olur, değer, yürütme sırasında kullanılacak ilişkili kod bloğuna düşer.
zh_cn: 将“ 匹配” 的表达方式想象成像一枚硬币分拣机:硬币滑下一条轨道,上面有各种大小的洞,每一枚硬币都会从它所碰到的第一个洞中掉下来。 同样,数值以匹配的方式穿透每个图案,在第一个图案中,值为“适值 ”, 值则从执行时使用的相关代码块中掉下来。
