Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: <span class="caption">Listing 16-2: A simple Counter component</span>
es: <span class="caption">Lista 16-2: Un simple componente de contador</span>
fr: <span class="caption">Liste 16-2: Un composant de comptoir simple</span>
id: <span class="caption">Listing 16-2: Sebuah komponen Counter sederhana</span>
tr: span class="caption">Liste 16-2: Basit bir Sayaç bileşeni/span>
zh_cn: <span类="Caption" > listing 16-2:一个简单的对应组件 </span>

source: Testing the Component by Deploying a Mock Contract
es: Probando el componente mediante el despliegue de un contrato de mock
fr: Tester le composant en déployant un contrat Mock
id: Menguji Komponen dengan Menyebarkan Kontrak Mock
tr: Bir Sahte Sözleşme Dağıtarak Bileşenin Test Edilmesi
zh_cn: 通过部署模拟合同测试部件

source: The easiest way to test a component is to integrate it within a mock contract. This mock contract is only used for testing purposes, and only integrates the component you want to test. This allows you to test the component in the context of a contract, and to use a Dispatcher to call the component's entry points.
es: La forma más fácil de probar un componente es integrarlo en un contrato simulado. Este contrato simulado sólo se utiliza para fines de prueba, y sólo integra el componente que desea probar. Esto le permite probar el componente en el contexto de un contrato, y utilizar un Dispatcher para llamar a los puntos de entrada del componente.
fr: La façon la plus simple de tester un composant est de l'intégrer dans un contrat simulé. Ce contrat simulé n'est utilisé qu'à des fins de test, et intègre uniquement le composant que vous voulez tester. Cela vous permet de tester le composant dans le contexte d'un contrat, et d'utiliser un Expéditeur pour appeler les points d'entrée du composant.
id: Cara termudah untuk menguji sebuah komponen adalah mengintegrasikannya dalam kontrak palsu. Kontrak tiruan ini hanya digunakan untuk tujuan pengujian, dan hanya mengintegrasikan komponen yang ingin Anda uji. Hal ini memungkinkan Anda untuk menguji komponen dalam konteks kontrak, dan menggunakan Dispatcher untuk memanggil titik masuk komponen.
tr: Bir bileşeni test etmenin en kolay yolu, onu sahte bir sözleşme içinde entegre etmektir. Bu sahte sözleşme sadece test amaçlı kullanılır ve yalnızca test etmek istediğiniz bileşeni entegre eder. Bu, bileşeni bir sözleşme bağlamında test etmenizi ve bileşenin giriş noktalarını aramak için bir Dispatcher kullanmanızı sağlar.
zh_cn: 测试部件的最简单方式是将其整合到模拟合同中。 此模拟合同仅用于测试目的, 并且只整合您想要测试的部件。 这样您就可以在合同中测试部件, 并使用调度器调用组件的切入点 。

source: We can define such a mock contract as follows:
es: Podemos definir este tipo de contrato simulado de la siguiente manera:
fr: Nous pouvons définir un tel contrat fictif comme suit:
id: Kita dapat menentukan seperti kontrak pura-pura sebagai berikut:
tr: Böyle bir sahte sözleşmeyi şöyle tanımlayabiliriz:
zh_cn: 我们可以将这种模拟合同定义如下:

source: This contract is entirely dedicated to testing the `Counter` component. It embeds the component with the `component!` macro, exposes the component's entry points by annotating the impl aliases with `#[abi(embed_v0)]`.
es: Este contrato se dedica enteramente a probar el componente `Counter`. Incrusta el componente con el `componente!` macro, expone los puntos de entrada del componente anotando los alias de impl con '[abi(embed_v0)] '.
fr: Ce contrat est entièrement dédié à tester le composant `Counter`. Il intègre le composant avec la macro `component!`, expose les points d'entrée du composant en annotant les alias impl avec `#[abi(embed_v0)]`.
id: Kontrak ini sepenuhnya didedikasikan untuk menguji komponen kounter. Ini mencakup komponen dengan makro! mengekspos titik masuk komponen dengan menyebutkan alias impl dengan ▪#[abi[embed_v0).
tr: Bu sözleşme tamamen Counter bileşenini test etmeye adanmıştır. Bileşeni component! makrosuyla gömer, impl takma adlarını #[abi(embed_v0)] ile belirterek bileşenin giriş noktalarını açığa çıkarır.
zh_cn: 本合同完全用于测试`计算'部件,将部件嵌入`构件!`宏观,通过用`{{ib(embed_v0)]'注解别名,暴露部件的切入点。

source: We also need to define an interface that will be required to interact externally with this mock contract.
es: También tenemos que definir una interfaz que será necesaria para interactuar externamente con este contrato simulado.
fr: Nous devons également définir une interface qui sera nécessaire pour interagir avec l'extérieur avec ce contrat fictif.
id: Kita juga perlu mendefinisikan antarmuka yang diperlukan untuk berinteraksi secara eksternal dengan kontrak tiruan ini.
tr: Ayrıca, bu sahte sözleşme ile dış etkileşimde bulunması gereken bir arayüz tanımlamamız gerekiyor.
zh_cn: 我们还需要确定一个接口,以便外部与这一模拟合同进行互动。

source: We can now write tests for the component by deploying this mock contract and calling its entry points, as we would with a typical contract.
es: Ahora podemos escribir pruebas para el componente implementando este contrato simulado y llamando a sus puntos de entrada, como lo haríamos con un contrato típico.
fr: Nous pouvons maintenant passer des tests pour le composant en déployant ce contrat fictif et en appelant ses points d'entrée, comme nous le ferions avec un contrat typique.
id: Kita sekarang dapat menulis tes untuk komponen dengan menyebarkan kontrak palsu ini dan memanggil titik masuknya, seperti yang kita lakukan dengan kontrak yang khas.
tr: Artık tipik bir sözleşmede olduğu gibi, bu sahte sözleşmeyi dağıtarak ve giriş noktalarını arayarak bileşen için testler yazabiliriz.
zh_cn: 我们现在可以通过部署这一模拟合同,并按典型合同要求其入境点,对组成部分进行测试。

source: Testing Components Without Deploying a Contract
es: Ensayo de componentes sin recurrir a un contrato
fr: Composants d'essai sans déploiement d'un contrat
id: Menguji Komponen Tanpa Menyebarkan Kontrak
tr: Bir Sözleşmeyi Dağıtmadan Bileşenleri Test Etmek
zh_cn: 未部署合同的测试部件

source: In [Components under the hood](./ch16-02-01-under-the-hood.md), we saw that components leveraged genericity to define storage and logic that could be embedded in multiple contracts. If a contract embeds a component, a `HasComponent` trait is created in this contract, and the component methods are made available.
es: En [Componentes bajo el capó](./ch16-02-01-under-the-hood.md), vimos que los componentes aprovechaban la genericidad para definir el almacenamiento y la lógica que podían integrarse en múltiples contratos. Si un contrato incrusta un componente, en este contrato se crea un rasgo " HasComponent " y se ponen a disposición los métodos de componentes.
fr: Dans [Components under the hood](../ch16-02-01-under-the-hood.md), nous avons vu que les composants ont utilisé la généricité pour définir le stockage et la logique qui pourraient être intégrés dans plusieurs contrats. Si un contrat intègre un composant, un caractère `HasComponent` est créé dans ce contrat, et les méthodes des composants sont mises à disposition.
id: Dalam [Koponen di bawah kap mobil]. /ch16-02-under-the-hood.md), kami melihat bahwa komponen berpengaruh umumitas untuk mendefinisikan penyimpanan dan logika yang dapat tertanam dalam beberapa kontrak. Jika kontrak embes sebuah komponen, sebuah sifat ▪HaCompponent-- diciptakan dalam kontrak ini, dan metode komponen yang tersedia.
tr: [Kutu altındaki bileşenler](./ch16-02-01-under-the-hood.md) 'de, bileşenlerin birden fazla sözleşmeye gömülebilecek depolama ve mantığı tanımlamak için genellikten yararlandığını gördük. Bir sözleşme bir bileşeni gömerse, bu sözleşmede bir HasComponent özelliği oluşturulur ve bileşen yöntemleri kullanılabilir hale getirilir.
zh_cn: 在[头罩以下的构件](./ch16-02-01-under-world.md)中,我们看到这些构件利用通用性来界定储存和可嵌入多个合同的逻辑,如果合同包含一个构件,则在本合同中设定了`Hasconcompent'特性,并提供了构件方法。

source: This informs us that if we can provide a concrete `TContractState` that implements the `HasComponent` trait to the `ComponentState` struct, should be able to directly invoke the methods of the component using this concrete `ComponentState` object, without having to deploy a mock.
es: Esto nos informa de que si podemos proporcionar un " Estado contratante " concreto que ponga en práctica el rasgo " TieneComponente " de la estructura " Estado contratante ", debería poder invocar directamente los métodos del componente utilizando este objeto concreto " Estado contratante ", sin tener que utilizar un simulacro.
fr: Cela nous informe que si nous pouvons fournir un "TContractState" concret qui met en œuvre le caractère `HasComponent` à la structure `ComponentState`, devrait pouvoir invoquer directement les méthodes du composant en utilisant cet objet concret `ComponentState`, sans avoir à déployer une maquette.
id: Hal ini memberi tahu kita bahwa jika kita dapat menyediakan konkrit TContracststate yang menerapkan sifat ▪HasComponentéctate, harus dapat secara langsung memanggil metode komponen yang menggunakan benda konkrit ini, tanpa harus menyebarkan tiruan.
tr: Bu, ComponentState yapısına ComponentState özelliğini uygulayan bir somut TContractState sağlayabilirsek, bu somut ComponentState nesnesini kullanarak, bir alay uygulamak zorunda kalmadan, bileşenin yöntemlerini doğrudan çağırabilmemiz gerektiğini bildirir.
zh_cn: 这告诉我们,如果我们能够提供具体的`缔约国 ',以落实`进口国'结构`存在'特性,就应能直接援引组成部分的方法,使用这一具体的`含水层国'物体,而不必部署假象。

source: Let's see how we can do that by using type aliases. We still need to define a mock contract - let's use the same as above - but this time, we won't need to deploy it.
es: Vamos a ver cómo podemos hacer eso usando alias de tipo. Todavía tenemos que definir un contrato simulado - usemos lo mismo que arriba - pero esta vez, no necesitaremos implementarlo.
fr: Voyons comment nous pouvons le faire en utilisant des alias de type. Nous devons encore définir un contrat fictif - utilisons le même que ci-dessus - mais cette fois, nous n'aurons pas besoin de le déployer.
id: Mari kita lihat bagaimana kita dapat melakukannya dengan menggunakan nama alias tipe. kita masih perlu mendefinisikan kontrak pura-pura - mari kita menggunakan sama seperti di atas - tapi kali ini, kita tidak perlu menyebarkannya.
tr: Bunu tür takma adları kullanarak nasıl yapabileceğimizi görelim. Yine de sahte bir sözleşme tanımlamamız gerekiyor - yukarıdakiyle aynı şekilde kullanalım - ama bu sefer, dağıtmamıza gerek kalmayacak.
zh_cn: 让我们看看我们如何通过使用别名来做到这一点。我们仍然需要定义一个模拟合同,让我们使用与上面相同的方法,但这次,我们不需要部署它。

source: First, we need to define a concrete implementation of the generic `ComponentState` type using a type alias. We will use the `MockContract::ContractState` type to do so.
es: En primer lugar, es necesario definir una aplicación concreta del tipo genérico `EstadoComponente` utilizando un alias de tipo. Para ello, utilizaremos el tipo `Contrato::EstadoContractual`.
fr: Premièrement, nous devons définir une mise en œuvre concrète du type générique `ComponentState` en utilisant un alias de type. Nous utiliserons le type `MockContract::ContractState` pour le faire.
id: Pertama, kita perlu mendefinisikan implementasi konkrit dari tipe umum komponentstate; menggunakan nama alias.
tr: İlk olarak, jenerik ComponentState tipinin bir tür takma adını kullanarak somut bir uygulamasını tanımlamamız gerekir. Bunu yapmak için MockContract::ContractState tipini kullanacağız.
zh_cn: 首先,我们需要用别名界定具体实施通用的`实体国'类型,我们将使用`协议:缔约国'类型这样做。

source: // You can derive even `Default` on this type alias
es: // Usted puede derivar incluso `Default` en este tipo de alias
fr: // Vous pouvez déduire même `Défaut` sur ce type d'alias
id: #/Anda dapat memperoleh bahkan default# pada jenis alias
tr: // Bu tür takma adda Default'u bile türetebilirsiniz
zh_cn: / 你可以在这种别名上甚至得出 " 违约 " 。

source: We defined the `TestingState` type as an alias of the `CounterComponent::ComponentState<MockContract::ContractState>` type. By passing the `MockContract::ContractState` type as a concrete type for `ComponentState`, we aliased a concrete implementation of the `ComponentState` struct to `TestingState`.
es: Definimos el tipo `Estado de prueba` como un alias del `ContrastanteComponente::EstadoComponente<MockContract::EstadoContrastante* Tipo. Al pasar el tipo `MockContract::EstadoContrastante` como un tipo concreto para `EstadoComponente`, alias una aplicación concreta del `EstadoComponente` estructura a `Estado de prueba`.
fr: Nous avons défini le type `TestingState` comme un alias du `CounterComponent::ComponentState<MockContract::ContractState>` type. En passant le `MockContract::ContractState` type comme un type concret pour `ComponentState`, nous avons alias une mise en œuvre concrète de la structure `ComponentState` à `TestingState`.
id: Kami mendefinisikan tipe TestatingState> sebagai alias dari COunterCoponent::CoponentState<ComuckContract:::ContractState> tipe. Dengan melewati tipe kompontract:::Contractateé sebagai tipe konkrit untuk ComponentState, kami menyebut implementasi konkrit dari COponentSate éCoponentSate.
tr: ComponentState tipini CounterComponent::ComponentStateMockContract:::ContractState> tipinin bir takma adı olarak tanımladık. ComponentState tipini ComponentState için somut bir tür olarak geçerek, ComponentState struct to TestingState'in somut bir uygulaması olarak isimlendirdik.
zh_cn: 我们把`试验国'类型界定为`管制国:Commonent State <Mock Contract:Contront:Controntate_Mock Contract:Parties_BAR__BAR__BAR__BAR__BAR_Controntry_BAR__BAR__BAR__BAR_Controute:Controntate_Mock Contract:Control_BAR__BAR__BAR_BAR__BAR__BAR_BAR__BAR_BAR__BAR__BAR_BAR__BAR_BAR__BAR_BAR__BAR__BAR_BAR__BAR__BAR__BAR__BAR__BAR__BAR__BAR__BAR__BAR_C_Contate:Contractate_Contractate:Contractal:Contractal:Ct_Part:Ctate_Parttate_Parttate_Ctate_Contate_Contate_Contate_Contate_Contate_Cornate_Ctate_Cord_Cord_ tyate_Cornate_ tynate_ tynate_Contate_BAR_Con_Con_BAR_Contate_Contate_ tynate_ tynate_Contate_Contate_ ty_ ty_ tynation_ ty_ ty_ ty_我们_ tynate_ tynate_thetate_thetrocordate_Ctate_ tynate_ tynate_我们)的别名别名别名别名别名别名,我们)的别名别名的别名别名别名别名别名别名,我们用的别名别名别名,我们用的别名别名名名,我们,我们,我们用的别名名名名名名名名名名名名名名名名名名,我们具体执行`con,我们的别名名,我们

source: Because `MockContract` embeds `CounterComponent`, the methods of `CounterComponent` defined in the `CounterImpl` block can now be used on a `TestingState` object.
es: Dado que `MockContract` incorpora `CounterComponent`, los métodos de `CounterComponent` definidos en el bloque `CounterImpl` ahora pueden utilizarse en un objeto `TestingState`.
fr: Parce que `MockContract` intègre `CounterComponent`, les méthodes de `CounterComponent` définies dans le bloc `CounterImpl` peuvent maintenant être utilisées sur un objet `TestingState`.
id: Karena metode CounterCounterComuntent, yang didefinisikan dalam blok COunterlpl, kini dapat digunakan pada objek yang ditestasikan.
tr: MockContract, CounterComponent'i gömdüğü için, CounterImpl bloğunda tanımlanan CounterComponent yöntemleri artık TestingState nesnesinde kullanılabilir.
zh_cn: 由于`Mock Contract'嵌入`Counter Concoment ',`Counter Impl'区块界定的`Counter Concoment'方法现在可用于`试验国'物体。

source: Now that we have made these methods available, we need to instantiate an object of type `TestingState`, that we will use to test the component. We can do so by calling the `component_state_for_testing` function, which automatically infers that it should return an object of type `TestingState`.
es: Ahora que hemos puesto estos métodos a disposición, necesitamos instanciar un objeto de tipo `TestingState`, que usaremos para probar el componente. Podemos hacerlo llamando a la función `component_state_for_testing`, que automáticamente infiere que debe devolver un objeto de tipo `TestingState`.
fr: Maintenant que nous avons mis ces méthodes à disposition, nous avons besoin d'instituer un objet de type `TestingState`, que nous allons utiliser pour tester le composant. Nous pouvons le faire en appelant la fonction `component_state_for_testing`, qui indique automatiquement qu'il doit retourner un objet de type `TestingState`.
id: Sekarang kita telah membuat metode-metode ini tersedia, kita perlu mengkampanyekan sebuah objek dari tipe testasi, yang akan kita gunakan untuk menguji komponennya. kita dapat melakukannya dengan menghubungi komponent_state_for_testingà fungsi, yang secara otomatis akan mengembalikan sebuah objek dari tipe Tessate.
tr: Şimdi bu yöntemleri kullanılabilir hale getirdiğimize göre, bileşeni test etmek için kullanacağımız TestState tipi bir nesneyi anlık hale getirmeliyiz. Bunu, component_state_for_testing fonksiyonunu arayarak yapabiliriz, bu da otomatik olarak TestState tipi bir nesneyi döndürmesi gerektiğini gösterir.
zh_cn: 既然我们提供了这些方法,我们需要即时使用一个`试验国'类型的物体,用来测试部件,我们可以称之为`组成部分_state_for_test'功能,自动推断它应该返回一个`试验国'类型的物体。

source: We can even implement this as part of the `Default` trait, which allows us to return an empty `TestingState` with the `Default::default()` syntax.
es: Incluso podemos implementar esto como parte del rasgo `Default`, que nos permite devolver un `Estado de prueba` vacío con la sintaxis `Default::default()`.
fr: Nous pouvons même implémenter cela dans le cadre du caractère `Default`, qui nous permet de retourner un `TestingState` vide avec la syntaxe `Default::default()`.
id: Kita bahkan dapat mengimplementasikan ini sebagai bagian dari sifat Default, yang memungkinkan kita untuk mengembalikan sintaks yang kosong.
tr: Bunu Default özelliğinin bir parçası olarak bile uygulayabiliriz, bu da Default::default() sözdizimi ile boş bir TestState döndürmemizi sağlar.
zh_cn: 我们甚至可以将此作为`违约'特性的一部分加以实施,这使我们能够用`违约:违约()`语法”归还一个空的`试验国'。

source: Let's summarize what we've done so far:
es: Vamos a resumir lo que hemos hecho hasta ahora:
fr: Résumons ce que nous avons fait jusqu'ici :
id: Mari kita ringkaskan apa yang telah kita lakukan sejauh ini:
tr: Şimdiye kadar yaptıklarımızı özetleyelim:
zh_cn: 让我们总结一下我们迄今所做的工作:

source: We defined a mock contract that embeds the component we want to test.
es: Definimos un contrato simulado que incrusta el componente que queremos probar.
fr: Nous avons défini un contrat fictif qui intègre le composant que nous voulons tester.
id: Kami mendefinisikan kontrak pura-pura yang embeds komponen kita ingin menguji.
tr: Test etmek istediğimiz bileşeni yerleştiren sahte bir sözleşme tanımladık.
zh_cn: 我们定义了一个模拟合同 嵌入我们想要测试的部分

source: We defined a concrete implementation of `ComponentState<TContractState>` using a type alias with `MockContract::ContractState`, that we named `TestingState`.
es: Definimos una aplicación concreta de `Estadocomponente<EstadoTcontractatorio} utilizando un tipo de alias con `MockContract::EstadoContractual`, que llamamos `EstadoPruebador`.
fr: Nous avons défini une mise en œuvre concrète de `ComponentState<TContractState>` en utilisant un alias de type `MockContract::ContractState`, que nous avons nommé `TestingState`.
id: Kami mendefinisikan sebuah implementasi konkrit dari komponentate<TContract> menggunakan sebuah alias tipe dengan mockContract:::ContractState, yang kami namai åTestingState.
tr: ComponentStateTContractState>'ın MockContract::ContractState adlı bir tür takma ad kullanarak somut bir uygulamasını tanımladık.
zh_cn: 我们用一种别名与我们称为`试验国'的`Mock Contract:Cates'界定了`Component State <Tather State'的具体实施。

source: We defined a function that uses `component_state_for_testing` to return a `TestingState` object.
es: Definimos una función que utiliza `component_state_for_testing` para devolver un objeto `TestingState`.
fr: Nous avons défini une fonction qui utilise `component_state_for_testing` pour renvoyer un objet `TestingState`.
id: Kami mendefinisikan sebuah fungsi yang menggunakan komponent_state_for_testé untuk mengembalikan sebuah objek yang sedang diuji ulang.
tr: Bir TestState nesnesini döndürmek için component_state_for_testing kullanan bir fonksiyon tanımladık.
zh_cn: 我们定义了一种功能,即使用`元件_state_for_test'来返回`试验国'物体。

source: We can now write tests for the component by calling its functions directly, without having to deploy a mock contract. This approach is more lightweight than the previous one, and it allows testing internal functions of the component that are not exposed to the outside world trivially.
es: Ahora podemos escribir pruebas para el componente llamando a sus funciones directamente, sin tener que implementar un contrato simulado. Este enfoque es más ligero que el anterior, y permite probar funciones internas del componente que no están expuestas al mundo exterior trivialmente.
fr: Nous pouvons maintenant écrire des tests pour le composant en appelant ses fonctions directement, sans avoir à déployer un contrat simulé. Cette approche est plus légère que la précédente, et elle permet de tester les fonctions internes du composant qui ne sont pas exposés au monde extérieur trivialement.
id: Kita sekarang dapat menulis tes untuk komponen dengan memanggil fungsinya secara langsung, tanpa harus menyebarkan kontrak tiruan. pendekatan ini lebih ringan daripada sebelumnya, dan memungkinkan pengujian fungsi internal komponen yang tidak terpapar ke dunia luar secara sepele.
tr: Artık sahte bir sözleşme yapmak zorunda kalmadan doğrudan işlevlerini arayarak bileşen için testler yazabiliriz. Bu yaklaşım bir öncekinden daha hafiftir ve bileşenin dış dünyaya önemsiz bir şekilde maruz kalmayan iç işlevlerini test etmeye izin verir.
zh_cn: 我们现在可以通过直接调用部件的功能来为部件写测试,而不必部署模拟合同。 这种方法比前一种更轻,它允许测试部件的内部功能,而这些功能与外界无关。

source: Upgradeable Contracts
es: Contratos actualizables
fr: Contrats susceptibles d'être mis à niveau
id: Kontrak Dapat Diperbarui
tr: Yükseltilebilir Sözleşmeler
zh_cn: 可升级合同

source: Starknet separates contracts into classes and instances, making it simple to upgrade a contract's logic without affecting its state.
es: Starknet separa los contratos en clases e instancias, por lo que es fácil actualizar la lógica de un contrato sin afectar su estado.
fr: Starknet sépare les contrats en classes et en instances, ce qui facilite la mise à niveau de la logique d'un contrat sans affecter son état.
id: Starknet memisahkan kontrak ke dalam kelas dan contoh, membuatnya sederhana untuk meningkatkan logika kontrak tanpa mempengaruhi kondisinya.
tr: Starknet, sözleşmeleri sınıflara ve örneklere ayırır ve bir sözleşmenin mantığını durumunu etkilemeden yükseltmeyi kolaylaştırır.
zh_cn: Starknet将合同分为等级和实例,使得在不影响合同状态的情况下提高合同逻辑的提升变得简单易行。

source: A contract class is the definition of the semantics of a contract. It includes the entire logic of a contract: the name of the entry points, the addresses of the storage variables, the events that can be emitted, etc. Each class is uniquely identified by its class hash. A class does not have its own storage: it's only a definition of logic.
es: Una clase de contrato es la definición de la semántica de un contrato. Incluye toda la lógica de un contrato: el nombre de los puntos de entrada, las direcciones de las variables de almacenamiento, los eventos que pueden emitirse, etc. Cada clase es identificada de manera única por su hachís de clase. Una clase no tiene su propio almacenamiento: es sólo una definición de lógica.
fr: Une classe de contrat est la définition de la sémantique d'un contrat. Elle comprend toute la logique d'un contrat : le nom des points d'entrée, l'adresse des variables de stockage, les événements qui peuvent être émis, etc. Chaque classe est identifiée de façon unique par son hash de classe. Une classe n'a pas son propre stockage : c'est seulement une définition de logique.
id: Sebuah kelas kontrak adalah definisi semantik dari sebuah kontrak. Ini termasuk seluruh logika dari sebuah kontrak: nama titik masuk, alamat dari variabel penyimpanan, peristiwa yang dapat dipancarkan, dll. Setiap kelas diidentifikasi secara unik oleh hash kelasnya. Sebuah kelas tidak memiliki gudang sendiri: itu hanya definisi logika.
tr: Bir sözleşme sınıfı, bir sözleşmenin semantiğinin tanımıdır. Bir sözleşmenin tüm mantığını içerir: giriş noktalarının adı, depolama değişkenlerinin adresleri, yayılabilen olaylar vb. Her sınıf, sınıf hash'i ile benzersiz bir şekilde tanımlanır. Bir sınıfın kendi depolama alanı yoktur: sadece mantığın bir tanımıdır.
zh_cn: 合同类别是合同语义的定义。 它包括合同的整个逻辑: 切入点的名称、 存储变量的地址、 可以排放的事件等等。 每个类别都有其分类散列所独有的特征。 一个类别没有它自己的储存: 它只是逻辑的定义 。
