Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The `loop` keyword tells Cairo to execute a block of code over and over again forever or until you explicitly tell it to stop.
es: La palabra clave `loop` le dice a El Cairo que ejecute un bloque de código una y otra vez para siempre o hasta que le digas explícitamente que se detenga.
fr: Le mot-clé `loop` dit au Caire d'exécuter un bloc de code encore et encore pour toujours ou jusqu'à ce que vous lui disiez explicitement de s'arrêter.
id: Kata kuncinya memberitahu Kairo untuk menjalankan satu blok kode lagi dan lagi selamanya atau sampai Anda secara eksplisit menyuruhnya untuk berhenti.
tr: loop anahtar kelimesi, Kahire'ye bir kod bloğunu sonsuza kadar veya açıkça durmasını söyleyene kadar tekrar tekrar çalıştırmasını söyler.
zh_cn: `循环'关键词指示开罗永远或永远执行一组代码,或直到你明确要求停止。

source: As an example, change the _src/lib.cairo_ file in your _loops_ directory to look like this:
es: Como ejemplo, cambie el archivo _src/lib.cairo_ en su directorio _loops_ para que tenga este aspecto:
fr: Par exemple, changez le fichier _src/lib.cairo_ dans votre répertoire _loops_ pour ressembler à ceci :
id: Sebagai contoh, ubah berkas _src/lib.cairo_ dalam direktori _loops_ Anda agar terlihat seperti ini:
tr: Örnek olarak, _loops_ dizinindeki _src/lib.cairo_ dosyasını şu şekilde değiştirin:
zh_cn: 举例来说, 在您的目录中更改 _src/lib.cairo_ 文件, 使其看起来如此 :

source: "again!"
es: "¡Otra vez!"
fr: "encore!"
id: "lagi!"
tr: "Tekrar!"
zh_cn: "又来了!"

source: Note: This program would not compile without a break condition. For the purpose of the example, we added a `break` statement that will never be reached, but satisfies the compiler.
es: Nota: Este programa no se compilaría sin una condición de ruptura. Para el propósito del ejemplo, añadimos una instrucción `break` que nunca será alcanzada, pero satisface el compilador.
fr: Note: Ce programme ne serait pas compilé sans une condition de rupture. Aux fins de l'exemple, nous avons ajouté une déclaration de rupture qui ne sera jamais atteinte, mais qui satisfait le compilateur.
id: Catatan: Program ini tidak akan dikompilasi tanpa kondisi yang rusak.
tr: Not: Bu program bir mola koşulu olmadan derlemez. Örnek amacıyla, asla ulaşılmayacak, ancak derleyiciyi tatmin edecek bir break ifadesi ekledik.
zh_cn: 注:本程序不会在没有中断条件的情况下进行编译。为例举的目的,我们添加了“中断”语句,该语句永远无法达到,但满足了编译者的要求。

source: When we run this program, we’ll see `again!` printed over and over continuously until either the program runs out of gas or we stop the program manually. Most terminals support the keyboard shortcut ctrl-c to interrupt a program that is stuck in a continual loop. Give it a try:
es: Cuando ejecutemos este programa, veremos `¡de nuevo!` impreso una y otra vez continuamente hasta que el programa se quede sin gasolina o detengamos el programa manualmente. La mayoría de los terminales soportan el acceso directo al teclado ctrl-c para interrumpir un programa que está atascado en un bucle continuo.
fr: Lorsque nous exécutons ce programme, nous allons voir `à nouveau!` imprimé en continu jusqu'à ce que le programme soit épuisé ou que nous arrêtions le programme manuellement. La plupart des terminaux prennent en charge le raccourci clavier ctrl-c pour interrompre un programme qui est coincé dans une boucle continue.
id: Ketika kita menjalankan program ini, kita akan melihat lagi! dicetak berulang-ulang sampai program kehabisan gas atau kita menghentikan program secara manual. sebagian besar terminal mendukung jalan pintas papan ketik ctrl-c untuk mengganggu program yang terjebak dalam loop terus-menerus.
tr: Bu programı çalıştırdığımızda, program gaz bitene veya programı manuel olarak durdurana kadar yine!'yi sürekli olarak basılı göreceğiz. Çoğu terminal, sürekli döngüye sıkışmış bir programı kesmek için klavye kısayolu ctrl-c'yi destekler. Bir deneyin:
zh_cn: 当我们运行此程序时, 我们会看到“ 再次! ” 不断打印, 直到程序用完气体或手动停止程序。 大多数终端都支持键盘快捷键 ctrl- c 来中断被卡在连续循环中的程序。 尝试一下 :

source: ```shell $ scarb cairo-run --available-gas=20000000 Compiling loops v0.1.0 (file:///projects/loops) Finished release target(s) in 0 seconds Running loops again! again! again! ^Cagain! ```
es: Concha $ scarb cairo-run --disponible-gas=20000000 Compilando bucles v0.1.0 (file:///projects/loops) Finalizado lanzamiento objetivo(s) en 0 segundos ¡Correndo bucles de nuevo! de nuevo!
fr: ```shell $ scarb cairo-run --available-gas=20000000 Compilation loops v0.1.0 (fichier:///projects/loops) Finis la sortie cible(s) en 0 secondes Running loops de nouveau!! regain! ^Cagain! ``
id: Scarb cairo-run --available-gas=20000 Compiling loop v0.1.0 (file:///projects/loops) Selesai rilis target 106s) dalam 0 detik Berjalan loop lagi! lagi! ^C again!
tr: shell $ scarb cairo-run - available-gas=20000000 Derleme döngüleri v0.1.0 (dosya:///projects/loops) 0 saniye içinde serbest bırakma hedefi(ler) Yine Koşu döngüleri! tekrar! Cagain!
zh_cn: $shell $ scarb cairo-run - 可用 gas=2000000 Comping locations v.1.0 ( file:///projects/loops) 0 秒内完成释放目标! 再次运行循环! 再次!\ again! ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ =+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

source: The symbol `^C` represents where you pressed ctrl-c. You may or may not see the word `again!` printed after the ^C, depending on where the code was in the loop when it received the interrupt signal.
es: El símbolo C` representa donde se pulsa ctrl-c. Puede o no ver la palabra `otra vez!` impreso después de la ^C, dependiendo de dónde el código estaba en el bucle cuando recibió la señal de interrupción.
fr: Le symbole `^C` représente l'endroit où vous avez appuyé sur ctrl-c. Vous pouvez voir ou non le mot `à nouveau!` imprimé après le ^C, selon l'endroit où le code était dans la boucle quand il a reçu le signal d'interruption.
id: Simbol ini mewakili dimana Anda menekan ctrl-c. Anda mungkin atau mungkin tidak melihat kata tersebut lagi! dicetak setelah ^C, tergantung di mana kode berada dalam loop ketika menerima sinyal interupsi.
tr: C sembolü, ctrl-c tuşuna bastığınız yeri temsil eder. Kesme sinyalini aldığında kodun döngüde bulunduğu yere bağlı olarak, C'den sonra basılan again! kelimesini görebilir veya göremeyebilirsiniz.
zh_cn: 符号 `C' 表示您按下 ctrl-c 的位置。 您可能看到或可能看不到在 °C 之后打印的单词 `又!', 取决于代码收到中断信号时在循环中的位置。

source: Note: Cairo prevents us from running program with infinite loops by including a gas meter. The gas meter is a mechanism that limits the amount of computation that can be done in a program. By setting a value to the `--available-gas` flag, we can set the maximum amount of gas available to the program. Gas is a unit of measurement that expresses the computation cost of an instruction. When the gas meter runs out, the program will stop. In the previous case, we set the gas limit high enough for the program to run for quite some time.
es: Nota: El Cairo nos impide ejecutar programas con bucles infinitos mediante la inclusión de un medidor de gas. El medidor de gas es un mecanismo que limita la cantidad de cálculo que se puede hacer en un programa. Al establecer un valor a la bandera `--disponible-gas`, podemos establecer la cantidad máxima de gas disponible para el programa. El gas es una unidad de medida que expresa el costo de cálculo de una instrucción. Cuando el medidor de gas se agote, el programa se detendrá. En el caso anterior, fijamos el límite de gas lo suficientemente alto para que el programa funcione durante bastante tiempo.
fr: Note: Le Caire nous empêche de lancer un programme avec des boucles infinies en incluant un compteur de gaz. Le compteur de gaz est un mécanisme qui limite la quantité de calcul qui peut être fait dans un programme. En définissant une valeur au drapeau `--disponible-gaz`, nous pouvons définir la quantité maximale de gaz disponible au programme. Le gaz est une unité de mesure qui exprime le coût de calcul d'une instruction. Lorsque le compteur de gaz s'épuise, le programme s'arrêtera. Dans le cas précédent, nous définissons la limite de gaz suffisamment élevée pour que le programme fonctionne pendant un certain temps.
id: Kairo mencegah kita dari menjalankan program dengan putaran yang tak terbatas dengan termasuk meteran gas. meteran gas adalah mekanisme yang membatasi jumlah komputasi yang dapat dilakukan dalam sebuah program. dengan menetapkan nilai untuk program tersebut - tersedia-gas yang dapat digunakan dengan flag, kita dapat mengatur jumlah maksimum gas yang tersedia untuk program tersebut. Gas adalah unit pengukuran yang mengekspresikan biaya komputasi dari instruksi. ketika meteran gas berjalan keluar, program akan berhenti. Dalam kasus sebelumnya, kami mengatur batas gas yang cukup tinggi untuk program untuk berjalan selama beberapa waktu.
tr: Not: Kahire, bir gaz sayacı dahil ederek programı sonsuz döngülerle çalıştırmamızı önler. Gaz sayacı, bir programda yapılabilecek hesaplama miktarını sınırlayan bir mekanizmadır. - available-gas bayrağına bir değer ayarlayarak, program için mevcut olan maksimum gaz miktarını ayarlayabiliriz. Gaz, bir talimatın hesaplama maliyetini ifade eden bir ölçüm birimidir. Gaz sayacı bittiğinde, program bir önceki program için oldukça yüksek bir süre durur.
zh_cn: 注:开罗防止我们以无穷环环运行程序,办法是加入一个气体计数仪。气体计数仪是一个限制程序内可以完成的计算数量的机制。通过设定“可用气体”旗帜的值,我们可以设定程序可使用的最大气体量。气体是表示一项指令计算成本的测量单位。当气体计数仪用完时,程序将停止。在前一种情况下,我们设定了足够高的气体限值,使程序运行相当长的时间。

source: It is particularly important in the context of smart contracts deployed on Starknet, as it prevents from running infinite loops on the network. If you're writing a program that needs to run a loop, you will need to execute it with the `--available-gas` flag set to a value that is large enough to run the program.
es: Es particularmente importante en el contexto de los contratos inteligentes implementados en Starknet, ya que impide ejecutar bucles infinitos en la red. Si estás escribiendo un programa que necesita ejecutar un bucle, necesitarás ejecutarlo con el indicador `--disponible-gas` establecido con un valor lo suficientemente grande como para ejecutar el programa.
fr: Il est particulièrement important dans le contexte des contrats intelligents déployés sur Starknet, car il empêche d'exécuter des boucles infinies sur le réseau. Si vous écrivez un programme qui doit exécuter une boucle, vous devrez l'exécuter avec le drapeau `--available-gas` défini à une valeur suffisamment grande pour exécuter le programme.
id: Hal ini sangat penting dalam konteks kontrak cerdas dikerahkan di Starknet, karena hal itu mencegah dari menjalankan loop yang tak terbatas pada jaringan. jika Anda menulis sebuah program yang perlu menjalankan sebuah loop, Anda harus melaksanakannya dengan those--available-gas-mount ke nilai yang cukup besar untuk menjalankan program.
tr: Starknet'te konuşlandırılmış akıllı sözleşmeler bağlamında özellikle önemlidir, çünkü ağ üzerinde sonsuz döngüler çalıştırmayı önler. Bir döngüyü çalıştırması gereken bir program yazıyorsanız, programı çalıştırmak için yeterince büyük bir değere ayarlanmış - available-gas bayrağı ile yürütmeniz gerekir.
zh_cn: 这一点在部署在斯塔克内特的智能合同中特别重要,因为它无法在网络上运行无限循环。如果您正在撰写一个需要运行循环的程序,您需要用“有气”的标记来执行它,这个标记的值足以运行程序。

source: Now, try running the same program again, but this time with the `--available-gas` flag set to `200000` instead of `2000000000000`. You will see the program only prints `again!` 3 times before it stops, as it ran out of gas to keep executing the loop.
es: Ahora, intente ejecutar el mismo programa de nuevo, pero esta vez con el `--disponible-gas` conjunto de bandera a `200000` en lugar de `2000000000000`. Verá el programa sólo imprime `de nuevo!'3 veces antes de que se detenga, ya que se quedó sin gas para seguir ejecutando el bucle.
fr: Maintenant, essayez d'exécuter le même programme à nouveau, mais cette fois avec le drapeau `--available-gas` défini à `200000` au lieu de `2000000000000`. Vous verrez le programme imprime seulement `à nouveau!` 3 fois avant qu'il s'arrête, car il est épuisé de gaz pour continuer à exécuter la boucle.
id: Sekarang, coba jalankan program yang sama lagi, tapi kali ini dengan - tersedia-gas yang diatur menjadi 200,000,000, bukan 00.000. Anda akan melihat program hanya mencetak lagi! 3 kali sebelum berhenti, karena kehabisan gas untuk tetap mengeksekusi loop.
tr: Şimdi, aynı programı tekrar çalıştırmayı deneyin, ancak bu sefer - available-gas bayrağı ile 200000000000000 yerine 200000 olarak ayarlanmıştır. Programın sadece döngüyü yürütmeye devam etmek için gazın tükenmesi nedeniyle durmadan önce yine! 3 kez baskı yaptığını göreceksiniz.
zh_cn: 现在,尝试再次运行同一个程序,但这次使用`有气'的旗帜,设定为`200000'而不是`2000000000'。在停止之前,您将看到程序只打印“再次!”3次,因为没有气来持续执行环绕。

source: Fortunately, Cairo also provides a way to break out of a loop using code. You can place the `break` keyword within the loop to tell the program when to stop executing the loop.
es: Afortunadamente, El Cairo también proporciona una manera de salir de un bucle usando código. Puede colocar la palabra clave `break` dentro del bucle para decirle al programa cuándo dejar de ejecutar el bucle.
fr: Heureusement, Cairo fournit également un moyen de sortir d'une boucle en utilisant le code. Vous pouvez placer le mot clé `break` dans la boucle pour indiquer au programme quand arrêter d'exécuter la boucle.
id: Untungnya, Kairo juga menyediakan cara untuk keluar dari loop menggunakan kode. Anda dapat menempatkan kata kunci dalam loop untuk memberitahu program ketika untuk berhenti mengeksekusi loop.
tr: Neyse ki, Kahire ayrıca kod kullanarak bir döngüden çıkmanın bir yolunu da sağlar. Döngüyü çalıştırmayı ne zaman durduracağını söylemek için break anahtar kelimesini döngünün içine yerleştirebilirsiniz.
zh_cn: 幸运的是,开罗也提供了一个使用代码打破循环的方法。 您可以在循环中放置“ 中断” 关键字, 告诉程序何时停止执行循环 。

source: "i = {}"
zh_cn: "一="

source: The `continue` keyword tells the program to go to the next iteration of the loop and to skip the rest of the code in this iteration. Let's add a `continue` statement to our loop to skip the `println!` statement when `i` is equal to `5`.
es: La palabra clave `continuar` le dice al programa que vaya a la siguiente iteración del bucle y que omita el resto del código en esta iteración. Añadamos una declaración `continuar` a nuestro bucle para saltar la declaración `println!` cuando `i` es igual a `5`.
fr: Le mot-clé `continue` indique au programme d'aller à la prochaine itération de la boucle et de sauter le reste du code dans cette itération. Ajoutons une instruction `continue` à notre boucle pour sauter l'instruction `println!` quand `i` est égal à `5`.
id: Kata kunci yang diteruskan mengatakan kepada program untuk pergi ke iterasi berikutnya dari loop dan untuk melewatkan sisa kode dalam iterasi ini.
tr: continue anahtar kelimesi, programın döngünün bir sonraki yinelemesine gitmesini ve bu yinelemedeki kodun geri kalanını atlamasını söyler. i 5'ye eşit olduğunda, döngümüze println! ifadesini atlamak için bir continue ifadesi ekleyelim.
zh_cn: `连续'关键词指示程序转到循环的下一个迭代,并跳过此迭代中代码的其余部分。让我们在循环中添加一个`连续'语句,以跳过`打印!'语句,当`i'等于`5'时。

source: Executing this program will not print the value of `i` when it is equal to `5`.
es: Ejecutar este programa no imprimirá el valor de `i` cuando sea igual a `5`.
fr: L'exécution de ce programme n'impressionnera pas la valeur de `i` lorsqu'elle est égale à `5`.
id: Mengeksekusi program ini tidak akan mencetak nilai dari ▪i· ketika sama dengan 5.
tr: Bu programın çalıştırılması, i değerini 5'ye eşit olduğunda yazdırmaz.
zh_cn: 执行此程序时, 当值等于“ 5” 时, 将不会打印“ i” 值 。

source: Returning Values from Loops
es: Devolviendo valores de Loops
fr: Retour des valeurs des boucles
id: Nilai Kembali dari Loops
tr: Döngülerden Dönen Değerler
zh_cn: 从循环返回值

source: One of the uses of a `loop` is to retry an operation you know might fail, such as checking whether an operation has succeeded. You might also need to pass the result of that operation out of the loop to the rest of your code. To do this, you can add the value you want returned after the `break` expression you use to stop the loop; that value will be returned out of the loop so you can use it, as shown here:
es: Uno de los usos de un `loop` es volver a intentar una operación que usted sabe podría fallar, como comprobar si una operación ha tenido éxito. También puede necesitar pasar el resultado de esa operación fuera del loop al resto de su código. Para hacer esto, puede agregar el valor que desea devolver después de la expresión `break` que utiliza para detener el loop; ese valor será devuelto del loop para que pueda usarlo, como se muestra aquí:
fr: Une des utilisations d'une boucle est de réessayer une opération que vous connaissez pourrait échouer, comme vérifier si une opération a réussi. Vous pourriez également avoir besoin de passer le résultat de cette opération hors de la boucle au reste de votre code. Pour ce faire, vous pouvez ajouter la valeur que vous souhaitez retournée après l'expression `break` que vous utilisez pour arrêter la boucle; cette valeur sera renvoyée hors de la boucle afin que vous puissiez l'utiliser, comme indiqué ici:
id: Salah satu dari penggunaan sebuah oopé adalah untuk mencoba ulang operasi yang Anda tahu mungkin gagal, seperti memeriksa apakah operasi telah berhasil. Anda mungkin juga perlu untuk melewatkan hasil dari operasi yang keluar dari loop ke sisa kode Anda. Untuk melakukan ini, Anda dapat menambahkan nilai yang Anda inginkan kembali setelah ekspresi istirahat yang Anda gunakan untuk menghentikan loop, bahwa nilai akan dikembalikan keluar dari loop sehingga Anda dapat menggunakannya, seperti yang ditunjukkan di sini:
tr: Bir loop'un kullanım alanlarından biri, bir işlemin başarılı olup olmadığını kontrol etmek gibi başarısız olabileceğini bildiğiniz bir işlemi yeniden denemektir. Bu işlemin sonucunu döngüden kodunuzun geri kalanına da geçirmeniz gerekebilir. Bunu yapmak için, döngüyü durdurmak için kullandığınız break ifadesinden sonra geri dönmek istediğiniz değeri ekleyebilirsiniz; Bu değer, burada gösterildiği gibi, döngüden geri döndürülecektir:
zh_cn: `循环'的一个用途是重新尝试您知道可能失败的操作, 例如检查操作是否成功。 您可能需要将操作的结果从循环中传送到您的代码的其余部分。 要做到这一点, 您可以添加您想要在` 中断'表达式后返回的值, 您用它来阻止循环; 该值将被从循环中返回, 这样您就可以使用它, 如这里所示 :

source: "The result is {}"
es: "El resultado es... "
fr: "Le résultat est {}"
id: "Hasilnya adalah [}"
tr: "Sonuç "
zh_cn: "结果就是..."

source: Before the loop, we declare a variable named `counter` and initialize it to `0`. Then we declare a variable named `result` to hold the value returned from the loop. On every iteration of the loop, we check whether the `counter` is equal to `10`, and then add `1` to the `counter` variable. When the condition is met, we use the `break` keyword with the value `counter * 2`. After the loop, we use a semicolon to end the statement that assigns the value to `result`. Finally, we print the value in `result`, which in this case is `20`.
es: Antes del bucle, declaramos una variable llamada `counter` y la inicializamos a `0`. Luego declaramos una variable llamada `resultado` para mantener el valor devuelto del bucle. En cada iteración del bucle, comprobamos si el `counter` es igual a `10`, y luego añadimos `1` a la variable `counter`. Cuando se cumple la condición, usamos la palabra clave `break` con el valor `counter * 2`. Después del bucle, usamos un punto y coma para terminar la instrucción que asigna el valor a `resultado`. Por último, imprimimos el valor en `resultado`, que en este caso es `20`.
fr: Avant la boucle, nous déclarons une variable nommée `counter` et l'initialisons à `0`. Ensuite, nous déclarons une variable nommée `result` pour tenir la valeur retournée de la boucle. À chaque itération de la boucle, nous vérifions si la `counter` est égale à `10`, puis ajoutons `1` à la variable `counter`. Lorsque la condition est remplie, nous utilisons le mot-clé `break` avec la valeur `counter * 2`. Après la boucle, nous utilisons un point-virgule pour terminer l'instruction qui attribue la valeur à `result`. Enfin, nous imprimons la valeur dans `result`, qui dans ce cas est `20`.
id: Sebelum putaran itu, kami menyatakan sebuah variabel yang dinamai \ Ncounter, dan menginisialisasinya menjadi 0;0; kemudian kami menyatakan sebuah variabel bernama ·result. untuk mempertahankan nilai tersebut kembali dari loop. pada setiap pengulangan loop, kami memeriksa apakah angka tersebut sama dengan 0.0.0.0.0.00, dan kemudian menambahkan variabel tersebut ke variabel 0.1; ketika kondisi itu terpenuhi, kita menggunakan kata kunci dengan nilai 2. Setelah putaran, kita menggunakan sebuah semicolon untuk mengakhiri pernyataan yang memberikan nilai yang menunjuk ke angkaults, akhirnya kita mencetak dalam kasus ini.
tr: Döngüden önce, counter adlı bir değişkeni beyan ediyoruz ve 0 olarak başlatıyoruz. Sonra döngüden dönen değeri tutmak için result adlı bir değişkeni ilan ediyoruz. Döngünün her yinelemesinde, counter değeri 10 değerine eşit olup olmadığını kontrol ediyoruz ve sonra counter değişkenine 1 ekliyoruz. Durum karşılandığında, break değerini kullanıyoruz.
zh_cn: 在循环之前,我们宣布一个名为`反'的变量,并将其初始化为`0'。然后我们宣布一个名为`结果'的变量,以保持循环返回的值。在循环的每一次迭代中,我们检查`反'是否等于`10 ',然后在`反'变量中加上`1'。在条件得到满足时,我们使用`突破'关键词,其值为`反'2。在循环之后,我们用分号来结束将值划为`结果'的语句。最后,我们在`结果'中打印了数值,在这种情况下是`20'。

source: Conditional Loops with `while`
es: Loops condicionales con `mientras`
fr: Boucles conditionnelles avec `temps`
id: Kondisional Loops dengan ıwhile
tr: while ile koşullu döngüler
zh_cn: 与`同时'的有条件循环
