Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: An alternative and more idiomatic approach to panic in Cairo would be to use the `panic_with_felt252` function. This function serves as an abstraction of the array-defining process and is often preferred due to its clearer and more concise expression of intent. By using `panic_with_felt252`, developers can panic in a one-liner by providing a `felt252` error message as an argument, making the code more readable and maintainable.
es: Un enfoque alternativo y más idiomático del pánico en El Cairo sería utilizar la función `panic_with_felt252`. Esta función sirve como una abstracción del proceso de definición de la matriz y a menudo se prefiere debido a su expresión de intención más clara y concisa. Al utilizar `panic_with_felt252`, los desarrolladores pueden entrar en pánico en una línea única proporcionando un mensaje de error `felt252` como argumento, haciendo que el código sea más legible y mantenible.
fr: Une approche alternative et plus idiomatique de la panique au Caire serait d'utiliser la fonction `panic_with_felt252`. Cette fonction sert d'abstraction du processus de définition du tableau et est souvent préférée en raison de son expression d'intention plus claire et plus concise. En utilisant `panic_with_felt252`, les développeurs peuvent paniquer dans un liner unique en fournissant un message d'erreur `felt252` comme argument, rendant le code plus lisible et plus durable.
id: Sebuah pendekatan alternatif dan lebih terdiomatitik untuk panik di Kairo akan menggunakan ekspresi yang lebih jelas dan lebih ringkas dari maksud. Dengan menggunakan fungsi_felt252. Fungsi ini berfungsi sebagai abstraksi dari proses penyelenggara array dan sering kali lebih disukai karena lebih jelas dan lebih ringkas ekspresi maksud. Dengan menggunakan ▪panic_felt2523, pengembang dapat panik dalam satu-liner dengan memberikan sebuah pesan felt25 sesaat sebagai argumen, membuat kode yang dapat dibaca dan dipertahankan.
tr: Kahire'de panik için alternatif ve daha deyimsel bir yaklaşım, panic_with_felt252 fonksiyonunu kullanmak olacaktır. Bu işlev, dizi tanımlama işleminin bir soyutlaması olarak işlev görür ve daha net ve daha özlü niyet ifadesi nedeniyle sıklıkla tercih edilir. panic_with_felt252 kullanarak, geliştiriciler bir felt252 hata mesajı okunabilir argümanı sağlayarak tek satırda panikleyebilirler.
zh_cn: 开罗的另一种更普通的恐慌应对办法是使用`panic_with_felt252'功能,作为阵列定义过程的抽象,由于表达的意向更清楚、更简洁,这一功能往往更可取。通过使用`panic_with_felt252 ',开发商可以通过提供“felt252”错误信息作为论据,在单行中制造恐慌,使代码更易读、更便于维护。

source: Let's consider an example:
es: Consideremos un ejemplo:
fr: Prenons un exemple :
id: Mari kita perhatikan sebuah contoh:
tr: Bir örnek düşünelim:
zh_cn: 举个例子:

source: Executing this program will yield the same error message as before. In that case, if there is no need for an array and multiple values to be returned within the error, `panic_with_felt252` is a more succinct alternative.
es: Ejecutar este programa producirá el mismo mensaje de error que antes. En ese caso, si no hay necesidad de devolver un array y varios valores dentro del error, `panic_with_felt252` es una alternativa más sucinta.
fr: Exécuter ce programme donnera le même message d'erreur qu'avant. Dans ce cas, s'il n'est pas nécessaire de renvoyer un tableau et plusieurs valeurs dans l'erreur, `panic_with_felt252` est une alternative plus succincte.
id: Menjalankan program ini akan menghasilkan pesan galat yang sama seperti sebelumnya. Dalam hal ini, jika tidak ada kebutuhan untuk sebuah array dan beberapa nilai yang akan dikembalikan dalam kesalahan, ·panic_with_felt252 TM adalah alternatif yang lebih singkat.
tr: Bu programın çalıştırılması daha önce olduğu gibi aynı hata iletisini verecektir. Bu durumda, bir dizi ve birden fazla değerin hata içinde döndürülmesine gerek yoksa, panic_with_felt252 daha kısa bir alternatiftir.
zh_cn: 执行此程序将产生与以前相同的错误消息。 在此情况下, 如果在错误中不需要返回一个数组和多个值, `panic_ without_felt252' 是更简洁的替代方案 。

source: `panic!` Macro
es: `Pánico!` Macro
fr: "panique!" Macro
id: Makro
tr: panic! Makro
zh_cn: `西班牙人!'宏观

source: `panic!` macro can be really helpful. The previous example returning the error code `2` shows how convenient `panic!` macro is. There is no need to create an array and pass it as an argument like with the `panic` function.
es: `panic!` macro puede ser muy útil. El ejemplo anterior que devuelve el código de error `2` muestra lo conveniente que es `panic!` macro. No hay necesidad de crear un array y pasarlo como un argumento como con la función `panic`.
fr: `panic!` macro peut être vraiment utile. L'exemple précédent renvoyant le code d'erreur `2` montre à quel point `panic!` macro est pratique. Il n'est pas nécessaire de créer un tableau et de le passer comme un argument comme avec la fonction `panic`.
id: makro dapat sangat membantu. Contoh sebelumnya mengembalikan kode kesalahan menunjukkan betapa nyamannya makro.
tr: panic! makrosu gerçekten yardımcı olabilir. 2 hata kodunu döndüren önceki örnek, panic! makrosunun ne kadar kullanışlı olduğunu gösterir. Bir dizi oluşturmaya ve panic fonksiyonunda olduğu gibi bir argüman olarak geçirmeye gerek yoktur.
zh_cn: `panic!' 宏确实有用, 返回错误代号` 2' 的上一个示例显示“panic!' 宏多么方便。 不需要创建阵列, 将其作为“ panic” 函数的参数传递 。

source: Unlike the `panic_with_felt252` function, using `panic!` allows the input, which is ultimately the panic error, to be a literal longer than 31 bytes. This is because `panic!` takes a string as a parameter. For example, the following line of code will successfully compile:
es: A diferencia de la función `panic_with_felt252`, usando `panic!` permite que la entrada, que es en última instancia el error de pánico, sea un literal más de 31 bytes. Esto es porque `panic!` toma una cadena como parámetro. Por ejemplo, la siguiente línea de código se compilará con éxito:
fr: Contrairement à la fonction `panic_with_felt252`, l'utilisation de `panic!` permet à l'entrée, qui est finalement l'erreur de panique, d'être littéralement plus de 31 octets. C'est parce que `panic!` prend une chaîne comme paramètre. Par exemple, la ligne de code suivante sera compilée avec succès:
id: Tidak seperti "panic_with_felt252," menggunakan åpanic! Ijinkan masukan, yang pada akhirnya kesalahan panik, untuk menjadi literal lebih lama dari 31 byte. Ini karena åpanic! Ambil string sebagai parameter. Sebagai contoh, baris berikut kode akan berhasil dikompilasi:
tr: panic_with_felt252 işlevinden farklı olarak, panic! kullanarak, sonuçta panik hatası olan girdinin 31 bayttan daha uzun olmasını sağlar. Bunun nedeni, panic! bir dizeyi parametre olarak almasıdır. Örneğin, aşağıdaki kod satırı başarıyla derleyecektir:
zh_cn: 与`panic_with_felt252' 函数不同的是,使用`panic!' 允许输入(即最终的恐慌错误)在字面上超过31字节。这是因为`panic!'将字符串作为一个参数。例如,以下的代码行将成功编译 :

source: "the error for panic! macro is not limited to 31 characters anymore"
es: "el error para el pánico! macro no se limita a 31 caracteres más"
fr: "l'erreur de panique! macro n'est plus limitée à 31 caractères"
id: "kesalahan untuk panik! makro tidak terbatas pada 31 karakter lagi"
tr: "Panik hatası! makro artık 31 karakterle sınırlı değil"
zh_cn: "惊慌的错误! 宏不再局限于31个字符"

source: `nopanic` Notation
es: Notación `nopánica`
fr: Notation «nopanique»
id: Notasi ·nopanicé
tr: nopanic Notasyonu
zh_cn: `无西班牙人'标记

source: You can use the `nopanic` notation to indicate that a function will never panic. Only `nopanic` functions can be called in a function annotated as `nopanic`.
es: Puede utilizar la notación `nopánica` para indicar que una función nunca entrará en pánico. Sólo las funciones `nopánicas` se pueden llamar en una función anotada como `nopánica`.
fr: Vous pouvez utiliser la notation `nopanic` pour indiquer qu'une fonction ne paniquera jamais. Seules les fonctions `nopanic` peuvent être appelées dans une fonction annotée comme `nopanic`.
id: Anda dapat menggunakan notasi gnopanic untuk menunjukkan bahwa sebuah fungsi tidak akan pernah panik.
tr: nopanic notasyonunu bir fonksiyonun asla paniklemeyeceğini belirtmek için kullanabilirsiniz. Sadece nopanic fonksiyonları nopanic olarak belirtilen bir fonksiyonda çağrılabilir.
zh_cn: 您可以使用“空泛”符号表示函数永远不会惊慌,只有“空泛”函数才可以在附加注释的“空泛”函数中调用“空泛”函数。

source: This function will always return `42` and is guaranteed to never panic. Conversely, the following function is not guaranteed to never panic:
es: Esta función siempre devolverá `42` y se garantiza que nunca entre en pánico. Por el contrario, la siguiente función no está garantizada a nunca entrar en pánico:
fr: Cette fonction retournera toujours `42` et est garantie de ne jamais paniquer. Inversement, la fonction suivante n'est pas garantie de ne jamais paniquer:
id: Fungsi ini akan selalu kembali, dan dijamin tidak akan pernah panik.
tr: Bu fonksiyon her zaman 42 geri dönecektir ve asla panik yapmaması garanti edilir. Tersine, aşağıdaki fonksiyonun asla paniklememesi garanti edilmez:
zh_cn: 此函数将总是返回'42 ',并且保证永远不惊慌。 相反,以下函数不能保证永远不惊慌:

source: If you try to compile this function that includes code that may panic, you will get the following error:
es: Si intenta compilar esta función que incluye código que puede entrar en pánico, obtendrá el siguiente error:
fr: Si vous essayez de compiler cette fonction qui inclut le code qui peut paniquer, vous obtiendrez l'erreur suivante:
id: Jika Anda mencoba mengkompilasi fungsi ini yang mencakup kode yang mungkin panik, Anda akan mendapat kesalahan berikut:
tr: Panikleyebilecek kod içeren bu işlevi derlemeye çalışırsanız, aşağıdaki hatayı alırsınız:
zh_cn: 如果您试图编译包含可能恐慌的代码的此函数, 就会有以下错误:

source: Note that there are two functions that may panic here, `assert` and equality with `==`. We usually don't use `assert` function in practice and use `assert!` macro instead. We will discuss `assert!` macro in more detail in the [Testing Cairo Programs](./ch10-01-how-to-write-tests.md#checking-results-with-the-assert-macro) chapter.
es: Tenga en cuenta que hay dos funciones que pueden entrar en pánico aquí, `asertar` y la igualdad con ` `. Usualmente no usamos la función `asertar` en la práctica y utilizar `asertar!'macro en su lugar. Discutiremos `asertar!'macro en más detalle en el capítulo [Programas de prueba de El Cairo](./ch10-01-how-to-write-tests.md#checking-resultados-with-the-asertar-macro).
fr: Notez qu'il y a deux fonctions qui peuvent paniquer ici, `assert` et l'égalité avec `==`. Nous n'utilisons généralement pas `assert` fonction dans la pratique et utiliser `assert!` macro à la place. Nous allons discuter `assert!` macro plus en détail dans le chapitre [Testing Cairo Programs](../ch10-01-how-to-write-tests.md#checking-results-with-the-assert-macro).
id: Perhatikan bahwa ada dua fungsi yang mungkin panik di sini, misro sebagai gantinya. kita akan membahas makro yang lebih detail di bab [Program Kairo]./ch10-01-how-to-tests.md# checking-reult-with-esert-macro).
tr: Burada panikleyebilecek iki fonksiyon olduğunu unutmayın, assert ve == ile eşitlik. Genellikle pratikte assert işlevini kullanmayız ve bunun yerine assert! makrosunu kullanırız. [Testing Cairo Programs](./ch10-01-how-to-write-tests.md#checking-results-the-the-the-the-the-
zh_cn: 请注意,这里可能有两个功能,即`资产'和`平等'。我们通常不在实践中使用`资产'功能,而是使用`资产!'宏观。我们将在[试验开罗方案](./ch10-01-how-to-writ-test-tests. md# checking-results-with-assert-macro)章节中更详细地讨论`资产!'宏观。

source: `panic_with` Attribute
es: Atributo `panic_with`
fr: `panic_with` Attribut
id: Panik_dengan Atribut
tr: panic_with Öznitelik
zh_cn: `带有`属性的`西班牙语 '

source: You can use the `panic_with` attribute to mark a function that returns an `Option` or `Result`. This attribute takes two arguments, which are the data that is passed as the panic reason as well as the name for a wrapping function. It will create a wrapper for your annotated function which will panic if the function returns `None` or `Err`, with the given data as the panic error.
es: Puede utilizar el atributo `panic_with` para marcar una función que devuelve una `Opción` o `Resultado`. Este atributo toma dos argumentos, que son los datos que se pasan como la razón de pánico, así como el nombre de una función de envoltura. Creará un envoltorio para su función anotada que entrará en pánico si la función devuelve `None` o `Err`, con los datos dados como el error de pánico.
fr: Vous pouvez utiliser l'attribut `panic_with` pour marquer une fonction qui renvoie une `Option` ou `Result`. Cet attribut prend deux arguments, qui sont les données qui sont passées comme la raison de panique ainsi que le nom d'une fonction d'emballage. Il créera un wrapper pour votre fonction annotée qui paniquera si la fonction retourne `Aucun` ou `Err`, avec les données données données comme erreur de panique.
id: Anda dapat menggunakan atribut åpanic_with sekelompok fungsi untuk menandai fungsi yang kembali ke fungsi awal atau result. Atribut ini membutuhkan dua argumen, yang adalah data yang lewat sebagai alasan panik serta nama untuk fungsi pembungkus. akan menciptakan pembungkus untuk fungsi yang telah dienotasikan Anda yang akan panik jika fungsi kembali atau tidak ada lagi argumen, dengan data yang diberikan sebagai kesalahan panik.
tr: panic_with özniteliğini, bir Option veya Result döndüren bir işlevi işaretlemek için kullanabilirsiniz. Bu öznitelik, panik nedeni olarak geçen veriler ve bir sarma işlevinin adı olan iki argüman alır. Fonksiyon, panik hatası olarak verilen verilerle None veya Err döndürdüğünde paniklenecek olan açıklamalı işleviniz için bir ambalaj oluşturacaktır.
zh_cn: 您可以使用“ panic_ with'属性” 来标记返回“ option” 或“Result” 的函数。 此属性需要两个参数, 即作为恐慌原因传递的数据以及包装函数的名称。 这将为附加说明的函数创建一个折叠符, 如果函数返回“ 无” 或“ 错误”, 且给定的数据为恐慌错误, 则会恐慌 。

source: Example:
es: Ejemplo
fr: Exemple :
id: Contoh:
tr: Örnek:
zh_cn: 示例:

source: // this returns None
es: // esto devuelve None
fr: // ce retour n'est pas
id: # # This return None
tr: // bu None değerini gönderir
zh_cn: / 此返回 / 返回无

source: // this panics with 'value is 0'
es: // esto entra en pánico con 'valor es 0'
fr: // cette panique avec 'valeur est 0'
id: /Ini panik dengan 'nilai adalah 0'
tr: // bu 'değer 0' ile panikler
zh_cn: / 这种惊慌与“ 值为 0 ” 。

source: {{#quiz ../quizzes/ch09-01-unrecoverable-errors-with-panic.toml}}
es: quiz../quizzes/ch09-01-incobrable-errors-with-panic.toml
fr: {{#quiz../quizes/ch09-01-errors-non récupérables-with-panic.toml}}
id: {{#quiz../quizzes/ch09-01-uncoverable-errors-with-panic.toml}} ]
zh_cn: Quiz./quizzes/ch09-01-无法复原的用西班牙语的毒气.toml_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________

source: Recoverable Errors with `Result`
es: Errores recuperables con `Resultado`
fr: Erreurs récupérables avec `Résultat`
id: Kesalahan Yang Dapat Dipulihkan dengan CERINTA
tr: Result ile Kurtarılabilir Hatalar
zh_cn: “Result”的可恢复错误

source: Most errors aren’t serious enough to require the program to stop entirely. Sometimes, when a function fails, it’s for a reason that you can easily interpret and respond to. For example, if you try to add two large integers and the operation overflows because the sum exceeds the maximum representable value, you might want to return an error or a wrapped result instead of causing undefined behavior or terminating the process.
es: La mayoría de los errores no son lo suficientemente graves como para requerir que el programa se detenga por completo. A veces, cuando una función falla, es por una razón que se puede interpretar y responder fácilmente. Por ejemplo, si intenta añadir dos números enteros grandes y los desbordamientos de la operación porque la suma excede el valor máximo representable, es posible que desee devolver un error o un resultado envuelto en lugar de causar un comportamiento indefinido o terminar el proceso.
fr: La plupart des erreurs ne sont pas assez graves pour exiger que le programme s'arrête complètement. Parfois, quand une fonction échoue, elle s'exécute pour une raison que vous pouvez facilement interpréter et répondre à. Par exemple, si vous essayez d'ajouter deux grands entiers et l'opération déborde parce que la somme dépasse la valeur représentative maximale, vous pourriez vouloir retourner une erreur ou un résultat enveloppé au lieu de causer un comportement non défini ou de terminer le processus.
id: Kebanyakan kesalahan tidak cukup serius untuk menghentikan program ini. Kadang-kadang, ketika sebuah fungsi gagal, itu karena alasan bahwa Anda dapat dengan mudah menafsirkan dan merespon. Sebagai contoh, jika Anda mencoba untuk menambahkan dua bilangan bulat besar dan operasi overflows karena jumlah melampaui nilai yang mewakili maksimum, Anda mungkin ingin mengembalikan kesalahan atau hasil yang dibungkus daripada menyebabkan perilaku yang tidak jelas atau mengakhiri proses.
tr: Çoğu hata, programın tamamen durmasını gerektirecek kadar ciddi değildir. Bazen, bir işlev başarısız olduğunda, kolayca yorumlayabileceğiniz ve yanıtlayabileceğiniz bir nedenden dolayıdır. Örneğin, iki büyük tamsayı eklemeye çalışırsanız ve işlem, toplamın maksimum temsil edilebilir değeri aştığı için taşarsa, tanımsız davranışa neden olmak veya süreci sonlandırmak yerine bir hata veya sarılmış bir sonuç döndürmek isteyebilirsiniz.
zh_cn: 大多数错误并不严重,以至于要求程序完全停止。 有时,当函数失败时,它的原因很容易解释和回应。 例如,如果试图添加两个大整数和操作溢出,因为数字超过最大可代表值,你可能想要返回错误或包包的结果,而不是造成不确定的行为或终止过程。

source: The `Result` Enum
es: El " Enum de resultados "
fr: Le thème "Résultat"
id: Enum (Enam).
tr: Result Enum
zh_cn: `成果'元体

source: Recall from [Generic data types](./ch08-01-generic-data-types.md#enums) section in Chapter 8 that the `Result` enum is defined as having two variants, `Ok` and `Err`, as follows:
es: Recordemos de [los tipos de datos genéricos](./ch08-01-genéricos-tipos de datos.md#enums) en el capítulo 8 que el `Resultado` enum se define como tener dos variantes, `Ok` y `Err`, como sigue:
fr: Rappel de la section [types de données génériques](./ch08-01-generic-data-types.md#enums) du chapitre 8 que l'enum `Résultat` est défini comme ayant deux variantes, `Ok` et `Err`, comme suit:
id: Recall from [Genic tipe data]. /ch08-01-generic-data-types.ms.md#enums) dalam Bab 8 bahwa enum enum resolte didefinisikan sebagai memiliki dua varians, ▪Ok Chewier, sebagai berikut:
tr: Bölüm 8'deki [Generic data types](./ch08-01-generic-data-types.md#enums) bölümünden Result enum'un aşağıdaki gibi iki varyanta sahip olduğu tanımlanmaktadır:
zh_cn: 从第8章[地球数据类型](./ch08-01-generic-data-types.md#enums)一节中回顾,`Result' enum的定义是,`Result' enum有两个变式,`Ok'和`Err ',如下:

source: The `ResultTrait`
es: El `Trait de resultados`
fr: Le 'RésultatTraitement'
tr: ResultTrait
zh_cn: `Result Trait '

source: The `ResultTrait` trait provides methods for working with the `Result<T, E>` enum, such as unwrapping values, checking whether the `Result` is `Ok` or `Err`, and panicking with a custom message. The `ResultTraitImpl` implementation defines the logic of these methods.
es: El rasgo `ResultTrait` ofrece métodos para trabajar con el `Result<T, E® enum, tales como desenvolver los valores, comprobar si el `Result` es `Ok` o `Err`, y entrar en pánico con un mensaje personalizado.
fr: Le caractère `ResultTrait` fournit des méthodes pour travailler avec le `Result<T, E>` enum, comme les valeurs de décomptage, vérifier si le `Result` est `Ok` ou `Err`, et paniquer avec un message personnalisé. L`implémentation `ResultTraitImpl` définit la logique de ces méthodes.
id: Sifat ResultTrait menyediakan metode-metode untuk bekerja dengan result<T, E>, seperti nilai-nilai unwraping, memeriksa apakah implementasi resolult adalah oká atau err, dan panik dengan pesan kustom.
tr: ResultTrait özelliği, ResultT, E> enum ile çalışmak için Result'nin Ok veya Err olup olmadığını kontrol etmek ve özel bir mesajla paniklemek gibi yöntemler sağlar. ResultTraitImpl uygulaması bu yöntemlerin mantığını tanımlar.
zh_cn: `ResultTrait'特性提供了与`Result<T, E enum'合作的方法,例如解开数值,检查`Result'是`Ok'或`Err ',用自定义信息惊慌失措。

source: The `expect` and `unwrap` methods are similar in that they both attempt to extract the value of type `T` from a `Result<T, E>` when it is in the `Ok` variant. If the `Result` is `Ok(x)`, both methods return the value `x`. However, the key difference between the two methods lies in their behavior when the `Result` is in the `Err` variant. The `expect` method allows you to provide a custom error message (as a `felt252` value) that will be used when panicking, giving you more control and context over the panic. On the other hand, the `unwrap` method panics with a default error message, providing less information about the cause of the panic.
es: Los métodos `esperar` y `unwrap` son similares en el sentido de que ambos tratan de extraer el valor del tipo `T` de un `Resultado<T, E` cuando está en la variante `Ok`. Si el `Resultado` es `Ok(x)`, ambos métodos devuelven el valor `x`. Sin embargo, la diferencia clave entre los dos métodos reside en su comportamiento cuando el `Resultado` está en la variante `Err`. El método `esperar` le permite proporcionar un mensaje de error personalizado (como un valor `felt252`) que se utilizará al entrar en pánico, dándole más control y contexto sobre el pánico. Por otra parte, el método `unwrap` entra en pánico con un mensaje de error predeterminado, proporcionando menos información sobre la causa del pánico.
fr: Les méthodes `expect` et `unwrap` sont similaires en ce sens qu'elles tentent toutes deux d'extraire la valeur du type `T` d'un `Résultat<T, E>` quand il est dans la variante `Ok`. Si le `Résultat` est `Ok(x)`, les deux méthodes retournent la valeur `x`. Cependant, la différence clé entre les deux méthodes réside dans leur comportement lorsque le `Résultat` est dans la variante `Err`. La méthode `expect` vous permet de fournir un message d'erreur personnalisé (en tant que valeur `felt252`) qui sera utilisé lors de la panique, vous donnant plus de contrôle et de contexte sur la panique. D'autre part, la méthode `unwrap` panique avec un message d'erreur par défaut, fournissant moins d'informations sur la cause de la panique.
id: Metode-metode ini mirip dengan metode-metode yang mereka berdua coba mengekstrak nilai dari tipe tersebut, dari sebuah result <T, E> ketika berada dalam varian åok. Jika metode yang mereka berdua coba ekstrak adalah åOkánax), kedua metode itu mengembalikan nilai tersebut. Namun, perbedaan kunci di antara dua metode tersebut terletak pada perilaku mereka ketika bencana berada dalam variabel tersebut.
tr: Expect ve unwrap yöntemleri, her ikisi de T tipinin değerini ResultT, E> Ok varyantında olduğunda eldeki bir hatadan çıkarmaya çalıştıklarında benzerdir. Result, Ok(x) ise, her iki yöntem de x değerini döndürür. Ancak, iki yöntem arasındaki anahtar fark, davranışlarında yatar.
zh_cn: `预期'和`unbrap'方法相似,因为它们都试图从`Result<T,E'在`Ok'变方中提取`T'类的价值,如果`Result'是`Ok(x) ',两种方法都返回`x'值。但是,这两种方法之间的关键区别在于,当`Result'在`错误'变方中时,它们的行为。`预期'方法允许你提供自定义错误信息(作为`felt252'值),在恐慌时使用该信息,使你对恐慌有更多的控制权和上下文。另一方面,`unwack`方法的恐慌以默认错误信息返回。
