Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: **Warning:** This is different from the EVM where a `staticcall` opcode is provided, which prevents storage modifications in the current context and subcontexts. Hence developers **should not** have the assumption that calling a view function on another contract cannot modify the state.
es: **Advertencia:** Esto es diferente de la EVM donde se proporciona un opcode `staticcall`, que evita modificaciones de almacenamiento en el contexto actual y subcontextos. Por lo tanto, los desarrolladores **no deben** tener la suposición de que llamar a una función de vista en otro contrato no puede modificar el estado.
fr: **Attention :** Ceci est différent de l'EVM où un opcode `staticcall` est fourni, ce qui empêche les modifications de stockage dans le contexte et les sous-contextes actuels. Par conséquent, les développeurs ** ne devraient pas** avoir l'hypothèse que l'appel d'une fonction de vue sur un autre contrat ne peut pas modifier l'état.
id: ** Peringatan:** Ini berbeda dari EVM dimana opkode opkode ·staticcall telah disediakan, yang mencegah modifikasi penyimpanan dalam konteks dan subkonteks saat ini. Oleh karena itu pengembang ** seharusnya tidak memiliki asumsi bahwa memanggil fungsi tampilan pada kontrak lain tidak dapat memodifikasi negara.
tr: **Uyarı:** Bu, mevcut bağlam ve alt metinlerdeki depolama değişikliklerini engelleyen bir staticcall opcode'un sağlandığı EVM'den farklıdır. Bu nedenle geliştiriciler ** başka bir sözleşmede bir görünüm fonksiyonunu çağırmanın durumu değiştiremeyeceği varsayımına sahip olmamalıdır.
zh_cn: ** 警告:** 与提供“静态呼叫”代码的EVM不同,该代码防止在目前的上下文和子文本中修改储存,因此开发商** 不应** 假定在另一合同上调用查看功能不能改变状态。

source: Standalone Public Functions
es: Funciones públicas independientes
fr: Fonctions publiques autonomes
id: Standar Fungsi Publik
tr: Bağımsız Kamu Fonksiyonları
zh_cn: 独立公共职能

source: It is also possible to define public functions outside of an implementation of a trait, using the `#[external(v0)]` attribute. Doing this will automatically generate the corresponding ABI, allowing these standalone public functions to be callable by anyone from the outside. These functions can also be called from within the contract just like any function in Starknet contracts. The first parameter must be `self`.
es: También es posible definir las funciones públicas fuera de la implementación de un rasgo, usando el atributo "[external(v0)]`. Hacer esto generará automáticamente el ABI correspondiente, permitiendo que estas funciones públicas independientes puedan ser llamadas por cualquier persona desde el exterior. Estas funciones también pueden ser llamadas desde dentro del contrato como cualquier función en los contratos Starknet. El primer parámetro debe ser "self".
fr: Il est également possible de définir les fonctions publiques en dehors d'une implémentation d'un trait, en utilisant l'attribut `#[external(v0)]`. Cela générera automatiquement l'ABI correspondant, permettant à ces fonctions publiques autonomes d'être appelables par n'importe qui de l'extérieur. Ces fonctions peuvent également être appelées à partir du contrat comme n'importe quelle fonction dans les contrats Starknet. Le premier paramètre doit être `self`.
id: Ada juga kemungkinan untuk mendefinisikan fungsi publik di luar implementasi suatu sifat, dengan menggunakan atribut [externtal Allahv0]]. Melakukan ini akan secara otomatis menghasilkan ABI yang sesuai, memungkinkan fungsi publik mandiri ini dapat dipanggil oleh siapapun dari luar. Fungsi ini juga dapat dipanggil dari dalam kontrak sama seperti setiap fungsi dalam kontrak Starknet. Parameter pertama harus menjadi dirinya sendiri.
tr: #[external(v0)] özniteliğini kullanarak bir özelliğin uygulanması dışında kamu işlevlerini tanımlamak da mümkündür. Bunu yapmak otomatik olarak karşılık gelen ABI'yi oluşturacak ve bu bağımsız kamu işlevlerinin dışarıdan herkes tarafından aranabilir olmasını sağlayacaktır. Bu işlevler, Starknet sözleşmelerindeki herhangi bir işlev gibi sözleşmenin içinden de çağrılabilir. İlk parametre self olmalıdır.
zh_cn: 也可以使用“[外部(v0)] ”属性,在特性实施之外界定公共职能。这样做将自动产生相应的ABI,使这些独立的公共职能可由外部任何人调用,这些职能也可以像斯塔克内特合同中的任何功能一样,在合同中被调用。第一个参数必须是“自我”。

source: Here, we define a standalone `get_contract_name` function outside of an impl block:
es: Aquí, definimos una función independiente `get_contract_name` fuera de un bloque impl:
fr: Ici, nous définissons une fonction autonome `get_contract_name` en dehors d'un bloc impl:
id: Di sini, kita mendefinisikan fungsi standaronal \u200b\u200b\u200\u200\u200b\u200\u200\u200\u200\u200\u200b\u200\u200\u200\u200\u200\u200\u200\u200\u200\u200) \an\an\u200\u200\u1\u200\an:
tr: Burada, bir impl bloğunun dışında bağımsız bir get_contract_name işlevi tanımlıyoruz:
zh_cn: 在此, 我们定义一个独立“ get_ contract_ name” 函数, 其值不在此列 :

source: 3. Private Functions
es: 3. Funciones privadas
fr: 3. Fonctions privées
id: 3. Fungsi Pribadi
tr: 3. Özel Fonksiyonlar
zh_cn: 3. 私人职能

source: Functions that are not defined with the `#[external(v0)]` attribute or inside a block annotated with the `#[abi(embed_v0)]` attribute are private functions (also called internal functions). They can only be called from within the contract.
es: Las funciones que no se definen con el atributo «[external(v0)]» o dentro de un bloque anotado con el atributo «[abi(embed_v0)]» son funciones privadas (también llamadas funciones internas).
fr: Les fonctions qui ne sont pas définies avec l'attribut `#[external(v0)]` ou à l'intérieur d'un bloc annoté avec l'attribut `#[abi(embed_v0)]` sont des fonctions privées (également appelées fonctions internes).
id: Fungsi yang tidak didefinisikan dengan atribut ·[external[v0)]] atau di dalam sebuah blok yang dianotasi dengan atribut ·abiánmbed_v0] adalah fungsi-fungsi privat (juga disebut fungsi internal). Mereka hanya dapat dipanggil dari dalam kontrak.
tr: #[external(v0)] özniteliği ile tanımlanmayan veya #[abi(embed_v0)]] özniteliği ile belirtilen bir bloğun içindeki fonksiyonlar özel fonksiyonlardır (iç fonksiyonlar olarak da adlandırılır). Sadece sözleşmenin içinden çağrılabilirler.
zh_cn: 未以 [extern(v0)] 属性定义的函数或以 [abi(embed_v0)] 属性附加注释的区块内的函数为私有函数(也称为内部函数),只能从合同中调用。

source: They can be grouped in a dedicated impl block (e.g., in components, to easily import internal functions all at once in the embedding contracts) or just be added as free functions inside the contract module. Note that these 2 methods are equivalent. Just choose the one that makes your code more readable and easy to use.
es: Pueden agruparse en un bloque de impl dedicado (por ejemplo, en componentes, para importar fácilmente funciones internas de una sola vez en los contratos de incrustación) o simplemente añadirse como funciones gratuitas dentro del módulo de contrato. Tenga en cuenta que estos 2 métodos son equivalentes. Simplemente elija el que hace que su código sea más legible y fácil de usar.
fr: Ils peuvent être regroupés dans un bloc impl dédié (par exemple, dans des composants, pour importer facilement des fonctions internes toutes à la fois dans les contrats d'intégration) ou simplement être ajoutés en tant que fonctions libres à l'intérieur du module de contrat. Notez que ces 2 méthodes sont équivalentes. Choisissez simplement celle qui rend votre code plus lisible et facile à utiliser.
id: Mereka dapat dikelompokkan dalam blok impl yang didedikasikan (misalnya, dalam komponen, untuk dengan mudah mengimpor fungsi internal sekaligus dalam kontrak embedding) atau hanya ditambahkan sebagai fungsi bebas dalam modul kontrak. Perlu dicatat bahwa 2 metode ini setara. Pilih satu yang membuat kode Anda lebih mudah dibaca dan mudah digunakan.
tr: Özel bir impl bloğunda gruplandırılabilirler (örneğin, bileşenlerde, gömme sözleşmelerinde dahili işlevleri kolayca içe aktarmak için) veya sadece sözleşme modülü içinde ücretsiz işlevler olarak eklenebilirler. Bu 2 yöntemin eşdeğer olduğunu unutmayın. Kodunuzu daha okunabilir ve kullanımı kolay hale getiren birini seçin.
zh_cn: 它们可以分组在一个专用的内嵌块中(例如,在组件中,在嵌入合同中可以轻松地同时输入全部内部功能),也可以在合同模块中作为自由功能添加。请注意,这2种方法是等效的。只需选择一种方法,使您的代码更容易读取和容易使用。

source: Wait, what is this `#[generate_trait]` attribute? Where is the trait definition for this implementation? Well, the `#[generate_trait]` attribute is a special attribute that tells the compiler to generate a trait definition for the implementation block. This allows you to get rid of the boilerplate code of defining a trait with generic parameters and implementing it for the implementation block. With this attribute, we can simply define the implementation block directly, without any generic parameter, and use `self: ContractState` in our functions.
es: Espera, ¿cuál es este atributo?[generate_trait]`? ¿Dónde está la definición de rasgo para esta implementación? Bueno, el atributo?[generate_trait]` es un atributo especial que le dice al compilador que genere una definición de rasgo para el bloque de implementación. Esto le permite deshacerse del código de la placa de caldera de definir un rasgo con parámetros genéricos e implementarlo para el bloque de implementación. Con este atributo, podemos simplemente definir el bloque de implementación directamente, sin ningún parámetro genérico, y utilizar `self: ContractState` en nuestras funciones.
fr: Wait, qu'est-ce que cet attribut `#[generate_trait]`? Où est la définition du caractère pour cette implémentation? Eh bien, l'attribut `#[generate_trait]` est un attribut spécial qui indique au compilateur de générer une définition du caractère pour le bloc d'implémentation. Cela vous permet de vous débarrasser du code boelorplate de définir un caractère avec des paramètres génériques et de le mettre en œuvre pour le bloc d'implémentation. Avec cet attribut, nous pouvons simplement définir le bloc d'implémentation directement, sans aucun paramètre générique, et utiliser `self: ContractState` dans nos fonctions.
id: Tunggu, apa atribut khusus ini yang memberitahu kompiler untuk menghasilkan definisi sifat untuk blok implementasi ini? Di mana definisi sifat untuk implementasi ini? Nah, yang Nah, yang [generate_trait] terjadi adalah atribut khusus yang memberitahu kompiler untuk menghasilkan definisi sifat untuk blok implementasi. Hal ini memungkinkan Anda untuk menyingkirkan kode tempalate dari mendefinisikan sifat dengan parameter generik dan mengimplementasikannya untuk blok implementasi. Dengan atribut ini, kita hanya dapat mendefinisikan blok implementasi langsung, tanpa parameter umum, dan gunakan sendiri: KontrakStasi dalam fungsi kita.
tr: Bekle, bu #[genate_trait] özniteliği nedir? Bu uygulama için özellik tanımı nerede? Peki, #[genate_trait] özniteliği, derleyiciye uygulama bloğu için bir özellik tanımı oluşturmasını söyleyen özel bir özniteliktir. Bu, genel parametrelerle bir özellik tanımlamanın ve uygulama bloğu için uygulamanın kazan plakası kodundan kurtulmanızı sağlar. Bu öznitelikle, herhangi bir parametreyi doğrudan kullanmadan tanımlayabiliriz.
zh_cn: 等等,这是什么 {{{[generate_trait_trait} 的属性? 此执行的特性定义在哪里?{{{}}}}} 属性是一个特殊属性,它告诉汇编者为执行区块生成特性定义。这可以使您摆脱用于定义带有通用参数的特性并用于执行区块的锅炉牌代码。有了这一属性,我们可以直接定义执行区块,不使用任何通用参数,并在我们的职能中使用`自我:合同状态'。

source: The `#[generate_trait]` attribute is mostly used to define private impl blocks. It might also be used in addition to `#[abi(per_item)]` to define the various entrypoints of a contract (see [next section](./ch14-02-contract-functions.md#4-abiper_item-attribute)).
es: El atributo "[generate_trait]` se utiliza principalmente para definir bloques de impl privados. También puede utilizarse además de "[abi(per_item)]` para definir los diversos puntos de entrada de un contrato (véase [la siguiente sección](./ch14-02-contract-functions.md#4-abiper_item-atribute)).
fr: L'attribut `#[generate_trait]` est principalement utilisé pour définir les blocs d'impl privés. Il peut également être utilisé en plus de `#[abi(per_item)]` pour définir les différents points d'entrée d'un contrat (voir [prochaine section](./ch14-02-contract-fonctions.md#4-abiper_item-attribute)).
id: atribut 'generate_trait' sebagian besar digunakan untuk mendefinisikan blok impl privat. Ini juga dapat digunakan sebagai tambahan untuk fungsi.md#[abiper_item)]) untuk menentukan berbagai titik masuk dari kontrak (lihat [bagian berikutnya]./ch14-02-contract-functionions.md#4-abiper_ite-atribute)).
tr: #[genate_trait] özniteliği çoğunlukla özel impl bloklarını tanımlamak için kullanılır. Bir sözleşmenin çeşitli giriş noktalarını tanımlamak için #[abi(per_item)] ek olarak da kullanılabilir (bkz. [sonraki bölüm](./ch14-02-contract-functions.md#4-abiper_item-attribute))).
zh_cn: [generate_trait] 属性主要用于定义私人内嵌块,除{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}_{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}>外,还可用于界定合同的各个切入点(见{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}}}}}}}}}}}}}}}}_合同-合同-功能。

source: Note: using `#[generate_trait]` in addition to the `#[abi(embed_v0)]` attribute for a public impl block is not recommended, as it will result in a failure to generate the corresponding ABI. Public functions should only be defined in an impl block annotated with `#[generate_trait]` if this block is also annotated with the `#[abi(per_item)]` attribute.
es: Nota: no se recomienda el uso de un bloque de impl público, ya que no se generará el ABI correspondiente. Las funciones públicas sólo deben definirse en un bloque de impl anotado con •[generate_trait]` si este bloque también está anotado con el atributo •[abi(per_item)]`.
fr: Note : l'utilisation de `#[generate_trait]` en plus de l'attribut `#[abi(embed_v0)]` pour un bloc public impl n'est pas recommandée, car elle ne permet pas de générer l'ABI correspondant. Les fonctions publiques ne devraient être définies dans un bloc impl annoté avec `#[generate_trait]` que si ce bloc est également annoté avec l'attribut `#[abi(per_item)]`.
id: Catatan: menggunakan ▪[generate_trait] sebagai tambahan untuk itu#[abi[abinbed_v0)]] atribut untuk blok impl publik tidak disarankan, karena itu akan mengakibatkan kegagalan untuk menghasilkan ABI yang sesuai. Fungsi-fungsi publik seharusnya hanya didefinisikan dalam sebuah blok impl dianotasi dengan ▪[generate_trait] ¶¶ jika blok ini juga dinotasi dengan atribut ▪abi[abiperite_m].
tr: Not: #[genate_trait] ek olarak #[abi(embed_v0)] özniteliği bir halka açık impl bloğu için tavsiye edilmez, çünkü ilgili ABI'yi oluşturmada bir başarısızlıkla sonuçlanacaktır. Kamusal işlevler yalnızca #[genate_trait] özniteliği ile belirtilen bir impl bloğunda tanımlanmalıdır.
zh_cn: 注:除{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}}}’外,使用{{{{{{{}}}}}>`{{{{{{{{{{{{{{{{{{{{{{{}}}}}}}>`[{{{{{{{{{{{}}}}}}}}{{{{{{}}}}}不推荐公有公有功能,因为这将导致未能产生相应的ABI。公共功能只应在附加附加说明的{{{{{{{{{{{{{{{{{}}}}}}}}}}}}`的的的内定义。

source: `[abi(per_item)]` Attribute
es: Atributo `[abi(per_item)]`
fr: «[abi(per_item)]» Attribut
id: ▪[abi[per_item)] Atribut
tr: [abi(per_item)] Öznitelik
zh_cn: `[{(每项目_项目)]`属性

source: You can also define the entrypoint type of functions individually inside an impl block using the`#[abi(per_item)]` attribute on top of your impl. It is often used with the `#[generate_trait]` attribute, as it allows you to define entrypoints without an explicit interface. In this case, the functions will not be grouped under an impl in the ABI. Note that when using `#[abi(per_item)]` attribute, public functions need to be annotated with the `#[external(v0)]` attribute - otherwise, they will not be exposed and will be considered as private functions.
es: También puede definir el tipo de punto de entrada de funciones individualmente dentro de un bloque de impl usando el atributo •[abi(per_item)]` en la parte superior de su impl. A menudo se utiliza con el atributo •[generate_trait]`, ya que le permite definir puntos de entrada sin una interfaz explícita. En este caso, las funciones no se agruparán bajo un impl en el ABI. Tenga en cuenta que cuando se utiliza •[abi(per_item)]` atributo, las funciones públicas deben estar anotadas con el atributo •[external(v0)]` - de lo contrario, no se expondrán y se considerarán como funciones privadas.
fr: Vous pouvez également définir le type de fonctions d'entrée individuellement à l'intérieur d'un bloc impl en utilisant l'attribut `#[abi(per_item)]` en haut de votre impl. Il est souvent utilisé avec l'attribut `#[generate_trait]`, car il vous permet de définir des points d'entrée sans interface explicite. Dans ce cas, les fonctions ne seront pas regroupées sous un impl dans l'ABI. Notez que lorsque vous utilisez l'attribut `#[abi(per_item)]`, les fonctions publiques doivent être annotées avec l'attribut `#[external(v0)]` - sinon, elles ne seront pas exposées et seront considérées comme des fonctions privées.
id: Anda juga dapat mendefinisikan tipe titik masuk dari fungsi secara individual dalam sebuah blok impl menggunakan "#[abiper_item)] atribut di atas impl Anda. Hal ini sering digunakan dengan atribut ▪[generate_trait], seperti yang memungkinkan Anda untuk mendefinisikan titik masuk tanpa antarmuka eksplisit. Dalam hal ini, fungsi tidak akan dikelompokkan di bawah impl dalam ABI. Perhatikan bahwa ketika menggunakan atribut ▪[abiperite_mitte], fungsi publik perlu dienotasi dengan \#[exital0) - atau mereka tidak akan terpapar sebagai fungsi pribadi.
tr: Ayrıca, impl'nizin üstündeki #[abi(per_item)] özniteliğini kullanarak bir impl bloğunun içindeki fonksiyonların giriş noktasını tek tek tanımlayabilirsiniz. Aksi takdirde açık bir arayüz olmadan giriş noktalarını tanımlamanıza izin verdiği için #[genate_trait] özniteliği ile birlikte kullanılır. Bu durumda, fonksiyonlar ABI'de bir impl altında gruplandırılmayacaktır.
zh_cn: 您也可以使用 {{{{{{{{{{{{{{{{{}}}}} 属性来定义内管块内个别函数的切入点类型。它通常与{{{{{{{{}}}}}}属性一起使用,因为它允许您在没有明确接口的情况下定义切入点。在这种情况下,这些函数不会在 ABI 中归类在分块内。请注意,在使用{{{{{{{{{{{{}}}} 属性时,公共函数需要附加说明,加上{{{{[extern(v0)]}}}`属性,否则,它们不会暴露出来,将被视为私人功能。

source: Here is a short example:
es: He aquí un breve ejemplo:
fr: Voici un court exemple :
id: Berikut contoh singkatnya:
tr: İşte kısa bir örnek:
zh_cn: 以下是一个简短的例子:

source: // this is a constructor function
es: // esto es una función constructora
fr: // c'est une fonction de constructeur
id: //ini adalah fungsi konstruktor
tr: // bu bir constructor fonksiyonudur
zh_cn: / 这是构建符函数

source: // this is a public function
es: // esto es una función pública
fr: // c'est une fonction publique
id: //Ini adalah fungsi publik
tr: // bu bir kamu fonksiyonudur
zh_cn: / 这是公共职能

source: // this is a l1_handler function
es: // esto es una función l1_handler
fr: // c'est une fonction l1_handler
id: //Ini adalah sebuah fungsi l1_handler
tr: // bu bir l1_handler fonksiyonudur
zh_cn: / 这是 I1_ handler 函数

source: // this is an internal function
es: // esta es una función interna
fr: // c'est une fonction interne
id: //Ini adalah fungsi internal
tr: // bu bir iç fonksiyondur
zh_cn: /这是内部职能

source: In the case of `#[abi(per_item)]` attribute usage without `#[generate_trait]`, it will only be possible to include `constructor`, `l1-handler` and `internal` functions in the trait implementation. Indeed, `#[abi(per_item)]` only works with a trait that is not defined as a Starknet interface. Hence, it will be mandatory to create another trait defined as interface to implement public functions.
es: En el caso de las funciones de «abi(per_item)]`atribuir el uso sin la aplicación del rasgo», sólo será posible incluir las funciones de `constructor`, `l1-handler` e `interna` en la aplicación del rasgo. De hecho, `[abi(per_item)]` sólo funciona con un rasgo que no se define como una interfaz Starknet. Por lo tanto, será obligatorio crear otro rasgo definido como interfaz para la ejecución de las funciones públicas.
fr: Dans le cas de l'utilisation de l'attribut `#[abi(per_item)]` sans `#[generate_trait]`, il ne sera possible d'inclure que les fonctions `constructeur`, `l1-handler` et `internal` dans l'implémentation du caractère. En effet, `#[abi(per_item)]` ne fonctionne qu'avec un caractère qui n'est pas défini comme une interface Starknet. Par conséquent, il sera obligatoire de créer un autre caractère défini comme interface pour mettre en œuvre des fonctions publiques.
id: Dalam kasus ini, hanya akan mungkin untuk menyertakan ▪constructorál1-handler (property) dan fungsi international dalam implementasi sifat. Memang, ·abi_traitm] hanya akan bekerja dengan sifat yang tidak didefinisikan sebagai antarmuka Starknet. Oleh karena itu, itu akan wajib untuk membuat antarmuka lain yang didefinisikan untuk mengimplementasikan fungsi publik.
tr: #[abi(per_item)]] #[generate_trait] olmadan öznitelik kullanımı durumunda, yalnızca constructor, l1-handler ve internal işlevlerini özellik uygulamasına dahil etmek mümkün olacaktır. Gerçekten de, #[abi(per_item)] yalnızca bir Starknet arayüzü olarak tanımlanmayan bir özellikle çalışır.
zh_cn: 如果``{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}>`属性使用}>`,则在特性执行中只能包括`构件>、`l1- handler`和`内部'的功能。{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}}`但有非 Starknet接口的特性。因此,为履行公共功能,必须创建另一个被定义为接口的特性。

source: Events are custom data structures that are emitted by smart contracts during execution. They provide a way for smart contracts to communicate with the external world by logging information about specific occurrences in a contract.
es: Los eventos son estructuras de datos personalizadas que se emiten mediante contratos inteligentes durante la ejecución. Proporcionan una forma para que los contratos inteligentes se comuniquen con el mundo externo registrando información sobre sucesos específicos en un contrato.
fr: Les événements sont des structures de données personnalisées qui sont émises par des contrats intelligents pendant l'exécution. Ils fournissent un moyen pour les contrats intelligents de communiquer avec le monde extérieur en enregistrant des informations sur des événements spécifiques dans un contrat.
id: Peristiwa-peristiwa adalah struktur data kustom yang dipancarkan oleh kontrak cerdas selama eksekusi. Mereka menyediakan cara bagi kontrak cerdas untuk berkomunikasi dengan dunia luar dengan mencatat informasi tentang kejadian tertentu dalam kontrak.
tr: Olaylar, yürütme sırasında akıllı sözleşmeler tarafından yayılan özel veri yapılarıdır. Akıllı sözleşmelerin, bir sözleşmedeki belirli olaylarla ilgili bilgileri günlüğe kaydederek dış dünyayla iletişim kurması için bir yol sağlarlar.
zh_cn: 事件是在执行期间由智能合同排放的定制数据结构,为智能合同通过记录合同中具体事件的信息与外部世界沟通提供了一种途径。
