Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: /// @dev Contract constructor initializing the contract with a list of registered voters and 0 vote count
es: /// @dev Constructor de contrato inicializando el contrato con una lista de votantes registrados y conteo de 0 votos
fr: /// @dev Constructeur de contrat initialisant le contrat avec une liste d'électeurs inscrits et 0 compte de vote
id: // @dev Constructor menginisialisasi kontrak dengan daftar pemilih terdaftar dan 0 jumlah suara
tr: /// @dev Sözleşme yapıcısı, sözleşmeyi kayıtlı seçmenler listesi ve 0 oy sayımı ile başlatıyor
zh_cn: ///@dev@dev 合同建造商以登记选民名单和0票计票开始合同

source: // Register all voters by calling the _register_voters function
es: // Registrar a todos los votantes llamando a la función _register_voters
fr: // Enregistrez tous les électeurs en appelant la fonction _register_voters
id: // Register semua pemilih dengan memanggil fungsi _register_voters
tr: // Tüm seçmenleri _register_voters işlevini arayarak kaydedin
zh_cn: / 通过调用 _register_voters 功能登记所有选民

source: // Initialize the vote count to 0
es: // Inicializar el recuento de votos a 0
fr: // Initialiser le nombre de votes à 0
id: //Inisialisasi hitungan suara ke 0
tr: // Oy sayımını 0'a başlat
zh_cn: / 开始投票数为0

source: /// @dev Event that gets emitted when a vote is cast
es: /// @dev Evento que se emite cuando se vota
fr: /// @dev Événement émis lors d'un vote
id: // @dev Event yang akan dipancarkan ketika pemungutan suara dilemparkan
tr: /// @dev Bir oylama yapıldığında yayılan olay
zh_cn: ///@dev 事件,当投票时会发布

source: /// @dev Represents a vote that was cast
es: /// @dev Representa un voto emitido
fr: /// @dev Représente un vote qui a été lancé
id: // @dev Mewakili pemungutan suara yang dilemparkan
tr: /// @dev Atılan bir oylamayı temsil eder
zh_cn: //@dev 代表投票结果

source: /// @dev Represents an unauthorized attempt to vote
es: /// @dev Representa un intento no autorizado de votar
fr: /// @dev Représente une tentative non autorisée de vote
id: /// @dev Mewakili usaha yang tidak sah untuk memilih
tr: /// @dev Yetkisiz oy verme girişimini temsil eder
zh_cn: //@@dev 代表未经授权的投票企图

source: /// @dev Implementation of VoteTrait for ContractState
es: /// @dev Implementación de VoteTrait para ContractState
fr: /// @dev Mise en œuvre du voteTraitement pour l'État contractant
tr: /// @dev ContractState için VoteTrait Uygulaması
zh_cn: ///@dev 实施合同国的投票程序

source: /// @dev Returns the voting results
es: /// @dev Devuelve los resultados de la votación
fr: /// @dev Retourne les résultats du vote
id: // @dev Mengembalikan hasil voting
tr: /// @dev Oylama sonuçlarını döndürür
zh_cn: // @dev 返回投票结果

source: /// @dev Check whether a voter is allowed to vote
es: /// @dev Compruebe si un votante puede votar
fr: /// @dev Vérifiez si un électeur est autorisé à voter
id: /// @dev Periksa apakah pemilih diijinkan untuk memilih
tr: /// @dev Bir seçmenin oy kullanmasına izin verilip verilmediğini kontrol edin
zh_cn: ///@dev 检查是否允许选民投票

source: /// @dev Check whether an address is registered as a voter
es: /// @dev Compruebe si una dirección está registrada como votante
fr: /// @dev Vérifiez si une adresse est enregistrée comme électeur
id: /// @dev Periksa apakah alamat terdaftar sebagai pemilih
tr: /// @dev Bir adresin seçmen olarak kayıtlı olup olmadığını kontrol edin
zh_cn: ///@dev 检查一个地址是否登记为选民

source: /// @dev Submit a vote
es: /// @dev Presentar una votación
fr: /// @dev Soumettre un vote
id: // @dev Kirim suara
tr: /// @dev Bir oy gönder
zh_cn: // @dev 提交投票

source: /// @dev Internal Functions implementation for the Vote contract
es: /// @dev Implementación de funciones internas para el contrato de voto
fr: /// @dev Mise en œuvre des fonctions internes pour le contrat de vote
id: // @dev Fungsi Internal implementasi untuk kontrak Vote
tr: /// @dev Oy sözleşmesi için İç Fonksiyonlar uygulaması
zh_cn: ///@dev 实施投票合同的内部功能

source: /// @dev Registers the voters and initializes their voting status to true (can vote)
es: /// @dev Registra a los votantes y inicializa su estatus de voto a true (puede votar)
fr: /// @dev Enregistre les électeurs et initialise leur statut de vote à vrai (peut voter)
id: // @dev Register pemilih dan menginisialisasi status suara mereka ke true (dapat memilih)
tr: /// @dev Seçmenleri kaydeder ve oy durumlarını doğru olarak başlatır (oy kullanabilir)
zh_cn: //@dev 登记选民,

source: /// @dev Asserts implementation for the Vote contract
es: /// @dev Asserts implementa el contrato de voto
fr: /// @dev Asserts implémentation pour le contrat de vote
id: // @dev Asserts implementasi untuk kontrak Voting
tr: /// Oy sözleşmesi için @dev Asserts uygulaması
zh_cn: ///@dev Asserts 实施投票合同

source: // @dev Internal function that checks if an address is allowed to vote
es: // @dev Función interna que comprueba si una dirección está autorizada a votar
fr: // @dev Fonction interne qui vérifie si une adresse est autorisée à voter
id: // @dev Internal fungsi yang memeriksa jika alamat diijinkan untuk memilih
tr: // @dev Bir adresin oy kullanmasına izin verilip verilmediğini kontrol eden dahili işlev
zh_cn: / @dev@dev 内部功能,可以检查是否允许投票地址

source: "USER_NOT_REGISTERED"
es: "USER_NO_REGISTERIDO"
fr: "USER_NOT_REGISTRÉ"
tr: "USER_NOT_REGISTERED" (İngilizce).
zh_cn: (美国核反应堆)

source: "USER_ALREADY_VOTED"
es: "USER_ALREADY_VOTADA"
tr: "USER_ALREADY_VOTED" (İngilizce).
zh_cn: (AAAAREADAVED) (USERAAREAADEVETED) (AUSERAAREAADADED) (AUSERAREAREADANDATED) (AUSERAREAREADANDATED) (AUSERERAREAREADANDATED)

source: /// @dev Implement the VotingResultTrait for the Vote contract
es: /// @dev Implementar el VotingResultTrait para el contrato de Votación
fr: /// @dev Mettre en œuvre le voteRésultatTraitement pour le contrat de vote
id: // @dev Implementasi VotingReultTrait untuk kontrak Voting
tr: /// @dev Oylama Sözleşmesi için Oy VermeResultTrait Uygulaması
zh_cn: /// @dev 执行投票结果 投票合同

source: // @dev Internal function to get the voting results (yes and no vote counts)
es: // @dev Función interna para obtener los resultados de la votación (sí y no cuenta el voto)
fr: // @dev Fonction interne pour obtenir les résultats du vote (oui et pas de compte de vote)
id: // @dev Internal fungsi untuk mendapatkan hasil voting (ya dan tidak ada jumlah suara)
tr: // @dev Oylama sonuçlarını almak için iç fonksiyon (evet ve hayır oy sayımı)
zh_cn: / @dev 内部功能以获得投票结果(是和不计票)

source: // @dev Internal function to calculate the voting results in percentage
es: // @dev Función interna para calcular los resultados de votación en porcentaje
fr: // @dev Fonction interne pour calculer les résultats de vote en pourcentage
id: // @dev Internal fungsi untuk menghitung hasil voting dalam persentase
tr: // @dev Oylama sonuçlarını yüzde olarak hesaplamak için iç fonksiyon
zh_cn: / / @dev 内部函数以百分比计算投票结果

source: <span class="caption">Listing 16-7: A voting smart contract</span>
es: <span class="caption">Lista 16-7: Un contrato inteligente de votación</span>
fr: <span class="caption">Liste 16-7: Un contrat intelligent de vote</span>
id: <span class="caption">Listing 16-7: Sebuah kontrak pintar voting</span>
tr: span class="caption">Liste 16-7: Oy veren akıllı sözleşme/span>
zh_cn: <span类=“caption” > listing 16-7: 投票智能合同 </span>

source: Deploying, Calling and Invoking the Voting Contract
es: Implementación, convocatoria e invocación del Contrato de Votación
fr: Déployer, appeler et invoquer le contrat de vote
id: Menyebarkan, Memanggil dan Memanggil Kontrak Voting
tr: Oy Sözleşmesinin Dağıtılması, Çağrılması ve Davet Edilmesi
zh_cn: 部署、调用和援引投票合同

source: Part of the Starknet experience is deploying and interacting with smart contracts.
es: Parte de la experiencia Starknet es implementar e interactuar con contratos inteligentes.
fr: Une partie de l'expérience Starknet est en train de déployer et d'interagir avec des contrats intelligents.
id: Bagian dari pengalaman Starknet adalah menyebarkan dan berinteraksi dengan kontrak cerdas.
tr: Starknet deneyiminin bir kısmı akıllı sözleşmeleri dağıtmak ve etkileşim kurmaktır.
zh_cn: 斯塔克内特的部分经验是部署和与智能合同互动。

source: Once the contract is deployed, we can interact with it by calling and invoking its functions:
es: Una vez desplegado el contrato, podemos interactuar con él llamando e invocando sus funciones:
fr: Une fois le contrat déployé, nous pouvons interagir avec lui en appelant et en invoquant ses fonctions :
id: Setelah kontrak dikerahkan, kita dapat berinteraksi dengan itu dengan memanggil dan memanggil fungsinya:
tr: Sözleşme dağıtıldıktan sonra, işlevlerini çağırarak ve çağırarak onunla etkileşime geçebiliriz:
zh_cn: 一旦合同部署完毕,我们可以通过调用和援引其职能与合同互动:

source: Calling contracts: Interacting with external functions that only read from the state. These functions do not alter the state of the network, so they don't require fees or signing.
es: Contratos de llamada: Interactuar con funciones externas que solo se leen desde el estado. Estas funciones no alteran el estado de la red, por lo que no requieren honorarios ni firma.
fr: Contrats d'appel : Interagir avec des fonctions externes qui ne lisent que de l'état. Ces fonctions ne modifient pas l'état du réseau, de sorte qu'elles n'exigent ni frais ni signature.
id: Memanggil kontrak: Interakting dengan fungsi eksternal yang hanya dibaca dari negara. Fungsi ini tidak mengubah keadaan jaringan, sehingga mereka tidak memerlukan biaya atau penandatanganan.
tr: Sözleşmeleri çağırmak: Sadece eyaletten okuyan harici işlevlerle etkileşim kurmak. Bu işlevler ağın durumunu değiştirmez, bu nedenle ücret veya imza gerektirmezler.
zh_cn: 连接合同: 与只从国家读取的外部功能互动。 这些功能不会改变网络状态, 因此不需要收费或签名 。

source: Invoking contracts: Interacting with external functions that can write to the state. These functions do alter the state of the network and require fees and signing.
es: Invocar contratos: Interactuar con funciones externas que pueden escribir al estado. Estas funciones modifican el estado de la red y requieren honorarios y firma.
fr: Invocation de contrats : Interagir avec des fonctions externes qui peuvent écrire à l'état. Ces fonctions modifient l'état du réseau et exigent des frais et la signature.
id: Mendaftar kontrak: Berinteraksi dengan fungsi eksternal yang dapat menulis ke negara. Fungsi-fungsi ini mengubah keadaan jaringan dan memerlukan biaya dan penandatanganan.
tr: Sözleşmeleri çağırmak: Devlete yazabilecek harici işlevlerle etkileşime girmek. Bu işlevler ağın durumunu değiştirir ve ücret ve imza gerektirir.
zh_cn: 援引合同:与可以向国家写信的外部职能进行互动,这些职能确实改变了网络的状况,需要收费和签名。

source: We will setup a local development node using `katana` to deploy the voting contract. Then, we'll interact with the contract by calling and invoking its functions. You can also use the Goerli Testnet instead of `katana`. However, we recommend using `katana` for local development and testing. You can find the complete tutorial for `katana` in the ["Katana: A Local Node"](https://book.starknet.io/ch02-04-katana.html) chapter of the Starknet Book.
es: Estableceremos un nodo de desarrollo local usando `katana` para implementar el contrato de votación. Luego, interactuaremos con el contrato llamando e invocando sus funciones. También puede utilizar el Goerli Testnet en lugar de `katana`. Sin embargo, recomendamos usar `katana` para el desarrollo local y pruebas. Puede encontrar el tutorial completo para `katana` en el ["Katana: A Local Node"] (https://book.starknet.io/ch02-04-katana.html) capítulo del libro Starknet.
fr: Nous allons configurer un nœud de développement local en utilisant `katana` pour déployer le contrat de vote. Ensuite, nous interagirons avec le contrat en appelant et en invoquant ses fonctions. Vous pouvez également utiliser le Goerli Testnet au lieu de `katana`. Cependant, nous recommandons d'utiliser `katana` pour le développement local et les tests. Vous pouvez trouver le tutoriel complet pour `katana` dans le chapitre ["Katana: A Local Node"](https://book.starknet.io/ch02-04-katana.html) du livre Starknet.
id: Kita akan membuat node pengembangan lokal menggunakan kode Goerli Testnet sebagai ganti Ékatana. namun, kita merekomendasikan untuk mengembangkan dan menguji lokal. kamu dapat menemukan tutorial lengkap untuk ▪katana di ["Katana: A Localde"://https.startbook.stark.io/04-katana.html) bab Starknet.
tr: Oylama sözleşmesini dağıtmak için katana'ı kullanarak yerel bir geliştirme düğümü kuracağız. Daha sonra, işlevlerini arayarak ve çağırarak sözleşmeyle etkileşime gireceğiz. Ayrıca katana yerine Goerli Testnet'i de kullanabilirsiniz. Bununla birlikte, yerel geliştirme ve test için katana kullanmanızı tavsiye ederiz. katana için eksiksiz öğreticiyi ["Katana: A Local Node" bölümünde bulabilirsiniz.
zh_cn: 我们将用`katana'来设置地方发展节点,以部署投票合同,然后,我们将通过调用和援引合同功能与合同互动,您也可以使用Goerli Testnet而不是`katana',然而,我们建议使用`katana'来进行地方发展和测试。您可以在斯塔克内特书(https://book.starknet.io/ch02-04-katana.html)一章中找到`katana'的完整辅导。

source: The `katana` Local Starknet Node
es: El nodo local de `katana` Starknet
fr: Le nœud local "katana" de Starknet
id: Node Local Starknet.
tr: katana Yerel Starknet Düğümü
zh_cn: `katana'地方史塔克网节点

source: `katana` is designed to support local development by the [Dojo team](https://github.com/dojoengine/dojo/blob/main/crates/katana). It will allow you to do everything you need to do with Starknet, but locally. It is a great tool for development and testing.
es: El `katana` está diseñado para apoyar el desarrollo local por el [equipo Dojo] (https://github.com/dojoengine/dojo/blob/main/crates/katana) y le permitirá hacer todo lo que necesita hacer con Starknet, pero localmente. Es una gran herramienta para el desarrollo y las pruebas.
fr: `katana` est conçu pour soutenir le développement local par l`équipe [Dojo] (https://github.com/dojoengine/dojo/blob/main/crates/katana). Il vous permettra de faire tout ce que vous devez faire avec Starknet, mais localement. C`est un excellent outil pour le développement et les tests.
id: Katarana dirancang untuk mendukung pembangunan lokal oleh [Dojo tim][Dojohttps://gitub.com/dojoeng/dob/main/crates/katana). Ini akan memungkinkan Anda untuk melakukan segala sesuatu yang perlu Anda lakukan dengan Starknet, tapi secara lokal. Ini adalah alat yang hebat untuk pengembangan dan pengujian.
tr: katana [Dojo ekibi] tarafından yerel gelişimi desteklemek için tasarlanmıştır(https://github.com/dojo/dojo/blob/main/crates/katana). Starknet ile yapmanız gereken her şeyi yapmanıza izin verecektir, ancak yerel olarak. Geliştirme ve test için harika bir araçtır.
zh_cn: `katana'由[Dojo小组](https://github.com/dojoengine/dojo/blob/main/crates/katana)设计,目的是支持地方发展,使你能够对Starknet尽你所能,但可以在当地进行,这是发展和测试的伟大工具。

source: To install `katana` from the source code, please refer to the ["Basic Installation"](https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) chapter of the Starknet Book.
es: Para instalar `katana` desde el código fuente, consulte el capítulo ["Instalación básica"] (https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) del libro Starknet.
fr: Pour installer `katana` à partir du code source, veuillez consulter le chapitre ["Installation de base"] (https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) du livre Starknet.
id: Untuk instal åhttps://book.starknet.io/ch02-01-basic-installation.html#katana-installation) bab dari Starknet Book.
tr: katana'yı kaynak koddan yüklemek için Starknet Kitabı'nın ["Temel Kurulum"] [https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation] bölümüne bakınız.
zh_cn: 要从源代码中安装`katana',请参见斯塔克内特书中的[“基本安装”]一章(https://book.starknet.io/ch02-01-import-安裝.html#katana-node-安裝)。

source: Note: Please verify that the version of `katana` match the specified version provided below.
es: Nota: Por favor verifique que la versión de `katana` coincida con la versión especificada a continuación.
fr: Note: Veuillez vérifier que la version de `katana` correspond à la version spécifiée ci-dessous.
id: Catatan: Silakan periksa apakah versi åkatana cocok dengan versi yang tercantum di bawah ini.
tr: Not: Lütfen katana sürümünün aşağıda belirtilen sürümle eşleştiğini doğrulayın.
zh_cn: 注:请核实`katana'的版本与下文规定的版本相符。

source: To upgrade `katana` version, refer to the ["Basic Installation"](https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) chapter of the Starknet Book.
es: Para actualizar la versión `katana`, consulte el capítulo ["Instalación básica"](https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) del libro Starknet.
fr: Pour mettre à jour la version `katana`, reportez-vous au chapitre ["Installation de base"] (https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) du livre Starknet.
id: Untuk meng-upgrade versi ókatana, merujuk ke ["Instalasi Basic"]][https://book.starknet.io/ch02-01-basic-instalation.html#katana-node-installation) bab dari buku Starknet.
tr: katana sürümünü yükseltmek için Starknet Kitabı'nın ["Temel Kurulum"] [https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation] bölümüne bakın.
zh_cn: 为了升级“katana”版本,请参考斯塔克内特书中的[“基本安装”]一章(https://book.starknet.io/ch02-01-import-安裝.html#katana-node-安裝)。

source: Once you have `katana` installed, you can start the local Starknet node with:
es: Una vez que haya instalado `katana`, puede iniciar el nodo local Starknet con:
fr: Une fois que vous avez installé `katana`, vous pouvez démarrer le noeud local Starknet avec:
id: Setelah Anda memasang åkatana, Anda dapat memulai node lokal Starknet dengan:
tr: katana yükledikten sonra, yerel Starknet düğümünü şu şekilde başlatabilirsiniz:
zh_cn: 安装“katana”后,您可以用下列方式启动本地的 Starknet 节点:

source: This command will start a local Starknet node with 3 deployed accounts. We will use these accounts to deploy and interact with the voting contract:
es: Este comando iniciará un nodo local de Starknet con 3 cuentas desplegadas. Usaremos estas cuentas para implementar e interactuar con el contrato de votación:
fr: Cette commande lancera un nœud local Starknet avec 3 comptes déployés. Nous utiliserons ces comptes pour déployer et interagir avec le contrat de vote:
id: Perintah ini akan memulai node Starknet lokal dengan 3 akun yang dikerahkan. kami akan menggunakan akun ini untuk menyebarkan dan berinteraksi dengan kontrak pemungutan suara:
tr: Bu komut, 3 konuşlandırılmış hesaba sahip yerel bir Starknet düğümü başlatacaktır. Bu hesapları oy sözleşmesini dağıtmak ve etkileşimde bulunmak için kullanacağız:
zh_cn: 此命令将启动一个本地的 Starknet 节点, 包含 3 个已部署的账户 。 我们将使用这些账户来部署和与投票合同互动 :

source: Before we can interact with the voting contract, we need to prepare the voter and admin accounts on Starknet. Each voter account must be registered and sufficiently funded for voting. For a more detailed understanding of how accounts operate with Account Abstraction, refer to the ["Account Abstraction"](https://book.starknet.io/ch04-00-account-abstraction.html) chapter of the Starknet Book.
es: Antes de que podamos interactuar con el contrato de votación, necesitamos preparar las cuentas de votantes y administradores en Starknet. Cada cuenta de votantes debe estar registrada y suficientemente financiada para votar. Para una comprensión más detallada de cómo funcionan las cuentas con Abstraction Account, consulte el ["Account Abstraction"] (https://book.starknet.io/ch04-00-account-abstraction.html) capítulo del libro Starknet.
fr: Avant de pouvoir interagir avec le contrat de vote, nous devons préparer les comptes d'électeurs et d'administrateurs sur Starknet. Chaque compte d'électeurs doit être enregistré et suffisamment financé pour voter. Pour une compréhension plus détaillée du fonctionnement des comptes avec Account Abstraction, reportez-vous au chapitre ["Account Abstraction"](https://book.starknet.io/ch04-00-account-abstraction.html) du livre Starknet.
id: Sebelum kita dapat berinteraksi dengan kontrak suara, kita perlu mempersiapkan akun pemilih dan admin di Starknet. Setiap akun pemilih harus terdaftar dan cukup didanai untuk pemilihan. Untuk pemahaman yang lebih rinci tentang bagaimana akun beroperasi dengan Abstraksi Akun, mengacu ke bab ["Account Abstraction"]://https.Starknet.io/ch04-account-abstraction.htl) bab buku Starknet.
tr: Oylama sözleşmesiyle etkileşime girmeden önce, Starknet'teki seçmen ve yönetici hesaplarını hazırlamamız gerekir. Her seçmen hesabı kayıtlı olmalı ve oylama için yeterince finanse edilmelidir. Hesapların Hesap Özeti ile nasıl çalıştığını daha ayrıntılı anlamak için, Starknet Kitabı'nın [https://book.starknet.io/ch04-00-account-abstraction.html] bölümüne bakın.
zh_cn: 在与投票合同互动之前,我们需要准备斯塔克内特的选民帐户和行政帐户。每个选民帐户必须登记,并有足够的投票资金。为了更详细地了解账户与“账户摘要”如何运作,请参见史塔克内特书中的“账户摘要”一章(https://book.starknet.io/ch04-00-count-abstraction.html)。

source: Smart Wallets for Voting
es: Carteras inteligentes para votar
fr: Portefeuilles intelligents pour le vote
id: Dompet Pintar untuk Voting
tr: Oylama için Akıllı Cüzdanlar
zh_cn: 用于投票的智能票花板

source: Aside from Scarb you will need to have Starkli installed. Starkli is a command line tool that allows you to interact with Starknet. You can find the installation instructions in the \["Basic Installation"\]\[starkli installation\] chapter of the Starknet Book.
es: Además de Scarb tendrá que tener Starkli instalado. Starkli es una herramienta de línea de comandos que le permite interactuar con Starknet. Puede encontrar las instrucciones de instalación en el capítulo \["Instalación básica"\]\[instalación de Starkli\] del libro Starknet.
fr: En dehors de Scarb, vous devrez installer Starkli. Starkli est un outil en ligne de commande qui vous permet d'interagir avec Starknet. Vous pouvez trouver les instructions d'installation dans le chapitre \["Installation de base"\]\[installation de Starkli\] du livre Starknet.
id: Selain Scarb Anda perlu memasang Starkli. Starkli adalah alat baris perintah yang memungkinkan Anda berinteraksi dengan Starknet. Anda dapat menemukan instruksi instalasi dalam \["Peninstalan Basic"\]\[starkli instalasi\] bab dari Starknet Book.
tr: Scarb'ın yanı sıra Starkli'nin yüklü olması gerekir. Starkli, Starknet ile etkileşime girmenizi sağlayan bir komut satırı aracıdır. Kurulum talimatlarını Starknet Kitabı'nın ["Temel Kurulum"][starkli kurulum] bölümünde bulabilirsiniz.
zh_cn: 除了疤痕之外, 您还需要安装斯塔克利。 Starkli 是一个命令行工具, 允许您与 Starknet 互动。 您可以在 Starknet 书的 \ [ “ 基本安装”\]\ [ starkkli 安装] 章节中找到安装指令 。

source: Note: Please verify that the version of `starkli` match the specified version provided below.
es: Nota: Por favor, verifique que la versión de `starkli` coincida con la versión especificada a continuación.
fr: Note: Veuillez vérifier que la version de `starkli` correspond à la version spécifiée ci-dessous.
id: Catatan: Silakan periksa apakah versi åstarkli cocok dengan versi yang tercantum di bawah ini.
tr: Not: Lütfen starkli sürümünün aşağıda belirtilen sürümle eşleştiğini doğrulayın.
zh_cn: 注:请核实`starkli'的版本是否与下文规定的版本相符。

source: To upgrade `starkli` to `0.2.9`, use the `starkliup -v 0.2.9` command, or simply `starkliup` which installed the latest stable version.
es: Para actualizar `starkli` a `0.2.9`, utilice el comando `starkliup -v 0.2.9`, o simplemente `starkliup'que instaló la última versión estable.
fr: Pour mettre à niveau `starkli` vers `0.2.9`, utilisez la commande `starkliup -v 0.2.9` ou simplement `starkliup` qui a installé la dernière version stable.
id: Untuk meng-upgrade thosestarkli menjadi 0.2.9.9, gunakan perintah 0.2.9.9, atau hanya "starkliup." yang menginstal versi stabil terbaru.
tr: starkli'i 0.2.9'ye yükseltmek için, starkliup -v 0.2.9 komutunu veya en son kararlı sürümü yükleyen starkliup'u kullanın.
zh_cn: 将`Starkli'升级为`0.2.9',使用`Starkliup-v0.2.9'命令,或简单地使用安装最新稳定版本的`Starkliup'命令。
