Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: A program will often need to evaluate a condition within a loop. While the condition is `true`, the loop runs. When the condition ceases to be `true`, the program calls `break`, stopping the loop. It’s possible to implement behavior like this using a combination of `loop`, `if`, `else`, and `break`; you could try that now in a program, if you’d like. However, this pattern is so common that Cairo has a built-in language construct for it, called a `while` loop.
es: Un programa a menudo tendrá que evaluar una condición dentro de un bucle. Mientras que la condición es `verdadera`, el bucle se ejecuta. Cuando la condición deja de ser `verdadera`, el programa llama `break`, deteniendo el bucle. Es posible implementar un comportamiento como este usando una combinación de `loop`, `if`, `else`, y `break`; usted podría intentar eso ahora en un programa, si lo desea. Sin embargo, este patrón es tan común que El Cairo tiene una construcción de lenguaje incorporada para él, llamado un bucle `while`.
fr: Un programme aura souvent besoin d'évaluer une condition dans une boucle. Bien que la condition soit `true`, la boucle tourne. Lorsque la condition cesse d'être `true`, le programme appelle `break`, arrêtant la boucle. Il est possible d'implémenter un comportement comme ceci en utilisant une combinaison de `loop`, `if`, `else` et `break`; vous pouvez essayer cela maintenant dans un programme, si vous voulez. Cependant, ce modèle est tellement commun que le Caire a une construction de langage intégré pour elle, appelé une `bilan`.
id: Sebuah program akan sering perlu untuk mengevaluasi sebuah kondisi dalam sebuah putaran. sementara kondisi ini benar-benar berjalan. ketika kondisi itu berhenti untuk menjadi benar-benar benar, program memanggil kita untuk menghentikan putaran. namun, pola ini adalah umum bahwa Kairo memiliki sebuah struktur bahasa yang dibangun untuk itu, disebut loop ·else.
tr: Bir programın genellikle bir döngü içindeki bir durumu değerlendirmesi gerekir. Durum true iken, döngü çalışır. Durum true olarak sona erdiğinde, program break'yi çağırır, döngüyü durdurur. Böyle bir davranışı loop, if, else ve break kombinasyonu kullanarak uygulamak mümkündür; Eğer böyle bir dil inşa ettiyseniz, şimdi bunu bir programda deneyebilirsiniz.
zh_cn: 程序通常需要在循环中评估一个条件。 虽然条件是“ 真实的 ”, 循环会运行。 当条件不再是“真实的 ” 时, 程序会叫“ 中断 ”, 停止循环 。 使用“ 循环 ” 、 “ 如果 ” 、 “ else ” 和“ 打破 ” 的组合来实施类似的行为是可能的; 你可以在程序里尝试这一点, 如果你喜欢的话。 但是, 这种模式非常常见, 以至于开罗有一个内部语言结构, 叫做“ 循环 ” 。

source: In Listing 2-2, we use `while` to loop the program three times, counting down each time after printing the value of `number`, and then, after the loop, print a message and exit.
es: En Listado 2-2, usamos `while` para enroscar el programa tres veces, contando hacia abajo cada vez después de imprimir el valor de `número`, y luego, después del bucle, imprimir un mensaje y salir.
fr: Dans Listing 2-2, nous utilisons `When` pour boucler le programme trois fois, en comptant à chaque fois après avoir imprimé la valeur de `number`, puis, après la boucle, imprimer un message et sortir.
id: Dalam Listing 2-2, kita menggunakan Á while to loop the program three time, menghitung mundur setiap kali setelah mencetak nilai dari nomor æa, dan kemudian, setelah loop, mencetak pesan dan keluar.
tr: Listeleme 2-2'de, programı üç kez döngü yapmak için while kullanıyoruz, number değerini yazdırdıktan sonra her seferinde geri sayım yapıyoruz ve daha sonra döngüden sonra bir mesaj yazdırıp çıkıyoruz.
zh_cn: 在清单2-2中,我们使用`同时'将程序循环三次,每次在打印`数字'值后计算一次,然后在循环后打印消息和退出。

source: "{number}!"
es: "¡{número}!"
fr: "{numéro}!"
tr: "numara!"
zh_cn: "{数目}!"

source: "LIFTOFF!!!"
zh_cn: 举起手来! 举起手来! 举起手来! 举起手来! 举起手来!

source: <span class="caption">Listing 2-2: Using a `while` loop to run code while a condition holds `true`.</span>
es: <span class="caption">Lista 2-2: Usar un bucle `while` para ejecutar código mientras una condición contiene `true`.</span>
fr: <span class="caption">Liste 2-2: Utilisation d'une boucle `time` pour exécuter le code alors qu'une condition contient `true`.</span>
id: <span class="caption">Listing 2-2: Menggunakan loop yang sedang digunakan untuk menjalankan kode sementara sebuah kondisi memegang benar.</span>
tr: span class="caption">Listing 2-2: Bir koşul true tutarken kodu çalıştırmak için bir while döngüsü kullanma./span>
zh_cn: <span class="caption" > listing 2-2: 使用“ 循环” 运行代码, 而条件持有“ true” 。 </span>

source: This construct eliminates a lot of nesting that would be necessary if you used `loop`, `if`, `else`, and `break`, and it’s clearer. While a condition evaluates to `true`, the code runs; otherwise, it exits the loop.
es: Esta construcción elimina una gran cantidad de anidación que sería necesario si se utiliza `loop`, `if`, `else`, y `break`, y es más claro. Mientras que una condición evalúa a `verdadero`, el código corre; de lo contrario, sale del bucle.
fr: Cette construction élimine beaucoup de nidification qui serait nécessaire si vous utilisez `loop`, `if`, `else`, et `break`, et il est plus clair. Bien qu'une condition évalue à `true`, le code fonctionne; sinon, il sort de la boucle.
id: Pembangunan ini akan menghilangkan banyak sarang yang diperlukan jika Anda menggunakan ·loope, jika tidak, dan kemudian keluar dari lingkaran.
tr: Bu yapı, loop, if, else ve break kullanırsanız gerekli olacak birçok yuvayı ortadan kaldırır ve daha nettir. Bir koşul true değerini değerlendirirken, kod çalışır; aksi takdirde döngüden çıkar.
zh_cn: 这种构思消除了使用`loop'、`if'、`else'和`break'等`loop'、`if'、`else'和`break'所必要的许多巢穴,而且更清楚。当一种条件对` true'作出评估时,代码运行;否则,它就会退出循环。

source: {{#quiz ../quizzes/ch02-05-control-flow.toml}}
fr: {{#quiz../quizes/ch02-05-control-flow.toml}}
zh_cn: ./quizzes/ch02-05- control- flow.toml /quizzes/ch02-05- control- flow.toml

source: You made it! This was a sizable chapter: you learned about variables, data types, functions, comments, `if` expressions and loops! To practice with the concepts discussed in this chapter, try building programs to do the following:
es: ¡Usted lo hizo! Este fue un capítulo considerable: usted aprendió sobre variables, tipos de datos, funciones, comentarios, expresiones `if` y bucles! Para practicar con los conceptos discutidos en este capítulo, intente construir programas para hacer lo siguiente:
fr: Vous l'avez fait! C'était un chapitre important: vous avez appris sur les variables, les types de données, les fonctions, les commentaires, les expressions `si` et les boucles! Pour pratiquer avec les concepts discutés dans ce chapitre, essayez de construire des programmes pour faire ce qui suit:
id: Anda berhasil! Ini adalah bab yang cukup besar: Anda belajar tentang variabel, tipe data, fungsi, komentar, ekspresi dan loop! untuk berlatih dengan konsep yang dibahas di bab ini, cobalah membuat program untuk melakukan hal berikut:
tr: Başardınız! Bu büyük bir bölümdü: değişkenler, veri türleri, fonksiyonlar, yorumlar, if ifadeleri ve döngüleri hakkında bilgi edindiniz! Bu bölümde tartışılan kavramlarla pratik yapmak için aşağıdakileri yapmak için programlar oluşturmayı deneyin:
zh_cn: 您做到了! 这是一个相当可观的章节: 您学习了变量、 数据类型、 函数、 注释、 “ 如果” 表达式和循环 。 要实践本章讨论的概念, 请尝试构建程序来完成以下任务 :

source: Generate the _n_\-th Fibonacci number.
es: Generar el número _n_\-th Fibonacci.
fr: Générer le numéro de _n_\-th Fibonacci.
id: Hasilkan nomor Fibonacci.
tr: _n_-th Fibonacci numarasını oluştur.
zh_cn: 生成 _n-th Fibonacci 编号。

source: Compute the factorial of a number _n_.
es: Calcular el factorial de un número _n_.
fr: Calculer la factorielle d'un nombre _n_.
id: Hitung faktorial dari sebuah nomor _n_.
tr: Bir sayının faktöriyelini hesapla _n_.
zh_cn: 计算一个数字的乘数 _n_。

source: Now, we’ll review the common collection types in Cairo in the next chapter.
es: Ahora, vamos a revisar los tipos de colección común en El Cairo en el próximo capítulo.
fr: Maintenant, nous allons examiner les types de collection communs au Caire dans le prochain chapitre.
id: Sekarang, kita akan meninjau koleksi umum di Kairo di bab berikutnya.
tr: Şimdi, Kahire'deki ortak koleksiyon türlerini bir sonraki bölümde inceleyeceğiz.
zh_cn: 现在,我们将在下一章中审查开罗的常见收集类型。

source: Cairo provides a set of common collection types that can be used to store and manipulate data. These collections are designed to be efficient, flexible, and easy to use. This section introduces the primary collection types available in Cairo: Arrays and Dictionaries.
es: El Cairo ofrece un conjunto de tipos de recolección comunes que se pueden utilizar para almacenar y manipular datos. Estas colecciones están diseñadas para ser eficientes, flexibles y fáciles de usar. Esta sección presenta los tipos de recolección primaria disponibles en El Cairo: Arrays y Diccionarios.
fr: Le Caire fournit un ensemble de types de collecte communs qui peuvent être utilisés pour stocker et manipuler des données. Ces collections sont conçues pour être efficaces, flexibles et faciles à utiliser. Cette section présente les principaux types de collecte disponibles au Caire: Arrays et Dictionnaires.
id: Kairo menyediakan sekumpulan jenis koleksi umum yang dapat digunakan untuk menyimpan dan memanipulasi data. Koleksi ini dirancang untuk menjadi efisien, fleksibel, dan mudah digunakan. Bagian ini memperkenalkan jenis koleksi utama yang tersedia di Kairo: Array dan Diactionaries.
tr: Kahire, verileri depolamak ve manipüle etmek için kullanılabilecek bir dizi ortak toplama türü sunar. Bu koleksiyonlar verimli, esnek ve kullanımı kolay olacak şekilde tasarlanmıştır. Bu bölüm, Kahire'de mevcut olan birincil toplama türlerini tanıtır: Diziler ve Sözlükler.
zh_cn: 开罗提供了一套共同的收集类型,可用于储存和操作数据,这些收集旨在高效、灵活和易于使用,本节介绍开罗的主要收集类型:阵列和字典。

source: An array is a collection of elements of the same type. You can create and use array methods by using the `ArrayTrait` trait from the core library.
es: Un array es una colección de elementos del mismo tipo. Puede crear y utilizar métodos de array usando el rasgo `ArrayTrait` de la biblioteca central.
fr: Un tableau est une collection d'éléments du même type. Vous pouvez créer et utiliser des méthodes de tableau en utilisant le caractère `ArrayTrait` de la bibliothèque centrale.
id: Array adalah kumpulan elemen dari jenis yang sama Anda dapat membuat dan menggunakan metode array dengan menggunakan sifat arrayTrait dari perpustakaan inti.
tr: Bir dizi, aynı türden öğelerin bir koleksiyonudur. Çekirdek kitaplığından ArrayTrait özelliğini kullanarak dizi yöntemleri oluşturabilir ve kullanabilirsiniz.
zh_cn: 数组是同一类型元素的集合。您可以使用核心库中的“ ArrayTrait” 特性创建和使用数组方法。

source: An important thing to note is that arrays have limited modification options. Arrays are, in fact, queues whose values can't be modified. This has to do with the fact that once a memory slot is written to, it cannot be overwritten, but only read from it. You can only append items to the end of an array and remove items from the front.
es: Una cosa importante a tener en cuenta es que los arrays tienen opciones de modificación limitadas. Los arrays son, de hecho, colas cuyos valores no se pueden modificar. Esto tiene que ver con el hecho de que una vez que se escribe una ranura de memoria, no se puede sobrescribir, pero sólo leer de ella. Sólo se pueden añadir elementos al final de un array y eliminar elementos del frente.
fr: Une chose importante à noter est que les tableaux ont des options de modification limitées. Les tableaux sont, en fait, des files d'attente dont les valeurs ne peuvent pas être modifiées. Cela a à voir avec le fait qu'une fois qu'une fente de mémoire est écrite, elle ne peut pas être écrasée, mais seulement lue d'elle. Vous pouvez seulement ajouter des éléments à la fin d'un tableau et supprimer des éléments de l'avant.
id: Sebuah hal penting untuk dicatat adalah bahwa array memiliki pilihan modifikasi terbatas. Array adalah, pada kenyataannya, antrian yang nilai-nilainya tidak dapat dimodifikasi. Ini berhubungan dengan fakta bahwa sekali sebuah slot memori ditulis, tidak dapat ditulis ulang, tetapi hanya dibaca dari itu. Anda hanya dapat menambahkan item ke akhir array dan menghapus item dari depan.
tr: Dikkat edilmesi gereken önemli bir şey, dizilerin sınırlı değişiklik seçeneklerine sahip olmasıdır. Diziler, aslında değerleri değiştirilemeyen kuyruklardır. Bu, bir bellek yuvasına yazıldığında, üzerine yazılamaz, ancak sadece ondan okunabilir. Sadece öğeleri bir dizinin sonuna ekleyebilir ve öğeleri ön taraftan kaldırabilirsiniz.
zh_cn: 需要注意的一个问题是,阵列的修改选项有限。事实上,阵列是无法修改其值的队列。这与以下事实有关:一旦内存槽被写入,它就不能被覆盖,而只能从中读取。您只能将项目附加到阵列的末尾,并从前端删除项目。

source: Creating an Array
es: Crear un Array
fr: Création d'un tableau
id: Membuat Larik
tr: Bir Dizi Oluşturmak
zh_cn: 创建队列

source: Creating an array is done with the `ArrayTrait::new()` call. Here's an example of creating an array and appending 3 elements to it::
es: Crear un array se hace con la llamada `ArrayTrait::new()`. He aquí un ejemplo de crear un array y añadir 3 elementos a él:
fr: Créer un tableau est fait avec l'appel `ArrayTrait::new()`. Voici un exemple de création d'un tableau et d'ajout de 3 éléments à celui-ci:
id: Membuat sebuah array yang dibuat dengan arrayTrait:: panggilan baru (baru). ini adalah contoh dari membuat sebuah array dan menambahkan 3 elemen:
tr: Bir dizi oluşturmak ArrayTrait::new() çağrısı ile yapılır. Burada bir dizi oluşturmak ve buna 3 eleman eklemek için bir örnek::
zh_cn: 创建数组时使用 `ArrayTrait::new () ` call' 。 这里有一个创建数组并附加 3 元素的示例 :

source: When required, you can pass the expected type of items inside the array when instantiating the array like this, or explicitly define the type of the variable.
es: Cuando sea necesario, puede pasar el tipo de elementos esperados dentro del array al instanciar el array como este, o definir explícitamente el tipo de la variable.
fr: Si nécessaire, vous pouvez passer le type d'éléments attendu à l'intérieur du tableau lors de l'activation du tableau comme ceci, ou définir explicitement le type de la variable.
id: Bila diperlukan, Anda dapat melewatkan jenis item yang diharapkan di dalam array ketika mengaktifkan array seperti ini, atau secara eksplisit mendefinisikan tipe variabel.
tr: Gerektiğinde, diziyi bu şekilde hazırlarken dizi içinde beklenen öğe türünü geçebilir veya değişkenin türünü açıkça tanımlayabilirsiniz.
zh_cn: 需要时,您可以将数组内的预期项目类型通过数组中,当对数组进行这种同步时,或者明确定义变量的类型。

source: Updating an Array
es: Actualizando un Array
fr: Mise à jour d'un tableau
id: Memperbarui Sebuah Larik
tr: Bir Dizinin Güncellenmesi
zh_cn: 更新队列

source: Adding Elements
es: Añadiendo elementos
fr: Ajout d'éléments
id: Menambahkan Elemen
tr: Elementler Ekleme
zh_cn: 添加元素

source: To add an element to the end of an array, you can use the `append()` method:
es: Para añadir un elemento al final de un array, puede utilizar el método `append()`:
fr: Pour ajouter un élément à la fin d'un tableau, vous pouvez utiliser la méthode `append()`:
id: Untuk menambahkan elemen ke ujung sebuah array, Anda dapat menggunakan metode ·append Allah):
tr: Bir dizinin sonuna bir eleman eklemek için append() yöntemini kullanabilirsiniz:
zh_cn: 要在数组结尾添加元素,请使用“附录()”方法:

source: Removing Elements
es: Eliminar elementos
fr: Suppression des éléments
id: Elemen Penghapusan
tr: Elementlerin Kaldırılması
zh_cn: 删除元素

source: You can only remove elements from the front of an array by using the `pop_front()` method. This method returns an `Option` that can be unwrapped, containing the removed element, or `Option::None` if the array is empty.
es: Sólo puede eliminar elementos del frente de un array utilizando el método `pop_front()`. Este método devuelve una `Opción` que se puede desenvolver, que contiene el elemento eliminado, o `Opción::Ninguna` si el array está vacío.
fr: Vous ne pouvez supprimer des éléments de l'avant d'un tableau qu'en utilisant la méthode `pop_front()`. Cette méthode renvoie une `Option` qui peut être déballée, contenant l'élément supprimé, ou `Option::Aucun` si le tableau est vide.
id: Anda hanya dapat menghapus elemen dari suatu array dengan menggunakan metode åpop_frontáne). Metode ini akan mengembalikan sebuah opsi yang dapat dibuka, yang berisi elemen yang dihapus, atau opsi:: Tidak ada jika susunan kosong.
tr: pop_front() metodunu kullanarak yalnızca bir dizinin ön kısmından öğeleri kaldırabilirsiniz. Bu yöntem, kaldırılan öğeyi içeren bir Option veya Option::None dizinin boş olması durumunda bir Option döndürür.
zh_cn: 您只能使用“pop_front()” 方法从数组前端删除元素。 如果数组为空, 此方法返回可解开的“ 选项”, 包含已删除元素, 或“ 选项: 无 ” 。

source: "The first value is {}"
es: "El primer valor es ""
fr: "La première valeur est {}"
id: " Nilai pertama adalah {}"
tr: "İlk değer "
zh_cn: "第一个值是"

source: The above code will print `The first value is 10` as we remove the first element that was added.
es: El código anterior imprimirá `El primer valor es 10` mientras eliminamos el primer elemento que se añadió.
fr: Le code ci-dessus va imprimer `La première valeur est 10` que nous supprimons le premier élément qui a été ajouté.
id: Kode di atas akan mencetak nilai pertama adalah 10. Ketika kita menghapus elemen pertama yang ditambahkan.
tr: Yukarıdaki kod, eklenen ilk öğeyi kaldırdığımız için İlk değer 10 olarak yazdıracaktır.
zh_cn: 上述代码将打印“第一个值为10”,因为我们删除了添加的第一个要素。

source: In Cairo, memory is immutable, which means that it is not possible to modify the elements of an array once they've been added. You can only add elements to the end of an array and remove elements from the front of an array. These operations do not require memory mutation, as they involve updating pointers rather than directly modifying the memory cells.
es: En El Cairo, la memoria es inmutable, lo que significa que no es posible modificar los elementos de un array una vez que se han añadido. Sólo se pueden añadir elementos al final de un array y eliminar elementos del frente de un array. Estas operaciones no requieren mutación de memoria, ya que implican actualizar punteros en lugar de modificar directamente las células de memoria.
fr: Au Caire, la mémoire est immuable, ce qui signifie qu'il n'est pas possible de modifier les éléments d'un tableau une fois qu'ils ont été ajoutés. Vous ne pouvez ajouter des éléments à la fin d'un tableau et supprimer des éléments de l'avant d'un tableau. Ces opérations ne nécessitent pas de mutation de mémoire, car elles impliquent la mise à jour des pointeurs plutôt que de modifier directement les cellules de mémoire.
id: Di Kairo, memori tidak dapat berubah, yang berarti bahwa tidak mungkin untuk mengubah elemen dari sebuah array setelah mereka telah ditambahkan. Anda hanya dapat menambahkan elemen ke akhir dari sebuah array dan menghapus elemen dari depan sebuah array. Operasi ini tidak memerlukan mutasi memori, karena mereka melibatkan pemutakhiran pointer daripada secara langsung mengubah sel memori.
tr: Kahire'de bellek değiştirilemez, bu da bir dizi elemanlarının eklendikten sonra değiştirilmesinin mümkün olmadığı anlamına gelir. Sadece bir dizinin sonuna elemanlar ekleyebilir ve elemanları bir dizinin önünden kaldırabilirsiniz. Bu işlemler, bellek hücrelerini doğrudan değiştirmek yerine işaretçileri güncellemeyi içerdiğinden, bellek mutasyonu gerektirmez.
zh_cn: 在开罗, 内存是不可变的, 这意味着一旦加入一个数组的元素, 就不可能修改它们。 您只能将元素添加到数组的末尾, 从数组的前面删除元素。 这些操作不需要内存突变, 因为它们涉及更新指针, 而不是直接修改内存单元格 。

source: Reading Elements from an Array
es: Leyendo elementos de una matriz
fr: Éléments de lecture d'un tableau
id: Membaca Elemen dari Array
tr: Bir Diziden Okuma Elementleri
zh_cn: 从数组读取元素

source: To access array elements, you can use `get()` or `at()` array methods that return different types. Using `arr.at(index)` is equivalent to using the subscripting operator `arr[index]`.
es: Para acceder a los elementos de array, puede utilizar métodos de array `get()` o `at()` que devuelven diferentes tipos. Usar `arr.at(index)` equivale a usar el operador de subíndice `arr[index]`.
fr: Pour accéder aux éléments de tableau, vous pouvez utiliser `get()` ou `at()` des méthodes de tableau qui renvoient différents types. L'utilisation de `arr.at(index)` est équivalente à l'utilisation de l'opérateur d'abonnement `arr[index]`.
id: Untuk mengakses elemen array, Anda dapat menggunakan æget®) atau metode array yang mengembalikan jenis yang berbeda. Menggunakan ·arrrr.at 1932index) adalah setara dengan menggunakan operator subscripting [erdex].
tr: Dizi elemanlarına erişmek için, farklı türleri döndüren get() veya at() dizi yöntemlerini kullanabilirsiniz. arr.at(index) kullanmak, arr[index] alt yazı işlecini kullanmakla eşdeğerdir.
zh_cn: 对于访问数组元素,您可以使用返回不同类型的`get()`或`at()`数组方法,使用`arr.at(index)'等于使用下标操作员`arr[index]'。

source: `get()` Method
es: Método `get()`
fr: `get()` Méthode
id: Metode ågetó)
tr: get() Yöntem
zh_cn: `get()`方法

source: The `get` function returns an `Option<Box<@T>>`, which means it returns an option to a Box type (Cairo's smart-pointer type) containing a snapshot to the element at the specified index if that element exists in the array. If the element doesn't exist, `get` returns `None`. This method is useful when you expect to access indices that may not be within the array's bounds and want to handle such cases gracefully without panics. Snapshots will be explained in more detail in the ["References and Snapshots"](./ch04-02-references-and-snapshots.md#snapshots) chapter.
es: La función `get` devuelve una `Option<BoxT, lo que significa que devuelve una opción a un tipo Box (el tipo smart-pointer de El Cairo) que contiene una instantánea al elemento en el índice especificado si ese elemento existe en el array. Si el elemento no existe, `get` devuelve `Ninguno`. Este método es útil cuando espera acceder a índices que pueden no estar dentro de los límites del array y desea manejar estos casos con gracia sin pánico. Las instantáneas se explicarán con más detalle en el capítulo ["Referencias y instantáneas"](./ch04-02-referencias-and-snapshots.md#snapshots).
fr: La fonction `get` retourne un `Option<Box<@T>>`, ce qui signifie qu'il retourne une option à un type de boîte (type de pointeur intelligent du Caire) contenant un instantané à l'élément de l'index spécifié si cet élément n'existe pas dans le tableau. Si l'élément n'existe pas, `get` retourne `Aucun`. Cette méthode est utile lorsque vous vous attendez à accéder à des indices qui ne sont pas dans les limites du tableau et veulent gérer ces cas gracieusement sans panique. Les snapshots seront expliqués plus en détail dans le chapitre ["Références et snapshots"](./ch04-02-references-and-snapshots.md#snapshots).
id: Fungsinya kembali ke tipe cerdas (Tipe penunjukCairo) berisi snapshot ke elemen pada indeks yang ditentukan jika elemen itu ada dalam susunan. Jika elemen tidak ada, maka pilihan tersebut kembali ke tipe Kotak (Kairo). Metode ini berguna ketika Anda menduga untuk mengakses indicses yang mungkin tidak berada dalam batas jangkauan array dan ingin menangani kasus tersebut secara anggun tanpa panik. Snapshots akan dijelaskan dalam rincian lebih lanjut dalam ["References" dan Snaps].
tr: get işlevi bir OptionBoxT> döndürür; bu, dizide bu eleman varsa, belirtilen indeksteki elemana anlık görüntü içeren bir Kutu tipine (Cairo'nun akıllı işaretçi tipi) bir seçenek döndürür. Eğer eleman yoksa, get#rep değerini döndürür. Bu yöntem, dizinin sınırları içinde olmayan indekslere erişmeyi beklediğinizde ve bu şekilde işlem yapmak istediğinizde kullanışlıdır.
zh_cn: `get' 函数返回“ option<Box_T ”, 这意味着它返回一个选项, 返回一个框类型( Cairo 的智能指针类型), 如果该元素存在于数组中, 则含有该元素在指定索引中的速记元素。 如果元素不存在, `get' 返回` non' 。 当您期望访问可能不在数组范围内的指数, 并且想要在不引起恐慌的情况下优雅地处理这些案例时, 此方法非常有用 。 抓图将在 [ “ 引用和抓图” (./ ch04-02- references- snapshots. md# snapshots. md# snappasss) 章中更详细地解释 。

source: Here is an example with the `get()` method:
es: He aquí un ejemplo con el método `get()`:
fr: Voici un exemple avec la méthode `get()`:
id: Berikut ini adalah sebuah contoh dengan metode ågetó):
tr: İşte get() yöntemi ile bir örnek:
zh_cn: 以下是`get()'方法的例子:
