Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: On the other hand, when bringing in structs, enums, traits, and other items with `use`, it’s idiomatic to specify the full path. Listing 7-10 shows the idiomatic way to bring the core library’s `BitSize` trait into the scope, allowing to call `bits` method to retrieve the size in bits of a type.
es: Por otra parte, al introducir structs, enums, rasgos y otros elementos con `uso`, es idiomático especificar la ruta completa. El listado 7-10 muestra la forma idiomática de introducir el rasgo `BitSize` de la biblioteca central en el alcance, permitiendo llamar al método `bits` para recuperar el tamaño en bits de un tipo.
fr: D'autre part, lors de l'introduction de structures, enums, traits, et d'autres éléments avec `use`, il est idiomatique pour spécifier le chemin complet. Listing 7-10 montre la manière idiomatique d'introduire le caractère de base de bibliothèque `BitSize` dans la portée, permettant d'appeler la méthode `bits` pour récupérer la taille en bits d'un type.
id: Di sisi lain, ketika membawa struct, enums, ciri-ciri, dan benda-benda lain yang memiliki fungsi lain, ia dapat menentukan jalur yang lengkap.
tr: Öte yandan, use ile structs, enums, özellikler ve diğer öğeleri getirirken, tam yolu belirtmek deyimseldir. 7-10 listelemek, çekirdek kütüphanesinin BitSize özelliğini kapsam içine getirmenin deyimsel yolunu gösterir ve bits yöntemini bir türdeki bitleri almak için çağırmaya izin verir.
zh_cn: 另一方面,在带入支架、支架、特性和其他有`使用'的物品时,具体说明整个路径是独特的。列出7-10显示了将核心图书馆的`BitSize'特性带入范围的独特方法,允许调用`bits'方法来检索某类型位数的大小。

source: "A u8 variable has {} bits"
es: "Una variable u8 tiene bits"
fr: "Une variable u8 a {} bits"
id: "A u8 variabel has {} bits"
tr: "Bir u8 değişkeni bitlere sahiptir"
zh_cn: u8 变量有 位元

source: <span class="caption">Listing 7-10: Bringing `BitSize` trait into scope in an idiomatic way</span>
es: <span class="caption">Lista 7-10: Llevando el rasgo `BitSize` al alcance de una manera idiomática</span>
fr: <span class="caption">Liste 7-10: Porter le caractère `BitSize` dans la portée d'une manière idiomatique</span>
id: <span class="caption">Listing 7-10: Membawa sifat ▪BitSizeó ke dalam lingkup dalam cara yang idimatis</span>
tr: span class="caption">Liste 7-10: BitSize özelliğini sıradan bir şekilde kapsamak/span>
zh_cn: <span class="Caption" > listing 7-10:将`BitSize'特性以单行方式带入范围 </span>

source: There’s no strong reason behind this idiom: it’s just the convention that has emerged in the Rust community, and folks have gotten used to reading and writing Rust code this way. As Cairo shares many idioms with Rust, we follow this convention as well.
es: No hay ninguna razón fuerte detrás de este idioma: es sólo la convención que ha surgido en la comunidad Rust, y la gente se ha acostumbrado a leer y escribir código Rust de esta manera. Como El Cairo comparte muchos idiomas con Rust, seguimos esta convención también.
fr: Il n'y a pas de raison forte derrière cet idiome: c'est juste la convention qui a émergé dans la communauté Rust, et les gens se sont habitués à lire et écrire le code Rust de cette façon. Comme le Caire partage beaucoup d'idiomes avec Rust, nous suivons cette convention aussi.
id: Tidak ada alasan yang kuat di balik ungkapan ini: itu hanya konvensi yang telah muncul di komunitas Rust, dan orang-orang terbiasa membaca dan menulis kode Rust seperti ini.
tr: Bu deyimin arkasında güçlü bir neden yoktur: sadece Rust topluluğunda ortaya çıkan kongredir ve millet Rust kodunu bu şekilde okumaya ve yazmaya alışmıştır. Kahire Rust ile birçok deyimi paylaşırken, bu kongreyi de takip ediyoruz.
zh_cn: 发自开罗 — — 与鲁斯特有着许多共同点 — — 也遵循了这项公约。 其背后没有强有力的理由:在鲁斯特社区出现的只是公约,人们也习惯了这样阅读和撰写鲁斯特代码。 开罗与鲁斯特有着许多共同点,因此我们也遵循了这项公约。

source: The exception to this idiom is if we’re bringing two items with the same name into scope with `use` statements, because Cairo doesn’t allow that.
es: La excepción a este lenguaje es si estamos trayendo dos artículos con el mismo nombre en el alcance con declaraciones de " uso ", porque El Cairo no lo permite.
fr: L'exception à cet idiome est si nous apportons deux éléments avec le même nom dans la portée avec des déclarations d'utilisation, parce que le Caire ne le permet pas.
id: Pengecualian untuk idiom ini adalah jika kita membawa dua item dengan nama yang sama ke dalam lingkup dengan pernyataan åuse, karena Kairo tidak memungkinkan itu.
tr: Bu deyimin istisnası, aynı isme sahip iki öğeyi use ifadeleri ile kapsam içine getiriyorsak, çünkü Kahire buna izin vermez.
zh_cn: 校对:Portnoy、Portnoy、Flickr、Flickr、Flickr、Flickr、Flickr、Flickr、Flickr、Flickr、Flickr、Flickr、Finland

source: Providing New Names with the `as` Keyword
es: Proporcionar nuevos nombres con la palabra clave `as`
fr: Fournir de nouveaux noms avec le mot-clé `as`
id: Menyediakan Nama Baru dengan Kata Kunci ·as)
tr: as Anahtar Kelime ile Yeni İsimler Sağlamak
zh_cn: 以`作为'关键字提供新名称

source: There’s another solution to the problem of bringing two types of the same name into the same scope with `use`: after the path, we can specify `as` and a new local name, or _alias_, for the type. Listing 7-11 shows how you can rename an import with `as`:
es: Hay otra solución al problema de introducir dos tipos del mismo nombre en el mismo ámbito con `uso`: después de la ruta, podemos especificar `as` y un nuevo nombre local, o _alias_, para el tipo. Listado 7-11 muestra cómo se puede cambiar el nombre de una importación con `as`:
fr: Il ya une autre solution au problème d'amener deux types de même nom dans la même portée avec `use`: après le chemin, nous pouvons spécifier `as` et un nouveau nom local, ou _alias_, pour le type. Listing 7-11 montre comment vous pouvez renommer une importation avec `as`:
id: Ada solusi lain untuk masalah membawa dua jenis nama yang sama ke dalam lingkup yang sama dengan Áuse: setelah jalan itu, kita dapat menentukan nama lokal yang baru, atau _alias_, untuk tipenya. Daftar 7-11 menunjukkan bagaimana Anda dapat mengubah nama impor dengan:
tr: use ile aynı adı taşıyan iki türü aynı kapsamda getirme sorununa başka bir çözüm var: Yoldan sonra, as ve yeni bir yerel ad veya _alias_'yi tür için belirtebiliriz. Listeleme 7-11, bir içe aktarmayı as ile nasıl yeniden adlandırabileceğinizi gösterir:
zh_cn: 对于将两种同名同名的“使用”纳入同一范围的问题,还有另一种解决办法:在路径之后,我们可以指定“作为”和该类型的新的本地名称,或_alias_。列出 7-11 显示您如何用“作为”重新命名导入:

source: // ArrayTrait was renamed to Arr
es: // ArrayTrait fue renombrado como Arr
fr: // ArrayTrait a été rebaptisé Arr
id: //ArrayTrait diubah namanya menjadi Arr
tr: // ArrayTrait, Arr olarak yeniden adlandırıldı
zh_cn: / 阵列Trait 重新命名为 Arr

source: <span class="caption">Listing 7-11: Renaming a trait when it’s brought into scope with the `as` keyword</span>
es: <span class="caption">Lista 7-11: Renombrar un rasgo cuando se introduce en el alcance con la palabra clave `as`</span>
fr: <span class="caption">Liste 7-11: Renaming a trait when it="s introduit dans la portée avec le mot-clé `as`</span>
id: <span class="caption">Listing 7-11: Mengubah suatu sifat ketika itu dibawa ke dalam lingkup dengan kata kunci </span>
tr: span class="caption">Liste 7-11: as anahtar kelimesi/span> ile kapsam içine getirildiğinde bir özelliği yeniden adlandırmak
zh_cn: <span class=“caption” > listing 7-11: 将“span” 类作为关键词 </span> 重新命名其范围时的特性

source: Here, we brought `ArrayTrait` into scope with the alias `Arr`. We can now access the trait's methods with the `Arr` identifier.
es: A este respecto, introdujimos `ArrayTrait` en el ámbito de aplicación del alias `Arr`. Ahora podemos acceder a los métodos del rasgo con el identificador `Arr`.
fr: Ici, nous avons mis la portée `ArrayTrait` avec l'alias `Arr`. Nous pouvons maintenant accéder aux méthodes du trait avec l'identificateur `Arr`.
id: Di sini, kami membawa arrayTrait ke dalam lingkup dengan nama alias tersebut sekarang kita dapat mengakses metode sifat dengan identifier.
tr: Burada ArrayTrait takma adıyla Arr'yi devreye soktuk. Artık Arr tanımlayıcısı ile özelliğin yöntemlerine erişebiliriz.
zh_cn: 在这里,我们用“ArrayTrait”这一别名将“ArrayTrait”带入了范围,我们现在可以使用“ArrayTrait”识别符访问该特性的方法。

source: Importing Multiple Items from the Same Module
es: Importación de varios elementos desde el mismo módulo
fr: Importation de plusieurs éléments du même module
id: Mengimpor Multiple Item dari Modul yang Sama
tr: Aynı Modülden Birden Fazla Öğe İçe Aktarılıyor
zh_cn: 从同一个模块导入多个项目

source: When you want to import multiple items (like functions, structs or enums) from the same module in Cairo, you can use curly braces `{}` to list all of the items that you want to import. This helps to keep your code clean and easy to read by avoiding a long list of individual `use` statements.
es: Cuando desea importar varios elementos (como funciones, structs o enums) desde el mismo módulo en El Cairo, puede utilizar llaves rizadas para listar todos los elementos que desea importar. Esto ayuda a mantener su código limpio y fácil de leer evitando una larga lista de declaraciones individuales de `uso`.
fr: Lorsque vous voulez importer plusieurs éléments (comme des fonctions, des structures ou des enums) du même module au Caire, vous pouvez utiliser des accessoires bouclés `{}` pour lister tous les éléments que vous voulez importer. Cela permet de garder votre code propre et facile à lire en évitant une longue liste de déclarations individuelles d'utilisation.
id: Bila Anda ingin mengimpor beberapa item (seperti fungsi, struktur, atau enums) dari modul yang sama di Kairo, Anda dapat menggunakan kurung keriting untuk daftar semua item yang ingin Anda impor. Hal ini membantu untuk menjaga kode Anda tetap bersih dan mudah dibaca dengan menghindari daftar panjang dari setiap pernyataan yang digunakan.
tr: Kahire'deki aynı modülden birden fazla öğeyi (fonksiyonlar, yapılar veya enumlar gibi) içe aktarmak istediğinizde, içe aktarmak istediğiniz tüm öğeleri listelemek için kıvırcık diş tellerini kullanabilirsiniz. Bu, kodunuzu uzun bir bireysel use ifadesi listesinden kaçınarak temiz ve okunması kolay tutmaya yardımcı olur.
zh_cn: 当您想要从开罗的同一个模块中导入多个项目(类似函数、支架或 enums) 时,您可以使用卷尾括号 \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: The general syntax for importing multiple items from the same module is:
es: La sintaxis general para importar múltiples elementos desde el mismo módulo es:
fr: La syntaxe générale pour importer plusieurs éléments du même module est :
id: Sintaks umum untuk mengimpor beberapa butir dari modul yang sama adalah:
tr: Aynı modülden birden fazla öğeyi içe aktarmak için genel sözdizimi:
zh_cn: 从同一个模块导入多个项目的一般语法是:

source: Here is an example where we import three structures from the same module:
es: Aquí hay un ejemplo donde importamos tres estructuras del mismo módulo:
fr: Voici un exemple où nous importons trois structures du même module :
id: Ini adalah contoh di mana kita mengimpor tiga struktur dari modul yang sama:
tr: İşte aynı modülden üç yapıyı içe aktardığımız bir örnek:
zh_cn: 以下是我们从同一个模块导入三个结构的例子:

source: // Assuming we have a module called `shapes` with the structures `Square`, `Circle`, and `Triangle`.
es: // Suponiendo que tengamos un módulo llamado `formas` con las estructuras `Cuadrado`, `Círculo` y `Triángulo`.
fr: // Supposons que nous ayons un module appelé `shapes` avec les structures `Square`, `Circle` et `Triangle`.
id: //Berasumsikan kita memiliki sebuah modul yang disebut pembentukan dengan strukturnya, dan berukuran besar.
tr: // Square, Circle ve Triangle yapılarıyla shapes adında bir modülümüz olduğunu varsayarsak.
zh_cn: / 假设我们有一个称为`形状'的单元,其结构为`结构'、`环绕'和`三角'。

source: // We can import the structures `Square`, `Circle`, and `Triangle` from the `shapes` module like this:
es: // Podemos importar las estructuras `Square`, `Círculo` y `Triángulo` desde el módulo `formas` como este:
fr: // Nous pouvons importer les structures `Square`, `Circle` et `Triangle` à partir du module `shapes` comme ceci:
id: /Kita dapat mengimpor strukturnya, dan dari modul yang berbeda seperti ini:
tr: // Square, Circle ve Triangle yapılarını shapes modülünden şu şekilde içe aktarabiliriz:
zh_cn: 我们可以从这种“形状”模块中进口“平方”、“圆圈”和“三角形”结构,例如:

source: // Now we can directly use `Square`, `Circle`, and `Triangle` in our code.
es: // Ahora podemos utilizar directamente `Square`, `Circle` y `Triangle` en nuestro código.
fr: // Nous pouvons maintenant utiliser directement `Square`, `Circle` et `Triangle` dans notre code.
id: /Sekarang kita bisa langsung menggunakan istilah, Circle, dan Triangle dalam kode kita.
tr: // Şimdi kodumuzda Square, Circle ve Triangle'ı doğrudan kullanabiliriz.
zh_cn: 现在,我们可以在我们的代码中直接使用`平方'、`圆圈'和`三角'。

source: <span class="caption">Listing 7-12: Importing multiple items from the same module</span>
es: <span class="caption">Lista 7-12: Importación de múltiples elementos del mismo módulo</span>
fr: <span class="caption">Liste 7-12: Importation de plusieurs éléments du même module</span>
id: <span class="caption">Listing 7-12: Mengimpor beberapa item dari modul yang sama</span>
tr: span class="caption">Liste 7-12: Aynı modülden birden fazla öğe içe aktarılıyor/span>
zh_cn: <span类="Caption" > listing 7-12: 从同一个模块导入多个项目 </span>

source: Re-exporting Names in Module Files
es: Reexportación de nombres en archivos de módulos
fr: Réexportation de noms dans des fichiers de modules
id: Mengekspor ulang Nama dalam Berkas Modul
tr: Modül Dosyalarında İsimleri Yeniden Aktarma
zh_cn: 在模块文件中重新导出名称

source: When we bring a name into scope with the `use` keyword, the name available in the new scope can be imported as if it had been defined in that code’s scope. This technique is called _re-exporting_ because we’re bringing an item into scope, but also making that item available for others to bring into their scope, with the `pub` keyword.
es: Cuando ponemos un nombre en el alcance con la palabra clave `usar`, el nombre disponible en el nuevo alcance se puede importar como si se hubiera definido en el alcance de ese código. Esta técnica se llama _reexportar_ porque estamos introduciendo un elemento en el alcance, pero también poniendo ese elemento a disposición de otros para introducir en su alcance, con la palabra clave `pub`.
fr: Lorsque nous apportons un nom dans la portée avec le mot-clé `use`, le nom disponible dans la nouvelle portée peut être importé comme s'il avait été défini dans la portée de ce code. Cette technique est appelée _re-exporting_ parce que nous apportons un élément dans la portée, mais aussi rendre cet élément disponible pour les autres à apporter dans leur portée, avec le mot-clé `pub`.
id: Ketika kita membawa nama ke dalam lingkup dengan kata kunci yang digunakan, nama yang tersedia dalam lingkup baru dapat diimpor seolah-olah telah didefinisikan dalam lingkup kode tersebut. Teknik ini disebut _re-exporting_ karena kita membawa item ke dalam lingkup, tetapi juga membuat item yang tersedia bagi orang lain untuk membawa ke dalam lingkup mereka, dengan kata kunci Épubá.
tr: use anahtar kelimesi ile bir adı kapsadığımızda, yeni kapsamda mevcut olan isim, o kodun kapsam içinde tanımlanmış gibi içe aktarılabilir. Bu teknik _re-ihracat_ olarak adlandırılır, çünkü bir öğeyi kapsam içine getiriyoruz, aynı zamanda bu öğeyi başkalarının kapsamına sokması için de kullanılabilir hale getiriyoruz, pub anahtar kelimesi ile.
zh_cn: 当我们用“使用”关键字将一个名称带入范围时,新范围中可用的名称可以仿照该代码的范围所定义的那样导入。这种技术被称为`re-export ',因为我们正在将一个项目带入范围,但也使该物品可供其他人使用,用“pub”关键字带入范围。

source: For example, let's re-export the `add_to_waitlist` function in the restaurant example:
es: Por ejemplo, reexportemos la función `add_to_waitlist` en el ejemplo del restaurante:
fr: Par exemple, réexportons la fonction `add_to_waitlist` dans l'exemple du restaurant :
id: Sebagai contoh, mari kita tunjukkan kembali fungsi dari restoran:
tr: Örneğin, restoran örneğinde add_to_waitlist işlevini yeniden aktaralım:
zh_cn: 例如,让我们再出口餐厅中的`add_to_waitlist'功能,例如:

source: <span class="caption">Listing 7-13: Making a name available for any code to use from a new scope with `pub use`</span>
es: <span class="caption">Lista 7-13: Hacer disponible un nombre para cualquier código a usar desde un nuevo alcance con `pub use/span>
fr: <span class="caption">Liste 7-13: Rendre disponible un nom pour tout code à utiliser à partir d'une nouvelle portée avec `pub use`</span>
id: <span class="caption">Listing 7-13: Membuat nama tersedia untuk kode apapun untuk digunakan dari lingkup baru dengan </span>
tr: span class="caption">Liste 7-13: pub kullanımı/span> ile yeni bir kapsamdan kullanılacak herhangi bir kod için bir isim yapmak
zh_cn: <span类=“caption” > listing 7- 13: 为任何代码提供名称, 以便从新范围中使用“ pub use_/span” 。

source: Before this change, external code would have to call the `add_to_waitlist` function by using the path `restaurant::front_of_house::hosting::add_to_waitlist()`. Now that this `pub use` has re-exported the `hosting` module from the root module, external code can now use the path `restaurant::hosting::add_to_waitlist()` instead.
es: Antes de este cambio, el código externo tendría que llamar a la función `add_to_waitlist` usando la ruta `restaurante::front_of_house::hosting::add_to_waitlist()`. Ahora que este `pub use` ha reexportado el módulo `hosting` desde el módulo raíz, el código externo ahora puede usar la ruta `restaurante::hosting:::add_to_waitlist()` en su lugar.
fr: Avant ce changement, le code externe devrait appeler la fonction `add_to_waitlist` en utilisant le chemin `restaurant::front_of_house::hosting::add_to_waitlist()`. Maintenant que ce `pub use` a réexporté le module `hosting` du module racine, le code externe peut désormais utiliser le chemin `restaurant::hosting::add_to_waitlist()`.
id: Sebelum perubahan ini, kode eksternal harus menghubungi ·add_to_waitlist dengan menggunakan jalur ▪restaurant::front_of_house:::hosting::::add_waitlist Allaht_to_waitlist). Sekarang bahwa fungsi ▪pub ini menggunakan kembali modul dari modul root, kode eksternal sekarang dapat menggunakan path Áretaurant::hos:hos:ad_wait:ad_waitlist) sebagai gantinya.
tr: Bu değişiklikten önce, dış kodun restaurant::front_of_house::hosting::add_to_waitlist() yolunu kullanarak add_to_waitlist işlevini çağırması gerekir. Şimdi bu pub kullanımı hosting modülünü kök modülden yeniden dışa aktardığına göre, dış kod artık restaurant:hosting_wait() yolunu kullanabilir.
zh_cn: 更改前,外部代码必须使用路径`restaurant::front_of_house:: hosting::add_to_waitlist()'来调用`add_to_waitlist()' 函数,以此称呼`add_to_waitlist()'功能。 现在,由于这个`pub use'已从根模块中再导出`东道'模块,外部代码现在可以使用路径`restaurant:: hosting:add_to_waitlist()'。

source: Re-exporting is useful when the internal structure of your code is different from how programmers calling your code would think about the domain. For example, in this restaurant metaphor, the people running the restaurant think about “front of house” and “back of house.” But customers visiting a restaurant probably won’t think about the parts of the restaurant in those terms. With `pub use`, we can write our code with one structure but expose a different structure. Doing so makes our library well organized for programmers working on the library and programmers calling the library.
es: La reexportación es útil cuando la estructura interna de su código es diferente de cómo los programadores que llaman a su código pensarían en el dominio. Por ejemplo, en esta metáfora del restaurante, las personas que dirigen el restaurante piensan en “front of house” y “back of house”. Pero los clientes que visitan un restaurante probablemente no pensarán en las partes del restaurante en esos términos. Con `uso de pub`, podemos escribir nuestro código con una estructura pero exponer una estructura diferente. Hacerlo hace que nuestra biblioteca esté bien organizada para los programadores que trabajan en la biblioteca y los programadores que llaman a la biblioteca.
fr: La réexportation est utile lorsque la structure interne de votre code est différente de la façon dont les programmeurs appelant votre code penseraient au domaine. Par exemple, dans cette métaphore de restaurant, les gens qui dirigent le restaurant pensent à "front de maison" et "back of house." Mais les clients visitant un restaurant n'ont probablement pas pensé aux parties du restaurant en ces termes. Avec "pub use", nous pouvons écrire notre code avec une seule structure mais exposer une structure différente.
id: Pengeksporan ulang berguna ketika struktur internal kode Anda berbeda dari bagaimana programmer memanggil kode Anda akan berpikir tentang domain. misalnya, dalam metafora restoran ini, orang-orang yang menjalankan restoran berpikir tentang ·front rumah# dan kembalinya rumah.
tr: Kodunuzun iç yapısı, kodunuzu arayan programcıların etki alanı hakkında nasıl düşüneceğinden farklı olduğunda yeniden dışa aktarma yararlıdır. Örneğin, bu restoran metaforunda, restoranı işleten insanlar "evin ön yüzü" ve "evin arkası" hakkında düşünürler. Ancak bir restoranı ziyaret eden müşteriler muhtemelen restoranın bölümlerini bu terimlerle düşünmezler. pub kullanımı ile kodumuzu tek bir yapı ile yazabiliriz, ancak kütüphaneyi iyi bir şekilde işlerken farklı bir yapıyı ortaya koyabiliriz.
zh_cn: 当您的代码的内部结构与程序员如何称呼您的代码会想到域不同时,再出口是有用的。 比如,在这个餐馆的隐喻中,餐馆的老板会想到“前门 ” 和“后门 ” 。 但是,访问餐馆的顾客可能不会用这些术语来考虑餐厅的零件。有了“pub use ”, 我们就可以用一个结构来写我们的代码,但暴露不同的结构。 这样做,我们的图书馆就为图书馆的编程员和叫图书馆的编程员组织得井然有序了。

source: Using External Packages in Cairo with Scarb
es: Uso de paquetes externos en El Cairo con Scarb
fr: Utilisation de paquets externes au Caire avec écharpe
id: Menggunakan Paket Eksternal di Kairo dengan Scarb
tr: Kahire'de Harici Paketleri Scarb ile Kullanmak
zh_cn: 在开罗使用带有刀疤的外部软件包
