Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Now we define the struct. As you might have noticed, we didn't derive the `Hash` trait. If you attempt to derive the `Hash` trait for this struct, it will result in an error because the structure contains a field that is not hashable.
es: Ahora definimos la estructura. Como habrás notado, no derivamos el rasgo `Hash`. Si intentas derivar el rasgo `Hash` para esta estructura, resultará en un error porque la estructura contiene un campo que no es hashable.
fr: Maintenant nous définissons la structure. Comme vous l'avez peut-être remarqué, nous n'avons pas déduit le caractère `Hash`. Si vous essayez de déduire le caractère `Hash` pour cette structure, il en résultera une erreur parce que la structure contient un champ qui n'est pas hashable.
id: Sekarang kita definisikan strukturnya seperti yang mungkin anda perhatikan, kita tidak mendapatkan sifat hash. jika anda mencoba untuk memperoleh sifat dari struktur ini, itu akan mengakibatkan kesalahan karena strukturnya mengandung medan yang tidak dapat dilewati.
tr: Şimdi yapıyı tanımlıyoruz. Fark etmiş olabileceğiniz gibi, Hash özelliğini türetmedik. Bu yapı için Hash özelliğini türetmeye çalışırsanız, bir hataya neden olur çünkü yapıda hashable olmayan bir alan bulunur.
zh_cn: 现在,我们定义结构。正如你可能注意到的那样,我们没有得出“哈什”特性。如果你试图得出这一结构的“哈什”特性,它将导致错误,因为结构包含一个非易乱的字段。

source: In this example, we initialized a `HashState` (`hash`), updated it and then called the function `finalize()` on the `HashState` to get the computed hash `hash_felt252`. We used `poseidon_hash_span` on the `Span` of the `Array<felt252>` to compute its hash.
es: En este ejemplo, inicializamos un `HashState` (`hash`), lo actualizamos y luego llamamos la función `finalize()` en el `HashState` para obtener el hash computado `hash_felt252`. Usamos `poseidon_hash_span` en el `Span` del `Array<felt252® para calcular su hash.
fr: Dans cet exemple, nous avons initialisé un `HashState` (`hash`), l'avons mis à jour et ensuite appelé la fonction `finalize()` sur le `HashState` pour obtenir le hash calculé `hash_felt252`. Nous avons utilisé `poseidon_hash_span` sur le `Span` du `Array<felt252>` pour calculer son hash.
id: Dalam contoh ini, kami menginisialisasi sebuah hashstate (rasa 252), memperbaruinya dan kemudian disebut fungsinya pada ·finalisasiá) untuk mendapatkan hashstate atau hashed hash_felt252.
tr: Bu örnekte, bir HashState (hash) başlattık, güncelledik ve daha sonra HashState üzerindeki finalize() fonksiyonunu, hash_felt252 hesaplanmış hash'i almak için çağırdık. Arrayfelt252> dosyasının Span'inde poseidon_hash_span kullandık.
zh_cn: 在这个例子中,我们先开始一个`Hash State'(`hash') (`hash') (`hash'),然后更新了它,然后在`Hash State'上称为`Finalize() ',以获得计算出的hash`hash_felt252'(`hash_felt252'),我们在`Array<felt252'的`span'`span'(`span')上使用`posidon_hash_span'(`span')来计算其散列。

source: The Cairo language has some plugins that allow developers to simplify their code. They are called `inline_macros` and are a way of writing code that generates other code.
es: El idioma El Cairo tiene algunos plugins que permiten a los desarrolladores simplificar su código. Se llaman `inline_macros` y son una forma de escribir código que genera otro código.
fr: La langue du Caire a quelques plugins qui permettent aux développeurs de simplifier leur code. Ils sont appelés `inline_macros` et sont une façon d'écrire du code qui génère d'autres code.
id: Bahasa Kairo memiliki beberapa pengaya yang memungkinkan pengembang menyederhanakan kode mereka.
tr: Kahire dili, geliştiricilerin kodlarını basitleştirmelerine izin veren bazı eklentilere sahiptir. Bunlara inline_macros denir ve başka kodlar oluşturan bir kod yazma yoludur.
zh_cn: 开罗语言有一些插件可以让开发者简化代码。 它们被称为“ 内线_ macros ”, 是一种生成其他代码的写法。

source: `consteval_int!` Macro
id: Makro
tr: consteval_int! Makro
zh_cn: `contenteval_int!' 宏

source: In some situations, a developer might need to declare a constant that is the result of a computation of integers. To compute a constant expression and use its result at compile time, it is required to use the `consteval_int!` macro.
es: En algunas situaciones, un desarrollador puede necesitar declarar una constante que es el resultado de un cálculo de enteros. Para calcular una expresión constante y utilizar su resultado en el tiempo de compilación, se requiere utilizar la macro `consteval_int!`.
fr: Dans certaines situations, un développeur peut avoir besoin de déclarer une constante qui est le résultat d'un calcul d'entiers. Pour calculer une expression constante et utiliser son résultat au moment de la compilation, il est nécessaire d'utiliser la macro `consteval_int!`.
id: Dalam beberapa situasi, seorang pengembang mungkin perlu menyatakan konstan yang merupakan hasil dari komputasi integer. Untuk menghitung ekspresi konstan dan menggunakan hasilnya pada waktu yang dikompilasi, dibutuhkan untuk menggunakan ▪consteval_int! makro.
tr: Bazı durumlarda, bir geliştiricinin tamsayıların hesaplanmasının sonucu olan bir sabiti beyan etmesi gerekebilir. Sabit bir ifadeyi hesaplamak ve sonuçlarını derleme zamanında kullanmak için consteval_int! makrosunu kullanması gerekir.
zh_cn: 在某些情况下,开发者可能需要声明一个常数,该常数是计算整数的结果。要计算一个常数表达式并在编译时使用其结果,就需要使用`conteval_int!' 宏。

source: Here is an example of `consteval_int!`:
es: He aquí un ejemplo de `consteval_int!`:
fr: Voici un exemple de `consteval_int!`:
id: Berikut ini adalah contoh dari iconsteval_int!:
tr: İşte consteval_int! örneği:
zh_cn: 以下是`conteval_int!'的例子:

source: This will be interpreted as `const a: felt252 = 8;` by the compiler.
es: Esto se interpretará como `const a: feed252 = 8;` por el compilador.
fr: Ceci sera interprété comme «const a: feel252 = 8;» par le compilateur.
id: Ini akan ditafsirkan sebagai åconst a: felt252 = 8;-- oleh kompiler.
tr: Bu, derleyici tarafından const a: keçe252 = 8; olarak yorumlanacaktır.
zh_cn: 这将被汇编者解释为`a: feel252=8;'。

source: `selector!` Macro
fr: "sélécteur!" Macro
id: Pembeku! Macro
tr: selector! Makro
zh_cn: `选择者!'宏观

source: See [Entry Point Selector](./ch15-02-contract-dispatchers-library-dispatchers-and-system-calls.md#entry-point-selector).
es: Véase [Selector de puntos de entrada](./ch15-02-contract-dispatchers-biblioteca-dispatchers-and-system-calls.md#entry-point-selector).
fr: Voir [Sélecteur de points d'entrée](./ch15-02-contrat-dispatchers-bibliothèque-dispatchers-et-système-calls.md#entry-point-selector).
id: Lihat [Entertry Point Selektor]./ch15-02-contract-dispatchers-library-dispatchers-and-system-calls.md#entry-point-sector).
tr: [Entry Point Selector](./ch15-02-contract-dispatchers-library-dispatchers-and-system-calls.md#entry-point-selector] sayfasına bakın.
zh_cn: 见[输入点选择器](./ch15-02-合同-发送器-图书馆-发送器-发送器-系统呼叫.md#entry-点选择器)。

source: `print!` and `println!` Macros
es: `print!` y `println!` Macros
fr: Macros `print!` et `println!`
id: Cetakan! Macros
tr: print! ve println! Makrolar
zh_cn: " 印刷! " 和 " 印刷! " 宏

source: Please refer to the [Printing](./ch11-08-printing.md) page.
es: Consulte la página [Imprimir](./ch11-08-printing.md).
fr: Veuillez consulter la page [Imprimer](./ch11-08-printing.md).
id: Silakan merujuk ke halaman [Printing]. /ch11-08-printing.md).
tr: Lütfen [Baskı](./ch11-08-printing.md) sayfasına bakın.
zh_cn: 请参见[打印](./ch11-08-printing.md)页面。

source: Please refer to the [Arrays](./ch03-01-arrays.md) page.
es: Consulte la página [Arrays](./ch03-01-arrays.md).
fr: Veuillez consulter la page [Arrays](./ch03-01-arrays.md).
id: Silakan merujuk ke halaman [Arrays]. /ch03-01-arrays.md).
tr: Lütfen [Arrays](./ch03-01-arrays.md) sayfasına bakın.
zh_cn: 请参见[Arrays] (./ch03-01-arrays.md)页面。

source: See [Unrecoverable Errors with panic](./ch09-01-unrecoverable-errors-with-panic.html#panic-macro) page.
es: Véase la página [Errores irrecuperables con pánico](./ch09-01-errores irrecuperables-with-panic.html#panic-macro).
fr: Voir la page [Erreurs non récupérables avec panique](./ch09-01-errors-with-panic.html#panic-macro).
id: Lihat [ Error Tak Tercover dengan panik]. /ch09-01-uncoverable-errors-with-panic.html#panic-macro) halaman.
tr: Bakınız [Panikle düzeltilemeyen hatalar](./ch09-01-unrecoverable-errors-with-panic.html#panic-macro) sayfası.
zh_cn: 见[惊慌中无法挽回的错误] (./ch09-01-无法复原-erors- with-panic.html#panic-macro)页面。

source: `assert!` and `assert_xx!` Macros
es: `asertar!` y `asertar_xx!` Macros
fr: `assert!` et `assert_xx!` Macros
id: Dan Macrossert_xx!
tr: assert! ve assert_xx! Makrolar
zh_cn: " 资产! " 和 " 资产_xx! " 宏观

source: See [How to Write Tests](./ch10-01-how-to-write-tests.md) page.
es: Véase la página [Cómo escribir pruebas](./ch10-01-how-to-write-tests.md).
fr: Voir [Comment écrire des tests](../ch10-01-how-to-write-tests.md) page.
id: Lihat [Bagaimana Menulis Tests]. /ch10-01-how-to- write-tests.md) halaman.
tr: [Testler Nasıl Yazılır](./ch10-01-how-to-write-tests.md) sayfasına bakın.
zh_cn: 见[如何写测试](./ch10-01-how-to-write-tests.md)页面。

source: `format!` Macro
es: `formato!` Macro
id: Macro
tr: format! Makro
zh_cn: `format!'宏观

source: See [Printing](./ch11-08-printing.html#formatting) page.
es: Véase la página [Imprimir](./ch11-08-printing.html#formatting).
fr: Voir la page [Imprimer](./ch11-08-printing.html#formatting).
id: Lihat halaman.html#formatting). /ch11-08-printing.html#formatting).
tr: [Printing](./ch11-08-printing.html#formatting] sayfasına bakın.
zh_cn: 见[Printing] (./ch11-08-printing.html#formatting)页面。

source: `write!` and `writeln!` Macros
es: `escriba!` y `escriba!` Macros
fr: Macros `écrivez!` et `écrivez!`
id: Tulis! Dan tulislah! Macros
tr: write! ve writeln! Makrolar
zh_cn: " wwrite! " 和 " writeln! " 宏

source: See [Printing](./ch11-08-printing.html#printing-custom-data-types) page.
es: Véase la página [Imprimir](./ch11-08-printing.html#printing-custom-data-types).
fr: Voir la page [Imprimer](./ch11-08-printing.html#printing-custom-data-types).
id: Lihat halaman.html#printing-custom-data-types).
tr: [Printing](./ch11-08-printing.html#printing-custom-data-types] sayfasına bakın.
zh_cn: 见[Printing] (./ch11-08-printing.html#printing-custom-data-type)页面。

source: `get_dep_component!`, `get_dep_component_mut` and `component!` Macros
es: `get_dep_component!`, `get_dep_component_mut` y `component!` Macros
fr: `get_dep_component!`, `get_dep_component_mut` et `component!` Macros
id: Get_dep_component!, misal_dep_component_mut_component dan komponent!
tr: get_dep_component!, get_dep_component_mut ve component! Makrolar
zh_cn: ` Get_ dep_ 构件!'、` get_ dep_ 构件_ mut'和` 构件!'宏

source: Please refer to the [Composability and Components](./ch16-02-00-composability-and-components.md) chapter.
es: Véase el capítulo [Composibilidad y componentes](./ch16-02-00-composability-and-components.md).
fr: Veuillez consulter le chapitre [Composabilité et composants](./ch16-02-00-composabilité-et-composantes.md).
id: Mohon merujuk ke bab [Komputasi dan Komponen]./ch16-02-00-kompetisi-dan-komponen.md).
tr: Lütfen [Komposability and Components](./ch16-02-00-composability-and-components.md) bölümüne bakınız.
zh_cn: 请参见[可容性和构件](./ch16-02-00-可容性和构件.md)一章。

source: Inlining is a common code optimization technique supported by most compilers. It involves replacing a function call at the call site with the actual code of the called function, eliminating the overhead associated with the function call itself. This can improve performance by reducing the number of instructions executed, but may increase the total size of the program. When you're thinking about whether to inline a function, take into account things like how big it is, what parameters it has, how often it gets called, and how it might affect the size of your compiled code.
es: Inlining es una técnica de optimización de código común soportada por la mayoría de los compiladores. Implica reemplazar una llamada de función en el sitio de llamada con el código real de la función llamada, eliminando los gastos generales asociados con la llamada de función en sí. Esto puede mejorar el rendimiento reduciendo el número de instrucciones ejecutadas, pero puede aumentar el tamaño total del programa. Cuando usted está pensando en si inline una función, tener en cuenta cosas como lo grande que es, qué parámetros tiene, con qué frecuencia se llama, y cómo podría afectar el tamaño de su código compilado.
fr: Il s'agit de remplacer un appel de fonction sur le site d'appel par le code réel de la fonction appelée, en éliminant les frais généraux associés à l'appel de fonction lui-même. Cela peut améliorer les performances en réduisant le nombre d'instructions exécutées, mais peut augmenter la taille totale du programme. Lorsque vous pensez à l'opportunité d'inligner une fonction, prendre en compte des choses comme combien elle est grande, quels paramètres elle a, combien de fois elle est appelée, et comment elle peut affecter la taille de votre code compilé.
id: Inlining adalah teknik optimasi kode umum yang didukung oleh kebanyakan kompiler. Ini mencakup mengganti panggilan fungsi pada situs panggilan yang sebenarnya dengan kode yang disebut fungsi, menghilangkan overhead yang terkait dengan panggilan fungsi itu sendiri. Hal ini dapat meningkatkan kinerja dengan mengurangi jumlah instruksi yang dijalankan, tetapi dapat meningkatkan total ukuran program. Ketika Anda berpikir tentang apakah untuk inline fungsi, memperhitungkan hal-hal seperti besar itu, apa parameter itu, seberapa sering disebut, dan bagaimana mungkin mempengaruhi ukuran kode yang dikompile Anda.
tr: İnlining, çoğu derleyici tarafından desteklenen ortak bir kod optimizasyonu tekniğidir. Çağrı sitesindeki bir fonksiyon çağrısını, çağrılan fonksiyonun gerçek koduyla değiştirmeyi, fonksiyon çağrısının kendisiyle ilişkili yükü ortadan kaldırmayı içerir. Bu, çalıştırılan talimatların sayısını azaltarak performansı artırabilir, ancak programın toplam boyutunu artırabilir. Bir işlevi satır içine alıp almamayı düşünürken, ne kadar büyük olduğunu, hangi parametrelere sahip olduğunu, ne kadar sık adlandırılabileceğini ve ne kadar sık adlandırılabileceğini göz önünde bulundurun.
zh_cn: 内衬是一种常见的代码优化技术,得到大多数编译者的支持。 它涉及用调用站点的函数实际代码替换一个调用功能的实际代码, 消除函数调用本身的间接费用。 这可以通过减少执行指令的数量来改进性能, 但可能会增加程序的总规模。 当您在考虑是否插入一个函数时, 要考虑到它有多大、 它有多少参数、 它被调用的次数如何, 以及它会如何影响您编译的代码的大小 。

source: The `inline` Attribute
es: El atributo `en línea`
fr: L'attribut «inline»
id: Atribut dalam bahasa Inggris
tr: inline Özniteliği
zh_cn: `内含'属性

source: In Cairo, the `inline` attribute suggests whether or not the Sierra code corresponding to the attributed function should be directly injected in the caller function's context, rather than using a `function_call` libfunc to execute that code.
es: En El Cairo, el atributo `inline` sugiere si el código Sierra correspondiente a la función atribuida debe inyectarse directamente en el contexto de la función de llamada, en lugar de utilizar un libfunc `func func `func ` para ejecutar ese código.
fr: Au Caire, l'attribut `inline` suggère si le code Sierra correspondant à la fonction attribuée doit être injecté directement dans le contexte de la fonction appelante, plutôt que d'utiliser un libfunc `fonction_call` pour exécuter ce code.
id: Di Kairo, atribut æinlineé menunjukkan apakah kode Sierra berhubungan dengan fungsi atribut yang harus disuntikkan langsung dalam konteks fungsi pemanggil, daripada menggunakan sebuah libfunc thosefunction_call untuk menjalankan kode tersebut.
tr: Kahire'de, inline özniteliği, atfedilen işleve karşılık gelen Sierra kodunun, bu kodu çalıştırmak için bir function_call libfunc kullanmak yerine, arayanın işlevi bağlamında doğrudan enjekte edilip edilmemesi gerektiğini önerir.
zh_cn: 在开罗,`内线'属性表明,与归属函数相对应的Sierra代码是否应该直接注入调用函数的上下文,而不是使用`函数呼叫' libfunc来执行该代码。

source: There are three variants of the `inline` attribute that one can use:
es: Hay tres variantes del atributo `inline` que se puede utilizar:
fr: Il y a trois variantes de l'attribut `inline` que l'on peut utiliser:
id: Ada tiga varian dari atribut åinline-- yang dapat digunakan:
tr: inline özniteliğinin kullanabileceği üç varyantı vardır:
zh_cn: " 内含 " 属性有三种变式,人们可以使用:

source: `#[inline]` suggests performing an inline expansion.
es: •[en línea]` sugiere realizar una expansión en línea.
fr: `#[inline]` suggère d'effectuer une expansion en ligne.
id: ___[inline]*** menyarankan untuk melakukan ekspansi inline.
tr: #[inline] satır içi genişleme gerçekleştirmeyi önerir.
zh_cn: `[内 `建议进行内线扩展。

source: `#[inline(always)]` suggests that an inline expansion should always be performed.
es: •[en línea(siempre)]` sugiere que siempre se debe realizar una expansión en línea.
fr: `#[inline(toujours)]` suggère qu'une expansion en ligne doit toujours être effectuée.
id: ▪#[inlinemeisteralways]] menunjukkan bahwa ekspansi inline harus selalu dilakukan.
tr: #[inline(her zaman)] bir satır içi genişletmenin her zaman yapılması gerektiğini önerir.
zh_cn: `建议始终应进行内线扩展。

source: `#[inline(never)]` suggests that an inline expansion should never be performed.
es: •[inline(nunca)]` sugiere que nunca se debe realizar una expansión en línea.
fr: `#[inline(jamais)]` suggère qu'une expansion en ligne ne devrait jamais être effectuée.
id: ▪#[inline Allah tidak pernah) menunjukkan bahwa ekspansi inline tidak boleh dilakukan.
tr: #[inline(never)] satır içi genişlemenin asla yapılmaması gerektiğini öne sürer.
zh_cn: `[内(内 `建议绝不应进行内线扩展。

source: Note: the `inline` attribute in every form is a hint, with no requirements on the language to place a copy of the attributed function in the caller. This means that the attribute may be ignored by the compiler. In practice, `#[inline(always)]` will cause inlining in all but the most exceptional cases.
es: Nota: el atributo `inline` en cada forma es una pista, sin requisitos en el idioma para colocar una copia de la función atribuida en la persona que llama. Esto significa que el atributo puede ser ignorado por el compilador. En la práctica, "[inline(siempre)]` causará inlining en todos los casos excepto en los más excepcionales.
fr: Note : l'attribut `inline` dans chaque forme est un indice, sans aucune exigence sur la langue pour placer une copie de la fonction attribuée dans l'appelant. Cela signifie que l'attribut peut être ignoré par le compilateur. Dans la pratique, `#[inline(toujours)]` provoquera l'inline dans tous les cas sauf les cas les plus exceptionnels.
id: Catatan: atribut dalam setiap bentuk adalah petunjuk, tanpa persyaratan pada bahasa untuk menempatkan salinan fungsi atribut pada pemanggil. Ini berarti atribut tersebut dapat diabaikan oleh kompiler. Dalam praktek, "#[inline kalians)] akan menyebabkan inlining dalam semua kecuali kasus yang paling luar biasa.
tr: Not: Her formdaki inline özniteliği, dile atfedilen fonksiyonun bir kopyasını arayan kişiye yerleştirmek için bir ipucu değildir. Bu, özniteliğin derleyici tarafından göz ardı edilebileceği anlamına gelir. Pratikte, #[inline(hep)] en istisnai durumlar dışında tümünde inlining'e neden olacaktır.
zh_cn: 注: " 内嵌的 " 属性在每一种形式中都是提示,不需要语言在调用者中放置指定函数的副本,这意味着该属性可能被编译者忽略。实际上, " [内嵌(always)] " 除了最特殊的情况外, " 将诱导所有内容的内嵌。

source: Many of the Cairo corelib functions are inlined. User-defined functions may also be annotated with the `inline` attribute. Annoting functions with the `#[inline(always)]` attribute reduces the total number of steps required when calling these attributed functions. Indeed, injecting the Sierra code at the caller site avoids the step-cost involved in calling functions and obtaining their arguments.
es: Muchas de las funciones corelib de El Cairo están alineadas. Las funciones definidas por el usuario también pueden estar anotadas con el atributo `inline`. Anotar funciones con el atributo `[inline(always)]` reduce el número total de pasos requeridos al llamar a estas funciones atribuidas. De hecho, inyectar el código Sierra en el sitio de llamada evita el costo de paso que implica llamar funciones y obtener sus argumentos.
fr: Les fonctions définies par l'utilisateur peuvent également être annotées avec l'attribut `inline`. L'annotation des fonctions avec l'attribut `#[inline( always)]` réduit le nombre total d'étapes nécessaires pour appeler ces fonctions attribuées. En effet, l'injection du code Sierra sur le site de l'appelant évite le coût d'étape des fonctions d'appel et l'obtention de leurs arguments.
id: Banyak fungsi corelib Kairo tidak terinline. Fungsi terdefinisi pengguna mungkin juga dapat dinotasi dengan atribut ▪inlineå[inlinalways]. Atribut mengurangi jumlah langkah yang diperlukan ketika memanggil fungsi-fungsi yang atribut ini. Memang, menyuntikkan kode penelepon Sierra di situs tersebut menghindari fungsi panggilan langkah dan mendapatkan argumen mereka.
tr: Kahire corelib işlevlerinin çoğu satır içidir. Kullanıcı tanımlı fonksiyonlar inline özniteliği ile de not edilebilir. #[inline(hep)] özniteliği ile yapılan açıklamalar, bu atfedilen işlevleri çağırırken gereken toplam adım sayısını azaltır. Gerçekten de, arayan siteye Sierra kodunu enjekte etmek, fonksiyonları çağırmak ve argümanlarını elde etmek için gerekli olan adım maliyetinden kaçınır.
zh_cn: 许多开罗核心lib功能是内嵌的,用户定义的功能也可以用“内联”属性附加说明,用“内联(内联)属性”的标记功能减少了调用这些指定功能所需的步骤总数,事实上,在呼叫站点输入Sierra代码可以避免调用功能和获取其论点的分级成本。

source: However, inlining can also lead to increased code size. Whenever a function is inlined, the call site contains a copy of the function's Sierra code, potentially leading to duplication of code across the compiled code.
es: Sin embargo, el inlining también puede dar lugar a un aumento del tamaño del código.Cuando una función está inlineada, el sitio de llamada contiene una copia del código Sierra de la función, lo que puede llevar a la duplicación de código a través del código compilado.
fr: Cependant, l'inline peut également entraîner une augmentation de la taille du code. Chaque fois qu'une fonction est alignée, le site d'appel contient une copie du code Sierra de la fonction, ce qui peut entraîner une duplication du code dans le code compilé.
id: Namun, inlining juga dapat menyebabkan peningkatan ukuran kode. Setiap kali sebuah fungsi diinline, situs panggilan berisi salinan dari kode Sierra fungsi, berpotensi menyebabkan duplikasi kode melalui kode yang dikompilasi.
tr: Bununla birlikte, astarlama da kod boyutunun artmasına neden olabilir. Bir işlev satır içi olduğunda, çağrı sitesi, fonksiyonun Sierra kodunun bir kopyasını içerir ve potansiyel olarak derlenen kod boyunca kodun çoğaltılmasına yol açar.
zh_cn: 然而,内衬还可能导致代码大小的增加。 当函数被内嵌时, 呼叫网站都包含该函数的Sierra代码副本, 可能导致编译代码中代码的重复 。
