Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The Cairo Book
es: El libro de El Cairo
fr: Le Livre du Caire
id: Buku Kairo
tr: Kahire Kitabı
zh_cn: 《开罗书》

source: The Cairo Book Foreword Introduction
es: Introducción al prólogo del libro de El Cairo
fr: Avant-propos du livre du Caire
id: Perkenalan Kata Sandi Buku Kairo
tr: Kahire Kitap Önsöz Giriş
zh_cn: 《开罗书》前言导言

source: The Cairo Programming Language
es: El lenguaje de programación de El Cairo
fr: Le langage de programmation du Caire
id: Bahasa Pemrograman Kairo
tr: Kahire Programlama Dili
zh_cn: 开罗方案拟订语言

source: Getting Started
es: Comenzando
fr: Commencer
id: Mulai
tr: Başlarken
zh_cn: 开始

source: Installation
es: Instalación
id: Instalasi
tr: Kurulum
zh_cn: 安装安装

source: Hello, World!
es: ¡Hola, Mundo!
fr: Bonjour, Monde!
id: Halo, World!
tr: Merhaba Dünya!
zh_cn: 你好,世界!

source: Common Programming Concepts
es: Conceptos comunes de programación
fr: Concepts communs de programmation
id: Konsep Pemrograman Umum
tr: Ortak Programlama Kavramları
zh_cn: 共同方案拟订概念

source: Variables and Mutability
es: Variables y mutabilidad
fr: Variables et mutabilité
id: Variabel dan Mutability
tr: Değişkenler ve Mutabilite
zh_cn: 变量和可变性

source: Data Types
es: Tipos de datos
fr: Types de données
id: Tipe Data
tr: Veri Türleri
zh_cn: 数据类型

source: Functions
es: Funciones
fr: Fonctions
id: Fungsi
tr: Fonksiyonlar
zh_cn: 职能职能职能职能职能职能职能职能职能职能职能职能职能职能职能

source: Comments
es: Observaciones
fr: Commentaires
id: Komentar
tr: Yorumlar
zh_cn: 评论评论评论评论评论评论评论评论评论评论评论评论评论评论评论评论评论评论评论评论

source: Control Flow
es: Flujo de control
fr: Débit de contrôle
id: Aliran Kendali
tr: Kontrol Akışı
zh_cn: 控制流动

source: Common Collections
es: Colecciones comunes
fr: Collections communes
tr: Ortak Koleksiyonlar
zh_cn: 共同收藏

source: Arrays
fr: Tableaux
id: Array
tr: Diziler
zh_cn: 阵列数组

source: Dictionaries
es: Diccionarios
fr: Dictionnaires
id: Kamus
tr: Sözlükler
zh_cn: 字典

source: Understanding Ownership
es: Comprensión de la propiedad
fr: Comprendre la propriété
id: Memahami Kepemilikan
tr: Sahipliği Anlamak
zh_cn: 理解所有权

source: What is Ownership?
es: ¿Qué es la propiedad?
fr: Qu'est-ce que la propriété?
id: Apa Kepemilikan Itu?
tr: Sahiplik nedir?
zh_cn: 什么是所有权?

source: References and Snapshots
es: Referencias e instantáneas
fr: Références et instantanés
id: Referensi dan Snapshot
tr: Kaynakça ve Snapshotlar
zh_cn: 参考和抓图

source: Using Structs to Structure Related Data
es: Usando Estructuras para Estructurar Datos Relacionados
fr: Utilisation des structures pour structurer les données connexes
id: Menggunakan Struktur untuk Data Struktur Terkait
tr: Structs kullanarak ilgili verileri yapılandırın
zh_cn: 使用 Structs 来结构相关数据

source: Defining and Instantiating Structs
es: Definición e instantánea de estructuras
fr: Définition et activation des structures
id: Mendefinisikan dan Menginstansi Structs
tr: Structs'ın Tanımlanması ve Anlıklaştırılması
zh_cn: 界定和证明 " 条规 "

source: An Example Program Using Structs
es: Un programa de ejemplo que utiliza estructuras
fr: Un exemple de programme utilisant des structures
id: Contoh Program yang Menggunakan Struktur
tr: Structs Kullanan Bir Örnek Program
zh_cn: 使用 structs 的示例程序

source: Method Syntax
es: Sintaxis del método
fr: Méthode Syntaxe
id: Metoda Sintaksis
tr: Yöntem Sözdizimi
zh_cn: 方法法 语法

source: Enums and Pattern Matching
es: Enumes y coincidencia de patrones
fr: Énumérations et correspondance des motifs
id: Enum dan Pola yang Cocok
tr: Enums ve Desen Eşleştirme
zh_cn: 元和模式匹配

source: Enums
es: Enumes
fr: Énumérations
zh_cn: 环数

source: The Match Control Flow Construct
es: La construcción de flujo de control de coincidencia
fr: Constructeur de flux de contrôle de correspondance
id: Konstruksi Aliran Kendali yang Cocok
tr: Maç Kontrol Akış Yapısı
zh_cn: 匹配控制流程构造

source: Concise Control Flow with `if let` and `while let`
es: Control conciso del flujo con `si lo permites` y `mientras lo permites`
fr: Concise le débit de contrôle avec `si let` et `tout en let`
id: Pusat kendali akan mengalir jika kita biarkan saja dan biarkan saja.
tr: if let ve let let ile Kontrol Akışını Kısaltın while let
zh_cn: " 如果 " 和 " 同时 " 的简明控制流动

source: Managing Cairo Projects with Packages, Crates and Modules
es: Gestión de proyectos de El Cairo con paquetes, cajas y módulos
fr: Gérer les projets du Caire avec des paquets, des caisses et des modules
id: Mengelola Proyek Kairo dengan Paket, Crates dan Modul
tr: Kahire Projelerini Paketler, Sandıklar ve Modüllerle Yönetmek
zh_cn: 管理开罗项目,包括一揽子、高额和模块

source: Packages and Crates
es: Paquetes y dados
fr: Paquets et caisses
id: Paket dan Crates
tr: Paketler ve Sandıklar
zh_cn: 包包和高价

source: Defining Modules to Control Scope
es: Definir módulos para controlar el alcance
fr: Définition des modules pour le contrôle de la portée
id: Mendefinisikan Modul ke Cakupan Kontrol
tr: Modülleri Kontrol Kapsamına Tanımlama
zh_cn: 定义控制范围模块

source: Paths for Referring to an Item in the Module Tree
es: Rutas para referirse a un elemento en el árbol del módulo
fr: Chemins pour se référer à un élément de l'arbre de modules
id: Path untuk merujuk ke Butir dalam Pohon Modul
tr: Modül Ağacındaki Bir Öğeye Yönlendirilecek Yollar
zh_cn: 模块树树中项目引用路径

source: Bringing Paths into Scope with the `use` Keyword
es: Llevar los senderos al alcance con la palabra clave `usar`
fr: Mettre les chemins à la portée avec le mot-clé `use`
id: Membawa Jalur ke Cakupan dengan Kata Kunci Use
tr: use Anahtar Kelime ile Scope'a Yollar Getirmek
zh_cn: 将路径带入“使用”关键词的范围

source: Separating Modules into Different Files
es: Separando módulos en diferentes archivos
fr: Séparation des modules dans différents fichiers
id: Memisahkan Modul ke Berkas Berbeda
tr: Modülleri Farklı Dosyalara Ayırma
zh_cn: 将模块分隔成不同的文件

source: Generic Data Types
es: Tipos de datos genéricos
fr: Types de données génériques
id: Tipe Data Generik
tr: Genel Veri Türleri
zh_cn: 通用数据类型

source: Generic Types and Traits
es: Tipos y rasgos genéricos
fr: Types et caractères génériques
id: Jenis Generik dan Sifat
tr: Genel Tipler ve Türler
zh_cn: 通用类型和托盘

source: Traits in Cairo
es: Rasgos en El Cairo
fr: Traits au Caire
id: Sifat - Sifat di Kairo
tr: Kahire'deki Traits
zh_cn: 开罗的悲剧

source: Error Handling
es: Manejo de errores
fr: Gestion des erreurs
id: Kesalahan Menangani
tr: Hata işleme
zh_cn: 错误处理错误处理

source: Unrecoverable Errors with panic
es: Errores irrecuperables con pánico
fr: Erreurs irrécupérables avec panique
id: Galat Tak Terpulihkan dengan kepanikan
tr: Panikle Kurtarılamayan Hatalar
zh_cn: 恐慌中无法恢复的错误

source: Recoverable Errors with Result
es: Errores recuperables con resultado
fr: Erreurs récupérables avec résultat
id: Kesalahan Yang Dapat Dipulihkan dengan Hasil
tr: Sonuçla Kurtarılabilir Hatalar
zh_cn: 结果的可恢复错误

source: How To Write Tests
es: Cómo escribir pruebas
fr: Comment écrire des tests
id: Cara Menulis Ujian
tr: Testler Nasıl Yazılır
zh_cn: 如何写作测试

source: Testing Organization
es: Organización de ensayos
fr: Organisation des essais
id: Organisasi Uji
tr: Test Organizasyonu
zh_cn: 测试组织

source: Advanced Cairo Features
es: Características avanzadas de El Cairo
fr: Caractéristiques avancées du Caire
id: Fitur Advanced Kairo
tr: Gelişmiş Kahire Özellikleri
zh_cn: 开罗高级地物

source: Custom Data Structures
es: Estructuras de datos personalizadas
fr: Structures de données personnalisées
id: Struktur Data Gubahan
tr: Özel Veri Yapıları
zh_cn: 自定义数据结构

source: Smart Pointers
fr: Pointeurs intelligents
tr: Akıllı İşaretçiler
zh_cn: 智能点

source: Operator Overloading
es: Sobrecarga del operador
fr: Surcharge de l'opérateur
tr: Operatör Aşırı Yükleme
zh_cn: 超载操作器

source: Working with Hashes
es: Trabajar con Hashés
fr: Travailler avec Hashes
id: Bekerja dengan Hashes
tr: Hashes ile Çalışmak
zh_cn: 与Hashes合作

source: Macros
id: Makro
tr: Makrolar
zh_cn: 宏

source: Inlining in Cairo
es: Inlining en El Cairo
fr: Inline au Caire
id: Menyusuri di Kairo
tr: Kahire'de İniş
zh_cn: 开罗

source: Printing
es: Impresión
fr: Impression
id: Mencetak
tr: Baskı
zh_cn: 印刷印刷印刷

source: Appendix (Cairo)
es: Apéndice (El Cairo)
fr: Annexe (Le Caire)
id: Lampiran (Cairo)
tr: Ek (Cairo)
zh_cn: 附录(开罗)

source: A - Keywords
es: A - Palabras clave
fr: A - Mots clés
id: Kata Kunci
tr: A - Anahtar Kelimeler
zh_cn: A - 关键词

source: B - Operators and Symbols
es: B - Operadores y símbolos
fr: B - Opérateurs et symboles
id: B - Operator dan Simbol
tr: B - Operatörler ve Semboller
zh_cn: - 操作员和符号

source: C - Derivable Traits
es: C - Rasgos derivados
fr: C - Traits dérivés
id: C - Sifat yang Dapat Diturunkan
tr: C - Türevlenebilir Özellikleri
zh_cn: - C - 可衍生的陷阱

source: D - The Cairo Prelude
es: D - El Preludio de El Cairo
fr: D - Le Prélude du Caire
id: D - Prelude Kairo
tr: D - Kahire Prelüd
zh_cn: - 开罗预兆

source: E - Common Error Messages
es: E - Mensajes de error comunes
fr: E - Messages d'erreur courants
id: Pesan Kesalahan E - Common
tr: E - Yaygın Hata Mesajları
zh_cn: E - 常见错误消息

source: F - Useful Development Tools
es: F - Herramientas de desarrollo útiles
fr: F - Outils de développement utiles
id: Alat Pembangunan yang Berguna F
tr: F - Faydalı Geliştirme Araçları
zh_cn: F - 有用的发展工具

source: G - Installing Cairo binaries
es: G - Instalación de binarios en El Cairo
fr: G - Installation des binaires du Caire
id: Penginstalan G - Kairo binaries
tr: G - Kahire ikililerinin kurulması
zh_cn: G - 安装开罗二进制

source: Smart Contracts in Cairo
es: Contratos inteligentes en El Cairo
fr: Contrats intelligents au Caire
id: Kontrak Cerdas di Kairo
tr: Kahire'de Akıllı Sözleşmeler
zh_cn: 开罗的智能合同

source: Introduction to Starknet Smart Contracts
es: Introducción a los contratos inteligentes de Starknet
fr: Introduction aux contrats intelligents Starknet
id: Perkenalan Kontrak Cerdas Starknet
tr: Starknet Akıllı Sözleşmelere Giriş
zh_cn: Starknet智能合同介绍

source: General Introduction to Smart Contracts
es: Introducción general a los contratos inteligentes
fr: Introduction générale aux contrats intelligents
id: Perkenalan Umum Kontrak Cerdas
tr: Akıllı Sözleşmelere Genel Giriş
zh_cn: 智能合同一般介绍

source: Anatomy of a Simple Contract
es: Anatomía de un contrato sencillo
fr: Anatomie d'un contrat simple
id: Anatomi Kontrak Sederhana
tr: Basit Bir Sözleşmenin Anatomisi
zh_cn: 简单合同解剖

source: Building Starknet Smart Contracts
es: Construcción de contratos inteligentes Starknet
fr: Construction de contrats intelligents Starknet
id: Membangun Kontrak Cerdas Starknet
tr: Starknet Akıllı Sözleşmeler Oluşturma
zh_cn: 建筑史塔克网智能合同

source: Contract Storage
es: Almacenamiento de contratos
fr: Stockage contractuel
id: Penyimpanan Kontrak
tr: Sözleşme Depolama
zh_cn: 合同储存

source: Contract Functions
es: Funciones contractuales
fr: Fonctions contractuelles
id: Fungsi Kontrak
tr: Sözleşme Fonksiyonları
zh_cn: 合同职能

source: Contract Events
es: Acontecimientos contractuales
fr: Événements contractuels
id: Rangkaian Kontrak
tr: Sözleşme Etkinlikleri
zh_cn: 合同活动

source: Starknet Cross-Contract Interactions
es: Interacciones cruzadas de Starknet
fr: Interactions entre contrats Starknet
id: Starknet Cross-Contract Interaksi
tr: Starknet Çapraz Etkileşimler
zh_cn: Starknet 跨合同互动

source: ABIs and Contract Interfaces
es: ABIs e interfaces contractuales
fr: ABI et interfaces contractuelles
id: ABI dan Antarmuka Kontrak
tr: ABI'ler ve Sözleşme Arayüzleri
zh_cn: ABI和合同接口

source: Contract Dispatchers, Library Dispatchers and System Calls
es: Expedidores de contratos, despachadores de bibliotecas y llamadas al sistema
fr: Régulateurs contractuels, répartiteurs de bibliothèque et appels système
id: Dispatcher Kontrak, Pengirim Perpustakaan dan Sistem Panggilan
tr: Sözleşmeli Dispatchers, Kütüphane Dispatchers ve Sistem Çağrıları
zh_cn: 合同调度员、图书馆调度员和系统呼叫

source: Building Advanced Starknet Smart Contracts
es: Construcción avanzada de contratos inteligentes Starknet
fr: Construction de contrats évolués Starknet Smart
id: Membangun Advanced Starknet Smart Contracts
tr: Gelişmiş Starknet Akıllı Sözleşmeler Oluşturma
zh_cn: 建筑高级史塔克网智能合同

source: Optimizing Storage Costs
es: Optimización de los costos de almacenamiento
fr: Optimisation des coûts de stockage
id: Optimasi Biaya Penyimpanan
tr: Depolama Maliyetlerini Optimize Etme
zh_cn: 优化储存成本

source: Composability and Components
es: Composibilidad y componentes
fr: Composabilité et composants
id: Komposabilitas dan Komponen
tr: Kompozisyon ve Bileşenleri
zh_cn: 组成和构件

source: Under the Hood
es: Bajo el capó
fr: Sous le capot
tr: Hood'un Altında
zh_cn: 在兜帽下

source: Component Dependencies
es: Dependencias de los componentes
fr: Dépendances des composantes
id: Ketergantungan Komponen
tr: Bileşen Bağımlılıkları
zh_cn: 构成部分 构成部分

source: Testing Components
es: Componentes de ensayo
fr: Composants d'essai
id: Komponen Uji
tr: Test Bileşenleri
zh_cn: 测试部件

source: Upgradeability
es: Mejorabilidad
fr: Mise à niveau
id: Peningkatan
tr: Yükseltilebilirlik
zh_cn: 升级可升级

source: L1 \<\> L2 Messaging
es: L1 L2 Mensajería
fr: L1 \<\> L2 Messagerie
id: L1 \\> Pesan L2
tr: L1 > L2 Mesajlaşma
zh_cn: L1 L2 通信

source: Oracle Interactions
es: Interacciones con Oracle
fr: Interactions Oracle
id: Perselisihan Oracle
tr: Oracle Etkileşimleri
zh_cn: Oracle 互动

source: Price Feeds
es: Precio de los piensos
fr: Aliments pour animaux
id: Asupan Harga
tr: Fiyat Beslemeleri
zh_cn: 价格饲料

source: Randomness
es: Al azar
fr: Aléatoire
id: Keacakan
tr: Rastgelelik
zh_cn: 随机随机

source: Other Examples
es: Otros ejemplos
fr: Autres exemples
id: Contoh - Contoh Lain
tr: Diğer Örnekler
zh_cn: 其他实例

source: Deploying and Interacting with a Voting Contract
es: Implementación e interacción con un contrato de votación
fr: Déployer et interagir avec un contrat de vote
id: Menyebarkan dan Interacting dengan Kontrak Voting
tr: Bir Oy Sözleşmesi ile Dağıtım ve Etkileşim
zh_cn: 与投票合同的部署和互动

source: Starknet Smart Contracts Security
fr: Starknet Smart Contracts Sécurité
tr: Starknet Akıllı Sözleşmeler Güvenliği
zh_cn: Starknet智能智能合同安保

source: General Recommendations
es: Recomendaciones generales
fr: Recommandations générales
id: Rekomendasi Umum
tr: Genel Öneriler
zh_cn: 一般性建议

source: Testing Smart Contracts
es: Pruebas de contratos inteligentes
fr: Tester les contrats intelligents
id: Menguji Kontrak Cerdas
tr: Akıllı Sözleşmelerin Test Edilmesi
zh_cn: 测试智能合同

source: Static Analysis Tools
es: Herramientas de análisis estáticas
fr: Outils d'analyse statique
id: Perkakas Analisis Statik
tr: Statik Analiz Araçları
zh_cn: 静态分析工具

source: Formal Verification
es: Verificación formal
fr: Vérification formelle
id: Verifikasi Formal
tr: Resmi Doğrulama
zh_cn: 正式核查

source: Appendix
es: Apéndice
fr: Annexe
id: Lampiran
tr: Ek
zh_cn: 附录附录附录附录附录附录

source: Appendix (Starknet)
es: Apéndice (Starknet)
fr: Annexe (Starknet)
id: Lampiran (Starknet)
tr: Ek (Starknet)
zh_cn: 附录(星网)

source: A - System Calls
es: A - Llamadas del sistema
fr: A - Appels système
id: Panggilan Sistem
tr: A - Sistem Çağrıları
zh_cn: - 系统呼叫

source: Cairo VM
fr: Le Caire, MV
id: Kairo VM
tr: Kahire VM
zh_cn: 开罗VM

source: Introduction
es: Introducción
fr: Présentation
id: Perkenalan
tr: Giriş
zh_cn: 导言 导言 导言 导言 导言 导言 导言 导言

source: Architecture
es: Arquitectura
id: Arsitektur
tr: Mimarlık
zh_cn: 建筑结构结构

source: Memory
es: Memoria
fr: Mémoire
id: Memori
tr: Bellek
zh_cn: 内存

source: Non-Deterministic Read-only Memory
es: Memoria de sólo lectura no determinista
fr: Mémoire non déterministe en lecture seule
id: Bukan-Deterministik Memori Baca-saja
tr: Non-Deterministik Okuma-Sadece Bellek
zh_cn: 非确定性可读只读存储器

source: Segments
es: Segmentos
id: Segmen
tr: Segmentler
zh_cn: 线段

source: Segment Value
es: Valor del segmento
fr: Valeur du segment
id: Nilai segmen
tr: Segment Değeri
zh_cn: 值

source: Relocation
es: Reubicación
fr: Réinstallation
id: Relokasi
tr: Yer Değiştirme
zh_cn: 搬迁搬迁

source: Layout
es: Distribución
fr: Mise en page
id: Tata letak
tr: Yerleşim
zh_cn: 布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布布

source: Execution Model
es: Modelo de ejecución
fr: Modèle d'exécution
id: Model Eksekusi
tr: Yürütme Modeli
zh_cn: 执行模式执行模式

source: Registers
es: Registros
fr: Registres
id: Register
tr: Kayıtlar
zh_cn: 登记册

source: Instructions
es: Instrucciones
id: Instruksi
tr: Talimatlar
zh_cn: 指示指示指示

source: Cairo Assembly (CASM)
es: Asamblea de El Cairo (CASM)
fr: Assemblée du Caire (CASM)
id: Kebaktian Kairo (CASM)
tr: Kahire Meclisi (CASM)
zh_cn: 开罗大会(开罗大会)

source: State transition
es: Transición del Estado
fr: Transition de l'État
id: Pergeseran keadaan
tr: Durum geçişi
zh_cn: 国家过渡期

source: Builtins
fr: Eléments
id: Bawaan
zh_cn: 内建

source: Memory Communication
es: Comunicación de memoria
fr: Communication mémoire
id: Komunikasi Memori
tr: Bellek İletişimi
zh_cn: 记忆通信

source: List of builtins
es: Lista de construcciones
fr: Liste des constructions
id: Daftar builtin
tr: Yapıtların listesi
zh_cn: 内嵌列表

source: Hints
es: Consejos
fr: Conseils
id: Petunjuk
tr: İpucu
zh_cn: 提示

source: Structure
es: Estructura
id: Struktur
tr: Yapı
zh_cn: 结构结构结构结构结构

source: Hint runner
es: Corredor de la pista
fr: Coureur d'allure
id: Pelari Petunjuk
tr: İpucu koşucusu
zh_cn: 提示运行中

source: List of hints
es: Lista de sugerencias
fr: Liste des conseils
id: Daftar petunjuk
tr: İpuçlarının listesi
zh_cn: 提示列表列表

source: Runner
fr: Coureur
zh_cn: 运行运行器

source: Program
es: Programa
fr: Programme
zh_cn: 方案方案

source: Program Artifacts
es: Artefactos del programa
fr: Artéfacts du programme
id: Artefak Program
zh_cn: 方案非异形

source: Program Parsing
es: Análisis del programa
fr: Parsing du programme
id: Parsing Program
tr: Program Ayrıştırma
zh_cn: 程序分析

source: Runner Mode
es: Modo runner
fr: Mode de course
id: Mode Runner
tr: Runner Modu
zh_cn: 运行运行模式

source: Execution Mode
es: Modo de ejecución
fr: Mode d'exécution
id: Moda Eksekusi
tr: Yürütme Modu
zh_cn: 执行模式

source: Proof Mode
es: Modo de prueba
fr: Mode de preuve
id: Mode Bukti
tr: Proof Modu
zh_cn: 证明模式

source: Output
es: Producto
fr: Produit
id: Keluaran
tr: Çıktı
zh_cn: 产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出产出

source: Cairo PIE
es: El Cairo PIE
fr: PIE du Caire
tr: Kahire PIE
zh_cn: 开罗派

source: Memory File
es: Archivo de memoria
fr: Fichier mémoire
id: Berkas Memori
tr: Bellek Dosyası
zh_cn: 内存文件

source: Trace file
es: Archivo de rastreo
fr: Tracer le fichier
id: Telusuri berkas
tr: İz dosyası
zh_cn: 追踪文件

source: AIR public input
es: Contribución pública de AIR
fr: Contribution du public dans le domaine de l'AIR
id: Masukan publik AIR
tr: AIR kamu girişi
zh_cn: AIR 公共投入

source: AIR private input
es: Entrada privada de AIR
fr: AIR intrant privé
id: Masukan pribadi AIR
tr: AIR özel giriş
zh_cn: AIR 私人投入

source: Tracer
fr: Traceur
id: Pelacak
zh_cn: 追踪器

source: Implementations
es: Ejecución
fr: Mise en œuvre
id: Implementasi
tr: Uygulamalar
zh_cn: 执行

source: Resources
es: Recursos
fr: Ressources
id: Sumberdaya
tr: Kaynaklar
zh_cn: 资源资源资源 资源资源资源 资源资源 资源资源

source: By the Cairo Community and its [contributors](https://github.com/cairo-book/cairo-book.github.io). Special thanks to [StarkWare](https://starkware.co/) through [OnlyDust](https://www.onlydust.xyz/), and [Voyager](https://voyager.online/) for supporting the creation of this book.
es: Por la Comunidad de El Cairo y sus [contribuyentes](https://github.com/cairo-book/cairo-book.github.io).Agradecimiento especial a [StarkWare](https://starkware.co/) a través de [OnlyDust](https://www.onlydust.xyz/), y [Voyager](https://voyager.online/) por apoyar la creación de este libro.
fr: Par la Communauté du Caire et ses [contributeurs](https://github.com/cairo-book/cairo-book.github.io). Remerciements spéciaux à [StarkWare](https://starkware.co/) par [OnlyDust](https://www.onlydust.xyz/), et [Voyager](https://voyager.online/) pour leur soutien à la création de ce livre.
id: Oleh Kairo Community and its [contributors][contps://gitub.com/cairo-book/cairo-book.github.io). Khusus berkat [StarkWare][Nolhttps://starkware.co/) melalui [One-satunyaDust] 1964htt://www.onlydust.xyz/), dan [Voyager-https://voyager.online/) untuk mendukung pembuatan buku ini.
tr: Kahire Topluluğu ve [katkıda bulunanlar](https://github.com/cairo-book/cairo-book.github.io) tarafından. [StarkWare](https://starkware.co/) aracılığıyla [OnlyDust](https://www.online.com/), ve [Voyager](https://voyager.online/) için bu kitabın oluşturulmasını destekleyen özel teşekkürler.
zh_cn: 由开罗社区及其[捐助者](https://github.com/cairo-book/cairo-book.github.io)主持,特别感谢[StarkWare](https://starkware.co/)通过[独达 (https://www.lydustrad.xyz/)和[Voyager](https://voyager.online/)支持创建这本书。

source: This version of the text assumes you’re using the [Cairo Compiler](https://github.com/starkware-libs/cairo) [version 2.6.3](https://github.com/starkware-libs/cairo/releases). See the [Installation](ch01-01-installation.md) section of Chapter 1 to install or update Cairo.
es: Esta versión del texto asume que está utilizando el [Compilador de El Cairo] (https://github.com/starkware-libs/cairo) [versión 2.6.3] (https://github.com/starkware-libs/cairo/releases). Vea la sección [Instalación](ch01-01-installation.md) del capítulo 1 para instalar o actualizar El Cairo.
fr: Cette version du texte suppose que vous utilisez le [Cairo Compiler](https://github.com/starkware-libs/cairo) [version 2.6.3](https://github.com/starkware-libs/cairo/releases). Voir la section [Installation](ch01-01-installation.md) du chapitre 1 pour installer ou mettre à jour le Caire.
id: Versi teks ini berasumsi bahwa anda menggunakan [Kairo Compiler][Nirottps://gitub.com/starkware-libs/cairo) [version 2,3]Tidakhttps://gitub.com/starkware-libs/cairo/release). Lihat bagian 1 untuk memasang atau memperbarui Kairo.
tr: Metnin bu sürümü, [Cairo Derleyicisi](https://github.com/starkware-libs/cairo) [version 2.6.3](https://github.com/starkware-libs/cairo/releases] kullandığınızı varsayar. Kahire'yi kurmak veya güncellemek için Bölüm 1'in [Installation] (ch01-01-installation.mation.md) bölümüne bakın.
zh_cn: 本文本假定你使用第1章[Cairo 汇编机] (https://github.com/starkware-libs/cairo) [2.6.3] [https://github.com/starkware-libs/cairo/releases] 部分安装或更新开罗。 见[installation] (ch01-01-安放.md) 章节。
