Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: A trait defines a set of methods that can be implemented by a type. These methods can be called on instances of the type when this trait is implemented. A trait combined with a generic type defines functionality a particular type has and can share with other types. We can use traits to define shared behavior in an abstract way. We can use _trait bounds_ to specify that a generic type can be any type that has certain behavior.
es: Un rasgo define un conjunto de métodos que pueden ser implementados por un tipo. Estos métodos pueden ser llamados en instancias del tipo cuando este rasgo es implementado. Un rasgo combinado con un tipo genérico define la funcionalidad que un tipo en particular tiene y puede compartir con otros tipos. Podemos usar rasgos para definir el comportamiento compartido de una manera abstracta. Podemos usar _trait binds_ para especificar que un tipo genérico puede ser cualquier tipo que tenga cierto comportamiento.
fr: Un trait définit un ensemble de méthodes qui peuvent être implémentées par un type. Ces méthodes peuvent être appelées sur des instances du type lorsque ce trait est implémenté. Un trait combiné à un type générique définit les fonctionnalités d'un type particulier et peut être partagé avec d'autres types. Nous pouvons utiliser des caractères pour définir le comportement partagé de manière abstraite. Nous pouvons utiliser _trait limits_ pour spécifier qu'un type générique peut être n'importe quel type qui a un certain comportement.
id: Sebuah sifat mendefinisikan satu set metode yang dapat diimplementasikan dengan sebuah tipe. Metode ini dapat disebut pada contoh dari tipe ketika sifat ini diimplementasikan. Sebuah sifat yang dikombinasikan dengan tipe umum mendefinisikan fungsionalitas tipe tertentu dan dapat dibagi dengan tipe lain. Kita dapat menggunakan sifat yang sama untuk mendefinisikan perilaku bersama secara abstrak. Kita dapat menggunakan _trait terikat_ untuk menentukan bahwa tipe umum dapat menjadi tipe apapun yang memiliki perilaku tertentu.
tr: Bir özellik, bir tür tarafından uygulanabilecek bir dizi yöntemi tanımlar. Bu yöntemler, bu özellik uygulandığında türün örneklerine çağrılabilir. Jenerik bir türle birleştirilen bir özellik, belirli bir türün sahip olduğu ve diğer türlerle paylaşabileceği işlevselliği tanımlar. Paylaşılan davranışı soyut bir şekilde tanımlamak için özellikler kullanabiliriz. Jenerik bir türün belirli bir davranışa sahip herhangi bir tür olabileceğini belirtmek için _trait sınırlarını kullanabiliriz.
zh_cn: 特性定义了能够用某类型执行的一套方法。 这些方法可以使用该特性执行时的类型实例。 特性与通用类型结合, 定义了特定类型拥有并且可以与其他类型共享的功能。 我们可以使用特性来抽象地定义共同的行为。 我们可以使用 trait 界限_ 来指定一个通用类型可以是任何具有某种行为的类型。

source: Note: Traits are similar to a feature often called interfaces in other languages, although with some differences.
es: Nota: Los rasgos son similares a una característica a menudo llamada interfaces en otros idiomas, aunque con algunas diferencias.
fr: Note : Les caractères sont similaires à une fonctionnalité souvent appelée interfaces dans d'autres langues, bien qu'avec quelques différences.
id: Catatan: Sifat mirip dengan fitur yang sering disebut antarmuka dalam bahasa - bahasa lain, meskipun dengan beberapa perbedaan.
tr: Not: Bazı farklılıklar olsa da, özellikler genellikle diğer dillerde arayüzler olarak adlandırılan bir özelliğe benzer.
zh_cn: 注:轨迹与其他语言通常称为界面的特征相似,但有一些差异。

source: While traits can be written to not accept generic types, they are most useful when used with generic types. We already covered generics in the [previous chapter](./ch08-01-generic-data-types.md), and we will use them in this chapter to demonstrate how traits can be used to define shared behavior for generic types.
es: Aunque los rasgos pueden ser escritos para no aceptar tipos genéricos, son más útiles cuando se usan con tipos genéricos. Ya cubrimos los genéricos en el [capítulo anterior](./ch08-01-genérico-data-types.md), y los usaremos en este capítulo para demostrar cómo los rasgos pueden ser usados para definir el comportamiento compartido para los tipos genéricos.
fr: Bien que les caractères puissent être écrits pour ne pas accepter les types génériques, ils sont les plus utiles lorsqu'ils sont utilisés avec les types génériques. Nous avons déjà couvert les génériques dans le [chapitre précédent](./ch08-01-generic-data-types.md), et nous les utiliserons dans ce chapitre pour démontrer comment les caractères peuvent être utilisés pour définir le comportement partagé pour les types génériques.
id: Sementara sifat-sifat dapat ditulis untuk tidak menerima tipe generik, mereka paling berguna ketika digunakan dengan tipe generik. Kami telah menutupi generik dalam [ bab sebelumnya] Allahbapron./ch08-01-generic-data-types.md), dan kami akan menggunakannya di bab ini untuk menunjukkan bagaimana sifat-sifat dapat digunakan untuk mendefinisikan perilaku bersama untuk tipe umum.
tr: Özellikler, jenerik tipleri kabul etmemek için yazılabilirken, jenerik tiplerle birlikte kullanıldığında en yararlıdırlar. [önceki bölüm](./ch08-01-generic-data-types.md) 'deki jenerikleri zaten ele aldık ve bu bölümde, özelliklerin jenerik tipler için paylaşılan davranışı tanımlamak için nasıl kullanılabileceğini göstermek için bunları kullanacağız.
zh_cn: 虽然特征可以写成不接受通用类型,但在使用通用类型时最有用。 我们已经在[前一章](./ch08-01-generic- data-types.md)中涵盖了通用类型,我们将在本章中使用这些特征来说明如何使用这些特征来界定通用类型的共同行为。

source: Defining a Trait
es: Definir un rasgo
fr: Définition d'un trait
id: Mendefinisikan Sifat - Sifatnya
tr: Bir Trait'i Tanımlamak
zh_cn: 定义Trait

source: A type’s behavior consists of the methods we can call on that type. Different types share the same behavior if we can call the same methods on all of those types. Trait definitions are a way to group method signatures together to define a set of behaviors necessary to accomplish some purpose.
es: El comportamiento de un tipo consiste en los métodos que podemos utilizar en ese tipo. Diferentes tipos comparten el mismo comportamiento si podemos llamar a los mismos métodos en todos esos tipos. Las definiciones de rasgos son una manera de agrupar las firmas de métodos para definir un conjunto de comportamientos necesarios para lograr algún propósito.
fr: Un comportement de type est constitué des méthodes que nous pouvons appeler sur ce type. Différents types partagent le même comportement si nous pouvons appeler les mêmes méthodes sur tous ces types. Les définitions de caractères sont un moyen de grouper les signatures des méthodes pour définir un ensemble de comportements nécessaires pour accomplir un certain but.
id: Perilaku yang berbeda terdiri dari metode yang dapat kita gunakan untuk menentukan jenis perilaku yang sama jika kita dapat menghubungi metode yang sama pada semua jenis tersebut. definisi Trait adalah cara untuk mengelompokkan metode bersama-sama untuk menentukan seperangkat perilaku yang diperlukan untuk mencapai suatu tujuan.
tr: Bir türün davranışı, bu tür üzerinde çağırabileceğimiz yöntemlerden oluşur. Bu türlerin hepsinde aynı yöntemleri çağırabilirsek, farklı türler aynı davranışı paylaşır. Trait tanımları, bir amaca ulaşmak için gerekli bir dizi davranışı tanımlamak için yöntem imzalarını birlikte gruplamanın bir yoludur.
zh_cn: 一种类型的行为包括我们可以要求使用的方法。 不同类型的行为相同,如果我们可以对所有类型都使用同样的方法。 Trait定义是一种将方法签名组合在一起的方法,以定义实现某种目的所需的一系列行为。

source: For example, let’s say we have a struct `NewsArticle` that holds a news story in a particular location. We can define a trait `Summary` that describes the behavior of something that can summarize the `NewsArticle` type.
es: Por ejemplo, digamos que tenemos una estructura `NewsArticle` que contiene una noticia en un lugar en particular. Podemos definir un rasgo `Resumen` que describe el comportamiento de algo que puede resumir el tipo `NewsArticle`.
fr: Par exemple, disons que nous avons une structure `NewsArticle` qui contient une histoire de nouvelles dans un endroit particulier. Nous pouvons définir un trait `Sommary` qui décrit le comportement de quelque chose qui peut résumer le type `NewsArticle`.
id: Sebagai contoh, mari kita katakan kita memiliki sebuah struktur yang memegang berita di lokasi tertentu. kita dapat menentukan sebuah sifat yang menggambarkan perilaku dari sesuatu yang dapat meringkaskan tipe NewsArticle.
tr: Örneğin, belirli bir yerde bir haber öyküsü tutan bir NewsArticle yapımız olduğunu varsayalım. NewsArticle tipini özetleyebilecek bir şeyin davranışını tanımlayan bir Summary özelliğini tanımlayabiliriz.
zh_cn: 例如,我们可以说,我们有一个在特定地点有新闻故事的“新闻文章”结构,我们可以定义一个“摘要”特征,描述可以总结“新闻文章”类型的东西的行为。

source: "{:?} by {:?} ({:?})"
es: ¿Por qué?
fr: "{:?} par {:?} ({:?})"
id: "{:?" oleh {:?} ({:})"
zh_cn: "{{{{{{{{{{{{}}by {{{}}}}{{{{{{}}}}}{{{}}}{{}}}{{{}}}}by{{{{}}}}}}}}{{{{{{{}}}}}}}{{{{{{{{}}}}}}}}}}}({{{{{}}}}}}}}}}"。

source: Here, we declare a trait using the `trait` keyword and then the trait’s name, which is `Summary` in this case. We’ve also declared the trait as `pub` so that crates depending on this crate can make use of this trait too, as we’ll see in a few examples.
es: Aquí, declaramos un rasgo usando la palabra clave `trait` y luego el nombre del rasgo, que es `Resumen` en este caso. También hemos declarado el rasgo como `pub` para que las cajas dependiendo de esta caja puedan hacer uso de este rasgo también, como veremos en algunos ejemplos.
fr: Ici, nous déclarons un trait en utilisant le mot-clé `trait` et ensuite le nom de trait's, qui est `Sommary` dans ce cas. Nous avons également déclaré le trait comme `pub` afin que les caisses en fonction de cette caisse puissent utiliser ce trait aussi, comme nous le verrons dans quelques exemples.
id: Di sini, kita menyatakan sebuah sifat menggunakan kata kunci dan kemudian sifat itu, yang juga dapat digunakan dalam hal ini, seperti yang kita lihat dalam beberapa contoh.
tr: Burada, trait anahtar kelimesini ve daha sonra bu durumda Summary olan özelliğin adını kullanarak bir özellik beyan ediyoruz. Ayrıca bu özelliği pub olarak ilan ettik, böylece bu kasaya bağlı sandıklar da birkaç örnekte göreceğimiz gibi bu özelliği kullanabilir.
zh_cn: 在此,我们用`trait'关键词,然后用该特性的名称,即本案中的`摘要'来宣布一个特性,我们还宣布该特性为`pub ',以便依赖这一箱的箱子也能使用这一特性,我们将在几个例子中看到这一点。

source: Inside the curly brackets, we declare the method signatures that describe the behaviors of the types that implement this trait, which in this case is `fn summarize(self: @NewsArticle) -> ByteArray;`. After the method signature, instead of providing an implementation within curly brackets, we use a semicolon.
es: Dentro de los corchetes rizados, declaramos las firmas del método que describen los comportamientos de los tipos que implementan este rasgo, que en este caso es `fn summary(self: @NewsArticle) -> ByteArray;`. Después de la firma del método, en lugar de proporcionar una implementación dentro de corchetes rizados, utilizamos un punto y coma.
fr: À l'intérieur des crochets, nous déclarons les signatures de la méthode qui décrivent les comportements des types qui implémentent ce trait, qui dans ce cas est `fn summit(self: @NewsArticle) -> ByteArray;`. Après la signature de la méthode, au lieu de fournir une implémentation entre crochets, nous utilisons un point-virgule.
id: Di dalam kurung keriting, kami menyatakan tanda tangan metode yang menggambarkan perilaku dari jenis yang menerapkan sifat ini, yang dalam hal ini adalah ▪fn merangkumkan diri: @NewsArtikle) -> ByteArray;-- setelah tanda tangan metode, alih-alih menyediakan implementasi dalam kurung keriting, kami menggunakan semikolon.
tr: Kıvırcık parantez içinde, bu özelliği uygulayan türlerin davranışlarını tanımlayan yöntem imzalarını beyan ediyoruz, bu durumda bu fn özeti (kendi: @NewsArticle) -> ByteArray;. Yöntem imzasından sonra, kıvırcık parantez içinde bir uygulama sağlamak yerine, bir noktalı virgül kullanıyoruz.
zh_cn: 在括弧内,我们声明描述执行该特性的类型的行为的方法签字,在这种情况下,该签字是`fn摘要(本身:@NewsArray) - > ByteArray;`。在方法签字之后,我们使用分号,而不是在括弧内提供执行。

source: Note: the `ByteArray` type is the type used to represent strings in Cairo.
es: Nota: el tipo `ByteArray` es el tipo utilizado para representar cadenas en El Cairo.
fr: Note : le type `ByteArray` est le type utilisé pour représenter les chaînes au Caire.
id: Catatan: tipe byteArray adalah tipe yang digunakan untuk mewakili string di Kairo.
tr: Not: ByteArray tipi Kahire'deki dizeleri temsil etmek için kullanılan tiptir.
zh_cn: 注:`ByteAray'类型是开罗用于表示字符串的类型。

source: As the trait is not generic, the `self` parameter is not generic either and is of type `@NewsArticle`. This means that the `summarize` method can only be called on instances of `NewsArticle`.
es: Dado que el rasgo no es genérico, el parámetro `auto' tampoco es genérico y es del tipo `NewsArticle`, lo que significa que el método `resumir` sólo puede invocarse en las instancias de `NewsArticle`.
fr: Comme le caractère n'est pas générique, le paramètre `self` n'est pas générique non plus et est de type `@NewsArticle`. Cela signifie que la méthode `summarize` ne peut être appelée que sur les instances de `NewsArticle`.
id: Karena sifat ini tidak generik, parameter diri sendiri juga tidak umum dan bertipe umum. Ini berarti metode yang disummarisasi hanya dapat disebut pada contoh-contoh dari NewsArticle.
tr: Bu özellik genel olmadığından, self parametresi de genel değildir ve NewsArticle tipindedir. Bu, summarize yönteminin yalnızca NewsArticle örneklerinde çağrılabileceği anlamına gelir.
zh_cn: 由于特性不是通用的,“自我”参数也不是通用的,属于“News article”类型,这意味着“概述”方法只能根据“News Artices”的情况使用。

source: Now, consider that we want to make a media aggregator library crate named _aggregator_ that can display summaries of data that might be stored in a `NewsArticle` or `Tweet` instance. To do this, we need a summary from each type, and we’ll request that summary by calling a summarize method on an instance of that type. By defining the `Summary` trait on generic type `T`, we can implement the `summarize` method on any type we want to be able to summarize.
es: Ahora, considere que queremos hacer una caja de agregador de medios de comunicación llamada _agregador_ que pueda mostrar resúmenes de datos que podrían almacenarse en una instancia de `NewsArticle` o `Tweet`. Para ello, necesitamos un resumen de cada tipo, y solicitaremos ese resumen llamando a un método de resumen en una instancia de ese tipo. Al definir el rasgo `Resumen` en el tipo genérico `T`, podemos implementar el método `resumir` en cualquier tipo que queramos ser capaces de resumir.
fr: Maintenant, considérez que nous voulons faire une caisse de bibliothèque d'agrégateur de médias nommé _aggregator_ qui peut afficher des résumés de données qui pourraient être stockés dans une instance `NewsArticle` ou `Tweet`. Pour ce faire, nous avons besoin d'un résumé de chaque type, et nous allons demander ce résumé en appelant une méthode de résumé sur une instance de ce type. En définissant le caractère `Summary` sur le type générique `T`, nous pouvons mettre en œuvre la méthode `summarize` sur tout type que nous voulons être en mesure de résumer.
id: Sekarang, pertimbangkan bahwa kita ingin membuat sebuah media aggregator perpustakaan peti bernama _aggregator_ yang dapat menampilkan rangkuman data yang mungkin disimpan dalam sebuah åNewsArticle atau åTweetáne. Untuk melakukan hal ini, kita perlu ringkasan dari setiap tipe, dan kami akan meminta ringkasan bahwa dengan memanggil metoda tambahan pada contoh tipe itu. Dengan mendefinisikan sifat sumary pada tipe generik åT, kita dapat mengimplementasikan metode memberikan tipe mana pun kita ingin mampu untuk meringkas.
tr: Şimdi, bir NewsArticle veya Tweet örneğinde saklanabilecek veri özetlerini görüntüleyebilecek _aggregator_ adlı bir medya agregator kütüphane sandığı yapmak istediğimizi düşünün. Bunu yapmak için her türden bir özete ihtiyacımız var ve bu tür bir örneği özetleyerek bu özeti isteyeceğiz. Summary özelliğini jenerik tip üzerinde uygulayabiliriz
zh_cn: 现在,考虑一下,我们要制作一个名为 _aggator_ 的媒体聚合库箱,该箱可以显示可能存储在`NewsArt'或`Tweet'实例中的数据摘要。要做到这一点,我们需要每个类型的摘要,我们将通过在这类实例中使用一个摘要方法来请求汇总。通过定义通用类型`T'的`摘要'特性,我们可以在任何类型中执行“摘要”方法,我们希望能够总结的任何类型。

source: "Cairo has become the most popular language for developers"
es: "El Cairo se ha convertido en el lenguaje más popular para los desarrolladores"
fr: "Le Caire est devenu la langue la plus populaire pour les développeurs"
id: "Kairo telah menjadi bahasa yang paling populer bagi pengembang"
tr: "Cairo geliştiriciler için en popüler dil haline geldi"
zh_cn: "Cairo已经成为开发商最流行的语言"

source: "Worldwide"
es: "En todo el mundo"
fr: "Dans le monde entier"
tr: "Dünya çapında"
zh_cn: "世界范围"

source: "Cairo Digger"
zh_cn: "凯罗·迪格尔"

source: "Cairo is a new programming language for zero-knowledge proofs"
es: "El Cairo es un nuevo lenguaje de programación para pruebas de conocimiento cero"
fr: "Le Caire est un nouveau langage de programmation pour les preuves zéro connaissance"
id: "Cairo adalah bahasa pemrograman baru untuk bukti pengetahuan kosong "
tr: "Cairo sıfır bilgi kanıtları için yeni bir programlama dilidir"
zh_cn: "开罗是零知识证明的新编程语言"

source: "EliBenSasson"
zh_cn: "伊利本萨森"

source: "Crypto is full of short-term maximizing projects. \n @Starknet and @StarkWareLtd are about long-term vision maximization."
es: "Crypto está lleno de proyectos de maximización a corto plazo. \n @Starknet y @StarkWareLtd son sobre la maximización de la visión a largo plazo."
fr: "Crypto est plein de projets de maximisation à court terme. \n @Starknet et @StarkWareLtd sont sur la maximisation de la vision à long terme."
id: "Crypto penuh dengan proyek maksimum jangka pendek. \n @Starknet dan @StarkWareLtd adalah tentang maksimalisasi visi jangka panjang."
tr: "Crypto kısa vadeli maksimize projelerle doludur. n @Starknet ve @Starkhare Ltd.Şti uzun vadeli vizyon maksimize etme ile ilgilidir."
zh_cn: “Crypto充满了短期最大化项目。\n @starknet和@starkWareLtd都是关于长期愿景最大化的。

source: // Tweet instantiation
es: // tweet instanciation
fr: // Invocation du Tweet
tr: // Tweet Ansiklopedisi
zh_cn: / 微调即时

source: "New article available! {}"
es: "¡Nuevo artículo disponible!...................................................................................
fr: "Nouveau texte disponible! {}"
id: "Koran baru tersedia! []"
tr: "Yeni makale mevcut!"
zh_cn: "有新文章!"

source: "New tweet! {}"
es: "¡Nuevo tweet!"
fr: "Nouveau tweet! {}"
tr: "Yeni tweet! "
zh_cn: "新的推特!"

source: <span class="caption">A `Summary` trait that consists of the behavior provided by a `summarize` method</span>
es: <span class="caption">Un rasgo `Resumen` que consiste en el comportamiento proporcionado por un método `summarize`</span>
fr: <span class="caption">Un caractère `Sommary` qui se compose du comportement fourni par une méthode `summarize`</span>
id: <span class="caption">A ÁSummary sifat yang terdiri dari perilaku yang disediakan oleh sebuah metode </span>
tr: span class="caption">Bir summary yönteminin sağladığı davranıştan oluşan bir summary özelliği/span>
zh_cn: <span类=“Caption” > > A`摘要'特性,由`摘要'方法 </span>提供的行为构成

source: Each type implementing this trait must provide its own custom behavior for the body of the method. The compiler will enforce that any type that implements the `Summary` trait will have the method `summarize` defined with this signature exactly.
es: Cada tipo que implemente este rasgo debe proporcionar su propio comportamiento personalizado para el cuerpo del método. El compilador hará que cualquier tipo que implemente el rasgo `Resumen` tenga el método `resumir` definido con esta firma exactamente.
fr: Chaque type implémentant ce caractère doit fournir son propre comportement personnalisé pour le corps de la méthode. Le compilateur fera en sorte que tout type qui implémente le caractère `Sommary` aura la méthode `summarize` définie avec cette signature exactement.
id: Setiap tipe yang menerapkan sifat ini harus menyediakan kebiasaannya sendiri untuk tubuh metode tersebut. Komiler akan memaksakan jenis apa pun yang mengimplementasikan sifat slumary akan memiliki metode ·summarizeå didefinisikan dengan tanda tangan ini persis.
tr: Bu özelliği uygulayan her tür, yöntemin gövdesi için kendi özel davranışını sağlamalıdır. Derleyici, Summmary özelliğini uygulayan herhangi bir türün, bu imzayla tam olarak tanımlanan summarize yöntemine sahip olmasını sağlayacaktır.
zh_cn: 执行该特性的每一种类型都必须为该方法的体体提供自己的习惯行为。 汇编者将强制要求, 执行“ 摘要” 特性的任何类型都将有精确的“ 概要” 方法, 由此签名来定义 。

source: A trait can have multiple methods in its body: the method signatures are listed one per line and each line ends in a semicolon.
es: Un rasgo puede tener múltiples métodos en su cuerpo: las firmas del método se enumeran una por línea y cada línea termina en un punto y coma.
fr: Un trait peut avoir plusieurs méthodes dans son corps : les signatures de la méthode sont listées une par ligne et chaque ligne se termine dans un point-virgule.
id: Sebuah sifat dapat memiliki berbagai metode dalam tubuhnya: tanda tangan metodenya terdaftar satu per baris dan setiap baris berakhir pada titik koma.
tr: Bir özelliğin vücudunda birden fazla yöntem olabilir: yöntem imzaları satır başına bir tane listelenir ve her bir çizgi bir noktalı virgülde biter.
zh_cn: 特征在身体上可以有多种方法:方法特征每行列出一个,每一行以分号结尾。

source: Implementing a Trait on a Type
es: Implementación de un rasgo en un tipo
fr: Mise en œuvre d'un trait sur un type
id: Menimplementasikan Sifat pada Suatu Tipe
tr: Bir Tür Üzerinde Bir Trait Uygulamak
zh_cn: 执行一种类型上的轨迹

source: Now that we’ve defined the desired signatures of the `Summary` trait’s methods, we can implement it on the types in our media aggregator. The following code shows an implementation of the `Summary` trait on the `NewsArticle` struct that uses the headline, the author, and the location to create the return value of `summarize`. For the `Tweet` struct, we define `summarize` as the username followed by the entire text of the tweet, assuming that tweet content is already limited to 280 characters.
es: Ahora que hemos definido las firmas deseadas de los métodos del rasgo `Resumen`, podemos implementarlo en los tipos en nuestro agregador de medios. El siguiente código muestra una implementación del rasgo `Resumen` en la estructura `NewsArticle` que utiliza el título, el autor, y la ubicación para crear el valor de retorno de `resumir`. Para la estructura `Tweet`, definimos `resumir` como el nombre de usuario seguido por el texto completo del tweet, asumiendo que el contenido del tweet ya está limitado a 280 caracteres.
fr: Maintenant que nous avons défini les signatures souhaitées des méthodes `Sommary` trait's, nous pouvons l'appliquer sur les types dans notre agrégateur de médias. Le code suivant montre une implémentation du caractère `Sommary` sur la structure `NewsArticle` qui utilise le titre, l'auteur, et l'emplacement pour créer la valeur de retour de `summarize`. Pour la structure `Tweet`, nous définissons `summarize` comme le nom d'utilisateur suivi par l'ensemble du texte du tweet, en supposant que le contenu du tweet est déjà limité à 280 caractères.
id: Sekarang kita telah mendefinisikan tanda tangan yang diinginkan dari metode-metria Summary, kita dapat mengimplementasikannya pada tipe-tipe di media kita. Kode berikut ini menunjukkan implementasi dari sifat yang diinginkan pada struktur ÁSUMmarary di dalam bentuk yang menggunakan headline, penulis, dan lokasi untuk membuat nilai kembali ÁTweetán, kita mendefinisikan nama pengguna yang diikuti oleh seluruh teks, dengan tafsiran yang sudah terbatas pada 280 karakter.
tr: Şimdi Summary özelliğinin yöntemlerinin istenen imzalarını tanımladığımıza göre, bunu medya toplayıcımızdaki türler üzerinde uygulayabiliriz. Aşağıdaki kod, NewsArticle yapısındaki Summary özelliğinin zaten başlığı kullanan bir uygulamasını gösterir, yazar, ve summarize'in geri dönüş değerini oluşturmak için konum, summarize'in tüm kullanıcı adıdır.
zh_cn: 既然我们已经定义了`摘要'特性方法的预期特征,我们可以在媒体聚合器中将它作为类型加以执行,以下代码显示“摘要”特性在使用头条标题、作者和创建`摘要'返回价值的地点的`新文章'结构上的执行。关于`摘要'结构,我们将`摘要'定义为用户名,然后是整个推文的全文,假设推文内容已经限于280个字符。
