Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: It is also possible to implement the `Display` trait for the `Point` struct using these macros, as shown here:
es: También es posible poner en práctica el rasgo `Display` para la estructura `Point` utilizando estas macros, como se muestra a continuación:
fr: Il est également possible de mettre en œuvre le caractère `Affichage` pour la structure `Point` en utilisant ces macros, comme indiqué ici:
id: Hal ini juga dimungkinkan untuk mengimplementasikan sifat display yang untuk struktur ·Pointe_BAR_ menggunakan makro ini, sebagaimana ditunjukkan di sini:
tr: Burada gösterildiği gibi, bu makroları kullanarak Point yapısı için Display özelliğini uygulamak da mümkündür:
zh_cn: 如下文所示,利用这些宏执行`点'结构的`碎片'特性也是可能的:

source: "Point ({x}, {y})"
es: "Punto ({x}, {y})"
zh_cn: “ 点 ({x}, {y}) ”

source: Printing complex data types this way might not be ideal as it requires additional steps to use the `print!` and `println!` macros. If you need to print complex data types, especially when debugging, use the `Debug` trait described below instead.
es: La impresión de tipos de datos complejos de esta manera puede no ser ideal, ya que requiere pasos adicionales para usar las macros `print!` y `println!`. Si necesita imprimir tipos de datos complejos, especialmente al depurar, utilice el rasgo `Debug` descrito a continuación.
fr: Impression de types de données complexes de cette façon pourrait ne pas être idéal car il nécessite des étapes supplémentaires pour utiliser les macros `print!` et `println!`. Si vous avez besoin d'imprimer des types de données complexes, en particulier lors du débogage, utilisez plutôt le caractère `Debug` décrit ci-dessous.
id: Mencetak tipe data yang rumit dengan cara ini mungkin tidak ideal karena memerlukan langkah tambahan untuk menggunakan sidik jari! dan makro jika Anda perlu mencetak tipe data kompleks, terutama ketika debug, gunakan sifat debug yang digambarkan di bawah sebagai gantinya.
tr: Karmaşık veri türlerini bu şekilde yazdırmak, print! ve println! makrolarını kullanmak için ek adımlar gerektirdiğinden ideal olmayabilir. Karmaşık veri türlerini yazdırmanız gerekiyorsa, özellikle hata ayıklama sırasında, aşağıda açıklanan Debug özelliğini kullanın.
zh_cn: 这样打印复杂的数据类型可能不理想,因为它需要额外步骤使用“打印!”和“打印!”宏。如果需要打印复杂的数据类型,特别是在调试时,请使用下文所述的“调试”特性。

source: Print Debug Traces
es: Imprimir rastros de depuración
fr: Imprimer les traces de débogage
id: Cetak Telusuri Debug
tr: Hata Ayıklama İzlerini Yazdır
zh_cn: 打印调试追踪

source: Cairo provides the `Debug` trait, which can be derived to print the value of variables when debugging. Simply add `:?` within the curly brackets `{}` placeholders in a `print!` or `println!` macro string.
es: El Cairo proporciona el rasgo `Debug`, que se puede derivar para imprimir el valor de las variables al depurar. Simplemente añádase `:?` dentro de los corchetes rizados marcadores de posición en una cadena macro `print!` o `println!`.
fr: Le Caire fournit le caractère `Debug`, qui peut être dérivé pour imprimer la valeur des variables lors du débogage. Il suffit d'ajouter `:?` entre les crochets `{}` dans une chaîne macro `print!` ou `println!`.
id: Kairo menyediakan sifat debug, yang dapat diperoleh untuk mencetak nilai variabel ketika debug. Cukup tambahkan ·gt;??
tr: Kahire, hata ayıklama sırasında değişkenlerin değerini yazdırmak için türetilebilen Debug özelliğini sağlar. Sadece kıvırcık parantez içinde yer tutucuları bir print! veya println! makro dizisi ekleyin.
zh_cn: 开罗提供了“调试”特性,可以用来打印调试时的变量值,只需在“打印”或“打印”宏观字符串中括号内添加“?” 。

source: This trait is very useful and is implemented by default for basic data types. It can also be simply derived for complex data types using the `#[derive(Debug)]` attribute, as long as all types they contain implement it. This eliminates the need to manually implement extra code to print complex data types.
es: Este rasgo es muy útil y se implementa de forma predeterminada para los tipos de datos básicos. También se puede derivar simplemente para tipos de datos complejos usando el atributo •[derive(Debug)]`, siempre y cuando todos los tipos que contengan lo implementen. Esto elimina la necesidad de implementar manualmente código adicional para imprimir tipos de datos complejos.
fr: Ce caractère est très utile et est implémenté par défaut pour les types de données de base. Il peut également être simplement dérivé pour les types de données complexes en utilisant l'attribut `#[derive(Debug)]`, tant que tous les types qu'ils contiennent l'implémentent. Cela élimine la nécessité d'implémenter manuellement un code supplémentaire pour imprimer des types de données complexes.
id: Sifat ini sangat berguna dan diimplementasikan secara default untuk tipe data dasar. Ini juga dapat hanya diturunkan untuk tipe data kompleks menggunakan atribut åDebug "# [derive]], asalkan semua tipe mengandungnya yang mengimplementasikannya. Ini menghilangkan kebutuhan secara manual untuk mengimplementasikan kode ekstra untuk menampilkan tipe data kompleks.
tr: Bu özellik çok kullanışlıdır ve temel veri türleri için varsayılan olarak uygulanır. İçerdikleri tüm türler uyguladığı sürece #[türev(Debug)]] özniteliğini kullanarak karmaşık veri türleri için de basitçe türetilebilir. Bu, karmaşık veri türlerini yazdırmak için ekstra kodu manuel olarak uygulama ihtiyacını ortadan kaldırır.
zh_cn: 这一特性非常有用,并且默认地用于基本数据类型。它也可以简单地用于使用 {{[derive(Debug)]}`属性的复杂数据类型,只要它们包含的所有类型都加以执行。这就消除了手动执行额外代码以打印复杂数据类型的需要。

source: Note that `assert_xx!` macros used in tests require the provided values to implement the `Debug` trait, as they also print the result in case of assertion failure.
es: Tenga en cuenta que las macros `assert_xx!` utilizadas en los ensayos requieren los valores proporcionados para implementar el rasgo `Debug`, ya que también imprimen el resultado en caso de fallo de la afirmación.
fr: Notez que les macros `assert_xx!` utilisées dans les tests nécessitent les valeurs fournies pour implémenter le caractère `Debug`, car elles impriment également le résultat en cas de défaillance de l'affirmation.
id: Perhatikan bahwa makro yang digunakan dalam tes itu membutuhkan nilai - nilai yang disediakan untuk mengimplementasikan sifat åDebug, karena mereka juga mencetak hasilnya dalam kasus kegagalan pernyataan.
tr: Testlerde kullanılan assert_xx! makrolarının Debug özelliğini uygulamak için sağlanan değerleri gerektirdiğini unutmayın, çünkü sonuç iddia hatası durumunda da yazdırılır.
zh_cn: 请注意,在测试中使用的`Assert_xx!'宏要求提供数值,以落实`调试'特性,因为它们还印出在未能证实的情况下的结果。

source: For more details about the `Debug` trait and its usage for printing values when debugging, please refer to the [Derivable Traits](./appendix-03-derivable-traits.md#debug-trait-for-printing-and-debugging) appendix.
es: Para obtener más detalles sobre el rasgo `Debug` y su uso para la impresión de valores al depurar, consulte el apéndice [Rasgos Derivados](./appendix-03-derivable-traits.md#debug-trait-for-printing-and-debugging).
fr: Pour plus de détails sur le caractère `Debug` et son utilisation pour l'impression des valeurs lors du débogage, veuillez consulter l'appendice [Derivable Traits](./appendix-03-derivable-traits.md#debug-trait-for-printing-and-debugging).
id: Untuk rincian lebih lanjut tentang sifat åDebug dan penggunaannya untuk mencetak nilai ketika debugging, silakan merujuk ke apendiks [Barat Dapat Diizinkan]./apendix-03-derivable-traits.md#debug-trait-for-printing-and-debuging).
tr: Debug özelliği ve hata ayıklama sırasında yazdırma değerleri için kullanımı hakkında daha fazla bilgi için, lütfen [Türev Edilebilir Özellikler](./appendix-03-türevlenebilir-traits.md#debug-trait-for-printing-and-debugging) ekine bakın.
zh_cn: 关于“调试”特性及其在调试时用于打印值的更多详情,请参见[可调试]附录(./附录-03-可调试-traits.md#debug-trait- for-printing-和调试)。

source: The following sections contain reference material you may find useful in your Cairo journey.
es: Las siguientes secciones contienen material de referencia que puede encontrar útil en su viaje a El Cairo.
fr: Les sections suivantes contiennent du matériel de référence que vous pouvez trouver utile dans votre voyage au Caire.
id: Bagian - bagian berikut memuat bahan referensi yang mungkin berguna bagi perjalanan Anda di Kairo.
tr: Aşağıdaki bölümler, Kahire seyahatinizde yararlı bulabileceğiniz referans materyalleri içerir.
zh_cn: 以下各节载有您在开罗之旅中可能认为有用的参考材料。

source: Appendix A - Keywords
es: Apéndice A - Palabras clave
fr: Annexe A - Mots clés
id: Lampiran A - Kata Kunci
tr: Ek A - Anahtar Kelimeler
zh_cn: 附录A - 关键词

source: The following list contains keywords that are reserved for current or future use by the Cairo language.
es: La siguiente lista contiene palabras clave que están reservadas para su uso actual o futuro en el idioma de El Cairo.
fr: La liste suivante contient des mots-clés qui sont réservés à l'usage courant ou futur de la langue du Caire.
id: Daftar berikut berisi kata kunci yang dikhususkan untuk penggunaan bahasa Kairo saat ini atau di masa depan.
tr: Aşağıdaki liste, Kahire dili tarafından mevcut veya gelecekteki kullanım için ayrılmış anahtar kelimeler içerir.
zh_cn: 下表所列关键词专供开罗语文当前或今后使用。

source: There are three keyword categories:
es: Hay tres categorías de palabras clave:
fr: Il y a trois catégories de mots clés :
id: Ada tiga kategori kata kunci:
tr: Üç anahtar kelime kategorisi vardır:
zh_cn: 关键字有三个类别:

source: strict
es: estricto
id: ketat
tr: sıkı
zh_cn: 严格

source: loose
es: suelta
fr: lâche
id: lepas
tr: gevşek
zh_cn: 松散

source: reserved
es: reservadas
fr: réservé
id: Terresered
tr: rezerve
zh_cn: 保留

source: There is a fourth category, which are functions from the core library. While their names are not reserved, they are not recommended to be used as names of any items to follow good practices.
es: Hay una cuarta categoría, que son funciones de la biblioteca principal. Si bien sus nombres no están reservados, no se recomienda utilizarlos como nombres de ningún elemento para seguir buenas prácticas.
fr: Il y a une quatrième catégorie, qui sont des fonctions de la bibliothèque centrale. Bien que leurs noms ne soient pas réservés, ils ne sont pas recommandés pour être utilisés comme noms d'éléments pour suivre les bonnes pratiques.
id: Ada kategori keempat, yang merupakan fungsi dari perpustakaan inti. sedangkan nama mereka tidak dipesan, mereka tidak disarankan untuk digunakan sebagai nama dari setiap item untuk mengikuti praktek yang baik.
tr: Çekirdek kütüphaneden fonksiyonlar olan dördüncü bir kategori vardır. İsimleri ayrılmamış olsa da, iyi uygulamaları takip etmek için herhangi bir öğenin adı olarak kullanılması önerilmez.
zh_cn: 第四类是核心图书馆的职能,虽然不保留其名称,但建议不将其作为任何遵循良好做法的项目的名称。

source: Strict keywords
es: Palabras clave estrictas
fr: Mots-clés stricts
id: Kata kunci ketat
tr: Sıkı anahtar kelimeler
zh_cn: 严格关键词

source: These keywords can only be used in their correct contexts. They cannot be used as names of any items.
es: Estas palabras clave sólo se pueden usar en sus contextos correctos. No se pueden usar como nombres de ningún elemento.
fr: Ces mots-clés ne peuvent être utilisés que dans leur contexte correct. Ils ne peuvent être utilisés comme noms d'aucun élément.
id: Kata kunci ini hanya dapat digunakan dalam konteks yang benar. Mereka tidak dapat digunakan sebagai nama dari setiap butir.
tr: Bu anahtar kelimeler yalnızca doğru bağlamlarında kullanılabilir. Herhangi bir öğenin adı olarak kullanılamazlar.
zh_cn: 这些关键字只能用于正确的背景。 它们不能用作任何项目的名称。

source: `as` - Rename import
es: `as` - Cambiar el nombre de importación
fr: `as` - Renommer l'importation
id: Mengimpor ganti nama
tr: as - İçe aktarmayı yeniden adlandır
zh_cn: `as'- 重命名导入

source: `break` - Exit a loop immediately
es: `break` - Salir de un bucle inmediatamente
fr: `break` - Quitter une boucle immédiatement
id: - Keluar dari loop segera
tr: break - Bir döngüden hemen çıkın
zh_cn: `突破'- 立即退出环环

source: `const` - Define constant items
es: `const` - Definir elementos constantes
fr: `const` - Définir les éléments constants
id: - Definisikan konstanta item
tr: const - Sabit öğeleri tanımla
zh_cn: `保留'- 定义固定项目

source: `continue` - Continue to the next loop iteration
es: `continuar` - Continuar a la iteración del bucle siguiente
fr: `continue` - Continuer jusqu'à la prochaine itération de boucle
id: Lanjutkan ke iterasi loop berikutnya
tr: devam - Bir sonraki döngü yinelemeye devam et
zh_cn: `继续'- 继续下一轮循环迭代

source: `else` - Fallback for `if` and `if let` control flow constructs
es: `else` - Retroceso para `if` y `if let` control flow constructs
fr: `else` - Fallback pour `si` et `si let` commande les constructions de débit
id: Jika Anda membiarkan kontrol struktur aliran, Anda akan mendapatkan kembali.
tr: else - if ve if kontrol akış yapıları için geri dönüş
zh_cn: `else'-`如果'和`如果'控制流量结构的倒退

source: `enum` - Define an enumeration
es: `Enum` - Definir una enumeración
fr: `enum` - Définir une énumération
id: - Definisikan sebuah enumerasi
tr: enum - Bir sayım tanımla
zh_cn: `enum'- 界定列举

source: `extern` - Function defined at the compiler level that can be compiled to CASM
es: `externa` - Función definida a nivel del compilador que puede compilarse a CASM
fr: `extern` - Fonction définie au niveau du compilateur qui peut être compilée au CASM
id: - Fungsi terdefinisi pada tingkat kompiler yang dapat dikompilasi ke CASM
tr: extern - CASM'ye derlenebilen derleyici düzeyinde tanımlanan fonksiyon
zh_cn: `外部'- 在汇编者一级界定的功能,可汇编成化学文摘社

source: `false` - Boolean false literal
es: `falso` - Falso literal booleano
fr: "faux" - Booléen faux littéral
id: - Boolean palsu literal
zh_cn: `假'- 布尔假字

source: `fn` - Define a function
es: `fn` - Definir una función
fr: `fn` - Définir une fonction
id: - Definisikan sebuah fungsi
tr: fn - Bir işlevi tanımla
zh_cn: `fn'- 定义函数

source: `if` - Branch based on the result of a conditional expression
es: `si` - Subdivisión basada en el resultado de una expresión condicional
fr: `si` - Branche basée sur le résultat d'une expression conditionnelle
id: - Cabang berdasarkan hasil dari ekspresi kondisional
tr: if - Koşullu ifadenin sonucuna dayanan dal
zh_cn: `如果'-基于有条件表达结果的分支

source: `impl` - Implement inherent or trait functionality
es: `impl` - Implementar funcionalidad inherente o característica
fr: `impl` - Mettre en œuvre la fonctionnalité inhérente ou caractéristique
id: Implementasi bawaan atau sifat fungsionalitas
tr: impl - Doğal veya özellik işlevselliğini uygulamak
zh_cn: `impl'- 实施固有或特性功能

source: `implicits` - Special kind of function parameters that are required to perform certain actions
es: `implícitas` - Tipo especial de parámetros de función que se requieren para llevar a cabo ciertas acciones
fr: `implicites` - Types spéciaux de paramètres de fonction qui sont nécessaires pour exécuter certaines actions
id: - Jenis khusus parameter fungsi yang diperlukan untuk melakukan tindakan tertentu
tr: implicits - Belirli eylemleri gerçekleştirmek için gerekli olan özel tür fonksiyon parametreleri
zh_cn: `隐含'- 执行某些行动所需的特殊种类的功能参数

source: `let` - Bind a variable
es: `let` - Enlazar una variable
fr: `let` - Relier une variable
id: - Bind a variabel
tr: let - Bir değişkeni bağla
zh_cn: `let'- 捆绑变量

source: `loop` - Loop unconditionally
es: `Loop` - Loop incondicionalmente
fr: "loop" - Boucle inconditionnelle
id: - Loop tanpa syarat.
tr: loop - Koşulsuz döngü
zh_cn: `循环'- 无条件循环

source: `match` - Match a value to patterns
es: `match` - Coincidir con un valor a los patrones
fr: `match` - Correspondre une valeur aux modèles
id: - Cocokkan dengan pola
tr: match - Bir değeri kalıplarla eşleştir
zh_cn: `匹配' - 匹配值到模式

source: `mod` - Define a module
es: `mod` - Definir un módulo
fr: `mod` - Définir un module
id: - Definisikan sebuah modul
tr: mod - Bir modül tanımla
zh_cn: `模式'- 定义模块

source: `mut` - Denote variable mutability
es: `mut` - Mutabilidad variable de la nota
fr: "mut" - mutabilité variable de la note
id: - Variabel Kemunafikan Denote
tr: mut - Denote değişkeni değiştirilebilirliği
zh_cn: `mut'- 表示可变变化的可变性

source: `nopanic` - Functions marked with this notation mean that the function will never panic.
es: `nopánico` - Las funciones marcadas con esta notación significan que la función nunca entrará en pánico.
fr: `nopanic` - Les fonctions marquées de cette notation signifient que la fonction ne paniquera jamais.
id: ▪nopanic å - Fungsi yang ditandai dengan notasi ini berarti bahwa fungsi tersebut tidak akan pernah panik.
tr: nopanic - Bu notasyonla işaretlenmiş fonksiyonlar, fonksiyonun asla paniklemeyeceği anlamına gelir.
zh_cn: `非西班牙'- 以此符号标示的功能意味着该函数永远不会惊慌。

source: `of` - Implement a trait
es: `de` - Aplicar un rasgo
fr: `de` - Mettre en œuvre un trait
id: - Menimplementasi sebuah sifat
tr: of - Bir özellik uygula
zh_cn: ``` - 实施一个特性

source: `pub` - Denote public visibility in items, such as struct and struct fields, enums, consts, traits and impl blocks, or modules
es: `pub` - Denotar la visibilidad pública en elementos, tales como campos de estructura y estructura, enums, consts, rasgos y bloques de impl, o módulos
fr: `pub` - Signaler la visibilité du public dans des éléments tels que les champs de construction et de construction, les enums, les const, les traits et les blocs d'impl, ou les modules
id: ▪pubé - Memberikan visibilitas publik pada barang, seperti struct and struct fields, enums, consts, ciri dan impl blocks, atau modul
tr: pub - Yapı ve yapı alanları, enumlar, kontlar, özellikler ve impl blokları veya modüller gibi öğelerde kamu görünürlüğünü ifade edin
zh_cn: `管道'- 指在诸如建筑和建筑田、圆柱、阴柱、特性和断管块或模块等项目的公众能见度

source: `ref` - Parameter passed implicitly returned at the end of a function
es: `ref` - Parámetro pasado implícitamente devuelto al final de una función
fr: `ref` - Paramètre passé implicitement retourné à la fin d'une fonction
id: - Parameter dilewatkan secara implisit kembali pada akhir sebuah fungsi
tr: ref - Parametre, bir fonksiyonun sonunda dolaylı olarak döndürüldü
zh_cn: `ref'- 参数通过时默认返回函数结束时的参数

source: `return` - Return from function
es: `retorno` - Retorno de la función
fr: `return` - Retour de la fonction
id: Kembali dari fungsi
tr: return - Fonksiyondan dönüş
zh_cn: `返回'- 复职

source: `struct` - Define a structure
es: `struct` - Definir una estructura
fr: `struct` - Définir une structure
id: - Definisikan struktur
tr: struct - Bir yapı tanımla
zh_cn: `建筑'- 界定一个结构

source: `trait` - Define a trait
es: `ratio` - Definir un rasgo
fr: "caractère" - Définir un caractère
id: - Tentukan sifat.
tr: trait - Bir özelliği tanımla
zh_cn: `trait'- 界定特性

source: `true` - Boolean true literal
es: `true` - Boolean verdadero literal
fr: "vrai" - Booléen vrai littéral
id: - Boolean benar-benar literal
tr: true - Boolean gerçek anlamıyla
zh_cn: `真正的'- 布尔真实的字面

source: `type` - Define a type alias
es: `tipo` - Definir un alias de tipo
fr: `type` - Définir un alias de type
id: - Definisikan sebuah tipe alias
tr: type - Bir tür takma adı tanımla
zh_cn: `类型'- 定义类型别名

source: `use` - Bring symbols into scope
es: `uso` - Introducir símbolos en el ámbito de aplicación
fr: `utilisation` - Apporter des symboles dans la portée
id: - Bawa simbol ke dalam ruang lingkup
tr: use - Sembolleri kapsam içine getirin
zh_cn: `使用'- 将符号纳入范围

source: `while` - loop conditionally based on the result of an expression
es: `while` - bucle condicionalmente basado en el resultado de una expresión
fr: `alors` - boucle conditionnellement basée sur le résultat d'une expression
id: Sementara itu - loop secara kondisional berdasarkan hasil dari sebuah ekspresi
tr: while - bir ifadenin sonucuna bağlı olarak koşullu olarak döngü
zh_cn: `同时'- 有条件地根据表达方式的结果循环

source: Loose Keywords
es: Palabras clave sueltas
fr: Mot-clé laissés en place
id: Kata Kunci Loose
tr: Gevşek Anahtar Kelimeler
zh_cn: 松放关键字

source: These keywords are associated with a specific behaviour, but can also be used to define items.
es: Estas palabras clave están asociadas con un comportamiento específico, pero también se pueden utilizar para definir elementos.
fr: Ces mots clés sont associés à un comportement spécifique, mais peuvent également être utilisés pour définir des éléments.
id: Kata kunci ini dikaitkan dengan perilaku tertentu, tetapi juga dapat digunakan untuk mendefinisikan item.
tr: Bu anahtar kelimeler belirli bir davranışla ilişkilidir, ancak öğeleri tanımlamak için de kullanılabilir.
zh_cn: 这些关键词与具体行为相关联,但可用于界定项目。

source: `self` - Method subject
fr: `self` - Sujet de la méthode
id: - Masalah metode
tr: self - Yöntem konusu
zh_cn: `自我'- 方法问题

source: `super` - Parent module of the current module
es: `super` - Módulo padre del módulo actual
fr: `super` - Module parent du module actuel
id: - Modul induk modul modul saat ini
tr: super - Geçerli modülün ana modülü
zh_cn: `超级' - 当前模块的父模块

source: Reserved Keywords
es: Palabras clave reservadas
fr: Mots clés réservés
id: Kata Kunci Yang Dicadangkan
tr: Ayrılmış Anahtar Kelimeler
zh_cn: 关键词

source: These keywords aren't used yet, but they are reserved for future use. For now, it is possible to use them to define items, although it is highly recommended not to do so. The reasoning behind this recommendation is to make current programs forward compatible with future versions of Cairo by forbidding them to use these keywords.
es: Estas palabras clave no se utilizan todavía, pero están reservadas para uso futuro. Por ahora, es posible utilizarlas para definir elementos, aunque es muy recomendable no hacerlo. El razonamiento detrás de esta recomendación es hacer los programas actuales hacia adelante compatibles con futuras versiones de El Cairo, prohibiéndoles usar estas palabras clave.
fr: Ces mots-clés ne sont pas encore utilisés, mais ils sont réservés pour une utilisation future. Pour l'instant, il est possible de les utiliser pour définir des éléments, bien qu'il soit fortement recommandé de ne pas le faire. Le raisonnement derrière cette recommandation est de rendre les programmes actuels compatibles avec les futures versions du Caire en leur interdisant d'utiliser ces mots-clés.
id: Kata kunci ini belum digunakan, tetapi dikhususkan untuk penggunaan di masa depan. Untuk sekarang, mungkin untuk menggunakannya untuk mendefinisikan item, walaupun sangat dianjurkan untuk tidak melakukannya. Alasan di balik rekomendasi ini adalah untuk membuat program saat ini sesuai dengan versi berikutnya Kairo dengan melarang mereka menggunakan kata kunci ini.
tr: Bu anahtar kelimeler henüz kullanılmamıştır, ancak gelecekteki kullanımlar için ayrılmıştır. Şimdilik, öğeleri tanımlamak için bunları kullanmak mümkündür, ancak bunu yapmamanız şiddetle tavsiye edilir. Bu tavsiyenin arkasındaki gerekçe, mevcut programları bu anahtar kelimeleri kullanmalarını yasaklayarak Kahire'nin gelecekteki sürümleriyle uyumlu hale getirmektir.
zh_cn: 这些关键字尚未使用, 但保留给未来使用 。 目前, 可以使用这些关键字来定义项目, 虽然强烈建议不要这样做 。 这项建议的理由是, 禁止当前程序使用这些关键字, 使当前程序与开罗的未来版本兼容 。

source: `Self`
es: `Auto'
fr: "Soi-même"
id: Selfé
zh_cn: `自 '

source: `do`
es: `hacer`
fr: "faire"
id: Jadi, apa yang harus kita lakukan?
zh_cn: `做'

source: `for`
es: `por`
fr: «pour»
id: Untuk itu.
zh_cn: `为`

source: `hint`
es: `hit`
fr: 'hant'
id: Oh, tidak.
zh_cn: `东西'

source: `macro`
id: (Naikro)
zh_cn: `马克罗 '

source: `move`
es: `mover`
fr: Déplacer
id: Pergi dari sini.
tr: Hareket et
zh_cn: `移动 '

source: `static_assert`
id: S_asser_statis
zh_cn: `静态资产 '

source: `static`
es: `estático`
fr: "statique"
id: Aku tidak tahu apa-apa.
tr: statik
zh_cn: `静 '

source: `typeof`
es: `tipo de '
fr: «type de»
id: Seperti itulah.
tr: tipof
zh_cn: `类型'

source: `unsafe`
es: `inseguro`
fr: "insûre"
id: Aku tidak tahu apa yang harus dilakukan.
tr: güvensiz
zh_cn: `不安全'

source: `where`
es: `donde '
fr: "où"
id: Di mana aku berada?
tr: nerede
zh_cn: `此处 '

source: `with`
es: `con '
fr: "avec"
id: Dengan apa?
tr: ile
zh_cn: `与`

source: `yield`
fr: "rendement"
id: [ Gambar di hlm.
zh_cn: `爱'

source: Built-in Functions
es: Funciones integradas
fr: Fonctions intégrées
id: Fungsi Bawaan
tr: Dahili Fonksiyonlar
zh_cn: 内置功能
