Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Note: If you want to stick to a standard style across Cairo projects, you can use the automatic formatter tool available with `scarb fmt` to format your code in a particular style (more on `scarb fmt` in [Appendix F](./appendix-06-useful-development-tools.md)). The Cairo team has included this tool with the standard Cairo distribution, as `cairo-run` is, so it should already be installed on your computer!
es: Nota: Si desea seguir un estilo estándar a través de los proyectos de El Cairo, puede utilizar la herramienta formateria automática disponible con `scarb fmt` para formatear su código en un estilo particular (más en `scarb fmt` en [Apéndice F](./apéndice-06-util-development-tools.md)). El equipo de El Cairo ha incluido esta herramienta con la distribución estándar de El Cairo, como `cairo-run` es, por lo que ya debe estar instalado en su computadora!
fr: Remarque : Si vous voulez vous en tenir à un style standard dans tous les projets du Caire, vous pouvez utiliser l'outil de forme automatique disponible avec `scarb fmt` pour formater votre code dans un style particulier (plus sur `scarb fmt` dans [Appendice F](./appendix-06-useful-development-tools.md)). L'équipe du Caire a inclus cet outil avec la distribution standard du Caire, comme `cairo-run` est, donc il devrait déjà être installé sur votre ordinateur!
id: Catatan: Jika Anda ingin tetap dengan gaya standar di seluruh proyek Kairo, Anda dapat menggunakan alat formateri otomatis yang tersedia dengan fmscarb fmt; untuk memformat kode Anda dengan gaya tertentu (lebih banyak pada thosescarb fmt-- in [Appendix F]./appendix-06-usful-developmenttools.md). Tim Kairo telah menyertakan alat ini dengan distribusi standar Kairo, sebagai Ácairo-run, jadi ini seharusnya sudah dipasang di komputer Anda!
tr: Not: Kahire projeleri arasında standart bir stile bağlı kalmak istiyorsanız, kodunuzu belirli bir stilde biçimlendirmek için scarb fmt ile mevcut olan otomatik biçimlendirici aracını kullanabilirsiniz (daha fazla scarb fmt'de [Ek F] (./appendix-06-useful-development-tools.md)). Kahire ekibi bu aracı standart Kahire dağıtımına dahil etti, bu yüzden iroca olması gerekiyor.
zh_cn: 注意 : 如果您想要在整个开罗工程中坚持标准样式, 您可以使用可用“ sccarb fmt” 的自动物质工具, 以特定样式( 更多在 [ 附录F 中的“ scarb fmt” (./ appendix-06- useful Development- tools. md) ) 格式化您的代码。 开罗团队已经将这个工具与标准开罗分布( “ cairo- run” ) 格式化为“ cairo- run”, 因此它应该已经安装在您的计算机上!

source: The body of the `main` function holds the following code:
es: El cuerpo de la función " principal " contiene el siguiente código:
fr: Le corps de la fonction `main` contient le code suivant:
id: Tubuh fungsi åmain menyimpan kode berikut:
tr: main işlevinin gövdesi aşağıdaki kodu tutar:
zh_cn: `主要'职能的主体有以下代码:

source: This line does all the work in this little program: it prints text to the screen. There are four important details to notice here.
es: Esta línea hace todo el trabajo en este pequeño programa: imprime texto a la pantalla. Hay cuatro detalles importantes para notar aquí.
fr: Cette ligne fait tout le travail dans ce petit programme : elle imprime du texte à l'écran. Il y a quatre détails importants à remarquer ici.
id: Baris ini melakukan semua pekerjaan dalam program kecil ini: ini mencetak teks ke layar. Ada empat rincian penting untuk pemberitahuan di sini.
tr: Bu satır bu küçük programdaki tüm çalışmaları yapar: metni ekrana yazdırır. Burada dikkat edilmesi gereken dört önemli ayrıntı vardır.
zh_cn: 这条线可以完成这个小程序的所有工作: 它打印到屏幕上的文字。 这里需要注意四个重要细节 。

source: First, Cairo style is to indent with four spaces, not a tab.
es: En primer lugar, el estilo de El Cairo es de sangría con cuatro espacios, no una pestaña.
fr: Tout d'abord, le style du Caire est d'entrer avec quatre espaces, pas un onglet.
id: Pertama, gaya Kairo adalah untuk mengindentasi dengan empat spasi, bukan tab.
tr: İlk olarak, Kahire tarzı bir sekme ile değil, dört boşlukla girinti yapmaktır.
zh_cn: 首先,开罗风格是用四个空格缩进,而不是一个标签。

source: Second, `println!` calls a Cairo macro. If it had called a function instead, it would be entered as `println` (without the `!`). We’ll discuss Cairo macros in more detail in the ["Macros"](./ch11-05-macros.md) chapter. For now, you just need to know that using a `!` means that you’re calling a macro instead of a normal function and that macros don’t always follow the same rules as functions.
es: En segundo lugar, `println!` llama a una macro de El Cairo. Si hubiera llamado a una función en su lugar, se introduciría como `println` (sin el `!`). Vamos a discutir macros de El Cairo en más detalle en el ["Macros"](./ch11-05-macros.md) capítulo. Por ahora, usted sólo necesita saber que usando un `!` significa que usted está llamando a una macro en lugar de una función normal y que las macros no siempre siguen las mismas reglas que las funciones.
fr: Deuxièmement, `println!` appelle une macro du Caire. S'il avait appelé une fonction à la place, il serait entré comme `println` (sans la `!`). Nous allons discuter des macros du Caire plus en détail dans le chapitre [./ch11-05-macros.md). Pour l'instant, vous avez juste besoin de savoir que l'utilisation d'un `!` signifie que vous appelez une macro au lieu d'une fonction normale et que les macros ne suivent pas toujours les mêmes règles que les fonctions.
id: Kedua, jika disebut makro Kairo. jika disebut fungsi sebagai gantinya, itu akan dimasukkan sebagai ▪printlní (tanpa huruf!). kita akan membahas macro Kairo secara lebih detail dalam bab ["Macros"]. /ch11-05-macros.md) untuk sekarang, Anda hanya perlu tahu bahwa menggunakan sebuah ltu!) berarti bahwa Anda memanggil makro bukan fungsi normal dan macros tidak selalu mengikuti aturan yang sama seperti fungsi.
tr: İkincisi, println! bir Kahire makrosu çağırır. Bunun yerine bir fonksiyon çağırmış olsaydı, println (! olmadan) olarak girilirdi. Kahire makrolarını ["Macros"] (./ch11-05-macros.md) bölümünde daha ayrıntılı olarak tartışacağız. Şimdilik, her zaman bir! makrosu kullanarak ve bunun yerine bir makro işlevi aramadığınız anlamına gelir.
zh_cn: 第二,`println!' 称为开罗宏,如果它称为函数,则输入为`println'(没有`!'!”),我们将在[“Macross'] (./ch11-05-macros.md)章中更详细地讨论开罗宏。现在,你只需要知道,使用`!'就意味着你正在调用一个宏而不是正常的函数,而且宏并不总是遵循与函数相同的规则。

source: Third, you see the `"Hello, world!"` string. We pass this string as an argument to `println!`, and the string is printed to the screen.
es: En tercer lugar, se ve el `"Hola, mundo!"` cadena. Pasamos esta cadena como un argumento a `println! ', y la cadena se imprime en la pantalla.
fr: Troisièmement, vous voyez la chaîne `"Bonjour, monde!"`. Nous passons cette chaîne comme argument à `println!`, et la chaîne est imprimée à l'écran.
id: Ketiga, Anda melihat "Halo, dunia!" Kami melewati string ini sebagai argumen untuk ·println!, dan string dicetak ke layar.
tr: Üçüncüsü, "Merhaba, dünya!" dizesini görüyorsunuz. Bu dizeyi println!'ye bir argüman olarak geçiyoruz ve dize ekrana basılıyor.
zh_cn: 第三,你可以看到“你好,世界!” 字符串,我们通过这一字符串作为`println!'的论据,字符串印在屏幕上。

source: Fourth, we end the line with a semicolon (`;`), which indicates that this expression is over and the next one is ready to begin. Most lines of Cairo code end with a semicolon.
es: Cuarto, terminamos la línea con un punto y coma (`;`), que indica que esta expresión ha terminado y la siguiente está lista para comenzar. La mayoría de las líneas del código de El Cairo terminan con un punto y coma.
fr: Quatrièmement, nous terminons la ligne par un point-virgule (`;`), ce qui indique que cette expression est terminée et que la suivante est prête à commencer. La plupart des lignes du code du Caire se terminent par un point-virgule.
id: Keempat, kita mengakhiri garis dengan titik koma (Negara), yang menunjukkan bahwa ekspresi ini berakhir dan yang berikutnya siap untuk dimulai. sebagian besar garis kode Kairo berakhir dengan titik koma.
tr: Dördüncü olarak, bu ifadenin sona erdiğini ve bir sonrakinin başlamaya hazır olduğunu gösteren bir noktalı virgül (;) ile sonlandırırız. Kahire kodunun çoğu satırı noktalı virgül ile sona erer.
zh_cn: 第四,我们用分号(`;`)结束这条线,表示这一表达方式已经结束,下一个表达方式准备开始,开罗代码的大多数行以分号结束。

source: {{#quiz ../quizzes/ch01-02-hello-world.toml}}
fr: {{#quiz../quizes/ch01-02-hello-world.toml}}
zh_cn: / quizzes/ch01-02-Hello-world.toml

source: Summary
es: Resumen
fr: Résumé
id: Ringkasan
tr: Özet
zh_cn: 摘要摘要摘要

source: Let’s recap what we’ve learned so far about Scarb:
es: Repasemos lo que hemos aprendido hasta ahora sobre Scarb:
fr: Récapitulons ce que nous avons appris jusqu'à présent à propos de Scarb:
id: Mari kita ulangi apa yang telah kita pelajari sejauh ini tentang Scarb:
tr: Scarb hakkında şimdiye kadar öğrendiklerimizi özetleyelim:
zh_cn: 让我们回顾一下我们至今为止所学到的关于刀疤的教训:

source: We can install one or multiple Scarb versions, either the latest stable or a specific one, using asdf.
es: Podemos instalar una o varias versiones de Scarb, ya sea el último estable o uno específico, utilizando asdf.
fr: Nous pouvons installer une ou plusieurs versions Scarb, soit la dernière stable, soit une version spécifique, en utilisant asdf.
id: Kita dapat menginstal satu atau beberapa versi Scarb, baik stabil terbaru atau yang spesifik, menggunakan asdf.
tr: Asdf kullanarak bir veya birden fazla Scarb sürümünü, en son kararlı veya belirli bir sürümü yükleyebiliriz.
zh_cn: 我们可以安装一个或多个疤痕版本, 无论是最新的稳定版本还是特定的版本, 使用 asdf 。

source: We can create a project using `scarb new`.
es: Podemos crear un proyecto usando `scarb new`.
fr: Nous pouvons créer un projet en utilisant `scarb new`.
id: Kita bisa membuat sebuah proyek menggunakan bahan bakar baru.
tr: scarb new kullanarak bir proje oluşturabiliriz.
zh_cn: 我们可以用`新的碳碳'创建一个项目。

source: We can build a project using `scarb build` to generate the compiled Sierra code.
es: Podemos construir un proyecto utilizando `scarb build` para generar el código de Sierra compilado.
fr: Nous pouvons construire un projet en utilisant `scarb build` pour générer le code de Sierra compilé.
id: Kita dapat membangun sebuah proyek dengan membangun kereta untuk menghasilkan kode Sierra yang dikompilasi.
tr: Derlenmiş Sierra kodunu oluşturmak için scarb build kullanarak bir proje oluşturabiliriz.
zh_cn: 我们可以利用`碳碳建设'建立一个项目,以产生汇编的塞拉利昂法典。

source: We can execute a Cairo program using the `scarb cairo-run` command.
es: Podemos ejecutar un programa de El Cairo usando el comando `scarb cairo-run`.
fr: Nous pouvons exécuter un programme du Caire en utilisant la commande `scarb cairo-run`.
id: Kita dapat menjalankan program Kairo menggunakan perintah cairo-run.
tr: scarb cairo-run komutunu kullanarak bir Kahire programı yürütebiliriz.
zh_cn: 我们可以使用`scarb cairo-run'命令执行开罗方案。

source: An additional advantage of using Scarb is that the commands are the same no matter which operating system you’re working on. So, at this point, we’ll no longer provide specific instructions for Linux and macOS versus Windows.
es: Una ventaja adicional de usar Scarb es que los comandos son los mismos sin importar en qué sistema operativo estés trabajando. Así que, en este punto, ya no proporcionaremos instrucciones específicas para Linux y macOS frente a Windows.
fr: Un avantage supplémentaire de l'utilisation de Scarb est que les commandes sont les mêmes quel que soit le système d'exploitation sur lequel vous travaillez. Donc, à ce stade, nous ne fournissons plus d'instructions spécifiques pour Linux et macOS par rapport à Windows.
id: Keuntungan tambahan dari menggunakan Scarb adalah bahwa perintah adalah sama tidak peduli sistem operasi mana yang Anda kerjakan. jadi, pada saat ini, kita tidak lagi memberikan instruksi spesifik untuk Linux dan macOS versus Windows.
tr: Scarb'ı kullanmanın ek bir avantajı, hangi işletim sisteminde çalışırsanız çalışın komutların aynı olmasıdır. Bu nedenle, bu noktada, artık Linux ve macOS için Windows'a karşı belirli talimatlar sağlamayacağız.
zh_cn: 使用刀疤的另一个好处是,无论你正在操作哪个操作系统,命令都是一样的。 因此,此时此刻,我们将不再为Linux和MacOS与Windows提供具体的指示。

source: You’re already off to a great start on your Cairo journey! This is a great time to build a more substantial program to get used to reading and writing Cairo code.
es: Usted ya está a un gran comienzo en su viaje de El Cairo! Este es un gran momento para construir un programa más sustancial para acostumbrarse a leer y escribir el código de El Cairo.
fr: Vous êtes déjà sur un bon départ sur votre voyage au Caire! C'est un grand moment pour construire un programme plus substantiel pour s'habituer à la lecture et à l'écriture du code du Caire.
id: Ini adalah waktu yang tepat untuk membangun program yang lebih substansial untuk terbiasa membaca dan menulis kode Kairo.
tr: Kahire seyahatinize şimdiden harika bir başlangıç yapıyorsunuz! Kahire kodunu okumaya ve yazmaya alışmak için daha önemli bir program oluşturmak için harika bir zaman.
zh_cn: 您已经踏上开罗之旅的伟大开端了 。 这是一个构建一个更实质性的程式, 以适应阅读和写开罗代码的好时机 。

source: This chapter covers concepts that appear in almost every programming language and how they work in Cairo. Many programming languages have much in common at their core. None of the concepts presented in this chapter are unique to Cairo, but we’ll discuss them in the context of Cairo and explain the conventions around using these concepts.
es: Este capítulo abarca conceptos que aparecen en casi todos los lenguajes de programación y cómo funcionan en El Cairo. Muchos lenguajes de programación tienen mucho en común en su núcleo. Ninguno de los conceptos presentados en este capítulo son exclusivos de El Cairo, pero los discutiremos en el contexto de El Cairo y explicaremos las convenciones en torno a la utilización de estos conceptos.
fr: Ce chapitre couvre les concepts qui apparaissent dans presque tous les langages de programmation et comment ils fonctionnent au Caire. Beaucoup de langages de programmation ont beaucoup en commun à leur base. Aucun des concepts présentés dans ce chapitre sont uniques au Caire, mais nous allons les discuter dans le contexte du Caire et expliquer les conventions autour de l'utilisation de ces concepts.
id: Bab ini mencakup konsep-konsep yang muncul hampir di hampir setiap bahasa pemrograman dan bagaimana mereka bekerja di Kairo. banyak bahasa pemrograman memiliki banyak kesamaan pada inti mereka. tidak satupun konsep yang disajikan di bab ini unik untuk Kairo, tapi kita akan mendiskusikannya dalam konteks Kairo dan menjelaskan konvensi di sekitar menggunakan konsep-konsep ini.
tr: Bu bölüm, hemen hemen her programlama dilinde ortaya çıkan kavramları ve Kahire'de nasıl çalıştıklarını kapsar. Birçok programlama dilinin özünde çok fazla ortak nokta vardır. Bu bölümde sunulan kavramların hiçbiri Kahire'ye özgü değildir, ancak bunları Kahire bağlamında tartışacağız ve bu kavramları kullanarak etraftaki kongreleri açıklayacağız.
zh_cn: 本章涵盖了几乎每种编程语言中出现的概念及其在开罗的工作方式。 许多编程语言的核心有许多共同之处。 本章提出的任何概念都不是开罗所独有的,但我们将在开罗讨论这些概念,并解释使用这些概念的公约。

source: Specifically, you’ll learn about variables, basic types, functions, comments, and control flow. These foundations will be in every Cairo program, and learning them early will give you a strong core to start from.
es: Específicamente, aprenderás sobre variables, tipos básicos, funciones, comentarios y flujo de control. Estas fundaciones estarán en cada programa de El Cairo, y aprenderlas temprano te dará un núcleo fuerte para empezar.
fr: Plus précisément, vous apprendrez sur les variables, les types de base, les fonctions, les commentaires et le flux de contrôle. Ces fondations seront dans chaque programme du Caire, et les apprendre tôt vous donnera un noyau solide à partir de.
id: Secara khusus, Anda akan belajar tentang variabel, tipe dasar, fungsi, komentar, dan kontrol aliran. fondasi ini akan ada di setiap program Kairo, dan mempelajarinya lebih awal akan memberi Anda inti yang kuat untuk memulai dari.
tr: Özellikle, değişkenler, temel türleri, işlevleri, yorumları ve kontrol akışını öğreneceksiniz. Bu temeller her Kahire programında olacak ve bunları erken öğrenmek size başlamak için güçlü bir çekirdek verecektir.
zh_cn: 具体地说,你会了解变量、基本类型、功能、评论和控制流程。 这些基础将被纳入每个开罗方案,而早期的学习将为您提供从头开始的强大核心。

source: Cairo uses an immutable memory model, meaning that once a memory cell is written to, it can't be overwritten but only read from. To reflect this immutable memory model, variables in Cairo are immutable by default. However, the language abstracts this model and gives you the option to make your variables mutable. Let’s explore how and why Cairo enforces immutability, and how you can make your variables mutable.
es: El Cairo utiliza un modelo de memoria inmutable, lo que significa que una vez que se escribe una celda de memoria, no se puede sobrescribir, pero sólo leer de. Para reflejar este modelo de memoria inmutable, variables en El Cairo son inmutables por defecto. Sin embargo, el lenguaje abstrae este modelo y le da la opción de hacer sus variables mutables. Vamos a explorar cómo y por qué El Cairo impone la inmutabilidad, y cómo puede hacer que sus variables mutables.
fr: Le Caire utilise un modèle de mémoire immuable, ce qui signifie qu'une fois qu'une cellule de mémoire est écrite, elle ne peut pas être écrasée mais seulement lue. Pour refléter ce modèle de mémoire immuable, les variables au Caire sont immuables par défaut. Cependant, le langage abstractionne ce modèle et vous donne la possibilité de rendre vos variables mutables.
id: Kairo menggunakan model memori immutable, berarti bahwa sekali sebuah sel memori ditulis, itu tidak dapat ditimpa tetapi hanya dibaca dari. Untuk merefleksikan model memori immutable ini, variabel di Kairo tidak dapat berubah secara baku. Namun, bahasa abstrak model ini dan memberikan pilihan untuk membuat variabel Anda dapat bermutasi. Biarkan orang-orang mengeksplorasi bagaimana dan mengapa Kairo mengerahkan kemampuan abadi, dan bagaimana Anda dapat membuat variabel mustabel.
tr: Kahire değişmez bir bellek modeli kullanır, yani bir bellek hücresi yazıldığında, üzerine yazılamaz ama sadece okunur. Bu değişmez bellek modelini yansıtmak için, Kahire'deki değişkenler varsayılan olarak değiştirilemez. Bununla birlikte, dil bu modeli özetler ve değişkenlerinizi değiştirilebilir hale getirme seçeneği sunar. Kahire'nin değişmezliği nasıl ve neden uyguladığını ve değişkenlerinizi nasıl değiştirebileceğinizi araştıralım.
zh_cn: 开罗使用不可更改的内存模型,这意味着一旦内存单元格被写入,它就不能被覆盖,而只能从中读取。为了反映这种不可更改的内存模型,开罗的变量默认是不可变的。然而,语言摘要本模型给了您使变量变异的选项。让我们来探索开罗是如何和为什么强制执行不可变化的,以及如何使变量变异。

source: When a variable is immutable, once a value is bound to a name, you can’t change that value. To illustrate this, generate a new project called _variables_ in your _cairo_projects_ directory by using `scarb new variables`.
es: Cuando una variable es inmutable, una vez que un valor está vinculado a un nombre, no se puede cambiar ese valor. Para ilustrar esto, generar un nuevo proyecto llamado _variables_ en su directorio _cairo_projects_ mediante el uso de `scarb nuevas variables`.
fr: Quand une variable est immuable, une fois qu'une valeur est liée à un nom, vous ne pouvez pas changer cette valeur. Pour illustrer cela, générer un nouveau projet appelé _variables_ dans votre répertoire _cairo_projects_ en utilisant `scarb new variables`.
id: Ketika sebuah variabel tidak dapat diubah, sekali nilai terikat pada sebuah nama, anda tidak dapat mengubah nilai tersebut. Untuk mengilustrasikan ini, hasilkan sebuah proyek baru yang disebut _variables_ dalam direktori _cairo_projects_ anda dengan menggunakan variabel baru.
tr: Bir değişken değiştirilemez olduğunda, bir değer bir isme bağlandığında, bu değeri değiştiremezsiniz. Bunu örneklemek için, scarb yeni değişkenler kullanarak _cairo_projects_ dizininizde _variables_ adında yeni bir proje oluşturun.
zh_cn: 当变量不可变时, 一旦一个值与名称捆绑在一起, 您就不能更改该值 。 要说明这一点, 请在您的 _ cairo_ Projects_ 目录中, 使用“ scrab new 变量” 创建一个名为 _ variables_ 的新工程 。

source: Then, in your new _variables_ directory, open _src/lib.cairo_ and replace its code with the following code, which won’t compile just yet:
es: Luego, en su nuevo directorio _variables_, abra _src/lib.cairo_ y reemplace su código con el siguiente código, que no se compilará todavía:
fr: Ensuite, dans votre nouveau répertoire _variables_, ouvrez _src/lib.cairo_ et remplacez son code par le code suivant, qui n'a pas encore été compilé :
id: Kemudian, dalam direktori _variabel_ baru Anda, buka _src/lib.cairo_ dan ganti kodenya dengan kode berikut, yang belum mengkompilasinya:
tr: Ardından, yeni _variables_ dizininizde, _src/lib.cairo_ dosyasını açın ve kodunu henüz derlemeyecek olan aşağıdaki kodla değiştirin:
zh_cn: 然后,在您新的可变目录中,打开 _src/lib.cairo_,用以下代码取代代码,这些代码目前还无法编译:

source: <span class="filename">Filename: src/lib.cairo</span>
fr: <span class="filename">Nom du fichier: src/lib.cairo</span>
id: <nama berkas="pan"> Nama berkas: src/lib.cairo</span>
tr: span class="filename">Dosya adı: src/lib.cairo/span>
zh_cn: <span类="filename" >Filename: src/lib.cairo </span>

source: "The value of x is: {}"
es: "El valor de x es:
fr: "La valeur de x est: {}"
id: Nilai x adalah: {}"
tr: "x'in değeri: "
zh_cn: "x的值是:"

source: Save and run the program using `scarb cairo-run`. You should receive an error message regarding an immutability error, as shown in this output:
es: Guardar y ejecutar el programa usando `scarb cairo-run`. Usted debe recibir un mensaje de error con respecto a un error de inmutabilidad, como se muestra en esta salida:
fr: Enregistrer et exécuter le programme en utilisant `scarb cairo-run`. Vous devriez recevoir un message d'erreur concernant une erreur d'immutabilité, comme indiqué dans cette sortie:
id: Simpan dan jalankan program dengan menggunakan cairo-run. Anda harus menerima pesan kesalahan mengenai kesalahan immutability, seperti yang ditunjukkan pada keluaran ini:
tr: scarb cairo-run kullanarak programı kaydedin ve çalıştırın. Bu çıktıda gösterildiği gibi, bir değişmezlik hatasıyla ilgili bir hata mesajı almanız gerekir:
zh_cn: 使用“ scarb cairo- run” 保存并运行程序。 您应该收到关于不可改变错误的错误信息, 如此输出所示 :

source: This example shows how the compiler helps you find errors in your programs. Compiler errors can be frustrating, but they only mean your program isn’t safely doing what you want it to do yet; they do _not_ mean that you’re not a good programmer! Experienced Caironautes still get compiler errors.
es: Este ejemplo muestra cómo el compilador le ayuda a encontrar errores en sus programas. Los errores del compilador pueden ser frustrantes, pero sólo significan que su programa no está haciendo con seguridad lo que usted quiere que haga todavía; lo hacen _not_ significa que usted no es un buen programador!
fr: Cet exemple montre comment le compilateur vous aide à trouver des erreurs dans vos programmes. Les erreurs de compilateur peuvent être frustrantes, mais elles signifient seulement que votre programme n'est pas en toute sécurité faire ce que vous voulez qu'il fasse encore; elles font _not_ signifient que vous n'êtes pas un bon programmeur!
id: Contoh ini menunjukkan bagaimana kompiler membantu Anda menemukan kesalahan dalam program Anda. Kesalahan kompiler dapat membuat frustasi, tetapi hanya berarti program Anda tidak aman melakukan apa yang Anda inginkan; mereka melakukan _not_ berarti bahwa Anda bukan programmer yang baik! Kaironautes berpengalaman masih mendapatkan kesalahan kompiler.
tr: Bu örnek derleyicinin programlarınızdaki hataları bulmanıza nasıl yardımcı olduğunu gösterir. Derleyici hataları sinir bozucu olabilir, ancak yalnızca programınızın henüz istediğiniz şeyi güvenli bir şekilde yapmadığı anlamına gelir; _not_ iyi bir programcı olmadığınız anlamına gelir! Deneyimli Kahirenautes hala derleyici hataları alıyor.
zh_cn: 这个示例显示了编译器如何帮助您在您的编程中发现错误。 编译器的错误可能令人沮丧, 但这些错误只意味着您的编译器无法安全地完成您想要它做的事情; 它们确实不是意味着您不是一个好的编译器! 经验丰富的开罗会议仍然有编译器错误 。
