Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Ethereum, being the most widely used and resilient smart contract platform, became a victim of its own success. With the rapid adoption of some previously mentioned use cases, mainly DeFi, the cost of performing transactions became extremely high, rendering the network almost unusable. Engineers and researchers in the ecosystem began working on solutions to address this scalability issue.
es: Ethereum, siendo la plataforma de contratos inteligentes más utilizada y resistente, se convirtió en víctima de su propio éxito. Con la rápida adopción de algunos casos de uso mencionados anteriormente, principalmente DeFi, el costo de realizar transacciones se volvió extremadamente alto, haciendo que la red casi inutilizable. Ingenieros e investigadores en el ecosistema comenzaron a trabajar en soluciones para abordar este problema de escalabilidad.
fr: Ethereum, étant la plate-forme de contrat intelligente la plus utilisée et la plus résistante, est devenue victime de son propre succès. Avec l'adoption rapide de certains cas d'utilisation précédemment mentionnés, principalement DeFi, le coût de la réalisation des transactions est devenu extrêmement élevé, rendant le réseau presque inutilisable. Ingénieurs et chercheurs dans l'écosystème a commencé à travailler sur des solutions pour résoudre ce problème d'évolutivité.
id: Etherum, menjadi platform kontrak cerdas yang paling banyak digunakan dan tangguh, menjadi korban keberhasilannya sendiri. dengan adopsi cepat dari beberapa kasus sebelumnya yang disebutkan penggunaan, terutama DeFi, biaya untuk melakukan transaksi menjadi sangat tinggi, membuat jaringan hampir tidak dapat digunakan. Insinyur dan peneliti di ekosistem mulai bekerja pada solusi untuk mengatasi masalah skalabilitas ini.
tr: En yaygın kullanılan ve dayanıklı akıllı sözleşme platformu olan Ethereum, kendi başarısının kurbanı oldu. Daha önce sözü edilen bazı kullanım durumlarının, özellikle DeFi'nin hızlı bir şekilde benimsenmesiyle, işlemlerin yapılmasının maliyeti son derece yüksek hale geldi ve ağı neredeyse kullanılamaz hale getirdi. Ekosistemdeki mühendisler ve araştırmacılar, bu ölçeklenebilirlik sorununu çözmek için çözümler üzerinde çalışmaya başladılar.
zh_cn: Etheum是使用最广泛和最具弹性的智能合同平台,成为其自身成功的受害者。 随着上述一些使用案例(主要是DeFi)的迅速采纳,进行交易的成本变得极高,使得网络几乎无法使用。 生态系统的工程师和研究人员开始研究解决这一可扩缩性问题的办法。

source: A famous trilemma called The Blockchain Trilemma in the blockchain space states that it is hard to achieve a high level of scalability, decentralization, and security simultaneously; trade-offs must be made. Ethereum is at the intersection of decentralization and security. Eventually, it was decided that Ethereum's purpose would be to serve as a secure settlement layer, while complex computations would be offloaded to other networks built on top of Ethereum. These are called Layer 2s (L2s).
es: Un famoso trilema llamado The Blockchain Trilemma en el espacio blockchain afirma que es difícil lograr un alto nivel de escalabilidad, descentralización y seguridad simultáneamente; se deben hacer compensaciones. Ethereum está en la intersección de descentralización y seguridad. Eventualmente, se decidió que el propósito de Ethereum sería servir como una capa de asentamiento segura, mientras que los cálculos complejos se descargarían a otras redes construidas en la parte superior de Ethereum. Estos se llaman Capa 2s (L2s).
fr: Un célèbre trilemma appelé Le Trilemma Blockchain dans l'espace de la blockchain déclare qu'il est difficile d'atteindre un niveau élevé d'évolutivité, de décentralisation et de sécurité simultanément; des compromis doivent être faits. Ethereum est à l'intersection de la décentralisation et de la sécurité. Finalement, il a été décidé que le but d'Ethereum serait de servir de couche de règlement sécurisée, tandis que des calculs complexes seraient déchargés vers d'autres réseaux construits au sommet d'Ethereum.
id: Trilemma terkenal yang disebut The Blockchain Trilema di blok rantai ruang negara-negara yang sulit untuk mencapai tingkat skalabilitas tinggi, layakisasi, dan keamanan secara simultan; trade-offs harus dibuat. Etherum berada di persimpangan decentralization dan keamanan. pada akhirnya, diputuskan bahwa Etherum's tujuan akan melayani sebagai lapisan penyelesaian yang aman, sementara komputasi kompleks akan diturunkan ke jaringan lain dibangun di atas Etherum. ini disebut Layer 2s (2s).
tr: Blok zinciri alanındaki The Blockchain Trilemma adlı ünlü bir trilemma, yüksek düzeyde ölçeklenebilirlik, ademi merkeziyetçilik ve aynı anda güvenlik elde etmenin zor olduğunu belirtir; takaslar yapılmalıdır. Ethereum, ademi merkeziyetçilik ve güvenliğin kesiştiği noktadadır. Sonunda, Ethereum'un amacının güvenli bir yerleşim katmanı olarak hizmet etmek olacağına karar verildi, karmaşık hesaplamalar ise Ethereum'un üzerine inşa edilen diğer ağlara yüklenecekti.
zh_cn: 块链空间中名为“三环链”的著名三环称“三环链”称,很难同时实现高度的可扩展性、权力下放和安全;必须作出权衡。Etheum位于权力下放和安全的交汇处。最后,决定Etherem的目的将是充当一个安全的定居层,而复杂的计算将被卸载到Ethereum上方的其他网络上。这些被称为“第二层 ” ( L2 ) 。

source: The two primary types of L2s are optimistic rollups and validity rollups. Both approaches involve compressing and batching numerous transactions together, computing the new state, and settling the result on Ethereum (L1). The difference lies in the way the result is settled on L1. For optimistic rollups, the new state is considered valid by default, but there is a 7-day window for nodes to identify malicious transactions.
es: Los dos tipos primarios de L2s son rollos optimistas y rollos de validez. Ambos enfoques implican comprimir y por lotes numerosas transacciones juntas, computar el nuevo estado, y resolver el resultado en Ethereum (L1). La diferencia radica en la forma en que el resultado se establece en L1. Para los rollos optimistas, el nuevo estado se considera válido por defecto, pero hay una ventana de 7 días para nodos para identificar transacciones maliciosas.
fr: Les deux principaux types de L2 sont les rollups optimistes et les rollups de validité. Les deux approches impliquent la compression et le lotage de nombreuses transactions ensemble, le calcul du nouvel état, et le règlement du résultat sur Ethereum (L1). La différence réside dans la façon dont le résultat est réglé sur L1. Pour les rollups optimistes, le nouvel état est considéré comme valide par défaut, mais il y a une fenêtre de 7 jours pour les nœuds pour identifier les transactions malveillantes.
id: Kedua tipe utama dari L2 adalah rollups optimis dan validitas rollups. Keduanya melibatkan kompresi dan batching banyak transaksi bersama-sama, komputasi negara baru, dan menyelesaikan hasilnya pada Ethereum (L1). Perbedaannya terletak pada cara hasilnya diselesaikan pada L1. Untuk optimis rollups, negara baru dianggap valid secara baku, tetapi ada 7-hari jendela untuk nodes untuk mengidentifikasi transaksi jahat.
tr: İki ana L2 türü iyimser rollup ve geçerlilik rollup'larıdır. Her iki yaklaşım da çok sayıda işlemi birbirine sıkıştırmayı ve toplulaştırmayı, yeni durumu hesaplamayı ve sonucu Ethereum'a (L1) yerleştirmeyi içerir. Fark, sonucun L1'e yerleşme biçiminde yatmaktadır. İyimser rollup'lar için, yeni durum varsayılan olarak geçerli kabul edilir, ancak düğümlerin kötü niyetli işlemleri tanımlaması için 7 günlük bir pencere vardır.
zh_cn: 两种主要的L2类型是乐观的卷式和有效性卷式。 这两种方法都涉及压缩和分批大量交易,计算新状态,并解决Etheum(L1)的结果。 区别在于结果在L1上的解决方式。 对于乐观卷式来说,新状态在默认情况下是有效的,但节点有一个7天的窗口来识别恶意交易。

source: In contrast, validity rollups, such as Starknet, use cryptography to prove that the new state has been correctly computed. This is the purpose of STARKs, this cryptographic technology could permit validity rollups to scale significantly more than optimistic rollups. You can learn more about STARKs from Starkware's Medium [article](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a), which serves as a good primer.
es: Por el contrario, los rollups de validez, como Starknet, utilizan la criptografía para demostrar que el nuevo estado ha sido correctamente computado. Este es el propósito de STARKs, esta tecnología criptográfica podría permitir que los rollups de validez escalaran significativamente más que los rollups optimistas. Puede aprender más sobre STARKs de Starkware's Medium [article](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a), que sirve como una buena imprimación.
fr: En revanche, les rollups de validité, tels que Starknet, utilisent la cryptographie pour prouver que le nouvel état a été correctement calculé. C'est le but des STARKs, cette technologie cryptographique pourrait permettre les rollups de validité à l'échelle significativement plus que les rollups optimistes. Vous pouvez en apprendre plus sur STARKs de Starkware's Medium [article](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a), qui sert de bon amorce.
id: Sebagai kontras, validitas rollups, seperti Starknet, menggunakan kriptografi untuk membuktikan bahwa negara baru telah dihitung dengan benar. ini adalah tujuan dari STARKs, teknologi kriptografis ini dapat memungkinkan validitas untuk skala yang jauh lebih besar daripada rollups optimis. Anda dapat belajar lebih banyak tentang STARKs dari Starkware's Med [article]://dium.com/starkware/stark-starkex-starkex-starknet-a4266745a), yang berfungsi sebagai primar yang baik.
tr: Buna karşılık, Starknet gibi geçerlilik rollupları, yeni durumun doğru bir şekilde hesaplandığını kanıtlamak için kriptografiyi kullanır. Bu STARK'ların amacı budur, bu kriptografi teknolojisi, iyimser rollup'lardan önemli ölçüde daha fazla ölçeklendirmeye izin verebilir. STARK'lar hakkında daha fazla bilgi Starkware's Medium [article](https://medium.com/starkware/starks-stark-kex-ve-stark hizmet veren bir a7454-980
zh_cn: 相比之下,诸如斯塔克内特(Starknet)等有效性卷号则使用加密法来证明新状态的计算正确。 这是STARKs的目的, 这种加密技术可以让有效性卷号的规模大大超过乐观卷号。 您可以从Starkware的中型[文章](https://medic.com/starkware/starks-starkex-and-starknet-9a4260745a)中(https://medic.com/starkware/starkware/starks-starknet-starkex-and-starknet-9a4260745a)了解更多关于STARKs的信息。

source: Starknet's architecture is thoroughly described in the [Starknet Book](https://book.starknet.io/ch03-00-architecture.html), which is a great resource to learn more about the Starknet network.
es: La arquitectura de Starknet se describe a fondo en el [Libro Starknet] (https://book.starknet.io/ch03-00-architecture.html), que es un gran recurso para aprender más sobre la red Starknet.
fr: L'architecture de Starknet est décrite en détail dans le [Starknet Book] (https://book.starknet.io/ch03-00-architecture.html), qui est une excellente ressource pour en savoir plus sur le réseau Starknet.
id: Arsitektur Starknet dijelaskan secara menyeluruh dalam [Buku Starknet][Hehttps://book.starknet.io/ch03-00-architecture.html], yang merupakan sumber daya yang besar untuk mempelajari lebih banyak tentang jaringan Starknet.
tr: Starknet'in mimarisi, Starknet ağı hakkında daha fazla bilgi edinmek için harika bir kaynak olan [Starknet Book](https://book.starknet.io/ch03-00-architecture.html) 'de ayrıntılı olarak tanımlanmıştır.
zh_cn: Starknet的建筑在[Starknet book](https://book.starknet.io/ch03-00-architecture.html)中作了全面描述,这是进一步了解Starknet网络的伟大资源。

source: Remember Cairo? It is, in fact, a language developed specifically to work with STARKs and make them general-purpose. With Cairo, we can write **provable code**. In the context of Starknet, this allows proving the correctness of computations from one state to another.
es: ¿Recuerdas El Cairo? De hecho, es un lenguaje desarrollado específicamente para trabajar con STARKs y hacerlos de propósito general. Con El Cairo, podemos escribir **código demostrable**. En el contexto de Starknet, esto permite probar la corrección de los cálculos de un estado a otro.
fr: Souvenez-vous du Caire? C'est, en fait, un langage développé spécifiquement pour travailler avec les STARKs et les rendre d'usage général. Avec le Caire, nous pouvons écrire **prouvable code**. Dans le contexte de Starknet, cela permet de prouver la justesse des calculs d'un état à l'autre.
id: Ini adalah bahasa yang dikembangkan khusus untuk bekerja dengan STARKs dan membuatnya menjadi tujuan umum. dengan Kairo, kita dapat menulis kode yang dapat dibuktikan dalam konteks Starknet, ini memungkinkan bukti benarnya komputasi dari satu negara ke negara lain.
tr: Kahire'yi hatırlıyor musunuz? Aslında, STARK'larla çalışmak ve onları genel amaçlı hale getirmek için özel olarak geliştirilmiş bir dildir. Kahire ile ** uygulanabilir kod ** yazabiliriz. Starknet bağlamında, bu, hesaplamaların bir eyaletten diğerine doğruluğunu kanıtlamaya olanak tanır.
zh_cn: 记得开罗吗?事实上,它是专门为与STARKs合作而开发的一种语言,并使它们成为通用语言。在开罗,我们可以写出**可验证的代码**。在史塔克内特,这可以证明从一个州到另一个州的计算是否正确。

source: Unlike most (if not all) of Starknet's competitors that chose to use the EVM (either as-is or adapted) as a base layer, Starknet employs its own VM. This frees developers from the constraints of the EVM, opening up a broader range of possibilities. Coupled with decreased transaction costs, the combination of Starknet and Cairo creates an exciting playground for developers. Native account abstraction enables more complex logic for accounts, that we call "Smart Accounts", and transaction flows. Emerging use cases include **transparent AI** and machine learning applications. Finally, **blockchain games** can be developed entirely **on-chain**. Starknet has been specifically designed to maximize the capabilities of STARK proofs for optimal scalability.
es: A diferencia de la mayoría (si no todos) de los competidores de Starknet que optaron por utilizar la EVM (ya sea como está o adaptado) como una capa base, Starknet emplea su propia VM. Esto libera a los desarrolladores de las restricciones de la EVM, abriendo una gama más amplia de posibilidades. Junto con la disminución de los costos de transacción, la combinación de Starknet y El Cairo crea un parque infantil emocionante para los desarrolladores. La abstracción de cuentas nativas permite una lógica más compleja para las cuentas, que llamamos "cuentas inteligentes", y flujos de transacciones. Los casos de uso emergentes incluyen ** AI transparente** y aplicaciones de aprendizaje automático. Por último, ** juegos de blockchain** se pueden desarrollar completamente ** en cadena**. Starknet ha sido diseñado específicamente para maximizar las capacidades de las pruebas STARK para una escalabilidad óptima.
fr: Contrairement à la plupart des concurrents de Starknet qui ont choisi d'utiliser l'EMV (en tant que tel ou adapté) comme couche de base, Starknet utilise son propre VM. Cela libère les développeurs des contraintes de l'EMV, ouvrant une gamme plus large de possibilités. Associée à une diminution des coûts de transaction, la combinaison de Starknet et du Caire crée un terrain de jeu passionnant pour les développeurs. L'abstraction de compte natif permet une logique plus complexe pour les comptes, que nous appelons « comptes intelligents », et flux de transaction. Les cas d'utilisation émergents comprennent ** applications d'IA** transparentes et d'apprentissage automatique. Enfin, ** jeux de blockchain** peut être développé entièrement **sur-chaîne**. Starknet a été spécialement conçu pour maximiser les capacités des preuves STARK pour une évolutivité optimale.
id: Tidak seperti kebanyakan pesaing Starknet yang memilih untuk menggunakan EVM (misalnya atau beradaptasi) sebagai lapisan dasar, Starknet menggunakan VM sendiri. ini membebaskan para pengembang dari keterbatasan EVM, membuka berbagai kemungkinan yang lebih luas. ditambah dengan berkurangnya biaya transaksi, kombinasi Starknet dan Kairo menciptakan taman bermain yang menarik bagi pengembang.
tr: Starknet'in EVM'yi (ya as-is ya da uyarlanmış) bir temel katman olarak kullanmayı seçen rakiplerinin çoğundan farklı olarak, Starknet kendi VM'sini kullanır. Bu, geliştiricileri EVM'nin kısıtlamalarından kurtarır, daha geniş bir olasılık yelpazesi açar **. Azaltılmış işlem maliyetleri ile birleştiğinde, Starknet ve Kahire kombinasyonu geliştiriciler için heyecan verici bir oyun alanı oluşturur. Yerli hesap soyutlaması, "Akıllı" olarak adlandırdığımız hesaplar için daha karmaşık bir mantık sağlar.
zh_cn: Starknet的多数(如果不是全部的话)竞争对手选择使用EVM作为基础层, Starknet则雇用自己的VM。 Starknet 将开发商从EVM的限制中解脱出来,开辟了更广泛的可能性。 与交易成本的降低、 Starknet 和开罗的结合为开发者创造了一个令人兴奋的游乐场。 本地账户的抽取为账户提供了更复杂的逻辑, 我们称之为“ 智能账户 ”, 以及交易流。 新兴的使用案例包括** 透明AI** 和机器学习应用程序。 最后, ** 链式游戏** 可以完全开发** 连锁** 。 Starknet 专门设计的目的是最大限度地提高STARK 验证的最佳可扩展性。

source: Learn more about Account Abstraction in the [Starknet Book](https://book.starknet.io/ch04-00-account-abstraction.html).
es: Más información sobre Abstracción de cuentas en el [Libro Starknet](https://book.starknet.io/ch04-00-account-abstraction.html).
fr: En savoir plus sur l'abstraction de compte dans le [Livre Starknet](https://book.starknet.io/ch04-00-account-abstraction.html).
id: Pelajari lebih banyak tentang Akun Abstraction dalam [Buku Starknet].https://book.starknet.io/ch04-00-account-abstraction.html).
tr: [Starknet Book]'daki Hesap Özeti hakkında daha fazla bilgi edinin(https://book.starknet.io/ch04-00-account-abstraction.html).
zh_cn: 在[Starknet book] (https://book.starknet.io/ch04-00-ccount-abstraction.html)中了解更多关于账户摘要的更多信息。

source: Cairo Programs and Starknet Contracts: What Is the Difference?
es: El Cairo Programs y Starknet Contracts: ¿Cuál es la diferencia?
fr: Les programmes du Caire et les contrats Starknet : quelle est la différence?
id: Program Kairo dan Kontrak Starknet: Apa Perbedaannya?
tr: Kahire Programları ve Starknet Sözleşmeleri: Fark Nedir?
zh_cn: 开罗方案和斯塔克内特合同:有什么区别?

source: Starknet contracts are a special superset of Cairo programs, so the concepts previously learned in this book are still applicable to write Starknet contracts. As you may have already noticed, a Cairo program must always have a `main` function that serves as the entry point for this program:
es: Los contratos Starknet son un superconjunto especial de programas de El Cairo, por lo que los conceptos aprendidos anteriormente en este libro siguen siendo aplicables para escribir contratos Starknet. Como ya habrá notado, un programa de El Cairo debe tener siempre una función `principal` que sirve como punto de entrada para este programa:
fr: Les contrats Starknet sont un superset spécial des programmes du Caire, de sorte que les concepts précédemment appris dans ce livre sont toujours applicables pour écrire des contrats Starknet. Comme vous l'avez peut-être déjà remarqué, un programme du Caire doit toujours avoir une fonction `main` qui sert de point d'entrée pour ce programme:
id: Kontrak Starknet adalah superset khusus program Kairo, sehingga konsep yang sebelumnya dipelajari dalam buku ini masih berlaku untuk menulis kontrak Starknet.
tr: Starknet sözleşmeleri Kahire programlarının özel bir üst kümesidir, bu nedenle bu kitapta daha önce öğrenilen kavramlar Starknet sözleşmeleri yazmak için hala geçerlidir. Daha önce de fark etmiş olabileceğiniz gibi, bir Kahire programının her zaman bu programın giriş noktası olarak hizmet veren bir ana işlevi olmalıdır:
zh_cn: Starknet 合同是开罗方案的特殊超级集,因此本书中以前学到的概念仍然适用于写 Starknet 合同。 正如你可能已经注意到的,开罗方案必须始终有一个“主要”功能,作为这个方案的切入点:

source: Contracts deployed on the Starknet network are essentially programs that are run by the sequencer, and as such, have access to Starknet's state. Contracts do not have a `main` function but one or multiple functions that can serve as entry points.
es: Los contratos implementados en la red Starknet son esencialmente programas que son administrados por el secuenciador, y como tal, tienen acceso al estado de Starknet. Los contratos no tienen una función principal sino una o múltiples funciones que pueden servir como puntos de entrada.
fr: Les contrats déployés sur le réseau Starknet sont essentiellement des programmes qui sont gérés par le séquenceur, et à ce titre, ont accès à l'état de Starknet. Les contrats n'ont pas une fonction principale mais une ou plusieurs fonctions qui peuvent servir de points d'entrée.
id: Kontrak yang dikerahkan pada jaringan Starknet pada dasarnya adalah program yang dijalankan oleh pengurut, dan karena itu, memiliki akses ke negara Starknet. Kontrak tidak memiliki fungsi utama kecuali satu atau beberapa fungsi yang dapat berfungsi sebagai titik masuk.
tr: Starknet ağında konuşlandırılan sözleşmeler esasen sıralayıcı tarafından çalıştırılan programlardır ve bu nedenle Starknet'in durumuna erişebilirler. Sözleşmeler bir ana işlevine sahip değildir, ancak giriş noktaları olarak hizmet verebilecek bir veya birden fazla işleve sahiptir.
zh_cn: 在斯塔克内特网络上部署的合同基本上是由测序器操作的程序,因此可以进入斯塔克内特的状态,合同没有`主要'功能,而是可以作为切入点的一种或多种功能。

source: Starknet contracts are defined within [modules](./ch07-02-defining-modules-to-control-scope.md). For a module to be handled as a contract by the compiler, it must be annotated with the `#[starknet::contract]` attribute.
es: Los contratos Starknet se definen dentro de [módulos](./ch07-02-definir-módulos-a-control-scope.md). Para que un módulo sea manejado como un contrato por el compilador, debe ser anotado con el atributo [starknet::contract]`.
fr: Les contrats Starknet sont définis dans [modules](../ch07-02-defining-modules-to-control-scope.md). Pour qu'un module soit traité comme un contrat par le compilateur, il doit être annoté avec l'attribut `#[starknet::contract]`.
id: Kontrak Starknet didefinisikan dalam [modules][. /ch07-02-defining-modules-to-control-scope.md). Untuk sebuah modul yang akan ditangani sebagai kontrak oleh kompiler, ia harus dienotasi dengan atribut.#[starknet::contract].
tr: Starknet sözleşmeleri [modüller] içinde tanımlanır(./ch07-02-defining-modules-to-control-scope.md). Derleyici tarafından bir sözleşme olarak ele alınacak bir modül için #[starknet::contract] özniteliği ile not edilmelidir.
zh_cn: Starknet 合同在[模块](./ch07-02-定义模块-模块到控制范围.md)中界定。对于由汇编者作为合同处理的模块,必须附加“[星网:合同:合 ”属性的附加说明。

source: This chapter will introduce you to the basics of Starknet contracts using a very simple smart contract as example. You will learn how to write a contract that allows anyone to store a single number on the Starknet blockchain.
es: Este capítulo le presentará los conceptos básicos de los contratos Starknet usando un contrato inteligente muy simple como ejemplo. Aprenderá cómo escribir un contrato que permite a cualquier persona almacenar un solo número en la cadena de bloques Starknet.
fr: Ce chapitre vous présentera les bases des contrats Starknet en utilisant un contrat intelligent très simple comme exemple. Vous apprendrez à écrire un contrat qui permet à n'importe qui de stocker un seul numéro sur la blockchain Starknet.
id: Bab ini akan memperkenalkan anda kepada dasar-dasar kontrak Starknet menggunakan kontrak cerdas yang sangat sederhana sebagai contoh. anda akan belajar bagaimana menulis kontrak yang memungkinkan siapa pun untuk menyimpan satu nomor pada rantai blok Starknet.
tr: Bu bölüm, örnek olarak çok basit bir akıllı sözleşme kullanarak Starknet sözleşmelerinin temellerini tanıtacaktır. Starknet blok zincirinde herkesin tek bir numarayı saklamasına izin veren bir sözleşmenin nasıl yazılacağını öğreneceksiniz.
zh_cn: 本章将向您介绍斯塔克内特合同的基本内容, 使用非常简单的智能合同作为例子。 您将学习如何写入合同, 允许任何人在斯塔克内特区链上存储一个数字 。
