Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: To install Scarb, please refer to the [installation instructions](https://docs.swmansion.com/scarb/download). We strongly recommend that you install Scarb [via asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf), a CLI tool that can manage multiple language runtime versions on a per-project basis. This will ensure that the version of Scarb you use to work on a project always matches the one defined in the project settings, avoiding problems related to version mismatches.
es: Para instalar Scarb, consulte las instrucciones de instalación (https://docs.swmansion.com/scarb/download). Recomendamos encarecidamente que instale Scarb [via asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf), una herramienta CLI que puede gestionar versiones en múltiples idiomas en tiempo de ejecución por proyecto. Esto asegurará que la versión de Scarb que utilice para trabajar en un proyecto siempre coincida con la definida en la configuración del proyecto, evitando problemas relacionados con desajustes de versiones.
fr: Pour installer Scarb, veuillez vous référer aux [instructions d'installation](https://docs.swmansion.com/scarb/download). Nous vous recommandons fortement d'installer Scarb [via asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf), un outil CLI qui peut gérer plusieurs versions d'exécution de langue sur une base de projet. Cela permettra de s'assurer que la version de Scarb que vous utilisez pour travailler sur un projet correspond toujours à celle définie dans les paramètres du projet, en évitant les problèmes liés aux erreurs d'appariement de version.
id: Untuk memasang Scarb, silakan merujuk ke [installation instruksi][instalasi][installs.stps://docs.swmansion.com/scarb/download). Kami sangat merekomendasikan agar Anda memasang Scarb [via asdf] (via].https://docs.swmansion.com/scarb/download.hml#install-asdf), alat yang dapat mengelola berbagai versi bahasa pada dasar per-project. Ini akan memastikan bahwa versi Scarb yang Anda gunakan untuk mengerjakan sebuah proyek yang selalu cocok pada salah satu proyek yang ditentukan untuk menghindari versi yang terkait.
tr: Scarb'ı yüklemek için lütfen [yükleme talimatları](https://docs.swmansion.com/scarb/download) adresine bakın. Scarb'ı [via asdf] (https://docs.swmansion.com/scarb/download.html#install-via-asdf) yüklemenizi şiddetle tavsiye ederiz, bu, proje başına kullandığınız bir çalışma süresinde birden fazla dil çalışma zamanı sürümünü yönetebilecek bir CLI aracıdır.
zh_cn: 要安装疤痕,请参见[安装指示] (https://docs.swmansion.com/scarb/download)。我们强烈建议您安装疤痕[通过 asdf] (https://docs.swmansion.com/scarb/download.html#attall-via-asdf),这是一个CLI工具,可以按项目管理多种语文运行时间版本。这将确保您用于执行项目的刀疤版本始终与项目设置中定义的相同,避免版本错配问题。

source: Please refer to the [asdf documentation](https://asdf-vm.com/guide/getting-started.html) to install all prerequisites.
es: Consulte la documentación [asdf] (https://asdf-vm.com/guide/getting-started.html) para instalar todos los requisitos previos.
fr: Veuillez consulter la [document asdf](https://asdf-vm.com/guide/getting-started.html) pour installer toutes les conditions préalables.
id: Silakan merujuk ke [asdf dokumentasi][https://asdf-vm.com/guide/dimulai.html) untuk memasang semua prasyarat.
tr: Lütfen tüm önkoşulları yüklemek için [asdf documentation](https://asdf-vm.com/guide/getting-started.html) adresine bakınız.
zh_cn: 请参看[asdf documents] (https://asdf-vm.com/guide/getting-started.html),以安装所有先决条件。

source: Once you have asdf installed locally, you can download Scarb plugin with the following command:
es: Una vez que haya instalado asdf localmente, puede descargar el plugin Scarb con el siguiente comando:
fr: Une fois que vous avez asdf installé localement, vous pouvez télécharger le plugin Scarb avec la commande suivante:
id: Setelah Anda memasang asdf secara lokal, Anda dapat mengunduh plugin Scarb dengan perintah berikut:
tr: Asdf'yi yerel olarak yükledikten sonra, Scarb eklentisini aşağıdaki komutla indirebilirsiniz:
zh_cn: 您一旦在本地安装了 asdf, 就可以下载 Scarb 插件, 其命令如下 :

source: This will allow you to download specific versions:
es: Esto le permitirá descargar versiones específicas:
fr: Cela vous permettra de télécharger des versions spécifiques:
id: Hal ini akan memungkinkan Anda untuk mengunduh versi spesifik:
tr: Bu, belirli sürümleri indirmenize izin verecektir:
zh_cn: 这将允许您下载特定版本 :

source: and set a global version:
es: y establecer una versión global:
fr: et définir une version globale:
id: dan atur sebuah versi global:
tr: ve küresel bir sürüm ayarlayın:
zh_cn: 并设定一个全局版本 :

source: Otherwise, you can simply run the following command in your terminal, and follow the onscreen instructions. This will install the latest stable release of Scarb.
es: De lo contrario, simplemente puede ejecutar el siguiente comando en su terminal, y siga las instrucciones en pantalla. Esto instalará la última versión estable de Scarb.
fr: Sinon, vous pouvez simplement exécuter la commande suivante dans votre terminal, et suivre les instructions à l'écran. Cela installera la dernière version stable de Scarb.
id: Jika tidak, Anda dapat menjalankan perintah berikut di terminal Anda, dan mengikuti instruksi onscreen. Ini akan menginstal rilis Scarb terakhir yang stabil.
tr: Aksi takdirde, terminalinizde aşağıdaki komutu çalıştırabilir ve ekrandaki talimatları takip edebilirsiniz. Bu, Scarb'ın en son kararlı sürümünü kuracaktır.
zh_cn: 否则, 您可以在终端运行以下命令, 并遵循屏幕上的指令 。 这将安装最新的 Scarb 稳定释放 。

source: Installing the VSCode Extension
es: Instalación de la extensión VSCode
fr: Installation de l'extension VSCode
id: Memasang Ekstensi VSCode
tr: VSCode Uzantısını Kurmak
zh_cn: 安装 VSCode 扩展安装

source: Cairo has a VSCode extension that provides syntax highlighting, code completion, and other useful features. You can install it from the [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1). Once installed, go into the extension settings, and make sure to tick the `Enable Language Server` and `Enable Scarb` options.
es: El Cairo tiene una extensión VSOde que proporciona resaltado de sintaxis, terminación de código, y otras características útiles. Puede instalarlo desde [VSOde Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1). Una vez instalado, vaya a la configuración de la extensión y asegúrese de marcar las opciones `Enable Language Server` y `Enable Scarb`.
fr: Le Caire dispose d'une extension VSCode qui fournit la mise en surbrillance syntaxique, l'achèvement du code et d'autres fonctionnalités utiles. Vous pouvez l'installer à partir du [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1). Une fois installé, allez dans les paramètres d'extension, et assurez-vous de cocher les options `Enable Language Server` et `Enable Scarb`.
id: Kairo memiliki ekstensi VSCode yang menyediakan penandaan sintaks, pelengkapan kode, dan fitur berguna lainnya. Anda dapat memasangnya dari [VSCode Marketplace]bahttps://pplace.visualstudio.com/items?item?item=starkware.cairo1). Setelah dipasang, masuk ke pengaturan ekstensi, dan pastikan untuk mencentang Server Bahasa yang Dapat Di-enkrip dan pilihan Scarb.
tr: Kahire, sözdizimi vurgulama, kod tamamlama ve diğer yararlı özellikler sağlayan bir VSCode uzantısına sahiptir. [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) adresinden yükleyebilirsiniz. Kurulduktan sonra, uzantı ayarlarına gidin ve Enable Language Server ve Enable Scarb seçeneklerini işaretlediğinizden emin olun.
zh_cn: 开罗有一个 VSCode 扩展名, 提供语法突顯、 代码完成和其他有用的功能。 您可以从 [ VSCode 市场] (https:// smarkedplace. visualstudio.com/ items?itemName=starkware. cairo1) 安装它, 一旦安装后, 进入扩展设置, 并确保选中“ 可使用语言服务器” 和“ 可使用疤痕” 选项 。

source: {{#quiz ../quizzes/ch01-01-installation.toml}}
es: quiz../quizzes/ch01-01-instalación.toml
fr: {{#quiz../quizes/ch01-01-installation.toml}}
zh_cn: Quiz./quizzes/ch01-01-安放.toml

source: Hello, World
es: Hola, Mundo.
fr: Bonjour, Monde
id: Halo, Dunia
tr: Merhaba, Dünya
zh_cn: 你好,世界,你好

source: Now that you’ve installed Cairo through Scarb, it’s time to write your first Cairo program. It’s traditional when learning a new language to write a little program that prints the text `Hello, world!` to the screen, so we’ll do the same here!
es: Ahora que ha instalado El Cairo a través de Scarb, es hora de escribir su primer programa de El Cairo. Es tradicional cuando se aprende un nuevo idioma para escribir un pequeño programa que imprime el texto `Hola, mundo!` a la pantalla, así que vamos a hacer lo mismo aquí!
fr: Maintenant que vous avez installé Cairo à travers Scarb, il est temps d'écrire votre premier programme Cairo. C'est traditionnel quand vous apprenez une nouvelle langue pour écrire un petit programme qui imprime le texte `Bonjour, monde!` à l'écran, donc nous allons faire la même chose ici!
id: Sekarang Anda telah menginstal Kairo melalui Scarb, itu waktu untuk menulis program pertama Kairo Anda.
tr: Artık Kahire'yi Scarb üzerinden yüklediğinize göre, ilk Kahire programınızı yazmanın zamanı geldi. Merhaba, dünya! metnini ekrana yazdıran küçük bir program yazmak için yeni bir dil öğrenirken gelenekseldir, bu yüzden aynısını burada yapacağız!
zh_cn: 现在您已经通过刀疤安装了开罗,现在是时候写下您的第一个开罗程序了。 学习新语言写一个小程序,将文字印在屏幕上, “ 你好,世界!! ” 所以我们在这里也这样做!

source: Note: This book assumes basic familiarity with the command line. Cairo makes no specific demands about your editing or tooling or where your code lives, so if you prefer to use an integrated development environment (IDE) instead of the command line, feel free to use your favorite IDE. The Cairo team has developed a VSCode extension for the Cairo language that you can use to get the features from the language server and code highlighting. See [Appendix F](./appendix-06-useful-development-tools.md) for more details.
es: Nota: Este libro asume la familiaridad básica con la línea de comandos. El Cairo no hace ninguna exigencia específica sobre su edición o herramientas o dónde vive su código, por lo que si prefiere utilizar un entorno de desarrollo integrado (IDE) en lugar de la línea de comandos, no dude en utilizar su IDE favorito. El equipo de El Cairo ha desarrollado una extensión de VSOde para el idioma El Cairo que puede utilizar para obtener las características del servidor de idiomas y resaltado de código. Vea [Apéndice F](./apéndice-06-useful-development-tools.md) para más detalles.
fr: Note: Ce livre suppose une familiarité de base avec la ligne de commande. Le Caire ne fait pas de demandes spécifiques concernant votre édition ou outillage ou l'endroit où votre code vit, donc si vous préférez utiliser un environnement de développement intégré (IDE) au lieu de la ligne de commande, n'hésitez pas à utiliser votre IDE préféré. L'équipe du Caire a développé une extension VSCode pour la langue du Caire que vous pouvez utiliser pour obtenir les fonctionnalités du serveur de langue et de la mise en surbrillance du code. Voir [Annexe F](./appendice-06-useful-development-tools.md) pour plus de détails.
id: Catatan: Buku ini mengasumsikan dasar familiaritas dengan baris perintah. Kairo tidak membuat tuntutan spesifik tentang penyuntingan Anda atau tooling atau di mana kode hidup Anda, jadi jika Anda lebih memilih untuk menggunakan lingkungan pengembangan terpadu (IDE) daripada baris perintah, silakan gunakan IDE favorit Anda. Tim Kairo telah mengembangkan sebuah VSCode ekstensi untuk bahasa Kairo yang dapat Anda gunakan untuk mendapatkan fitur dari server bahasa dan penandaan kode. Lihat [Append F]./appix-useend-fuldevelpment-tool.m) untuk rincian lebih lanjut.
tr: Not: Bu kitap, komut satırı ile temel aşinalığı varsayar. Kahire, düzenlemeniz veya takım oluşturmanız veya kodunuzun nerede yaşadığı konusunda belirli bir talepte bulunmaz, bu nedenle komut satırı yerine entegre bir geliştirme ortamı (IDE) kullanmayı tercih ederseniz, en sevdiğiniz IDE'yi kullanmaktan çekinmeyin. Kahire ekibi, Kahire dili için, dil sunucusundan ve kod vurgulamadan yararlanabileceğiniz bir VSCode uzantısı geliştirdi. [Append-tool-end] (bkz.
zh_cn: 注意 : 本书假定您基本熟悉命令行 。 开罗没有对您的编辑或工具或代码使用地点提出具体要求, 所以如果您喜欢使用综合开发环境( IDE) 而不是命令行, 请随意使用您最喜欢的 IDE 。 开罗团队开发了开罗语言的 VSCode 扩展名, 您可以从语言服务器和代码突出显示中获取功能 。 详情请参见 [ 附录F] (./ ppendix- 06- useful Development- tools. md) 。

source: Creating a Project Directory
es: Crear un directorio de proyectos
fr: Création d'un répertoire de projets
id: Membuat Direktori Projek
tr: Proje Dizini Oluşturma
zh_cn: 创建工程目录

source: You’ll start by making a directory to store your Cairo code. It doesn’t matter to Cairo where your code lives, but for the exercises and projects in this book, we suggest making a _cairo_projects_ directory in your home directory and keeping all your projects there.
es: Usted comenzará por hacer un directorio para almacenar su código de El Cairo. No importa a El Cairo donde vive su código, pero para los ejercicios y proyectos en este libro, sugerimos hacer un directorio _cairo_projects_ en su directorio personal y mantener todos sus proyectos allí.
fr: Vous commencerez par créer un répertoire pour stocker votre code du Caire. Cela n'a pas d'importance pour le Caire où vit votre code, mais pour les exercices et les projets de ce livre, nous vous suggérons de créer un répertoire _cairo_projects_ dans votre répertoire personnel et de garder tous vos projets là-bas.
id: Anda akan mulai dengan membuat direktori untuk menyimpan kode Kairo Anda. tidak penting bagi Kairo di mana kode hidup Anda, tetapi untuk latihan dan proyek dalam buku ini, kami menyarankan untuk membuat direktori _cairo_projects_ di direktori rumah Anda dan menjaga semua proyek Anda di sana.
tr: Kahire kodunuzu saklamak için bir dizin yaparak işe başlarsınız. Kodunuzun nerede yaşadığı Kahire için önemli değil, ancak bu kitaptaki alıştırmalar ve projeler için, ev dizininize bir _cairo_projects_ dizini hazırlamanızı ve tüm projelerinizi orada tutmanızı öneririz.
zh_cn: 首先,您将制作一个存储您的开罗代码的目录。 开罗与您的代码生活在哪里无关,但对于这本书中的练习和项目,我们建议在您的主目录中制作一个 _cairo_projects_目录,并将您的所有项目保存在那里。

source: Open a terminal and enter the following commands to make a _cairo_projects_ directory.
es: Abra un terminal e introduzca los siguientes comandos para hacer un directorio _cairo_projects_.
fr: Ouvrez un terminal et entrez les commandes suivantes pour créer un répertoire _cairo_projects_.
id: Buka terminal dan masukkan perintah berikut untuk membuat direktori _cairo_projects_.
tr: Bir terminal açın ve _cairo_projects_ dizini yapmak için aşağıdaki komutları girin.
zh_cn: 打开一个终端并输入以下命令以创建 _cairo_project_ 目录 。

source: For Linux, macOS, and PowerShell on Windows, enter this:
es: Para Linux, macOS y PowerShell en Windows, introduzca lo siguiente:
fr: Pour Linux, macOS et PowerShell sous Windows, saisissez ceci :
id: Untuk Linux, macOS, dan PowerShell pada Windows, masukkan ini:
tr: Windows'ta Linux, macOS ve PowerShell için şunları girin:
zh_cn: Linux, macOS, 和Windows上的PowerShell, 请输入此信息 :

source: For Windows CMD, enter this:
es: Para Windows CMD, introduzca esto:
fr: Pour Windows CMD, saisissez ceci :
id: Untuk Windows CMD, masukkan ini:
tr: Windows CMD için şunları girin:
zh_cn: Windows CCMD 输入此选项:

source: "%USERPROFILE%\cairo_projects"
fr: "%USERPROFILE%\cairo_projets"
tr: "%USERPROFILE%cairo_projects" (İngilizce).
zh_cn: “% USERPROFILE cairo_ Projects” ( % USERPROFILE cairo_ Projects) ( % USERPROFILE cairo_ Projects) ( % USERPROFILE cairo_ projects) ( % USERPROFILE cairo_ projects) ” (% USERPERPROFILE cairo_ projects) ( %) (% USERPROFILE cairo_ projects) ( %) (% USERPROPILILE) (项目) (项目)

source: Note: From now on, for each example shown in the book, we assume that you will be working from a Scarb project directory. If you are not using Scarb, and try to run the examples from a different directory, you might need to adjust the commands accordingly or create a Scarb project.
es: Nota: A partir de ahora, para cada ejemplo que se muestra en el libro, suponemos que trabajará desde un directorio de proyecto Scarb. Si no está usando Scarb, e intenta ejecutar los ejemplos desde un directorio diferente, es posible que tenga que ajustar los comandos en consecuencia o crear un proyecto Scarb.
fr: Note: A partir de maintenant, pour chaque exemple montré dans le livre, nous supposons que vous travaillerez à partir d'un répertoire de projet Scarb. Si vous n'utilisez pas Scarb, et essayez d'exécuter les exemples à partir d'un répertoire différent, vous pourriez avoir besoin d'ajuster les commandes en conséquence ou de créer un projet Scarb.
id: Catatan: Mulai sekarang, untuk setiap contoh yang ditunjukkan dalam buku ini, kita berasumsi bahwa Anda akan bekerja dari direktori projek Scarb. Jika Anda tidak menggunakan Scarb, dan mencoba menjalankan contoh dari direktori yang berbeda, Anda mungkin perlu menyesuaikan perintah yang sesuai atau membuat proyek Scarb.
tr: Not: Bundan sonra, kitapta gösterilen her örnek için, bir Scarb proje dizininden çalışacağınızı varsayıyoruz. Scarb kullanmıyorsanız ve örnekleri farklı bir dizinden çalıştırmaya çalışıyorsanız, komutları buna göre ayarlamanız veya bir Scarb projesi oluşturmanız gerekebilir.
zh_cn: 注意 : 从现在开始, 对于书中显示的每个示例, 我们假设您将使用“ 疤痕” 项目目录。 如果您没有使用“ 疤痕” 项目目录, 并尝试从不同的目录运行示例, 您可能需要相应调整命令或创建“ 疤痕” 项目 。

source: Creating a Project with Scarb
es: Creación de un proyecto con cicatrices
fr: Création d'un projet avec Scarb
id: Membuat Projek dengan Scarb
tr: Scarb ile Proje Oluşturma
zh_cn: 创建带有刀疤的工程

source: Let’s create a new project using Scarb.
es: Vamos a crear un nuevo proyecto usando Scarb.
fr: Laissez-les créer un nouveau projet en utilisant Scarb.
id: Mari kita buat proyek baru menggunakan Scarb.
tr: Scarb kullanarak yeni bir proje oluşturalım.
zh_cn: 让我们用刀疤创建一个新项目。

source: Navigate to your _cairo_projects_ directory (or wherever you decided to store your code). Then run the following:
es: Navegue a su directorio _cairo_projects_ (o donde quiera que decida almacenar su código). Luego ejecute lo siguiente:
fr: Naviguez dans votre répertoire _cairo_projects_ (ou partout où vous avez décidé de stocker votre code).
id: Navigasi ke direktori _cairo_projects_ Anda (atau di mana pun Anda memutuskan untuk menyimpan kode Anda). Lalu jalankan berikut:
tr: _cairo_projects_ dizinine (veya kodunuzu saklamaya karar verdiğiniz yere) gidin. Ardından aşağıdakileri çalıştırın:
zh_cn: 导航到您的 _cairo_ projects_ 目录 (或决定存储代码的地址) 。 然后运行以下操作 :

source: It creates a new directory and project called _hello_world_. We’ve named our project _hello_world_, and Scarb creates its files in a directory of the same name.
es: Crea un nuevo directorio y proyecto llamado _hello_world_. Hemos nombrado nuestro proyecto _hello_world_, y Scarb crea sus archivos en un directorio del mismo nombre.
fr: Il crée un nouveau répertoire et projet appelé _hello_world_. Nous avons nommé notre projet _hello_world_, et Scarb crée ses fichiers dans un répertoire du même nom.
id: Ini menciptakan direktori dan proyek baru yang disebut _hello_world_.
tr: _hello_world_ adlı yeni bir dizin ve proje oluşturur. Projemize _hello_world_ adını verdik ve Scarb dosyalarını aynı isimli bir dizinde oluşturuyor.
zh_cn: 它创建了一个新的目录和工程,名为_Hello_world_。我们命名了我们的工程_Hello_world_,Scarb在同一个名称的目录中创建了自己的文件。

source: Go into the _hello_world_ directory with the command `cd hello_world`. You’ll see that Scarb has generated two files and one directory for us: a _Scarb.toml_ file and a _src_ directory with a _lib.cairo_ file inside.
es: Entra en el directorio _hello_world_ con el comando `cd hello_world`. Verás que Scarb ha generado dos archivos y un directorio para nosotros: un archivo _Scarb.toml_ y un directorio _src_ con un archivo _lib.cairo_ dentro.
fr: Allez dans le répertoire _hello_world_ avec la commande `cd hello_world`. Vous verrez que Scarb a généré deux fichiers et un répertoire pour nous: un fichier _scarb.toml_ et un répertoire _src_ avec un fichier _lib.cairo_ à l'intérieur.
id: Pergi ke direktori _hello_world_ dengan perintah thosecd hello_world. Anda akan melihat bahwa Scarb telah menghasilkan dua berkas dan satu direktori untuk kita: berkas _Scarb.toml_ dan direktori _src_ dengan _lib.cairo_ di dalamnya.
tr: cd alo_world komutuyla _hello_world_ dizinine gidin. Scarb'ın bizim için iki dosya ve bir dizin oluşturduğunu göreceksiniz: bir _Scarb.toml_ dosyası ve içinde _lib.cairo_ dosyası bulunan bir _src_ dizini.
zh_cn: 进入“ cd hello_world” 命令的 _hello_world_目录。你会看到,疤痕为我们生成了两个文件和一个目录:一个 _Scarb.toml_文件,以及一个包含 _lib.cairo_文件的 _src_目录。

source: It has also initialized a new Git repository along with a `.gitignore` file
es: También ha inicializado un nuevo repositorio Git junto con un archivo `.gitignore`
fr: Il a également initialisé un nouveau dépôt Git avec un fichier `.gitignore`
id: Ini juga telah diinisialisasi sebuah repositori Git baru bersama dengan sebuah berkas.gitignore)
tr: Ayrıca.gitignore dosyasıyla birlikte yeni Git deposunu başlatmıştır.
zh_cn: 它还启动了一个新的 Git 仓库,以及一个`.gitignore'文件。

source: Note: Git is a common version control system. You can stop using version control system by using the `--no-vcs` flag. Run `scarb new --help` to see the available options.
es: Nota: Git es un sistema de control de versiones común. Puede dejar de usar el sistema de control de versiones utilizando el indicador `--no-vcs`. Ejecute `scarb new --help` para ver las opciones disponibles.
fr: Remarque : Git est un système de contrôle de version commun. Vous pouvez arrêter d'utiliser le système de contrôle de version en utilisant le drapeau `--no-vcs`. Exécutez `scarb new --help` pour voir les options disponibles.
id: Catatan: Git adalah sistem kendali versi yang umum. Anda dapat berhenti menggunakan sistem kendali versi dengan menggunakan bendera --no-vcsé. Jalankan --helpán untuk melihat pilihan yang tersedia.
tr: Not: Git yaygın bir sürüm kontrol sistemidir. --no-vcs bayrağını kullanarak sürüm kontrol sistemini kullanmayı bırakabilirsiniz. Mevcut seçenekleri görmek için scarb new --help uygulamasını çalıştırın.
zh_cn: 注: Git 是一个通用的版本控制系统。 您可以使用 ` - no- vcs' 旗帜停止使用版本控制系统。 运行'scarb new - help'以查看可用的选项 。

source: Open _Scarb.toml_ in your text editor of choice. It should look similar to the code in Listing 1-1.
es: Abrir _Scarb.toml_ en el editor de texto de su elección. Debe parecer similar al código en Listado 1-1.
fr: Ouvrez _scarb.toml_ dans l'éditeur de texte de votre choix. Il devrait ressembler au code dans Listing 1-1.
id: Buka _Scarb.toml_ dalam pilihan penyunting teks Anda. Ini akan terlihat mirip dengan kode dalam Daftar 1-1.
tr: Tercih ettiğiniz metin editöründe _Scarb.toml_ açın. Listeleme 1-1'deki koda benzer görünmelidir.
zh_cn: 在您选择的文本编辑器中打开 _Scarb.toml_。 它应该与列表 1-1 中的代码相似 。

source: <span class="filename">Filename: Scarb.toml</span>
fr: <span class="filename">Nom du fichier: Scarb.toml</span>
id: <nama berkas="pan"> Nama berkas: Scarb.toml</span>
zh_cn: <span类="filename" >Filename: Scarb.toml </span>
