Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Items in a parent module can’t use the private items inside child modules, but items in child modules can use the items in their ancestor modules. This is because child modules wrap and hide their implementation details, but the child modules can see the context in which they’re defined. To continue with our metaphor, think of the privacy rules as being like the back office of a restaurant: what goes on in there is private to restaurant customers, but office managers can see and do everything in the restaurant they operate.
es: Los elementos de un módulo padre no pueden usar los elementos privados dentro de los módulos hijo, pero los elementos de los módulos hijo pueden usar los elementos de sus módulos ancestros. Esto se debe a que los módulos hijo envuelven y ocultan sus detalles de implementación, pero los módulos hijo pueden ver el contexto en el que están definidos. Para continuar con nuestra metáfora, piense en las reglas de privacidad como si fueran como la oficina de atrás de un restaurante: lo que pasa allí es privado para los clientes del restaurante, pero los gerentes de oficina pueden ver y hacer todo en el restaurante que operan.
fr: Les éléments d'un module parent ne peuvent pas utiliser les éléments privés à l'intérieur des modules enfants, mais les éléments des modules enfants peuvent utiliser les éléments de leurs modules ancêtres. C'est parce que les modules enfants enveloppent et cachent leurs détails d'implémentation, mais les modules enfants peuvent voir le contexte dans lequel ils sont définis. Pour continuer avec notre métaphore, pensez aux règles de confidentialité comme étant le back office d'un restaurant : ce qui se passe là-bas est privé pour les clients du restaurant, mais les gestionnaires de bureau peuvent voir et faire tout ce qui se passe dans le restaurant qu'ils exploitent.
id: Item dalam modul induk dapat menggunakan barang-barang pribadi di dalam modul anak, tetapi item dalam modul anak dapat menggunakan item dalam modul nenek moyang mereka. Ini karena modul anak membungkus dan menyembunyikan rincian implementasi mereka, tapi modul anak dapat melihat konteks di mana mereka didefinisikan. Untuk melanjutkan metafora kita, pikirkan aturan privasi seperti kantor belakang restoran: apa yang terjadi di sana adalah pribadi bagi pelanggan restoran, tetapi manajer kantor dapat melihat dan melakukan segala sesuatu di restoran yang mereka kerjakan.
tr: Bir ana modüldeki öğeler, çocuk modüllerindeki özel öğeleri kullanamaz, ancak çocuk modüllerindeki öğeler öğeleri ata modüllerinde kullanabilir. Bunun nedeni, çocuk modüllerinin uygulama ayrıntılarını sarması ve gizlemesidir, ancak çocuk modülleri tanımlandığı bağlamı görebilir. Metaforumuza devam etmek için gizlilik kurallarını bir restoranın arka ofisi gibi düşünün: Orada olup bitenler restoran müşterilerine özeldir, ancak ofis yöneticileri her şeyi görebilir ve restoranda her şeyi yapabilir.
zh_cn: 家长模块中的项目不能使用儿童模块中的私人项目,但儿童模块中的项目可以使用其祖先模块中的私人项目。 这是因为儿童模块包扎并隐藏其实施细节,但儿童模块可以看到它们被定义的背景。 继续我们的比喻,将隐私规则想象成餐馆的后台:那里是私人餐厅,但办公室经理可以看到和做他们经营的餐馆的一切。

source: Cairo chose to have the module system function this way so that hiding inner implementation details is the default. That way, you know which parts of the inner code you can change without breaking outer code. However, Cairo does give you the option to expose inner parts of child modules’ code to outer ancestor modules by using the `pub` keyword to make an item public.
es: El Cairo optó por tener la función del sistema de módulos de esta manera para que ocultar los detalles de la implementación interna sea el predeterminado. De esa manera, usted sabe qué partes del código interno puede cambiar sin romper el código externo. Sin embargo, El Cairo le da la opción de exponer las partes internas del código de módulos hijos a los módulos antepasados externos mediante el uso de la palabra clave `pub` para hacer un artículo público.
fr: Le Caire a choisi de faire fonctionner le système de module de cette façon afin que les détails de l'implémentation interne soient cachés par défaut. De cette façon, vous savez quelles parties du code intérieur vous pouvez changer sans casser le code extérieur. Cependant, Le Caire vous donne la possibilité d'exposer les parties intérieures des modules enfants de code aux modules de l'ancêtre externe en utilisant le mot-clé `pub` pour rendre un article public.
id: Kairo memilih untuk memiliki fungsi sistem modul dengan cara ini sehingga menyembunyikan rincian implementasi batin adalah hal yang baku. Dengan cara itu, Anda tahu bagian mana dari kode dalam yang dapat Anda ubah tanpa melanggar kode luar. Namun, Kairo memberikan pilihan untuk mengekspos bagian dalam modul anak.
tr: Kahire, modül sisteminin bu şekilde çalışmasını seçti, böylece iç uygulama ayrıntılarını gizlemek varsayılandır. Bu şekilde, dış kodu kırmadan iç kodun hangi bölümlerini değiştirebileceğinizi bilirsiniz. Bununla birlikte, Kahire, bir öğeyi kamuya açık hale getirmek için pub anahtar kelimesini kullanarak çocuk modüllerinin kodunun iç kısımlarını dış ata modüllerine maruz bırakma seçeneği sunar.
zh_cn: 开罗选择了模块系统以这种方式运行, 以便隐藏内部执行细节是默认的。 这样, 您就可以知道内部代码的哪些部分可以在不破解外码的情况下更改。 但是, 开罗确实允许您使用“ pub” 关键字将儿童模块代码的内部部分暴露在外祖先模块中, 从而将项目公之于众 。

source: Exposing Paths with the `pub` Keyword
es: Exponer caminos con la palabra clave `pub`
fr: Exposer les chemins avec le mot-clé `pub`
id: Alamat Eksposing dengan Kata Kunci åpub)
tr: pub Anahtar Kelime ile Patikaları Açığa Çıkarma
zh_cn: 用`pub' 关键字揭开路径

source: Let’s return to the previous error that told us the `hosting` module and the `add_to_waitlist` function are not visible. We want the `eat_at_restaurant` function in the parent module to have access to the `add_to_waitlist` function in the child module, so we mark the `hosting` module with the `pub` keyword, as shown in Listing 7-4.
es: Volvamos al error anterior que nos dijo que el módulo `hosting` y la función `add_to_waitlist` no son visibles. Queremos que la función `eat_at_restaurant` en el módulo padre tenga acceso a la función `add_to_waitlist` en el módulo hijo, por lo que marcamos el módulo `hosting` con la palabra clave `pub`, como se muestra en el listado 7-4.
fr: Revenez à l'erreur précédente qui nous a dit que le module `hosting` et la fonction `add_to_waitlist` ne sont pas visibles. Nous voulons que la fonction `eat_at_restaurant` dans le module parent ait accès à la fonction `add_to_waitlist` dans le module enfant, de sorte que nous marquions le module `hosting` avec le mot-clé `pub`, comme indiqué dans Listing 7-4.
id: Mari kita kembali ke kesalahan sebelumnya yang mengatakan kepada kita bahwa modul tersebut dan modul ·add_to_waitlist tidak terlihat.
tr: hosting modülü ve add_to_waitlist fonksiyonunu bize söyleyen önceki hataya geri dönelim. Ana modüldeki eat_at_restaurant fonksiyonunun çocuk modülündeki add_to_waitlist işlevine erişmesini istiyoruz, bu nedenle hosting modülünü Liste 7-4'te gösterildiği gibi pub anahtar kelimesi ile işaretliyoruz.
zh_cn: 让我们回到之前告诉我们的`托管'模块和`add_to_waitlist'功能不可见的错误,我们希望父模块中的`eat_at_restaurant'功能能够进入儿童模块中的`add_to_waitlist'功能,因此我们将“托管”模块标为`pub'关键字,如7-4列表所示。

source: <span class="caption">Listing 7-4: Declaring the `hosting` module as `pub` to use it from `eat_at_restaurant`</span>
es: <span class="caption">Lista 7-4: Declarando el módulo `hosting` como `pub` para usarlo desde `eat_at_restaurant/span>
fr: <span class="caption">Liste 7-4: Déclaration du module `hosting` comme `pub` pour l'utiliser à partir de `eat_at_restaurant`</span>
id: <kelas lebar="caption">Listing 7-4: Menyatakan modul </span>
tr: span class="caption">Liste 7-4: eat_at_restaurant/span> 'den kullanmak için hosting modülünü pub olarak ilan etmek
zh_cn: <span类=“Caption” > listing 7-4: 宣布`托管'模块为`pub',以便从`eat_at_restaurand__restaurant_/span>使用该模块

source: Unfortunately, the code in Listing 7-4 still results in an error.
es: Desafortunadamente, el código en Listado 7-4 todavía resulta en un error.
fr: Malheureusement, le code dans Listing 7-4 entraîne toujours une erreur.
id: Sayangnya, kode dalam Daftar 7-4 masih menghasilkan kesalahan.
tr: Ne yazık ki, Listeleme 7-4'teki kod hala bir hata ile sonuçlanır.
zh_cn: 不幸的是,7-4清单中的代码仍然出错。

source: What happened? Adding the `pub` keyword in front of `mod hosting;` makes the module public. With this change, if we can access `front_of_house`, we can access `hosting`. But the contents of `hosting` are still private; making the module public doesn’t make its contents public. The `pub` keyword on a module only lets code in its ancestor modules refer to it, not access its inner code. Because modules are containers, there’s not much we can do by only making the module public; we need to go further and choose to make one or more of the items within the module public as well.
es: ¿Qué pasó? Añadiendo la palabra clave `pub` delante de `mod hosting;` hace público el módulo. Con este cambio, si podemos acceder a `front_of_house`, podemos acceder a `hosting`. Pero el contenido de `hosting` sigue siendo privado; hacer público el módulo no hace público su contenido. La palabra clave `pub` en un módulo sólo permite que el código en sus módulos anteriores se refiera a él, no que acceda a su código interno. Debido a que los módulos son contenedores, no podemos hacer mucho solo haciendo público el módulo; tenemos que ir más allá y elegir también hacer públicos uno o más de los elementos dentro del módulo.
fr: Avec ce changement, si nous pouvons accéder à `front_of_house`, nous pouvons accéder à `hosting`. Mais le contenu de `hosting` sont toujours privés; rendre le module public ne rend pas son contenu public. Le mot-clé `pub` sur un module permet seulement le code dans ses modules d'ancêtres, ne pas accéder à son code intérieur. Parce que les modules sont des conteneurs, il n'y a pas grand chose que nous pouvons faire en rendant le module public; nous devons aller plus loin et choisir de rendre un ou plusieurs des éléments dans le module public aussi.
id: Apa yang terjadi? Menambahkan kata kunci di depan hosting ·mod; membuat modul publik. dengan perubahan ini, jika kita dapat mengaksesnya di depan_house, kita dapat mengakses modul leluhurnya, namun isi dari entertainer ·hostingà masih pribadi; membuat modul publik tidak membuat isi publik publik. Kata kunci pada modul hanya memungkinkan kode dalam modul nenek moyang yang mengacu, tidak mengakses kode batinnya. karena modul-modulnya, tidak banyak yang dapat kita lakukan dengan modul publik; kita perlu untuk membuat modul lebih lanjut; kita memilih satu modul atau lebih banyak modul publik yang ada di dalamnya.
tr: Ne oldu? pub anahtar kelimesini mod hosting; modülü kamuya açık hale getirir. Bu değişiklikle front_of_house'a erişebilirsek hosting'e erişebiliriz. Ancak hosting'nin içeriği hala özeldir; modülün kamuya açık hale getirilmesi yalnızca içeriğini kamuya açık hale getirmez. Bir modüldeki pub anahtar kelimesi, yalnızca ata modüllerindeki kodun kendisine hitap etmesine izin vermediğinden dolayı, iç koduna erişemez.
zh_cn: 发生什么了? 在“模式主机”前添加“pub”关键字; ` 将模块公之于众; 使模块公之于众。 有了这一变化,如果我们能够访问“ 前门', 我们就可以访问“ 托管” 。 但是“ 托管” 的内容仍然是私有的; 让模块公之于众并不公布其内容。 模块上的“ pub” 关键字只允许其祖先模块中的代码指向它, 而不是访问其内部代码。 由于模块是容器, 仅仅将模块公之于众, 我们无法做多少事; 我们需要更进一步, 并选择在模块中将一个或多个项目公之于众。

source: Let’s also make the `add_to_waitlist` function public by adding the `pub` keyword before its definition, as in Listing 7-5.
es: También hagamos pública la función `add_to_waitlist` añadiendo la palabra clave `pub` antes de su definición, como en la lista 7-5.
fr: Les lecteurs rendent également publique la fonction `add_to_waitlist` en ajoutant le mot-clé `pub` avant sa définition, comme dans Listing 7-5.
id: Mari juga membuat daftar fungsi publik dengan menambahkan kata kunci sebelum definisinya, seperti dalam Listing 7-5.
tr: Ayrıca add_to_waitlist fonksiyonunu, Listeleme 7-5'te olduğu gibi, tanımından önce pub anahtar kelimesini ekleyerek halka açık hale getirelim.
zh_cn: 让我们也公布“add_to_waitlist”功能,

source: // ✅ Compiles
es: // • Compilaciones
fr: // -Compilés
id: //compils
tr: // Derlemeler
zh_cn: 汇编

source: <span class="caption">Listing 7-5: Declaring the `hosting` module as `pub` to use it from `eat_at_restaurant`</span>
es: <span class="caption">Lista 7-5: Declarando el módulo `hosting` como `pub` para usarlo desde `eat_at_restaurant/span>
fr: <span class="caption">Liste 7-5: Déclaration du module `hosting` comme `pub` pour l'utiliser à partir de `eat_at_restaurant`</span>
id: <span class="caption">Listing 7-5: Menyatakan modul </span>
tr: span class="caption">Liste 7-5: eat_at_restaurant/span> 'den kullanmak için hosting modülünü pub olarak ilan etmek
zh_cn: <span类=“Caption” > listing 7-5: 宣布`托管'模块为`pub',以便从`eat_at_restaurand__restaurant_/span>使用该模块

source: Now the code will compile! To see why adding the `pub` keyword lets us use these paths in `add_to_waitlist` with respect to the privacy rules, let’s look at the absolute and the relative paths.
es: Ahora el código se compilará! Para ver por qué la adición de la palabra clave `pub` nos permite utilizar estas rutas en `add_to_waitlist` con respecto a las reglas de privacidad, vamos a mirar el absoluto y las rutas relativas.
fr: Maintenant le code va compiler! Pour voir pourquoi ajouter le mot-clé `pub` nous permet d'utiliser ces chemins dans `add_to_waitlist` en ce qui concerne les règles de confidentialité, let=s regardez les chemins absolus et relatifs.
id: Sekarang kode akan dikompilasi! Untuk melihat mengapa menambahkan kata kunci ·pubé memungkinkan kita menggunakan jalur ini dalam ·add_to_waitlist; terhadap aturan privasi, mari kita lihat pada absolut dan jalur relatif.
tr: Şimdi kod derlenecek! pub anahtar kelimesini eklemenin neden bu yolları gizlilik kurallarına göre add_to_waitlist içinde kullanmamızı sağladığını görmek için, mutlak ve göreceli yollara bakalım.
zh_cn: 现在代码将编译! 要了解为什么添加“ pub' 关键字”, 让我们在“ add_to_ waitlist” 中用这些路径来表达隐私规则, 让我们看看绝对路径和相对路径 。

source: In the absolute path, we start with the crate root, the root of our crate’s module tree. The `front_of_house` module is defined in the crate root. While `front_of_house` isn’t public, because the `eat_at_restaurant` function is defined in the same module as `front_of_house` (that is, `front_of_house` and `eat_at_restaurant` are siblings), we can refer to `front_of_house` from `eat_at_restaurant`. Next is the `hosting` module marked with `pub`. We can access the parent module of `hosting`, so we can access `hosting` itself. Finally, the `add_to_waitlist` function is marked with `pub` and we can access its parent module, so this function call works!
es: En la ruta absoluta, comenzamos con la raíz de la caja, raíz del árbol de módulos de nuestra caja. El módulo `front_of_house` se define en la raíz de la caja. Si bien `front_of_house` no es público, porque la función `eat_at_restaurant` se define en el mismo módulo que `front_of_house` (es decir, `front_of_house` y `eat_at_restaurant` son hermanos), podemos referirnos a `front_of_house` de `eat_at_restaurant`. A continuación se indica el módulo `hosting` marcado con `pub`. Podemos acceder al módulo padre de `hosting`, de modo que podemos acceder a `hosting` en sí mismo.
fr: Le module `front_of_house` est défini dans la racine de la caisse. Alors que `front_of_house` n`est pas public, parce que la fonction `eat_at_restaurant` est définie dans le même module que `front_of_house` (c`est-à-dire `front_of_house` et `eat_at_restaurant` sont des frères et sœurs), nous pouvons nous référer à `front_of_house` de `eat_at_restaurant`. Ensuite est le module `hosting` marqué avec `pub`. Nous pouvons accéder au module parent de `hosting`, afin que nous puissions accéder à `hosting` lui-même. Enfin, la fonction `add_to_waitlist` est marquée avec `pub` et nous pouvons accéder à son module parent, de sorte que cet appel de fonction fonctionne!
id: Di jalan absolut, kita mulai dengan akar peti, akar dari pohon modul peti kita. Modul depan_of_house didefinisikan dalam akar peti. Sementara difront_house_of_house tidak bersifat umum, karena fungsi petit_at_returant_productía didefinisikan dalam modul yang sama dengan modul selanjutnya (yang ditandai dengan modul Á_of_house. dan Á_part_reaten_reatent_storiant turis), kita dapat mereferensikan ke depan_of_parte_oat_s_storeat_rest_s.
tr: Mutlak yolda, sandık ağacımızın kökü olan sandık köküyle başlıyoruz. Bu front_of_house modülü sandık kökünde tanımlanmaktadır. front_of_house modülü halka açık değilken, eat_at_restaurant işlevi front_of_house ile aynı modülde tanımlanmaktadır.
zh_cn: 在绝对路径中,我们先从板箱根开始,即我们的板箱模块树的根根开始,在板箱根中定义了`front_of_house' 模块。虽然`front_of_house'模块并不公开,因为`eat_at_restaurant'功能在模块中被定义为`front_of_house'(即`front_house'和`eat_at_restaurant'是兄弟姐妹),我们可以从`eat_at_restaurant'中提及`for_house'前方`house'模块。下一个是`东道方'模块,标记为`pub'。我们可以访问`东道方'的母模块,因此我们可以访问`东道方'本身。最后,`ad_to_waitlist'函数以`pub'标有`add_to_wait'功能,我们可以访问其母模块,因此此功能调用!

source: In the relative path, the logic is the same as the absolute path except for the first step: rather than starting from the crate root, the path starts from `front_of_house`. The `front_of_house` module is defined within the same module as `eat_at_restaurant`, so the relative path starting from the module in which `eat_at_restaurant` is defined works. Then, because `hosting` and `add_to_waitlist` are marked with `pub`, the rest of the path works, and this function call is valid!
es: En la ruta relativa, la lógica es la misma que la ruta absoluta excepto en el primer paso: en lugar de partir de la raíz de caja, la ruta comienza desde `front_of_house`. El módulo `front_of_house` se define dentro del mismo módulo que `eat_at_restaurant`, por lo que la ruta relativa que comienza desde el módulo en el que se define `eat_at_restaurant` funciona. Entonces, porque `hosting` y `add_to_waitlist` están marcados con `pub`, el resto de la ruta funciona, y esta llamada a la función es válida.
fr: Dans le chemin relatif, la logique est la même que le chemin absolu sauf pour la première étape: plutôt que de partir de la racine de caisse, le chemin commence par `front_of_house`. Le module `front_of_house` est défini dans le même module que `eat_at_restaurant`, de sorte que le chemin relatif commençant par le module dans lequel `eat_at_restaurant` est défini fonctionne. Ensuite, parce que `hosting` et `add_to_waitlist` sont marqués par `pub`, le reste du chemin fonctionne, et cet appel de fonction est valide!
id: Dalam jalur relatif, logika adalah sama dengan jalur absolut kecuali untuk langkah pertama: daripada memulai dari akar peti, jalan dimulai dari bagian depan_of_house, modul yang sama dengan modul absolut_of_house. Kemudian, karena ▪hosting odd_wait_ature_at_retaurantía, jadi jalur relatif dimulai dari modul di mana Johnnye_at_rest_stouránue didefinisikan bekerja. Kemudian, karena ·hos_adto_waitánilist ditandai dengan ábáb, sisa dari jalur kerja ini, dan panggilan ini valid!
tr: Göreceli yolda mantık, ilk adım hariç mutlak yol ile aynıdır: sandık kökünden başlamak yerine, yol front_of_house'dan başlar. front_of_house modülü, eat_at_restaurant ile aynı modül içinde tanımlanır, bu nedenle eat_at_restaurant'ın bulunduğu modülden başlayan bağıl yol, eat_restaurant'ın tanımlı çalışmalarıdır ve host işlevi olduğundan,
zh_cn: 在相对路径中,逻辑与绝对路径相同,但第一步除外:路径不是从箱根开始,而是从`front_of_house'开始。`front_of_house'模块在“eat_at_restaurant”同一个模块中被定义为`eat_at_restaurant ',因此从`at_at_restaurant'定义“eat_at_restaurant”的模块开始的相对路径。然后,由于`东道'和`add_to_waitlist'被标记为`pub ',即路径的其余工作,而此函数呼叫是有效的!

source: {{#quiz ../quizzes/ch07-03-paths-in-module-tree-1.toml}}
es: quiz../quizzes/ch07-03-paths-in-módule-tree-1.toml
fr: {{#quiz../quizes/ch07-03-paths-in-module-tree-1.toml}}
zh_cn: Quiz./quizzes/ch07-03 -paths -in-module-treet-1.toml

source: Starting Relative Paths with `super`
es: Iniciando rutas relativas con `super`
fr: Début des chemins relatifs avec `super`
id: Memulai Jalur Relatif dengan Superhero
tr: super ile Bağıl Yollar Başlatma
zh_cn: “ 超级” 的起始相对路径

source: We can construct relative paths that begin in the parent module, rather than the current module or the crate root, by using `super` at the start of the path. This is like starting a filesystem path with the `..` syntax. Using `super` allows us to reference an item that we know is in the parent module, which can make rearranging the module tree easier when the module is closely related to the parent, but the parent might be moved elsewhere in the module tree someday.
es: Podemos construir rutas relativas que comienzan en el módulo padre, en lugar del módulo actual o la raíz de la caja, usando `super` al principio de la ruta. Esto es como iniciar una ruta del sistema de archivos con la sintaxis `..`. Usar `super` nos permite hacer referencia a un elemento que sabemos que está en el módulo padre, lo que puede hacer que la reorganización del árbol del módulo sea más fácil cuando el módulo está estrechamente relacionado con el padre, pero el padre puede ser movido a otra parte del árbol del módulo algún día.
fr: Nous pouvons construire des chemins relatifs qui commencent dans le module parent, plutôt que le module courant ou la racine de caisse, en utilisant `super` au début du chemin. C'est comme démarrer un chemin du système de fichiers avec la syntaxe `..`. L'utilisation de `super` nous permet de référencer un élément que nous savons dans le module parent, ce qui peut rendre plus facile la réorganisation de l'arborescence du module lorsque le module est étroitement lié au parent, mais le parent pourrait être déplacé ailleurs dans l'arborescence du module un jour.
id: Kita dapat membangun jalur relatif yang dimulai pada modul induk, daripada modul atau akar peti saat ini, dengan menggunakan ·superå di awal jalur. Ini seperti memulai jalur sistem berkas dengan syntax (motorx). Menggunakan hal yang kita ketahui pada modul induk, yang dapat membuat menyusun ulang pohon modul lebih mudah ketika modul itu berhubungan erat dengan induk, tetapi orang tua dapat dipindahkan ke tempat lain di pohon suatu hari nanti.
tr: Ana modülde başlayan göreli yolları, mevcut modül veya sandık kökü yerine, yolun başlangıcında süper kullanarak inşa edebiliriz. Bu,. sözdizimi ile bir dosya sistemi yolu başlatmaya benzer. süper kullanmak, modül ağacının ana modülde olduğunu bildiğimiz bir öğeye referans vermemizi sağlar, bu da modül ana modülle yakından ilişkili olduğunda modül ağacını yeniden düzenlemeyi kolaylaştırabilir, ancak ana modül bir gün başka bir yere taşınabilir.
zh_cn: 我们可以在路径的起始处使用“ super”, 而不是当前模块或箱根, 来构造从父模块开始的相对路径, 而不是当前模块或箱根。 这就像在路径的起始处使用 `. ` 语法 启动文件系统路径一样。 使用“ super ”, 允许我们引用我们所知道的在父模块中的项目, 这样当模块与父模块密切关联时, 可以更容易地重新排列模块树, 但将来可能会在模块树中将父树移到别处 。
