Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Each expression in these statements uses a mathematical operator and evaluates to a single value, which is then bound to a variable.
es: Cada expresión en estas declaraciones utiliza un operador matemático y evalúa a un solo valor, que luego se une a una variable.
fr: Chaque expression de ces instructions utilise un opérateur mathématique et évalue à une seule valeur, qui est alors liée à une variable.
id: Setiap ekspresi dalam pernyataan ini menggunakan operator matematika dan mengevaluasi ke satu nilai, yang kemudian terikat ke sebuah variabel.
tr: Bu ifadelerdeki her ifade bir matematiksel operatör kullanır ve tek bir değere değerlendirir, bu da daha sonra bir değişkene bağlanır.
zh_cn: 这些语句中的每个表达式都使用一个数学运算符,并评价一个单一值,然后与一个变量捆绑在一起。

source: [Appendix B](./appendix-02-operators-and-symbols.md#operators) contains a list of all operators that Cairo provides.
es: [Apéndice B](./apéndice-02-operadores-y-símbolos.md#operadores) contiene una lista de todos los operadores que El Cairo proporciona.
fr: [Appendice B](./appendix-02-operators-and-symbols.md#operators) contient une liste de tous les exploitants que le Caire fournit.
id: [Appendix B]Akuppendix-02-operator-and-symbols.md#operators) berisi daftar dari semua operator yang disediakan Kairo.
tr: [Ek B](./appendix-02-operators-and-symbols.md#operators) Kahire'nin sağladığı tüm operatörlerin bir listesini içerir.
zh_cn: [附录B](./附录02-Operators-and-symbols.md#operators)载有开罗提供的所有运营商的名单。

source: The Boolean Type
es: El tipo booleano
fr: Le type booléen
id: Tipe Boolean
tr: Boolean Tipi
zh_cn: 布尔类型

source: As in most other programming languages, a Boolean type in Cairo has two possible values: `true` and `false`. Booleans are one `felt252` in size. The Boolean type in Cairo is specified using `bool`. For example:
es: Al igual que en la mayoría de los demás idiomas de programación, un tipo booleano en El Cairo tiene dos valores posibles: `true` y `false`. Los booleanos son de un tamaño `felt252`. El tipo booleano en El Cairo se especifica usando `bool`. Por ejemplo:
fr: Comme dans la plupart des autres langages de programmation, un type booléen au Caire a deux valeurs possibles: `true` et `false`. Booléens sont un `felt252` de taille. Le type booléen au Caire est spécifié en utilisant `bool`. Par exemple:
id: Seperti kebanyakan bahasa pemrograman lainnya, tipe Boolean di Kairo memiliki dua nilai yang mungkin: benar dan salah satu istilah Booleans adalah ukuran tipe Boolean di Kairo dispesifikasikan sebagai contoh:
tr: Diğer programlama dillerinin çoğunda olduğu gibi, Kahire'deki bir Boole tipinin iki olası değeri vardır: true ve false. Booleans bir felt252 büyüklüğündedir. Kahire'deki Boole tipi bool kullanılarak belirtilir. Örneğin:
zh_cn: 与大多数其他节目语言一样,开罗的布尔型有两种可能的价值:`真'和`假';布尔型是尺寸为`felt252'的。

source: // with explicit type annotation
es: // con anotación explícita de tipo
fr: // avec annotation de type explicite
id: //dengan tipe anotasi eksplisit
tr: // açık tip açıklama ile
zh_cn: / 带有明确类型的注解

source: When declaring a `bool` variable, it is mandatory to use either `true` or `false` literals as value. Hence, it is not allowed to use integer literals (i.e. `0` instead of false) for `bool` declarations.
es: Al declarar una variable " bool ", es obligatorio utilizar literales " true " o " false " como valor, por lo que no se permite utilizar literales enteros (es decir, " 0 ", en lugar de falsos) para las declaraciones " bool ".
fr: Lorsqu'on déclare une variable `bool`, il est obligatoire d'utiliser les termes `true` ou `false` comme valeur. Par conséquent, il n'est pas permis d'utiliser des termes entiers (c'est-à-dire `0' au lieu de faux) pour les déclarations `bool`.
id: Karena itu, tidak diperbolehkan menggunakan variabel integer literal (misalnya 00) sebagai pengganti deklarasi palsu).
tr: Bir bool değişkeni ilan ederken, true veya false literallerini değer olarak kullanmak zorunludur. Bu nedenle, bool beyanları için tamsayı literallerinin (yani 0 yerine yanlış) kullanılmasına izin verilmez.
zh_cn: 在宣布`bool' 变量时,必须使用` true' 或`false' 字作为值,因此,不允许在`bool' 声明中使用整数字(即`0'而不是假字)。

source: The main way to use Boolean values is through conditionals, such as an `if` expression. We’ll cover how `if` expressions work in Cairo in the ["Control Flow"](./ch02-05-control-flow.md) section.
es: La forma principal de utilizar los valores booleanos es a través de condicionales, como una expresión `if`. Cubriremos cómo funcionan las expresiones `if` en El Cairo en la sección ["Flow de control"](./ch02-05-control-flow.md).
fr: La principale façon d'utiliser les valeurs booléennes est par l'intermédiaire de conditionnels, comme une expression `if`. Nous allons couvrir comment les expressions `if` fonctionnent au Caire dans la section ["Control Flow"](./ch02-05-control-flow.md).
id: Cara utama untuk menggunakan nilai-nilai Boolean adalah melalui kondisional, seperti ekspresi æifs. kita akan menutupi bagaimana ekspresi bekerja di Kairo di bagian ["Kontrol Flow"]./ch02-05-control-flow.md).
tr: Boolean değerlerini kullanmanın ana yolu, if ifadesi gibi koşulludur. if ifadelerinin Kahire'de ["Kontrol Akışı"](./ch02-05-control-flow.md) bölümünde nasıl çalıştığını ele alacağız.
zh_cn: 使用布尔值的主要方法是有条件的,如`如果'表达式。我们将在[“控制流程” (./ch02-05- control-flow.md) 部分说明`如果'表达式在开罗如何起作用。

source: String Types
es: Tipos de cadenas
fr: Types de chaînes
id: Jenis String
tr: Dize Çeşitleri
zh_cn: 字符串类型

source: Cairo doesn't have a native type for strings but provides two ways to handle them: short strings using simple quotes and ByteArray using double quotes.
es: El Cairo no tiene un tipo nativo para las cadenas, pero proporciona dos maneras de manejarlas: cadenas cortas usando comillas simples y ByteArray usando comillas dobles.
fr: Le Caire n'a pas de type natif pour les chaînes, mais fournit deux façons de les gérer : les chaînes courtes à l'aide de guillemets simples et ByteArray à l'aide de guillemets doubles.
id: Kairo tidak memiliki tipe asli untuk string tetapi menyediakan dua cara untuk menangani mereka: string pendek menggunakan kutipan sederhana dan ByteArray menggunakan tanda kutip ganda.
tr: Kahire, dizeler için yerli bir tipe sahip değildir, ancak bunları ele almanın iki yolunu sunar: basit alıntılar kullanan kısa dizeler ve çift tırnak kullanan ByteArray.
zh_cn: 开罗没有本地的字符串类型,但提供了两种处理方式:短字符串使用简单的引号,ByteAray使用双重引号。

source: Short strings
es: Cadenas cortas
fr: Cordes courtes
id: String pendek
tr: Kısa dizeler
zh_cn: 短短字符串

source: A short string is an ASCII string where each character is encoded on one byte (see the [ASCII table](https://www.asciitable.com/)). For example:
es: Una cadena corta es una cadena ASCII donde cada carácter está codificado en un byte (véase la tabla [ASCII](https://www.asciitable.com/)). Por ejemplo:
fr: Une courte chaîne est une chaîne ASCII où chaque caractère est encodé sur un octet (voir la [table ASCII](https://www.asciitable.com/)). Par exemple :
id: String pendek adalah string ASCII di mana setiap karakter dikodekan pada satu byte (lihat tabel [ASCII][https://www.ascitable.com/). Sebagai contoh:
tr: Kısa bir dize, her karakterin bir bayt üzerinde kodlandığı bir ASCII dizesidir (bkz. [ASCII tablosu](https://www.asciitable.com/)))). Örneğin:
zh_cn: 短字符串是一个 ASCII 字符串,其中每个字符编码在一个字节上(见[ASCII表](https://www.asciitable.com/)。 例如:

source: `'a'` is equivalent to `0x61`
es: `a' es equivalente a `0x61 '
fr: `'a'` est équivalent à `0x61`
id: Ini setara dengan 0x61.
tr: 'a' eşittir 0x61
zh_cn: `a'等于`0x61'

source: `'b'` is equivalent to `0x62`
es: `'b' es equivalente a `0x62 '
fr: `'b'` est équivalent à `0x62`
id: Ini setara dengan 0x62.
tr: 'b' eşittir 0x62
zh_cn: ``b'等于`0x62'

source: `'c'` is equivalent to `0x63`
es: `c' es equivalente a `0x63 '
fr: `'c'` est équivalent à `0x63`
id: Ini setara dengan 0x63.
tr: 'c' eşittir 0x63
zh_cn: `c'等于`0x63'

source: `0x616263` is equivalent to `'abc'`.
es: `0x616263` es equivalente a `'abc'.
fr: `0x616263` est équivalent à `'abc'`.
id: 0x616263 sama saja dengan 'abc'.
tr: 0x616263, 'abc''ye eşdeğerdir.
zh_cn: `0x6162663'等于`abc'。

source: Cairo uses the `felt252` for short strings. As the `felt252` is on 251 bits, a short string is limited to 31 characters (31 \* 8 = 248 bits, which is the maximum multiple of 8 that fits in 251 bits).
es: El Cairo utiliza el `felt252` para cadenas cortas. Como el `felt252` está en 251 bits, una cadena corta está limitada a 31 caracteres (31 \* 8 = 248 bits, que es el múltiplo máximo de 8 que cabe en 251 bits).
fr: Le Caire utilise le `felt252` pour les cordes courtes. Comme le `felt252` est sur 251 bits, une chaîne courte est limitée à 31 caractères (31 \* 8 = 248 bits, ce qui est le multiple maximum de 8 qui correspond en 251 bits).
id: Kairo menggunakan 252 sen untuk senar pendek. sebagaimana pada 251 bit, sebuah string pendek dibatasi menjadi 31 karakter (31 \* 8 = 248 bit, yang merupakan jumlah maksimum 8 yang cocok dalam 251 bits).
tr: Kahire kısa dizeler için felt252 kullanır. felt252 251 bit üzerinde olduğundan, kısa bir dize 31 karakterle sınırlıdır (31 * 8 = 248 bit, bu da 251 bite uyan 8'in maksimum katıdır).
zh_cn: 由于“felt252”在251位数上,短字符限为31个字符(31 8 = 248位数,这是251位数中最大8倍的乘数)。

source: You can choose to represent your short string with an hexadecimal value like `0x616263` or by directly writing the string using simple quotes like `'abc'`, which is more convenient.
es: Puede elegir representar su cadena corta con un valor hexadecimal como `0x616263` o escribiendo directamente la cadena usando comillas simples como `'abc`, lo cual es más conveniente.
fr: Vous pouvez choisir de représenter votre chaîne courte avec une valeur hexadécimal comme `0x616263` ou en écrivant directement la chaîne en utilisant des guillemets simples comme `'abc'`, ce qui est plus pratique.
id: Anda dapat memilih untuk mewakili string pendek Anda dengan nilai heksadesimal seperti 0x616263 atau dengan secara langsung menulis string menggunakan kutipan sederhana seperti å'abc'å, yang lebih nyaman.
tr: Kısa dizenizi 0x616263 gibi onaltılık bir değerle temsil etmeyi veya daha uygun olan 'abc' gibi basit alıntıları kullanarak dizeyi doğrudan yazarak temsil etmeyi seçebilirsiniz.
zh_cn: 您可以选择以“ 0x61626263” 等十六进制值代表您的短字符串,或者使用“ abc” 等简单引号直接写入字符串,这更方便。

source: Here are some examples of declaring short strings in Cairo:
es: Estos son algunos ejemplos de declarar cadenas cortas en El Cairo:
fr: Voici quelques exemples de déclarations de cordes courtes au Caire:
id: Berikut adalah beberapa contoh menyatakan senar pendek di Kairo:
tr: İşte Kahire'de kısa dizeler ilan etmenin bazı örnekleri:
zh_cn: 以下是在开罗宣布短线的一些例子:

source: 'C'
zh_cn: "C" "C" (C)

source: "this is a string which has more than 31 characters"
es: "esta es una cadena que tiene más de 31 caracteres"
fr: "c'est une chaîne qui a plus de 31 caractères"
id: "Ini adalah string yang memiliki lebih dari 31 karakter"
tr: "31'den fazla karaktere sahip bir dize"
zh_cn: "这是一个有超过31个字符的字符串"

source: Byte Array Strings
es: Cuerdas de arco de bytes
fr: Cordes d'array à octets
id: String Byte Array
tr: Byte Dizi Dizgileri
zh_cn: 字节数组字符串

source: With the `ByteArray` struct added in Cairo 2.4.0, you are not limited to 31 characters anymore. These `ByteArray` strings are written in double quotes like in the following example:
es: Con la estructura `ByteArray` añadida en El Cairo 2.4.0, ya no se limita a 31 caracteres. Estas cadenas `ByteArray` están escritas en comillas dobles como en el siguiente ejemplo:
fr: Avec la structure `ByteArray` ajoutée au Caire 2.4.0, vous n'êtes plus limité à 31 caractères. Ces chaînes `ByteArray` sont écrites en guillemets doubles comme dans l'exemple suivant :
id: Dengan struktur ByteArray yang ditambahkan di Kairo 2.4.0, Anda tidak terbatas pada 31 karakter lagi. string ByteArray ini ditulis dalam kutipan ganda seperti dalam contoh berikut:
tr: Kahire 2.4.0'da eklenen ByteArray yapısıyla artık 31 karakterle sınırlı değilsiniz. Bu ByteArray dizeleri aşağıdaki örnekte olduğu gibi çift tırnak içinde yazılmıştır:
zh_cn: 开罗2.4.0添加了`ByteAray'结构,不再局限于31个字符。这些`ByteAray'字符串以双重引号写成,例如如下例子:

source: Type Casting
es: Tipo de fundición
id: Casting Tipe
tr: Tip Döküm
zh_cn: 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种 种

source: In Cairo, you can convert scalar types from one type to another by using the `try_into` and `into` methods provided by the `TryInto` and `Into` traits from the core library.
es: En El Cairo, puede convertir tipos escalares de un tipo a otro utilizando los métodos `try_into` y `into` proporcionados por los rasgos `TryInto` e `Into` de la biblioteca principal.
fr: Au Caire, vous pouvez convertir des types scalaires d'un type à l'autre en utilisant les méthodes `try_into` et `into` fournies par les caractères `TryInto` et `Into` de la bibliothèque centrale.
id: Di Kairo, Anda dapat mengubah tipe skalar dari satu jenis ke jenis lain dengan menggunakan sifat-sifat dari perpustakaan utama.
tr: Kahire'de, skaler tiplerini, çekirdek kitaplığından try_into ve into tarafından sağlanan try_into ve into yöntemlerini kullanarak bir türe dönüştürebilirsiniz.
zh_cn: 在开罗,您可以通过使用核心图书馆的`TryInto'和`Into'提供的`tryinto'和`Into'特性的`tryinto'和`into'方法,将卡路里的类型从一种类型转换为另一种类型。

source: The `try_into` method allows for safe type casting when the target type might not fit the source value. Keep in mind that `try_into` returns an `Option<T>` type, which you'll need to unwrap to access the new value.
es: El método `try_into` permite el casting de tipo seguro cuando el tipo de destino puede no encajar con el valor de fuente. Tenga en cuenta que `try_into` devuelve un tipo `Option<TÃ3n, que necesitará desenvolver para acceder al nuevo valor.
fr: La méthode `try_into` permet de lancer un type sûr lorsque le type cible ne correspond pas à la valeur source. Gardez à l'esprit que `try_into` retourne un type `Option<T>`, que vous devrez décompresser pour accéder à la nouvelle valeur.
id: Metode pembongkaran jenis aman ketika tipe target mungkin tidak sesuai dengan nilai sumber. Perlu diingat bahwa åtry_into mengembalikan suatu tipe <T>, yang perlu Anda unwrap untuk mengakses nilai baru.
tr: try_into yöntemi, hedef türün kaynak değere uymayabileceği durumlarda güvenli tip dökümüne izin verir. try_into'un yeni değere erişmek için açmanız gereken bir OptionT> tipini döndürdüğünü unutmayın.
zh_cn: `try_ in' 方法允许在目标类型可能与源值不符时进行安全型式铸造。 请记住` trin_ in' 返回“ option < T} 类型, 您需要解开该类型才能访问新值 。

source: On the other hand, the `into` method can be used for type casting when success is guaranteed, such as when the source type is smaller than the destination type.
es: Por otra parte, el método " in " puede utilizarse para la fundición de tipos cuando se garantiza el éxito, por ejemplo cuando el tipo de fuente es menor que el tipo de destino.
fr: D'autre part, la méthode « into » peut être utilisée pour la coulée de type lorsque le succès est garanti, par exemple lorsque le type de source est plus petit que le type de destination.
id: Di pihak lain, metode itu dapat digunakan untuk pengecoran jenis bila dipastikan sukses, misalnya sewaktu jenis sumbernya lebih kecil daripada jenis tujuan.
tr: Öte yandan, into yöntemi, kaynak tipinin hedef tipinden daha küçük olduğu zaman olduğu gibi, başarı garanti edildiğinde tip dökümü için kullanılabilir.
zh_cn: 另一方面, " 内插 " 方法在成功得到保证时,如来源类型小于目的地类型时,可用于打字。

source: To perform the conversion, call `var.into()` or `var.try_into()` on the source value to cast it to another type. The new variable's type must be explicitly defined, as demonstrated in the example below.
es: Para realizar la conversión, llame a `var.into()` o `var.try_into()` en el valor fuente para lanzarlo a otro tipo. El tipo de la nueva variable debe definirse explícitamente, como se demuestra en el ejemplo a continuación.
fr: Pour effectuer la conversion, appelez `var.into()` ou `var.try_into()` sur la valeur source pour la lancer dans un autre type. Le type de la nouvelle variable doit être explicitement défini, comme le montre l'exemple ci-dessous.
id: Untuk melakukan konversi, panggil Ávar.into----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
tr: Dönüşümü gerçekleştirmek için, var.into() veya var.try_into()'yi kaynak değeri üzerinde başka bir türe atmak için arayın. Yeni değişkenin türü, aşağıdaki örnekte gösterildiği gibi açıkça tanımlanmalıdır.
zh_cn: 要执行转换,请在源值上调用“var.into()”或“var.try_into()”将其投放到另一类型。必须明确界定新变量的类型,如下文示例所示。

source: // Since a felt252 might not fit in a u8, we need to unwrap the Option<T> type
es: // Dado que un feeled252 puede no caber en un u8, necesitamos desenvolver el tipo Opción<T>
fr: // Étant donné qu'un feutre252 pourrait ne pas s'intégrer dans un u8, nous devons déballer l'option <T> type
id: //Karena felt2252 mungkin tidak cocok dalam sebuah u8, kita perlu membuka tipe Opsi<T>
tr: // Bir keçe252 bir u8'e sığmayabileceğinden, OptionT> türünü açmamız gerekir.
zh_cn: / 因为感觉252可能不适合u8, 我们需要解开选项 < T> 类型

source: // As a felt252 is smaller than a u256, we can use the into() method
es: // Como un feeld252 es más pequeño que un u256, podemos utilizar el método into()
fr: // Comme un feutre252 est plus petit qu'un u256, nous pouvons utiliser la méthode in()
id: //Sebagai felt2 lebih kecil dari u256, kita dapat menggunakan metodenya ke susah payah)
tr: // Bir keçe252 bir u256'dan daha küçük olduğundan, into() yöntemini kullanabiliriz.
zh_cn: 由于感觉252小于u256, 我们可以使用()方法

source: The Tuple Type
es: El tipo de tupla
fr: Le type de tuple
id: Tipe Tuples
tr: Tuple Tipi
zh_cn: 图例类型

source: A _tuple_ is a general way of grouping together a number of values with a variety of types into one compound type. Tuples have a fixed length: once declared, they cannot grow or shrink in size.
es: Un _tuple_ es una forma general de agrupar una serie de valores con una variedad de tipos en un tipo compuesto. Las tuplas tienen una longitud fija: una vez declaradas, no pueden crecer ni reducirse de tamaño.
fr: Un _tuple_ est une façon générale de regrouper un certain nombre de valeurs avec une variété de types en un seul type composé. Les tuples ont une longueur fixe: une fois déclarés, ils ne peuvent pas croître ou rétrécir dans la taille.
id: Sebuah _tuple_ adalah cara umum untuk mengelompokkan sejumlah nilai dengan berbagai tipe ke dalam satu tipe majemuk. Tuples memiliki panjang tetap: sekali dideklarasikan, mereka tidak dapat tumbuh atau mengecilkan ukuran.
tr: Bir _tuple_, çeşitli türlere sahip bir dizi değeri bir bileşik tipinde bir araya getirmenin genel bir yoludur. Tuples sabit bir uzunluğa sahiptir: bir kez ilan edildiğinde, büyüyemezler veya küçülmezler.
zh_cn: Atuple_ 是一种将若干种类型不同的数值组合成一种化合物类型的一般方法。图例有一个固定长度:一旦申报,它们就不能生长或缩小大小。

source: We create a tuple by writing a comma-separated list of values inside parentheses. Each position in the tuple has a type, and the types of the different values in the tuple don’t have to be the same. We’ve added optional type annotations in this example:
es: Creamos una tupla escribiendo una lista separada por comas de valores dentro de paréntesis. Cada posición en la tupla tiene un tipo, y los tipos de los diferentes valores en la tupla no tienen que ser los mismos. Hemos añadido anotaciones opcionales de tipo en este ejemplo:
fr: Nous créons un tuple en écrivant une liste de valeurs séparées par des virgules à l'intérieur des parenthèses. Chaque position dans le tuple a un type, et les types des différentes valeurs dans le tuple ne doivent pas être les mêmes. Nous avons ajouté des annotations de type optionnel dans cet exemple:
id: Kami membuat tuple dengan menulis daftar nilai-nilai yang dipisahkan koma di dalam tanda kurung. setiap posisi di tuple memiliki tipe, dan jenis nilai yang berbeda di tuple tidak harus sama. kami telah menambahkan notasi opsional dalam contoh ini:
tr: Parantez içindeki değerlerin virgülle ayrılmış bir listesini yazarak bir tuple oluşturuyoruz. Tuple'daki her pozisyonun bir türü vardır ve tuple'daki farklı değerlerin türleri aynı olmak zorunda değildir. Bu örnekte isteğe bağlı tip ek açıklamalar ekledik:
zh_cn: 我们通过在括号中写一个逗号分隔的数值列表来创建一个 tuple 。 括号中的每个位置都有一个类型, 而图Ple中不同值的类型不一定是相同的。 我们在此例中添加了可选类型的注释 :

source: The variable `tup` binds to the entire tuple because a tuple is considered a single compound element. To get the individual values out of a tuple, we can use pattern matching to destructure a tuple value, like this:
es: La variable `tup` se une a toda la tupla porque una tupla se considera un único elemento compuesto. Para obtener los valores individuales de una tupla, podemos usar el patrón emparejado para desestructurar un valor de tupla, como este:
fr: La variable `tup` se lie à l'ensemble du tuple parce qu'un tuple est considéré comme un seul élément composé. Pour sortir les valeurs individuelles d'un tuple, nous pouvons utiliser le modèle correspondant pour déstructurer une valeur de tuple, comme ceci:
id: Variabel mengikat seluruh tuple karena sebuah tuple dianggap sebagai elemen senyawa tunggal. untuk mendapatkan nilai individu dari sebuah tuple, kita dapat menggunakan pencocokan pola untuk mendestruktur sebuah nilai tuple, seperti ini:
tr: tup değişkeni, bir tuple tek bir bileşik element olarak kabul edildiğinden tüm tuple'a bağlanır. Bireysel değerleri bir tuple'dan çıkarmak için, bir tuple değerini destructure etmek için desen eşlemesini kullanabiliriz, bunun gibi:
zh_cn: 变量“ tup” 与整个图普相连, 因为图普被视为单一的复合元素。 要从图普中获取单个值, 我们可以使用匹配模式来改变图普值, 比如 :

source: "y is 6!"
es: "¡Y es 6!"
fr: "il a 6 ans!"
id: "Y adalah 6!"
tr: "Y 6 yaşında!"
zh_cn: "y is 6!" "y is 6!"

source: This program first creates a tuple and binds it to the variable `tup`. It then uses a pattern with `let` to take `tup` and turn it into three separate variables, `x`, `y`, and `z`. This is called _destructuring_ because it breaks the single tuple into three parts. Finally, the program prints `y is 6!` as the value of `y` is `6`.
es: Este programa crea primero una tupla y la une a la variable `tup`. Luego utiliza un patrón con `let` para tomar `tup` y convertirlo en tres variables separadas, `x`, `y` y `z`. Esto se llama _destructuring_ porque rompe la sola tupla en tres partes. Finalmente, el programa imprime `y es 6!` ya que el valor de `y` es `6`.
fr: Ce programme crée d'abord un tuple et le lie à la variable `tup`. Il utilise ensuite un motif avec `let` pour prendre `tup` et le transformer en trois variables distinctes, `x`, `y` et `z`. Ceci s'appelle _destructuration_ parce qu'il casse le tuple unique en trois parties. Enfin, le programme imprime `y est 6!` comme la valeur `y` est `6`.
id: Program ini pertama kali menciptakan sebuah tuple dan mengikatnya ke variabel yang disebut _destruction_ karena itu akan menghancurkan satu tuple menjadi tiga bagian. akhirnya, program mencetak 6!
tr: Bu program önce bir tuple oluşturur ve değişken tup'ye bağlar. Daha sonra tup'yi almak ve üç ayrı değişkene dönüştürmek için let ile bir kalıp kullanır, x, y ve z. Buna _destrucing_ denir çünkü tek tuple'ı üç parçaya ayırır. Son olarak, program y'nin değeri olarak 6!y'yi yazdırır.
zh_cn: 这个程序首先创建一个图普,并将其与变量`tup'捆绑在一起,然后使用“let`let' to take `tup'”的图案,将其变成三个独立的变量`x'、`y'和`z',这称为`instrument',因为它将单图普分成三个部分。最后,程序指纹`y is 6!',因为`y'值是`6'。

source: We can also declare the tuple with value and types, and destructure it at the same time. For example:
es: También podemos declarar la tupla con valor y tipos, y desestructurarla al mismo tiempo. Por ejemplo:
fr: Nous pouvons également déclarer le tuple avec valeur et types, et le déstructurer en même temps. Par exemple:
id: Kita juga dapat menyatakan tuple dengan nilai dan jenis, dan destruktur itu pada saat yang sama.
tr: Ayrıca tümülü değer ve türlerle beyan edebilir ve aynı anda yapılandırabiliriz. Örneğin:
zh_cn: 我们还可以以价值和类型来宣布图普,并同时进行结构调整。例如:
