Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: We store an array of `u8` in the variable `number_list` and extract the first number in the array in a variable named `largest`. We then iterate through all the numbers in the array, and if the current number is greater than the number stored in `largest`, we update the value of `largest`. However, if the current number is less than or equal to the largest number seen so far, the variable doesn’t change, and the code moves on to the next number in the list. After considering all the numbers in the array, `largest` should contain the largest number, which in this case is 100.
es: Almacenamos un array de `u8` en la variable `number_list` y extraemos el primer número del array en una variable llamada `largest`. Luego iteramos a través de todos los números del array, y si el número actual es mayor que el número almacenado en `largest`, actualizamos el valor de `largest`. Sin embargo, si el número actual es menor o igual al número más grande visto hasta ahora, la variable no cambia, y el código pasa al siguiente número de la lista. Después de considerar todos los números del array, `largest` debe contener el número más grande, que en este caso es 100.
fr: Nous stockons un tableau de `u8` dans la variable `number_list` et nous en extrayons le premier numéro dans une variable nommée `plus grande`. Nous itérerons alors à travers tous les nombres du tableau, et si le nombre courant est supérieur au nombre stocké dans `plus grande`, nous mettons à jour la valeur de `plus grande`. Cependant, si le nombre courant est inférieur ou égal au nombre le plus grand vu jusqu'ici, la variable ne change pas, et le code passe au nombre suivant dans la liste. Après avoir considéré tous les nombres dans le tableau, `plus grande` devrait contenir le plus grand nombre, qui dans ce cas est 100.
id: Kami menyimpan sebuah array yang berukuran besar. kami menyimpan sebuah array dalam sebuah variabel yang disebut besar. kami kemudian merangkumkan seluruh angka dalam array, dan jika angka saat ini lebih besar daripada nomor yang disimpan dalam daftar yang lebih besar. setelah mengingat semua angka dalam array, harus mengandung angka yang lebih besar. namun, jika angka saat ini kurang atau sama dengan angka terbesar yang terlihat sejauh ini, variabel tersebut tidak berubah, dan kode bergerak ke angka berikutnya dalam daftar berikutnya. setelah mengingat semua angka-angka dalam array, seharusnya berisi angka-angka yang paling besar, yang seharusnya berisi angka terbesar dalam 100 kasus ini.
tr: u8 dizisini number_list değişkeninde depolarız ve dizideki ilk sayıyı en büyük adlı bir değişkende çıkarırız. Daha sonra dizideki tüm sayıları yineleriz ve en büyük dizisinde depolanan sayıdan daha büyükse, en büyük dizinin değerini güncelleriz. Ancak, şu anki sayı şu ana kadar görülen en büyük sayıdan küçük veya eşitse, değişkenin değişmemesi gerekir.
zh_cn: 我们将`u8'的阵列存放在变量`序号_列表'中,并在名为`最大'的变量中提取数组的第一个数字。然后我们通过数组中的所有数字进行循环,如果当前数字大于`最大'中储存的数字,我们就更新`最大'的值。然而,如果当前数字小于或等于迄今看到的最大数字,则该变量没有变化,代码移到列表中的下一个数字。在考虑了数组中的所有数字后,`最大'应该包含最大数字,在这种情况下是100。

source: We've now been tasked with finding the largest number in two different arrays of numbers. To do so, we can choose to duplicate the previous code and use the same logic at two different places in the program, as follows:
es: Para ello, podemos optar por duplicar el código anterior y utilizar la misma lógica en dos lugares diferentes del programa, como sigue:
fr: Nous avons maintenant été chargés de trouver le plus grand nombre dans deux tableaux de nombres différents. Pour ce faire, nous pouvons choisir de dupliquer le code précédent et d'utiliser la même logique à deux endroits différents dans le programme, comme suit:
id: Kita sekarang telah ditugaskan untuk menemukan angka terbesar dalam dua array angka yang berbeda untuk melakukannya, kita dapat memilih untuk menduplikasi kode sebelumnya dan menggunakan logika yang sama di dua tempat yang berbeda dalam program ini, sebagai berikut:
tr: Şimdi iki farklı sayı dizisinde en büyük sayıyı bulmakla görevlendirildik. Bunu yapmak için, önceki kodu çoğaltmayı ve aynı mantığı programın iki farklı yerinde kullanmayı seçebiliriz, aşağıdaki gibi:
zh_cn: 我们现在的任务是在两个不同的数字阵列中找到最大的数字。为了这样做,我们可以选择重复以前的代码,并在程序的两个不同地方使用同样的逻辑,如下:

source: Although this code works, duplicating code is tedious and error-prone. We also have to remember to update the code in multiple places when we want to change it.
es: Aunque este código funciona, duplicar código es tedioso y propenso a errores. También tenemos que recordar actualizar el código en varios lugares cuando queremos cambiarlo.
fr: Bien que ce code fonctionne, dupliquer le code est fastidieux et sujet à erreur. Nous devons également nous rappeler de mettre à jour le code en plusieurs endroits lorsque nous voulons le modifier.
id: Meskipun kode ini bekerja, duplikasi kode membosankan dan prone kesalahan. kita juga harus ingat untuk memperbarui kode di beberapa tempat ketika kita ingin mengubahnya.
tr: Bu kod işe yarasa da, kodu kopyalamak sıkıcı ve hataya eğilimlidir. Değiştirmek istediğimizde kodu birden fazla yerde güncellemeyi de unutmamalıyız.
zh_cn: 虽然该代码有效, 但重复代码是乏味和易出错的。 当我们想更改代码时, 我们还必须记住要在多个地方更新代码 。

source: To eliminate this duplication, we’ll create an abstraction by defining a function that operates on any array of `u8` passed in a parameter. This solution makes our code clearer and lets us express the concept of finding the largest number in an array abstractly.
es: Para eliminar esta duplicación, crearemos una abstracción definiendo una función que opera en cualquier array de `u8` pasado en un parámetro. Esta solución hace nuestro código más claro y nos permite expresar el concepto de encontrar el mayor número en un array abstractamente.
fr: Pour éliminer cette duplication, nous allons créer une abstraction en définissant une fonction qui fonctionne sur n'importe quel tableau de `u8` passé dans un paramètre. Cette solution rend notre code plus clair et nous permet d'exprimer le concept de trouver le plus grand nombre dans un tableau de façon abstraite.
id: Untuk menghilangkan duplikasi ini, kita akan menciptakan sebuah abstraksi dengan mendefinisikan sebuah fungsi yang beroperasi pada berbagai array yang melewati parameter. solusi ini membuat kode kita lebih jelas dan memungkinkan kita mengungkapkan konsep untuk menemukan angka terbesar dalam array abstrak.
tr: Bu ikilemeyi ortadan kaldırmak için, herhangi bir parametrede geçen u8 dizisinde çalışan bir fonksiyon tanımlayarak bir soyutlama oluşturacağız. Bu çözüm, kodumuzu daha net hale getirir ve bir dizideki en büyük sayıyı bulma kavramını soyut olarak ifade etmemizi sağlar.
zh_cn: 为了消除这种重复,我们将通过界定在参数中通过的任何“u8”阵列上运作的功能来创造一种抽象的概念。 这一解决方案使我们的代码更加清晰,让我们抽象地表达在数列中找到最大数字的概念。

source: To do that, we extract the code that finds the largest number into a function named `largest`. Then we call the function to find the largest number in the two arrays. We could also use the function on any other array of `u8` values we might have in the future.
es: Para ello, extraemos el código que encuentra el mayor número en una función llamada `largest`. Luego llamamos a la función para encontrar el mayor número en los dos arrays. También podríamos utilizar la función en cualquier otro array de valores `u8` que podamos tener en el futuro.
fr: Pour cela, nous extrayons le code qui trouve le plus grand nombre dans une fonction nommée `plus grand`. Ensuite, nous appelons la fonction pour trouver le plus grand nombre dans les deux tableaux. Nous pourrions également utiliser la fonction sur tout autre tableau de valeurs `u8` que nous pourrions avoir dans le futur.
id: Untuk melakukan itu, kami mengekstrak kode yang menemukan angka terbesar ke dalam sebuah fungsi yang bernama Árst.
tr: Bunu yapmak için, en büyük sayıyı en büyük adlı bir fonksiyona bulan kodu çıkarırız. Sonra fonksiyonu iki dizideki en büyük sayıyı bulmak için çağırırız. Fonksiyonu gelecekte sahip olabileceğimiz başka herhangi bir u8 değeri dizisinde de kullanabiliriz.
zh_cn: 为此,我们将发现最大数字的代码提取成一个名为“最大”的函数。然后我们调用该函数以找到两个阵列中最大的数字。我们还可以将该函数用于我们今后可能拥有的任何其他“u8”数值阵列上。

source: The largest function has a parameter called `number_list`, passed by reference, which represents any concrete array of `u8` values we might pass into the function. As a result, when we call the function, the code runs on the specific values that we pass in.
es: La función más grande tiene un parámetro llamado `number_list`, pasado por referencia, que representa cualquier matriz concreta de valores `u8` que podríamos pasar a la función. Como resultado, cuando llamamos a la función, el código se ejecuta en los valores específicos que pasamos en.
fr: La plus grande fonction a un paramètre appelé `number_list`, passé par référence, qui représente n'importe quel tableau concret de valeurs `u8` que nous pourrions passer dans la fonction. Par conséquent, lorsque nous appelons la fonction, le code fonctionne sur les valeurs spécifiques que nous transmettons.
id: Fungsi terbesar memiliki parameter yang disebut nomor_listé, yang dilewatkan oleh referensi, yang mewakili susunan beton dari nilai-nilai yang mungkin kita masukkan ke dalam fungsi. sebagai hasilnya, ketika kita sebut fungsi, kode berjalan pada nilai-nilai spesifik yang kita masukkan ke dalam.
tr: En büyük fonksiyon, referansla geçen number_list adlı bir parametreye sahiptir, bu da fonksiyona geçebileceğimiz herhangi bir u8 değer dizisini temsil eder. Sonuç olarak, fonksiyonu çağırdığımızda, kod içinde geçtiğimiz belirli değerler üzerinde çalışır.
zh_cn: 最大函数有一个称为`编号列表'的参数,通过引用通过,该参数代表着我们可能传递到函数中的任何“u8”值的具体阵列。因此,当我们调用该函数时,代码以我们通过的具体值运行。

source: In summary, here are the steps we took to change the code:
es: En resumen, aquí están los pasos que tomamos para cambiar el código:
fr: En résumé, voici les mesures que nous avons prises pour modifier le code :
id: Sebagai ringkasan, inilah langkah-langkah yang kami ambil untuk mengubah kode:
tr: Özetle, kodu değiştirmek için attığımız adımlar şunlardır:
zh_cn: 简而言之,我们为修改守则采取了以下步骤:

source: Identify duplicate code.
es: Identifique el código duplicado.
fr: Identifiez le code dupliqué.
id: Identifikasi kode duplikat.
tr: Kopya kodu tanımla.
zh_cn: 识别重复代码 。

source: Extract the duplicate code into the body of the function and specify the inputs and return values of that code in the function signature.
es: Extraiga el código duplicado en el cuerpo de la función y especifique los valores de entrada y devolución de ese código en la firma de la función.
fr: Extraire le code dupliqué dans le corps de la fonction et spécifier les entrées et les valeurs de retour de ce code dans la signature de la fonction.
id: Ekstrak kode duplikat ke dalam tubuh fungsi dan spesifikasikan masukan dan kembalikan nilai dari kode tersebut dalam tanda-tangan fungsi.
tr: Kopya kodu fonksiyonun gövdesine çıkarın ve bu kodun girdilerini ve dönüş değerlerini fonksiyon imzasında belirtin.
zh_cn: 将重复代码提取到函数正文中,并在函数签名中指定该代码的输入值和返回值。

source: Update the two instances of duplicated code to call the function instead.
es: Actualizar las dos instancias de código duplicado para llamar a la función en su lugar.
fr: Mettre à jour les deux instances de code dupliqué pour appeler la fonction à la place.
id: Perbarui dua contoh kode duplikat untuk memanggil fungsi sebagai gantinya.
tr: Bunun yerine işlevi aramak için iki çoğaltılmış kod örneğini güncelleyin.
zh_cn: 更新两个重复代码实例, 代之以调用该函数 。

source: Next, we’ll use these same steps with generics to reduce code duplication. In the same way that the function body can operate on an abstract `Array<T>` instead of specific `u8` values, generics allow code to operate on abstract types.
es: A continuación, vamos a utilizar estos mismos pasos con genéricos para reducir la duplicación de código. De la misma manera que el cuerpo de la función puede operar en un resumen `Array<TÃ ́ en lugar de valores específicos `u8`, los genéricos permiten que el código funcione en tipos abstractos.
fr: Ensuite, nous utiliserons ces mêmes étapes avec des génériques pour réduire la duplication de code. De la même manière que l'organisme de la fonction peut fonctionner sur un abrégé `Array<T>` au lieu de valeurs spécifiques `u8`, les génériques permettent le code de fonctionner sur des types abstraits.
id: Selanjutnya, kita akan menggunakan langkah-langkah yang sama dengan generik untuk mengurangi duplikasi kode. dengan cara yang sama bahwa tubuh fungsi dapat beroperasi pada sebuah abstrak array <T>, bukan nilai-nilai spesifik, generik memungkinkan kode untuk beroperasi pada tipe abstrak.
tr: Daha sonra, kod çoğaltmasını azaltmak için bu aynı adımları jeneriklerle kullanacağız. Fonksiyon gövdesinin belirli u8 değerleri yerine soyut bir ArrayT> üzerinde çalışabilmesi gibi, jenerikler de kodun soyut türlerde çalışmasına izin verir.
zh_cn: 接下来,我们将使用这些带有通用名词的相同步骤来减少代码重复。 同样,通用名词也可以使用抽象的“Array<T ” 来操作,而不是特定的“u8” 值。 通用名词允许代码在抽象类型上操作。

source: We use generics to create definitions for item declarations, such as structs and functions, which we can then use with many different concrete data types. In Cairo, we can use generics when defining functions, structs, enums, traits, implementations and methods. In this chapter, we are going to take a look at how to effectively use generic types with all of them.
es: Utilizamos genéricos para crear definiciones de declaraciones de ítems, como estructuras y funciones, que luego podemos usar con muchos tipos de datos concretos. En El Cairo, podemos usar genéricos al definir funciones, estructuras, enums, rasgos, implementaciones y métodos. En este capítulo, vamos a echar un vistazo a cómo utilizar eficazmente los tipos genéricos con todos ellos.
fr: Au Caire, nous pouvons utiliser des génériques pour définir des fonctions, des structures, des enums, des traits, des implémentations et des méthodes. Dans ce chapitre, nous allons examiner comment utiliser efficacement des types génériques avec tous.
id: Kami menggunakan generik untuk membuat definisi untuk deklarasi butir, seperti struct dan fungsi, yang kemudian dapat kita gunakan dengan berbagai tipe data konkrit. Di Kairo, kita dapat menggunakan generik ketika mendefinisikan fungsi, struktur, enum, sifat, implementasi, dan metode. Dalam bab ini, kita akan melihat bagaimana menggunakan tipe umum secara efektif dengan semua itu.
tr: Daha sonra birçok farklı beton veri türü ile kullanabileceğimiz yapı ve fonksiyonlar gibi ürün beyanları için tanımlamalar oluşturmak için jenerikleri kullanıyoruz. Kahire'de, fonksiyonları, yapıları, enumları, özellikleri, uygulamaları ve yöntemleri tanımlarken jenerikleri kullanabiliriz. Bu bölümde, jenerik tiplerin hepsiyle nasıl etkili bir şekilde kullanılacağına bir göz atacağız.
zh_cn: 我们使用通用术语来为项目申报设定定义,例如结构和功能,然后我们可以用许多不同的具体数据类型来使用这些定义。 在开罗,我们可以使用通用术语来定义功能、结构、单元、特性、执行和方法。 在本章中,我们将研究如何有效地使用通用类型和所有类型。

source: Generics allow us to write reusable code that works with many types, thus avoiding code duplication, while enhancing code maintainability.
es: Los genéricos nos permiten escribir código reutilizable que funciona con muchos tipos, evitando así la duplicación de código, al tiempo que mejora la mantenibilidad del código.
fr: Les génériques nous permettent d'écrire du code réutilisable qui fonctionne avec de nombreux types, évitant ainsi la duplication du code, tout en améliorant la maintenance du code.
id: Generik memungkinkan kita menulis kode yang dapat digunakan kembali yang bekerja dengan banyak tipe, dengan demikian menghindari duplikasi kode, sementara meningkatkan ketahanan kode.
tr: Jenerikler, birçok türle çalışan yeniden kullanılabilir kod yazmamıza izin verir, böylece kod çoğaltılmasından kaçınırken, kod bakımını artırır.
zh_cn: 通用代码使我们能够编写可重复使用的代码,该代码使用多种类型,从而避免代码重复,同时加强代码的可维护性。

source: Generic Functions
es: Funciones genéricas
fr: Fonctions génériques
id: Fungsi Generik
tr: Genel Fonksiyonlar
zh_cn: 通用函数

source: Making a function generic means it can operate on different types, avoiding the need for multiple, type-specific implementations. This leads to significant code reduction and increases the flexibility of the code.
es: Hacer una función genérica significa que puede operar en diferentes tipos, evitando la necesidad de múltiples implementaciones específicas de tipo. Esto conduce a una reducción significativa del código y aumenta la flexibilidad del código.
fr: Faire une fonction générique signifie qu'elle peut fonctionner sur différents types, évitant la nécessité d'implémentations multiples et spécifiques au type, ce qui entraîne une réduction significative du code et augmente la flexibilité du code.
id: Membuat sebuah fungsi generik berarti ia dapat beroperasi pada berbagai jenis, menghindari kebutuhan untuk berbagai, implementasi spesifik tipe. Hal ini menyebabkan pengurangan kode yang signifikan dan meningkatkan fleksibilitas kode.
tr: Bir fonksiyon jenerik yapmak, farklı türlerde çalışabileceği anlamına gelir, çoklu, tipe özgü uygulamalara ihtiyaç duyulmaz. Bu, önemli bir kod azalmasına yol açar ve kodun esnekliğini arttırır.
zh_cn: 使一项功能具有通用性意味着它可以在不同类型上运作,避免需要多重的、特定类型的实施,从而导致大量减少代码并增加代码的灵活性。

source: When defining a function that uses generics, we place the generics in the function signature, where we would usually specify the data types of the parameter and return value. For example, imagine we want to create a function which given two `Array` of items, will return the largest one. If we need to perform this operation for lists of different types, then we would have to redefine the function each time. Luckily we can implement the function once using generics and move on to other tasks.
es: Al definir una función que utiliza genéricos, colocamos los genéricos en la firma de la función, donde normalmente especificaríamos los tipos de datos del parámetro y el valor de retorno. Por ejemplo, imaginemos que queremos crear una función que da dos `Array` de elementos, devolverá el más grande. Si necesitamos realizar esta operación para listas de diferentes tipos, entonces tendríamos que redefinir la función cada vez. Afortunadamente podemos implementar la función una vez que use genéricos y pasar a otras tareas.
fr: Lors de la définition d'une fonction qui utilise des génériques, nous plaçons les génériques dans la signature de la fonction, où nous spécifions habituellement les types de données du paramètre et la valeur de retour. Par exemple, imaginons que nous voulons créer une fonction qui a donné deux `Array` d'éléments, retournera la plus grande. Si nous avons besoin d'effectuer cette opération pour des listes de différents types, alors nous devrions redéfinir la fonction à chaque fois. Heureusement, nous pouvons implémenter la fonction une fois que nous utilisons des génériques et passer à d'autres tâches.
id: Ketika kita biasanya menentukan tipe data dari parameter dan nilai kembali. misalnya, bayangkan kita ingin membuat sebuah fungsi yang diberikan dua array pada item, akan mengembalikan yang terbesar. jika kita perlu melakukan operasi ini untuk daftar jenis yang berbeda, maka kita harus mendefinisikan ulang fungsi setiap saat. Untungnya kita dapat mengimplementasikan fungsi menggunakan generik dan bergerak ke tugas lain.
tr: Jenerikleri kullanan bir fonksiyon tanımlarken, jenerikleri genellikle parametrenin veri türlerini ve dönüş değerini belirleyeceğimiz işlev imzasına yerleştiririz. Örneğin, iki Array öğesi verilen, en büyük olanı döndürecek bir işlev oluşturmak istediğimizi hayal edin. Bu işlemi farklı türlerdeki listeler için gerçekleştirmemiz gerekirse, her seferinde işlevi yeniden tanımlamamız gerekir. Neyse ki, jenerikleri kullanarak işlevi uygulayabilir ve diğer görevlere geçebiliriz.
zh_cn: 当定义一个使用非专利的函数时,我们会在函数签名中放置非通用函数, 我们通常会在此指定参数和返回值的数据类型。 例如, 想象我们想要创建一个函数, 给两个“ 阵列” 项带来两个“ 阵列”, 返回最大的函数。 如果我们需要为不同类型的列表执行此操作, 那么我们就必须每次重新定义该函数。 幸运的是, 我们一旦使用通用参数和返回值执行该函数, 就可以执行其他任务 。

source: // Specify generic type T between the angulars
es: // Especifique el tipo genérico T entre los ángulos angulares
fr: // Spécifier le type générique T entre les angulaires
id: // Spesifikasikan tipe generik T diantara angular
tr: // Açısallar arasında genel tip T belirtin
zh_cn: / 指定方形之间的通用类型 T

source: // There is no need to specify the concrete type of T because // it is inferred by the compiler
es: // No hay necesidad de especificar el tipo concreto de T porque // es inferido por el compilador
fr: // Il n'est pas nécessaire de spécifier le type de béton de T car // il est déduit par le compilateur
id: //Tidak perlu untuk menspesifikasikan tipe beton dari T karena // itu diferred oleh kompiler
tr: // T'nin beton türünü belirtmeye gerek yoktur çünkü // derleyici tarafından çıkarımlanır
zh_cn: / 没有必要具体说明T的具体类型,因为 / / 是由汇编者推断的

source: The `largest_list` function compares two lists of the same type and returns the one with more elements and drops the other. If you compile the previous code, you will notice that it will fail with an error saying that there are no traits defined for dropping an array of a generic type. This happens because the compiler has no way to guarantee that an `Array<T>` is droppable when executing the `main` function. In order to drop an array of `T`, the compiler must first know how to drop `T`. This can be fixed by specifying in the function signature of `largest_list` that `T` must implement the `Drop` trait. The correct function definition of `largest_list` is as follows:
es: La función `largest_list` compara dos listas del mismo tipo y devuelve la una con más elementos y suelta la otra. Si compila el código anterior, notará que fallará con un error que dice que no hay rasgos definidos para soltar un array de un tipo genérico. Esto sucede porque el compilador no tiene forma de garantizar que un `Array<T® sea droppable al ejecutar la función `main`. Para eliminar un array de `T`, el compilador debe saber primero cómo soltar `T`. Esto se puede arreglar especificando en la firma de la función `largest_list` que `T` debe implementar el rasgo `Drop`. La definición correcta de función de `largest_list` es la siguiente:
fr: Si vous compilez le code précédent, vous remarquerez qu'il échouera avec une erreur en disant qu'il n'y a pas de traits définis pour la suppression d'un tableau d'un type générique. Cela se produit parce que le compilateur n'a aucun moyen de garantir qu'un `Array<T>` est droppable lors de l'exécution de la fonction `main`. Afin de laisser tomber un tableau de `T`, le compilateur doit d'abord savoir comment déposer `T`. Ceci peut être corrigé en spécifiant dans la signature de la fonction `plus important_list` que `T` doit implémenter le trait `Drop`. La définition correcte de la fonction `plus important_list` est la suivante:
id: Fungsi pembesaran_list_terbesar membandingkan dua daftar dengan jenis umum yang sama. Hal ini terjadi karena kompiler tidak memiliki cara untuk menjamin bahwa array <T> akan droppable ketika menjalankan fungsi Áy. Dalam rangka untuk menjatuhkan array \t.
tr: biggest_list işlevi, aynı türdeki iki listeyi karşılaştırır ve birini daha fazla elemanla döndürür ve diğerini düşürür. Önceki kodu derlerseniz, bir jenerik türün dizisini düşürmek için tanımlanmış hiçbir özellik olmadığını söyleyerek bir hata ile başarısız olacağını fark edeceksiniz. Bu, derleyicinin ArrayT> dizininin çalıştırılması sırasında main fonksiyonunun nasıl düzeltileceğini garanti etmenin bir yolu olmadığı için olur.
zh_cn: `最大列表'函数比较了同一类型的两个列表, 返回了含有更多元素的列表, 并击落了另一个。 如果您编译了上一个代码, 您将会注意到它会因错误而失败, 错误中说没有为丢弃一个通用类型的阵列而定义特性。 发生这种情况的原因是, 编译者无法保证在执行“ 主要” 函数时“ Array< T” 是可下载的 。 为了投下一个` T'的阵列, 编译者必须首先知道如何丢弃` T'。 这可以通过在` 最大列表'函数的函数签名中指定` T'必须执行` Drop' 特性。 “ 大列表” 的正确功能定义如下:
