Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Note that in some languages and test frameworks, the parameters for equality assertion functions are called `expected` and `actual`, and the order in which we specify the arguments matters. However, in Cairo, they’re called `left` and `right`, and the order in which we specify the value we expect and the value the code produces doesn’t matter. We could write the assertion in this test as `assert_eq!(add_two(2), 4)`, which would result in the same failure message that displays `` assertion failed: `(left == right)` ``.
es: Tenga en cuenta que en algunos idiomas y marcos de prueba, los parámetros para las funciones de afirmación de la igualdad se llaman `esperados` y `reales`, y el orden en el que especificamos los argumentos importa. Sin embargo, en El Cairo, se llaman `izquierda` y `derecha`, y el orden en el que especificamos el valor que esperamos y el valor que produce el código no importa. Podríamos escribir la afirmación en esta prueba como `assert_eq!(add_dos(2), 4)`, que daría lugar al mismo mensaje de fallo que muestra `` la afirmación falló: `(izquierda == derecha)` ``.
fr: Notez que dans certains langages et cadres de test, les paramètres des fonctions d'affirmation de l'égalité sont appelés `attendu` et `actual`, et l'ordre dans lequel nous spécifions les arguments est important. Cependant, au Caire, ils sont appelés `left` et `right`, et l'ordre dans lequel nous spécifions la valeur que nous attendons et la valeur produite par le code n'a pas d'importance. Nous pourrions écrire l'affirmation dans ce test comme `assert_eq!(add_two(2), 4)`, ce qui entraînerait le même message d'échec qui afficherait `` assertion échouée: `(left=right)```.
id: Perhatikan bahwa dalam beberapa bahasa dan kerangka kerja tes, parameter untuk penilaian kesetaraan disebut sebagai fungsi yang kita harapkan, dan urutan di mana kita menyatakan nilai yang kita harapkan dan nilai yang dihasilkan kode tidak penting.
tr: Bazı dillerde ve test çerçevelerinde, eşitlik iddia işlevleri için parametrelere beklenen ve actual denir ve argümanları belirttiğimiz sıra önemlidir. Bununla birlikte, Kahire'de, left ve right olarak adlandırılırlar ve beklediğimiz değeri ve kodun ürettiği değeri belirttiğimiz sıranın bir önemi yoktur. Bu testte iddiayı add_e olarak yazabiliriz.
zh_cn: 请注意,在某些语言和测试框架中,平等主张功能的参数被称为`预期的'和`实际的',以及我们具体说明争论事项的顺序,然而,在开罗,这些参数被称为`左'和`右 ',以及我们具体说明我们期望的价值和代码产生的价值的顺序并不重要。 我们可以将这一测试中的主张写成`assert_eq!(add_2(2),4) ',这将导致与显示“断言失败”的失败信息相同:`(left = right)`。

source: Here is a simple example comparing two structs, showing how to use `assert_eq!` and `assert_ne!` macros:
es: Aquí hay un ejemplo simple comparando dos structs, mostrando cómo usar macros `assert_eq!` y `assert_ne!`:
fr: Voici un exemple simple comparant deux structures, montrant comment utiliser les macros `assert_eq!` et `assert_ne!`:
id: Berikut ini adalah contoh sederhana membandingkan dua struktur, menunjukkan bagaimana menggunakan macro:
tr: assert_eq! ve assert_ne! makrolarının nasıl kullanılacağını gösteren iki yapıtı karşılaştıran basit bir örnek:
zh_cn: 以下是比较两个支架的简单例子,显示如何使用`assrt_eq!'和`assrt_ne!'宏:

source: "{:?},{:?} should be equal"
es: " {:?}, {:?} debe ser igual"
fr: "{:?},{:?} devrait être égal"
id: "{:?,"{:?} seharusnya sama"
tr: ":,: eşit olmalı"
zh_cn: {{:}}{{}}}应该平等。}

source: "{:?},{:?} should not be equal"
es: "No debe ser igual"
fr: "{:?},{:?} ne devrait pas être égal"
id: "{:?},{:?} tidak boleh sama"
tr: ":,: eşit olmamalı"
zh_cn: "{{:}}{{}}}不应该是平等的。"

source: Under the surface, `assert_eq!` and `assert_ne!` macros use the operators `==` and `!=`, respectively. They both take snapshots of values as arguments. When the assertions fail, these macros print their arguments using debug formatting (`{:?}` syntax), which means the values being compared must implement `PartialEq` and `Debug` traits. All primitive types and most of the core library types implement these traits. For structs and enums that you define yourself, you’ll need to implement `PartialEq` to assert equality of those types. You’ll also need to implement `Debug` to print the values when the assertion fails. Because both traits are derivable, this is usually as straightforward as adding the `#[derive(Drop, Debug, PartialEq)]` annotation to your struct or enum definition. See [Appendix C](./appendix-03-derivable-traits.md) for more details about these and other derivable traits.
es: Bajo la superficie, `assert_eq!` y `assert_ne!` macros utilizan los operadores `== y `!=, respectivamente. Ambos toman instantáneas de los valores como argumentos. Cuando las afirmaciones fallan, estas macros imprimen sus argumentos usando el formato de depuración (:? sintaxis), lo que significa que los valores que se comparan deben implementar rasgos `PartialEq` y `Debug`. Todos los tipos primitivos y la mayoría de los tipos de bibliotecas centrales implementan estos rasgos. Para las estructuras y enums que usted mismo define, necesitará implementar `PartialEq` para afirmar la igualdad de esos tipos. También necesitará implementar `Debug` para imprimir los valores cuando falla la afirmación. Debido a que ambos rasgos son derivables, esto suele ser tan sencillo como añadir los `derive(Drop, Debug, ParcialEq)` anotación a su definición de estructura o enum. Véase [Appendix C](./appendix-03-derivable-traits.m) para obtener más detalles.
fr: Sous la surface, les macros `assert_eq!` et `assert_ne!` utilisent les opérateurs `==` et `!=`, respectivement. Ils prennent tous deux des instantanés de valeurs comme arguments. Lorsque les affirmations échouent, ces macros impriment leurs arguments en utilisant le formatage de débogage (`{:?}` syntaxe), ce qui signifie que les valeurs comparées doivent implémenter les caractères `PartialEq` et `Debug`. Tous les types primitifs et la plupart des types de bibliothèque de base implémentent ces caractères. Pour les structures et les enums que vous définissez vous-même, vous devrez implémenter `PartialEq` pour affirmer l'égalité de ces types. Vous devrez également implémenter `Debug` pour imprimer les valeurs lorsque l'affirmation échoue.
id: Di bawah permukaan, misasert_eq! dan macros menampilkan argumen mereka dengan formattasi debug ({:}, yang berarti nilai-nilai yang sedang dibandingkan harus mengimplementasikan ÁPartialEq dan <debug sifat-sifat dasar dan sebagian besar tipe perpustakaan dasar yang mengimplementasikan sifat-sifat ini. Untuk struktur dan enums bahwa anda perlu untuk mengimplementasikan nilai-nilai tersebut. Anda juga perlu untuk mengimplementasikan nilai-nilai tersebut.
tr: Yüzeyin altında, assert_eq! ve assert_ne! makroları, sırasıyla bu [==] ve!= tarayıcı özelliklerini kullanmak için bu iki değerin anlık görüntülerini argüman olarak alır. İddialar başarısız olduğunda, bu makrolar argümanlarını hata ayıklama biçimlendirmesi (: sözdizimi) kullanarak yazdırır, bu da karşılaştırılan değerlerin PartialEq ve Hata ayıklama özellikleri uygulamak zorunda olduğu anlamına gelir.
zh_cn: 在表面之下,`Assert_eq!'和`Assert_eq.'和`Assert_ne!'宏分别使用操作员'和'{}\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"Assert_eq\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: `assert_lt!`, `assert_le!`, `assert_gt!` and `assert_ge!` Macros
es: `assert_lt!`, `assert_le!`, `assert_gt!` y `assert_ge!` Macros
fr: `assert_lt!`, `assert_le!`, `assert_gt!` et `assert_ge!` Macros
id: Asosert_lt!, sassert_le!, sacsert_gt! dan scarsert_ge!
tr: assert_lt!, assert_le!, assert_gt! ve assert_ge! Makrolar
zh_cn: `assrt_lt!'、`assrt_le!'、`assrt_gt!'和`assrt_ge!'宏

source: Comparisons in tests can be done using the `assert_xx!` macros:
es: Las comparaciones en las pruebas se pueden hacer usando las macros `assert_xx!`:
fr: Les comparaisons dans les tests peuvent être faites en utilisant les macros `assert_xx!`:
id: Pembandingan dalam tes dapat dilakukan dengan menggunakan makro ·assert_xx!
tr: Testlerdeki karşılaştırmalar assert_xx! makroları kullanılarak yapılabilir:
zh_cn: 可以用`assirt_xx!' 宏进行测试比较:

source: `assert_lt!` checks if a given value is lower than another value, and reverts otherwise.
es: `assert_lt!` comprueba si un valor dado es menor que otro valor, y revierte lo contrario.
fr: `assert_lt!` vérifie si une valeur donnée est inférieure à une autre valeur, et revient autrement.
id: Periksa apakah nilai yang diberikan lebih rendah dari nilai lain, dan kembali sebaliknya.
tr: assert_lt! belirli bir değerin başka bir değerden daha düşük olup olmadığını kontrol eder ve aksi takdirde geri döner.
zh_cn: `assirt_lt!' 检查给定值是否低于另一个值,并反转其他值。

source: `assert_le!` checks if a given value is lower or equal than another value, and reverts otherwise.
es: `assert_le!` comprueba si un valor dado es inferior o igual a otro valor, y revierte lo contrario.
fr: `assert_le!` vérifie si une valeur donnée est inférieure ou égale à une autre valeur, et revient autrement.
id: Periksa apakah nilai yang diberikan lebih rendah atau sama dengan nilai lain, dan kembali sebaliknya.
tr: assert_le! belirli bir değerin başka bir değerden daha düşük veya eşit olup olmadığını kontrol eder ve aksi takdirde geri döner.
zh_cn: `assrt_le!'检查给定价值是否低于或等于其他价值,并反弹。

source: `assert_gt!` checks if a given value is greater than another value, and reverts otherwise.
es: `assert_gt!` comprueba si un valor dado es mayor que otro valor, y revierte lo contrario.
fr: `assert_gt!` vérifie si une valeur donnée est supérieure à une autre valeur, et revient autrement.
id: pemeriksaan jika nilai yang diberikan lebih besar dari nilai lain, dan kembali sebaliknya.
tr: assert_gt! belirli bir değerin başka bir değerden büyük olup olmadığını kontrol eder ve aksi takdirde geri döner.
zh_cn: `assrt_gt!'检查给定值是否大于其他值,然后反转。

source: `assert_ge!` checks if a given value is greater or equal than another value, and reverts otherwise.
es: `assert_ge!` comprueba si un valor dado es mayor o igual que otro valor, y revierte lo contrario.
fr: `assert_ge!` vérifie si une valeur donnée est supérieure ou égale à une autre valeur, et revient autrement.
id: Periksa apakah nilai yang diberikan lebih besar atau sama dengan nilai lain, dan kembali sebaliknya.
tr: assert_ge! belirli bir değerin başka bir değerden daha büyük veya eşit olup olmadığını kontrol eder ve aksi takdirde geri döner.
zh_cn: `assirt_ge!'检查给定价值是否大于或等于其他价值,并反弹。

source: Listing 10-6 demonstrates how to use these macros:
es: El listado 10-6 demuestra cómo usar estas macros:
fr: La liste 10-6 montre comment utiliser ces macros :
id: Daftar 10-6 menunjukkan bagaimana menggunakan macro ini:
tr: Listeleme 10-6, bu makroların nasıl kullanılacağını gösterir:
zh_cn: 列表 10-6 演示如何使用这些宏:

source: "{:?},{:?} should be lower or equal"
es: "{:?},{:?} debe ser más bajo o igual"
fr: "{:?},{:?} devrait être inférieur ou égal"
id: "{:?},{:?} seharusnya lebih rendah atau sama"
tr: ":,: daha düşük veya eşit olmalıdır"
zh_cn: "{{:}}{{}}}应该更低或相等"

source: <span class="caption">Listing 10-6: Example of tests that use the `assert_xx!` macros for comparisons</span>
es: <span class="caption">Lista 10-6: Ejemplo de pruebas que utilizan las macros `assert_xx!` para comparaciones</span>
fr: <span class="caption">Liste 10-6: Exemple de tests utilisant les macros `assert_xx!` pour les comparaisons</span>
id: <span class="caption">Listing 10-6: Contoh dari tes yang menggunakan <assert_xx! macros untuk perbandingan</span>
tr: span class="caption">Liste 10-6: Karşılaştırmalar için assert_xx! makrolarını kullanan testlerin örneği/span>
zh_cn: <span类=“caption” > listing 10-6:使用`assirt_xx!'`宏比较 </span>的测试示例

source: In this example, we roll a `Dice` struct multiple times and compare the results. We need to manually implement the `PartialOrd` trait for our struct so that we can compare `Dice` instances with `lt`, `le`, `gt` and `ge` functions, which are used by `assert_lt!`, `assert_le!`, `assert_gt!` and `assert_ge!` macros, respectively. We also need to derive the `Copy` trait on our `Dice` struct to use the instantiated structs multiple times, as the comparison functions take ownership of the variables.
es: En este ejemplo, lanzamos una estructura de " dados " varias veces y comparamos los resultados. Necesitamos poner en práctica manualmente el rasgo " PartialOrd " para nuestra estructura, de modo que podamos comparar las instancias de " dados " con " lt ", " le ", " gt " y "ge ", que son utilizadas por " assert_lt ", " assert_le! ", " assert_gt! " y " assert_ge! " macros, respectivamente. También necesitamos derivar el rasgo " Copy " en nuestra estructura de " dados " para utilizar las estructuras instantáneas varias veces, ya que las funciones de comparación se hacen cargo de las variables.
fr: Nous devons implémenter manuellement le caractère `PartialOrd` pour notre structure afin que nous puissions comparer les instances `Dice` avec les macros `lt`, `le`, `gt` et `ge`, qui sont utilisées par `assert_lt!`, `assert_le!`, `assert_gt!` et `assert_ge!` respectivement. Nous devons également dériver le caractère `Copy` sur notre structure `Dice` pour utiliser les structures instantanées à plusieurs reprises, car les fonctions de comparaison prennent la propriété des variables.
id: Dalam contoh ini, kita dapat membanding-bandingkannya berulang kali dan membandingkan hasilnya. kita perlu mengimplementasikannya secara manual, yang digunakan secara manual oleh ·aster_lt!, scuasert_le!, assert_gt! dan assert_ge! kita juga perlu mendapatkan fungsi-fungsi yang kita butuhkan untuk mengoplabeli dalam kondisi yang lebih cepat, untuk menggunakan fungsi pengumpamaan yang berbeda, sebagai variabel pembanding.
tr: Bu örnekte, sırasıyla bir Dice struct'ı birden fazla kez yuvarlayıp sonuçları karşılaştırıyoruz. Dice örneklerini lt, le, gt ve ge fonksiyonlarıyla karşılaştırabilmemiz için PartialOrd özelliğini manuel olarak uygulamamız gerekiyor! assert_lt!, assert_leg tarafından kullanılan Dice, ,
zh_cn: 在这个例子中,我们滚动了`Dice'多次支架并比较结果,我们需要手动执行`Partial Ord' 特性,以便我们能够将`Dice'实例与`lt'、`le'、`gt'和`ge'功能进行比较,这些功能被`assrt_lt!'、`assrt_le!'、`assirt_gt!'和`assirt_ge!' 宏大分别使用。我们还需要从我们的`Dice'中获取`Copy'特性,以便使用即时支架多次,因为比较功能要掌握变量的所有权。

source: Adding Custom Failure Messages
es: Añadir mensajes de fallo personalizados
fr: Ajout de messages d'échec personnalisés
id: Menambahkan Pesan Kegagalan Kustom
tr: Özel Hata Mesajları Ekleme
zh_cn: 添加自定义失败消息

source: You can also add a custom message to be printed with the failure message as optional arguments to `assert!`, `assert_eq!`, and `assert_ne!` macros. Any arguments specified after the required arguments are passed along to the `format!` macro (discussed in the [Printing](./ch11-08-printing.md#formatting) chapter), so you can pass a format string that contains `{}` placeholders and values to go in those placeholders. Custom messages are useful for documenting what an assertion means; when a test fails, you’ll have a better idea of what the problem is with the code.
es: También puede añadir un mensaje personalizado para ser impreso con el mensaje de fallo como argumentos opcionales a `asertar!`, `assert_eq!`, y `assert_ne!` macros. Cualquier argumento especificado después de que los argumentos requeridos se pasan a lo largo de la macro `format!` (discutido en el capítulo [Imprimir](./ch11-08-printing.md#formatting), por lo que puede pasar una cadena de formato que contiene marcadores de posición y valores para ir en esos marcadores de posición. Los mensajes personalizados son útiles para documentar lo que significa una afirmación; cuando una prueba falla, tendrá una mejor idea de cuál es el problema con el código.
fr: Vous pouvez également ajouter un message personnalisé à imprimer avec le message d'échec en tant qu'argument optionnel à `assert!`, `assert_eq!` et `assert_ne!` macros. Tout argument spécifié après le passage des arguments requis à la macro `format!` (discuté dans le chapitre [Imprimer](./ch11-08-printing.md#formatting), de sorte que vous pouvez passer une chaîne de format qui contient `{}` placeholders et valeurs pour aller dans ces placeholders. Les messages personnalisés sont utiles pour documenter ce que signifie une assertion; quand un test échoue, vous aurez une meilleure idée du problème avec le code.
id: Anda juga dapat menambahkan pesan kustom untuk dicetak dengan pesan kegagalan sebagai argumen opsional untuk ·assert!, ·assert_eq!, dan macros. Argumen apa pun yang ditentukan setelah argumen yang diperlukan diteruskan ke ▪format! makro (mengalami di [Prinsi]dian] Valentina. /ch11-08-printing.mdformatting), sehingga Anda dapat melewatkan format string yang berisi pemegang dan nilai-nilai yang ada di tempat tersebut.
tr: Ayrıca assert!, assert_eq!, ve assert_ne! makrolarına isteğe bağlı argümanlar olarak hata mesajı ile basılacak özel bir mesaj ekleyebilirsiniz. Gerekli argümanlardan sonra belirtilen herhangi bir argüman format! makrosu ([Yazdırma] için özel bir kod kullanılırken, bu satırları kullanabilirsiniz.
zh_cn: 您也可以在“ assrt! ” 、 “assrt_eq!” 和“assrt_ne!” 宏中添加一个用失败信息打印的自定义电文,作为“assrt!” 、 “assrt_eq!” 和“assrt_ne!” 宏。在必要参数之后指定的任何参数都传递到“format!” 宏(在 [printing] (./ch11-08-printing.md#formatting) 章中讨论), 这样您就可以通过一个包含 占位符和值的格式字符串, 以在这些占位符中输入。 自定义电文有助于记录一个声明的含义; 当测试失败时, 您将更清楚地了解代码的问题是什么 。

source: Let’s add a custom failure message composed of a format string with a placeholder filled in with the actual value we got from the `add_two` function:
es: Agreguemos un mensaje de fallo personalizado compuesto de una cadena de formato con un marcador de posición lleno con el valor real que obtuvimos de la función `add_two`:
fr: Laissez-nous ajouter un message d'échec personnalisé composé d'une chaîne de format avec un détenteur de place rempli avec la valeur réelle que nous avons obtenue de la fonction `add_two`:
id: Mari kita tambahkan pesan kegagalan gubahan yang terdiri dari sebuah string format dengan pemegang tempat yang diisi dengan nilai sebenarnya yang kita dapatkan dari fungsi ·add_two:
tr: add_two işlevinden aldığımız gerçek değerle dolu bir yer tutucuya sahip bir format dizgesinden oluşan özel bir başarısızlık mesajı ekleyelim:
zh_cn: 让我们添加由格式字符串组成的自定义失败信息,其中含有一个占位符,以我们从`add_ two' 函数中获得的实际值填充:

source: "Expected {}, got add_two(2)={}"
es: "Especulado, tiene add_two(2)="
fr: "Expecté {}, obtenu add_two(2)={}"
id: "Diduga {}, diperoleh add_two Nabina2)={}"
tr: "Beklenen, add_two(2)="
zh_cn: "预期...,加了两(2)..."

source: Now when we run the test, we’ll get a more informative error message:
es: Ahora, cuando ejecutemos la prueba, obtendremos un mensaje de error más informativo:
fr: Maintenant, quand nous faisons le test, nous allons obtenir un message d'erreur plus informatif:
id: Sekarang ketika kita menjalankan tes, kita akan mendapatkan pesan kesalahan yang lebih informatif:
tr: Şimdi testi çalıştırdığımızda, daha bilgilendirici bir hata mesajı alacağız:
zh_cn: 当我们进行测试时, 我们将会收到更多信息错误信息:

source: ```shell $ scarb cairo-test testing adder ... running 1 test test adder::tests::it_adds_two ... fail (gas usage est.: 590230) failures: adder::tests::it_adds_two - Panicked with "assertion `4 == add_two(2)` failed: Expected 4, got add_two(2)=5 4: 4 add_two(2): 5". Error: test result: FAILED. 0 passed; 1 failed; 0 ignored ```
es: Error: resultado de la prueba: FAILED. 0 pasado; 1 fallado; 0 ignorado
fr: ``shell $ écharpe cairo-test test adder... exécutant 1 test adder::tests::it_adds_two... fail (utilisation de gaz est.: 590230) échecs: adder::tests::it_adds_two - Panicked avec "affirmation `4 == add_two(2)` échoué: Attendu 4, obtenu add_two(2)=5 4: 4 add_two(2): 5". Erreur: résultat du test: FAILED. 0 passé; 1 échoué; 0 ignoré ```
id: ·shell $ scarbs cairo-test test adder... berjalan 1 test adder::::it_adds_t_wo... gagal (gas penggunaan est.: 590230) kegagalan: adder::::test::: it_adds_t_dua -paniked dengan "assertion {2) == added_t_t2): Diduga 4, gott_two_2)=5. Error: hasil test: FAIED. 0; 0; 0; diabaikan 0; 0;
tr: shell $ scarb cairo-test test adder... çalışan 1 test adder::tests::it_adds_two... başarısız (gaz kullanımı est.: 590230) başarısız::tests:::it_adds_two - Panicked with "asertion 4 == add_two(2); başarısız oldu: Beklenen 4, alındı add_two(2)=5 4: add_two(2)".
zh_cn: 贝壳 $ carb cairo 测试添加器... 运行 1 个测试添加器 : 测试 :: 测试 : it_ adds_ two... 失败 (气体使用率 : 590230 ) 失败 : 添加 : 测试 : 测试 : it_ adds_ two - 被“ assertion'4 ” 困扰 : 添加 _ 2 (2) 失败 : 预测 4 添加 _ 2 (2)= 5 : 4 添加_ 2 (2): 5 错误 : 测试结果 : FAILED. 0 passed; 1 失败; 0 忽略 *

source: We can see the value we actually got in the test output, which would help us debug what happened instead of what we were expecting to happen.
es: Podemos ver el valor que realmente obtuvimos en la salida de prueba, lo que nos ayudaría a depurar lo que pasó en lugar de lo que esperábamos que sucediera.
fr: Nous pouvons voir la valeur que nous avons effectivement obtenue dans la sortie de test, ce qui nous aiderait à déboguer ce qui s'est passé au lieu de ce que nous nous attendions à ce qu'il se passe.
id: Kita dapat melihat nilai yang sebenarnya kita dapatkan di output tes, yang akan membantu kita men-debug apa yang terjadi bukan apa yang kita harapkan akan terjadi.
tr: Test çıktısında gerçekten aldığımız değeri görebiliriz, bu da olmasını beklediğimiz şey yerine olanları hata ayıklamamıza yardımcı olur.
zh_cn: 我们可以看到我们实际在测试输出中得到的价值, 这将有助于我们调试所发生的事情, 而不是我们预期会发生的事情。

source: Checking for panics with `should_panic`
es: Comprobando si hay pánico con ` should_panic`
fr: Vérifier les paniques avec `should_panic`
id: Memeriksa kepanikan dengan seharusnya_panik
tr: should_panic ile panik olup olmadığını kontrol edin
zh_cn: 与`应该'的`西班牙'检查惊慌症

source: In addition to checking return values, it’s important to check that our code handles error conditions as we expect. For example, consider the `Guess` type in Listing 10-7:
es: Además de comprobar los valores de retorno, es importante comprobar que nuestro código maneja las condiciones de error como esperamos. Por ejemplo, considere el tipo `Guess` en el listado 10-7:
fr: En plus de vérifier les valeurs de retour, il est important de vérifier que notre code gère les conditions d'erreur comme nous nous y attendons. Par exemple, considérez le type `Guess` dans Listing 10-7:
id: Selain memeriksa nilai kembali, penting untuk memeriksa kode kami menangani kondisi kesalahan seperti yang kita harapkan.
tr: İade değerlerini kontrol etmenin yanı sıra, kodumuzun hata koşullarını beklediğimiz gibi ele alıp almadığını kontrol etmek önemlidir. Örneğin, Listeleme 10-7'deki Guess tipini göz önünde bulundurun:
zh_cn: 除了检查返回值之外,还必须检查我们的代码是否按照预期处理错误条件。例如,在列出 10-7 中考虑“建议”类型:

source: "Guess must be >= 1 and <= 100"
es: "La incógnita debe ser > 1 y < = 100"
fr: "La guesse doit être >= 1 et <= 100"
id: "Tebak harus >= 1 dan <= 100"
tr: "Guess olmalıdır>= 1 ve = 100"
zh_cn: Guess must be 1 and 100" "guess must be 1 and 100"

source: <span class="caption">Listing 10-7: `Guess` struct and its `new` method</span>
es: <span class="caption">Lista 10-7: `Guess` struct y su método `nuevo`</span>
fr: <span class="caption">Liste 10-7: "Guess` struct and its `new` method</span>
id: <span class="caption">Listing 10-7: "Guess," struct dan metode baru </span>
zh_cn: <span类=“Caption” > listing 10-7:`Guess`struct及其`新'方法</span>
