Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: As you can see, the "classic" dispatcher is just a struct that wraps a contract address and implements the `DispatcherTrait` generated by the compiler, allowing us to call functions from another contract. This means that we can instantiate a struct with the address of the contract we want to call, and then simply call the functions defined in the interface on the dispatcher struct as if they were methods of that type.
es: Como se puede ver, el despachador "clásico" es sólo una estructura que envuelve una dirección de contrato e implementa el `DispatcherTrait` generado por el compilador, lo que nos permite llamar funciones de otro contrato. Esto significa que podemos instanciar una estructura con la dirección del contrato que queremos llamar, y luego simplemente llamar a las funciones definidas en la interfaz en la estructura de despachador como si fueran métodos de ese tipo.
fr: Comme vous pouvez le voir, le répartiteur "classique" n'est qu'une structure qui enveloppe une adresse de contrat et implémente le `DispatcherTrait` généré par le compilateur, nous permettant d'appeler des fonctions d'un autre contrat. Cela signifie que nous pouvons activer une structure avec l'adresse du contrat que nous voulons appeler, puis simplement appeler les fonctions définies dans l'interface sur le répartiteur struct comme s'il s'agissait de méthodes de ce type.
id: Seperti yang Anda lihat, dispatcher "classic" hanya sebuah struktur yang membungkus alamat kontrak dan menerapkan dispatcherTrait yang dihasilkan oleh kompiler, memungkinkan kita untuk memanggil fungsi dari kontrak lain. Ini berarti bahwa kita dapat mengaktifkan struktur dengan alamat kontrak kita ingin menelepon, dan kemudian hanya panggilan fungsi didefinisikan dalam antarmuka dispender struktur seolah-olah mereka adalah metode tipe itu.
tr: Gördüğünüz gibi, "klasik" gönderici sadece bir sözleşme adresini saran ve derleyici tarafından oluşturulan DispatcherTrait'i uygulayan, başka bir sözleşmeden fonksiyonları çağırmamızı sağlayan bir yapıdır. Bu, aramak istediğimiz sözleşmenin adresiyle bir yapıyı hazırlayabileceğimiz anlamına gelir ve daha sonra basitçe, gönderici yapıdaki arayüzde tanımlanan işlevleri, yöntemlerden biriymiş gibi adlandırabiliriz.
zh_cn: 如你所见, “ 古典” 调度器只是包裹合同地址和执行编译器产生的“ DispattercherTrait” 的支架, 允许我们从另一个合同中调用函数。 这意味着我们可以用我们所要调用的合同地址即时调用一个支架, 然后简单地调用调度器支架上接口中定义的功能, 仿佛它们是这种类型的方法。

source: It's also worthy of note that all these are abstracted behind the scenes thanks to the power of Cairo plugins.
es: También es digno de notar que todos estos se abstraen detrás de las escenas gracias al poder de los plugins de El Cairo.
fr: Il est également digne de noter que tous ces sont abstraits dans les coulisses grâce à la puissance des plugins du Caire.
id: Hal ini juga layak dicatat bahwa semua ini abstrak di belakang layar berkat kekuatan plugin Kairo.
tr: Ayrıca tüm bunların Kahire eklentilerinin gücü sayesinde sahne arkasında soyutlandığını da belirtmek gerekir.
zh_cn: 由于开罗插件的力量, 这些都是在幕后抽象的。

source: Calling Contracts using the Contract Dispatcher
es: Llamar a contratos utilizando el despachador de contratos
fr: Appel de contrats en utilisant le répartiteur de contrats
id: Memanggil Kontrak menggunakan Dispatcher Kontrak
tr: Sözleşme dağıtıcısını kullanarak Sözleşmeleri çağırmak
zh_cn: 使用合同调度员的通话合同

source: This is an example of a contract named `TokenWrapper` using a dispatcher to call functions defined on an ERC-20 token. Calling `transfer_token` will modify the state of the contract deployed at `contract_address`.
es: Este es un ejemplo de un contrato llamado `TokenWrapper` que utiliza un despachador para llamar a las funciones definidas en un token ERC-20. Llamar a `transfer_token` modificará el estado del contrato desplegado en `contract_address`.
fr: Il s'agit d'un exemple de contrat nommé `TokenWrapper` utilisant un répartiteur pour appeler des fonctions définies sur un jeton ERC-20. Appeler `transfer_token` modifiera l'état du contrat déployé à `contract_address`.
id: Ini adalah contoh dari sebuah kontrak bernama 'TokenWrapper' menggunakan sebuah operator untuk memanggil fungsi yang didefinisikan pada ERC-20 token.
tr: Bu, TokenWrapper adlı bir sözleşmenin bir ERC-20 belirteci üzerinde tanımlanan işlevleri çağırmak için bir gönderici kullanarak bir örneğidir. transfer_token çağrısı, contract_address adresinde konuşlandırılan sözleşmenin durumunu değiştirecektir.
zh_cn: 这是名为`TokenWrapper'的合同的一个实例,它利用调度员调用ECR-20牌上界定的功能,调用`移交'将改变在`合同地址'上部署的合同状况。

source: //**** Specify interface here ****//
es: //**** Especifique la interfaz aquí ****//
fr: //**** Spécifier l'interface ici ****//
id: /**** Nyatakan antarmuka di sini ****/ /
tr: //**** Burada arayüz belirtin ***//
zh_cn: /**** 指定在此的接口*******//

source: <span class="caption">Listing 15-3: A sample contract which uses the Contract Dispatcher.</span>
es: <span class="caption">Lista 15-3: Un contrato de muestra que utiliza el Despacho de Contrato.</span>
fr: <span class="caption">Liste 15-3: Un exemple de contrat qui utilise le régulateur de contrat.</span>
id: <span class="caption">Listing 15-3: Sebuah contoh kontrak yang menggunakan Dispatcher Kontrak.</span>
tr: span class="caption="Listing 15-3: Contract Dispatcher kullanan bir örnek sözleşme./span>
zh_cn: <span类=“Caption” > listing 15-3:使用合同调度员的样本合同。 </span>

source: As you can see, we had to first import `IERC20DispatcherTrait` and `IERC20Dispatcher` generated by the compiler, which allows us to make calls to the methods implemented for the `IERC20Dispatcher` struct (`name`, `transfer`, etc), passing in the `contract_address` of the contract we want to call in the `IERC20Dispatcher` struct.
es: Como pueden ver, primero tuvimos que importar `IERC20DispatcherTrait` y `IERC20Dispatcher` generados por el compilador, lo que nos permite hacer llamadas a los métodos implementados para la estructura `IERC20Dispatcher` (`nombre`, `transferencia`, etc.), pasando la `contract_address` del contrato que queremos llamar en la estructura `IERC20Dispatcher`.
fr: Comme vous pouvez le voir, nous avons dû d'abord importer `IERC20DispatcherTrait` et `IERC20Dispatcher` générés par le compilateur, ce qui nous permet de faire des appels aux méthodes mises en œuvre pour la structure `IERC20Dispatcher` (`nom`, `transfer`, etc), en passant dans le `contract_address` du contrat que nous voulons appeler dans la structure `IERC20Dispatcher`.
id: Seperti yang Anda lihat, kami pertama-tama harus mengimpor dispatcherTrait 20 discont (artial Trait) dan ÁRC20 Dispatcher) yang pertama kali dihasilkan oleh kompiler, yang memungkinkan kami untuk membuat panggilan ke metode yang diimplementasikan untuk struktur ÉRC20 Dispatcher (profer, dll), yang lewat dalam versuscontract_address dari kontrak yang kami ingin hubungi di struktur.
tr: Gördüğünüz gibi, ilk önce IERC20DispatcherTrait ve IERC20Dispatcher'yi derleyici tarafından oluşturulan ve IERC20Dispatcher struct (name, transfer, vb.) için uygulanan yöntemlere çağrılar yapmamızı sağlayan earch20DispatcherTrait ve IERC'de aramak istediğimiz sözleşmenin contractle_adres'ini içe aktarmamız gerekiyordu.
zh_cn: 如你所见,我们首先必须进口汇编者制作的`IERC20DispatcherTrait'和`IERC20Dispatcher ',这使我们能够呼吁为`IERC20Dispatcher'建筑(`名称'、`转让'等)采用的方法,通过我们希望在`IERC20Dispatcher'建筑中使用的合同的`合同'地址。

source: Library Dispatcher
es: Despacho de biblioteca
fr: Expéditeur de bibliothèque
id: Dispatcher Pustaka
tr: Kütüphane Dispatcher
zh_cn: 图书馆调度器

source: The key difference between the contract dispatcher and the library dispatcher lies in the execution context of the logic defined in the class. While regular dispatchers are used to call functions from **contracts** (with an associated state), library dispatchers are used to call **classes** (stateless).
es: La diferencia clave entre el despachador de contratos y el despachador de bibliotecas radica en el contexto de ejecución de la lógica definida en la clase. Mientras que los despachadores regulares se utilizan para llamar a funciones de **contratos** (con un estado asociado), los despachadores de bibliotecas se utilizan para llamar **clases** (apátridas).
fr: La différence clé entre le répartiteur de contrat et le répartiteur de bibliothèque réside dans le contexte d'exécution de la logique définie dans la classe. Tandis que les répartiteurs réguliers sont utilisés pour appeler des fonctions de **contracts** (avec un état associé), les répartiteurs de bibliothèque sont utilisés pour appeler **classes** (sans état).
id: Perbedaan kunci antara operator kontrak dan dispatcher perpustakaan terletak pada konteks eksekusi logika yang didefinisikan dalam kelas. Sementara operator reguler digunakan untuk memanggil fungsi dari **contracts** (dengan keadaan terkait), pengiriman perpustakaan digunakan untuk memanggil **class** (tak berdasar).
tr: Sözleşmeli gönderici ile kütüphane göndericisi arasındaki temel fark, sınıfta tanımlanan mantığın yürütme bağlamında yatmaktadır. Düzenli göndericiler ** sözleşmeli ** 'den fonksiyonları çağırmak için kullanılırken (bir ilişkili devlet ile), kütüphane göndericileri ** sınıfları ** (devletsiz) çağırmak için kullanılır.
zh_cn: 合同调度员和图书馆调度员之间的关键区别在于该类中界定的逻辑的执行背景。 虽然通常的调度员用来调用**合同**(与相关国家)的功能,但图书馆调度员却用来调用**类**(无)的功能。

source: Let's consider two contracts A and B.
es: Consideremos dos contratos A y B.
fr: Considérons deux contrats A et B.
id: Mari kita pertimbangkan dua kontrak A dan B.
tr: İki sözleşmeli A ve B'yi ele alalım.
zh_cn: 让我们考虑两份合同A和B

source: When A uses `IBDispatcher` to call functions from the **contract** B, the execution context of the logic defined in B is that of B. This means that the value returned by `get_caller_address()` in B will return the address of A, and updating a storage variable in B will update the storage of B.
es: Cuando A utiliza `IBDispatcher` para llamar a las funciones del **contract** B, el contexto de ejecución de la lógica definida en B es el de B. Esto significa que el valor devuelto por `get_caller_address()` en B devolverá la dirección de A, y la actualización de una variable de almacenamiento en B actualizará el almacenamiento de B.
fr: Quand A utilise `IBDispatcher` pour appeler les fonctions du **contract** B, le contexte d'exécution de la logique définie dans B est celui de B. Cela signifie que la valeur retournée par `get_caller_address()` dans B retournera l'adresse de A, et la mise à jour d'une variable de stockage dans B mettra à jour le stockage de B.
id: Ketika A menggunakan dispatcher (dispatcher) untuk memanggil fungsi dari **contract** B, konteks eksekusi logika yang didefinisikan dalam B adalah B. Ini berarti bahwa nilai yang dikembalikan oleh ▪Get_caller_addunderd) di B akan mengembalikan alamat A, dan memperbarui variabel penyimpanan di B akan memperbarui penyimpanan B.
tr: A, ** sözleşme** B'den fonksiyonları çağırmak için IBDispatcher kullandığında, B'de tanımlanan mantığın yürütme bağlamı B'ninkidir. Bu, B'de get_caller_address() tarafından döndürülen değerin A'nın adresini döndüreceği ve B'de bir depolama değişkenini güncellemenin B'nin depolamasını güncelleyeceği anlamına gelir.
zh_cn: 当A使用“IB Dispatcher”从** Contract** B调用函数时,B中定义的逻辑的执行背景是B。 这意味着B中`get_caller_address()'返回的数值将返回A的地址,而更新B中的存储变量将更新B的存储。

source: When A uses `IBLibraryDispatcher` to call functions from the **class** of B, the execution context of the logic defined in B's class is that of A. This means that the value returned by `get_caller_address()` variable in B will return the address of the caller of A, and updating a storage variable in B's class will update the storage of A (remember that the **class** of B is stateless; there is no state that can be updated!)
es: Cuando A usa `IBLibraryDispatcher` para llamar a las funciones de la **clase** de B, el contexto de ejecución de la lógica definida en la clase B es el de A. Esto significa que la variable `get_caller_address()` devuelve la dirección de la persona que llama a A, y la actualización de una variable de almacenamiento en la clase B actualizará el almacenamiento de A (recuerda que la **clase** de B es apátrida; ¡no hay estado que pueda actualizarse!)
fr: Quand A utilise `IBLibraryDispatcher` pour appeler des fonctions de la classe **** de B, le contexte d'exécution de la logique définie dans la classe B est celui de A. Cela signifie que la valeur retournée par la variable `get_caller_address()` dans B retournera l'adresse de l'appelant de A, et la mise à jour d'une variable de stockage dans la classe B mettra à jour le stockage de A (rappelez-vous que la classe **** de B est apatride; il n'y a pas d'état qui puisse être mis à jour!)
id: Ketika A menggunakan dispatcher (Dispatcher) untuk memanggil fungsi dari **class** dari B, konteks eksekusi dari logika yang didefinisikan dalam kelas B adalah A. Ini berarti nilai yang dikembalikan oleh varivator_caller_address) (*class** dari B akan mengembalikan alamat pemanggil A, dan memperbarui variabel penyimpanan di kelas B akan memperbarui penyimpanan A (ingat bahwa *class** dari Bless adalah negara bagian; tidak ada keadaan yang dapat diperbarui)!
tr: A, B'nin ** sınıfından ** işlevlerini çağırmak için IBLibraryDispatcher kullandığında, B'nin sınıfında tanımlanan mantığın yürütme bağlamı A'dır. Bu, B'deki get_caller_address() değişkeni tarafından döndürülen değerin A'nın arayanının adresini döndüreceği ve B'nin sınıfındaki bir depolama değişkeninin güncellenemeyeceği anlamına gelir.
zh_cn: 当“IBLIbrary Dispatcher”使用“IBLIbrary Dispatcher”从** B类** ** 调来函数时,B类中定义的逻辑执行背景是 A。 这意味着 B类中“get_caller_地址() ” 变量返回的数值将返回A调用者的地址,而更新B类中的存储变量将更新A类的存储内容(记住 B类** 是无国籍的; 没有状态可以更新! )

source: The expanded form of the struct and trait generated by the compiler look like:
es: La forma expandida de la estructura y el rasgo generado por el compilador parecen:
fr: La forme élargie de la structure et du caractère générés par le compilateur ressemble à :
id: Bentuk terekspansi dari struktur dan sifat yang dihasilkan oleh kompiler terlihat seperti:
tr: Derleyici tarafından oluşturulan yapının ve özelliğin genişletilmiş biçimi şöyle görünüyor:
zh_cn: 编译者所生成的构造和特性的扩大形式看起来像:

source: // starknet::syscalls::library_call_syscall is called in here
es: // blacknet::syscalls::library_call_syscall se llama aquí
fr: // starknet::syscalls::library_call_syscall est appelé ici
id: // starnet::syscalls::library_call_syscall dipanggil kesini
tr: // starknet::syscalls::library_call_syscall burada çağrılır
zh_cn: / 尖尖: : 侧写: : 图书馆 - 呼叫 - 侧写:

source: <span class="caption">Listing 15-4: An expanded form of the IERC20 trait.</span>
es: <span class="caption">Lista 15-4: Una forma expandida del rasgo IERC20.</span>
fr: <span class="caption">Liste 15-4: Une forme élargie du caractère IERC20.</span>
id: <span class="caption">Listing 15-4: Bentuk terekspansi dari sifat IERC20.</span>
tr: span class="caption">Listeleme 15-4: IERC20 özelliğinin genişletilmiş bir formu./span>
zh_cn: <span class="caption" > listing 15-4:IERC20 特性的扩大形式。 </span>

source: Notice that the main difference between the regular contract dispatcher and the library dispatcher is that the former uses `call_contract_syscall` while the latter uses `library_call_syscall`.
es: Observe que la principal diferencia entre el expedidor regular del contrato y el expedidor de la biblioteca es que el primero utiliza `call_contract_syscall` mientras que el segundo utiliza `library_call_syscall`.
fr: Notez que la principale différence entre le régulateur de contrat régulier et le régulateur de bibliothèque est que le premier utilise `call_contract_syscall` tandis que le second utilise `library_call_syscall`.
id: Perhatikan bahwa perbedaan utama antara operator kontrak reguler dan dispatcher perpustakaan adalah bahwa mantan penggunaan ▪call_contract_syscall_syscallé sementara yang terakhir menggunakan ▪library_call_syscall#.
tr: Düzenli sözleşme göndericisi ile kütüphane göndericisi arasındaki temel farkın, eskisinin call_contract_syscall kullanırken, ikincisinin library_call_syscall kullandığına dikkat edin.
zh_cn: 请注意,正常合同发件人和图书馆发件人之间的主要区别是前者使用`调用'合同_syscall ',而后者使用`图书馆_call_syscall'。

source: Calling Contracts using the Library Dispatcher
es: Llamar a contratos usando el despachador de la biblioteca
fr: Appel de contrats en utilisant le dispatcheur de bibliothèque
id: Memanggil Kontrak menggunakan Library Dispatcher
tr: Kütüphane Göndericisini Kullanarak Sözleşmeleri Aramak
zh_cn: 使用图书馆调度员的致电合同

source: Below's a sample code for calling contracts using the Library Dispatcher.
es: Abajo hay un código de ejemplo para llamar a contratos usando el Dispatcher de la Biblioteca.
fr: Ci-dessous, un exemple de code pour appeler les contrats en utilisant la Library Dispatcher.
id: Berikut ini adalah contoh kode untuk memanggil kontrak menggunakan Library Dispatcher.
tr: Aşağıda Kütüphane Dispatcher'ı kullanarak sözleşmeleri aramak için örnek bir kod verilmiştir.
zh_cn: 下面是使用图书馆调度员 调用合同的样本代码

source: <span class="caption">Listing 15-5: A sample contract using the Library Dispatcher.</span>
es: <span class="caption">Lista 15-5: Un contrato de muestra usando el Dispatcher de la Biblioteca.</span>
fr: <span class="caption">Liste 15-5: Un exemple de contrat utilisant le régulateur de bibliothèque.</span>
id: <span class="caption">Listing 15-5: Sebuah kontrak cuplikan menggunakan Library Dispatcher.</span>
tr: span class="caption="Listing 15-5: Library Dispatcher'ı kullanan bir örnek sözleşme./span>
zh_cn: <span class="caption" > listing 15-5:使用图书馆调度器的样本合同。 </span>

source: As you can see, we had to first import in our contract the `IContractADispatcherTrait` and `IContractALibraryDispatcher` which were generated from our interface by the compiler. Then, we can create an instance of `IContractALibraryDispatcher` passing in the `class_hash` of the class we want to make library calls to. From there, we can call the functions defined in that class, executing its logic in the context of our contract. When we call `set_value` on ContractA, it will make a library call to the `set_value` function in IContractA, updating the value of the storage variable `value` in ContractA.
es: Como puede ver, tuvimos que importar primero en nuestro contrato el `IContractADispatcherTrait` e `IContractALIbraryDispatcher` que fueron generados desde nuestra interfaz por el compilador. Entonces, podemos crear una instancia de `IContractALIbraryDispatcher` pasando en la `class_hash` de la clase a la que queremos hacer llamadas a la biblioteca. A partir de ahí, podemos llamar a las funciones definidas en esa clase, ejecutando su lógica en el contexto de nuestro contrato. Cuando llamamos `set_value` en ContractA, hará una llamada a la biblioteca a la función `set_value` en IContractA, actualizando el valor de la variable de almacenamiento `value` en ContractA.
fr: Comme vous pouvez le voir, nous avons dû d'abord importer dans notre contrat le `IContractADispatcherTrait` et `IContractALibraryDispatcher` qui ont été générés à partir de notre interface par le compilateur. Ensuite, nous pouvons créer une instance de `IContractALibraryDispatcher` passant dans la `class_hash` de la classe à laquelle nous voulons faire des appels de bibliothèque. De là, nous pouvons appeler les fonctions définies dans cette classe, exécutant sa logique dans le contexte de notre contrat. Lorsque nous appelons `set_value` sur ContractA, il fera un appel de bibliothèque à la fonction `set_value` dans IContractA, mettant à jour la valeur de la variable de stockage `value` dans ContractA.
id: Seperti yang dapat Anda lihat, kami harus mengimpor pertama kali dalam kontrak kami, kami harus mengimpornya terlebih dahulu dalam kontrak kami. Kemudian, kami dapat membuat contoh dari CHOIContractALALERTRAIT (discort) dan di kelas yang kami ingin membuat panggilan perpustakaan dari sana. Dari sana, kami dapat menyebut fungsi yang didefinisikan dalam kelas tersebut, mengeksekusi logikanya dalam konteks kontrak kami. Ketika kami menyebut 'Dispatbrary Dispatcher' (Dispatcherry Dispatcher' (Dispatcher), akan membuat sebuah perpustakaan menjadi sebuah fungsi yang sangat bernilai.
tr: Gördüğünüz gibi, ilk önce IContractAdispatcherTrait ve IContractALibraryDispatcher adlı sözleşmemizde, derleyici tarafından arayüzümüzden oluşturulan IContractALibraryDispatcher değerini, class_hash olarak tanımlanan sınıftan geçen bir IContractALibraryDispatcher örneği oluşturabiliriz.
zh_cn: 正如你可以看到的那样,我们首先必须在我们的合同中输入“IcontractA DispatcherTrait”和“Icontralibrary Dispatcher”这两个由编译者从我们的接口中产生的“Icontractalibrary Dispatcher”,然后,我们可以建立一个“Icontractalibrary Dispatcher”通过我们想拨打图书馆电话的`类'的例子。我们可以从那里调用该类中界定的功能,在我们的合同中执行逻辑。当我们在合同中称为`set_value'时,它将在图书馆中呼叫Itractracta的`seet_value'功能,更新合同中储存变量`value'的价值。

source: Using low-level syscalls
es: Uso de syscalls de bajo nivel
fr: Utilisation de syscalls de bas niveau
id: Menggunakan syscall tingkat rendah
tr: Düşük seviyeli syscalls kullanımı
zh_cn: 使用低级别音频调

source: Another way to call other contracts and classes is to use the `starknet::call_contract_syscall`and `starknet::library_call_syscall` system calls. The dispatchers we described in the previous sections are high-level syntaxes for these low-level system calls.
es: Otra forma de llamar a otros contratos y clases es usar las llamadas del sistema `starknet::call_contract_syscall` y `starknet::library_call_syscall`. Los despachadores que describimos en las secciones anteriores son sintaxis de alto nivel para estas llamadas del sistema de bajo nivel.
fr: Une autre façon d'appeler d'autres contrats et classes est d'utiliser les appels système `starknet::call_contract_syscall` et `starknet::library_call_syscall`. Les répartiteurs que nous avons décrits dans les sections précédentes sont des syntaxes de haut niveau pour ces appels système de bas niveau.
id: Cara lain untuk memanggil kontrak lain dan kelas adalah dengan menggunakan sistem call åstarknet:call_contract_syscall_scall:::library_syscall_syscallé calls. Para operator yang kami deskripsikan di seksi sebelumnya adalah sintaks tingkat tinggi untuk panggilan sistem tingkat rendah ini.
tr: Diğer sözleşmeleri ve sınıfları çağırmanın bir başka yolu, starknet::call_contract_syscall ve starknet::library_call_syscall sistem çağrılarını kullanmaktır. Önceki bölümlerde tanımladığımız göndericiler, bu düşük seviyeli sistem çağrıları için üst düzey sözdizimleridir.
zh_cn: 调用其他合同和班级的另一种方法是使用“星网:Call_contract_syscall”和“星网:library_call_syscall”系统。我们在前几节中描述的调度员是这些低级别系统电话的高级语法。
