Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: These functions allow us to manipulate dictionaries like in any other language. In the following example, we create a dictionary to represent a mapping between individuals and their balance:
es: Estas funciones nos permiten manipular diccionarios como en cualquier otro idioma. En el siguiente ejemplo, creamos un diccionario para representar un mapeo entre individuos y su equilibrio:
fr: Ces fonctions nous permettent de manipuler des dictionnaires comme dans n'importe quelle autre langue. Dans l'exemple suivant, nous créons un dictionnaire pour représenter une cartographie entre les individus et leur équilibre :
id: Fungsi-fungsi ini memungkinkan kita untuk memanipulasi kamus seperti dalam bahasa lain. Dalam contoh berikut, kita membuat kamus untuk mewakili pemetaan antara individu dan keseimbangan mereka:
tr: Bu işlevler, sözlükleri başka bir dilde olduğu gibi manipüle etmemizi sağlar. Aşağıdaki örnekte, bireyler ve dengeleri arasında bir haritalamayı temsil edecek bir sözlük oluşturuyoruz:
zh_cn: 这些功能允许我们像用任何其他语言一样操纵字典。 在下面的例子中,我们创建了一本字典,以代表个人与平衡之间的映射:

source: "Balance is not 100"
es: "El equilibrio no es 100"
fr: "La balance n'est pas 100"
id: "Balance bukan 100"
tr: "Balans 100 değil"
zh_cn: "平衡不是100"

source: "Balance is not 200"
es: "El equilibrio no es 200"
fr: "La balance n'est pas 200"
id: "Balance bukan 200"
tr: "Balans 200 değil"
zh_cn: "平衡不是200"

source: We can create a new instance of `Felt252Dict<u64>` by using the `default` method of the `Default` trait and add two individuals, each one with their own balance, using the `insert` method. Finally, we check the balance of our users with the `get` method. These methods are defined in the `Felt252DictTrait` trait in the core library.
es: Podemos crear una nueva instancia de `Felt252Dict<u64'' utilizando el método `default` del rasgo `Default` y añadir dos individuos, cada uno con su propio equilibrio, utilizando el método `insertar`. Finalmente, comprobamos el equilibrio de nuestros usuarios con el método `get`. Estos métodos se definen en el rasgo `Felt252DictTrait` en la biblioteca principal.
fr: Nous pouvons créer une nouvelle instance de `Felt252Dict<u64>` en utilisant la méthode `default` du trait `Default` et ajouter deux individus, chacun avec son propre équilibre, en utilisant la méthode `insert`. Enfin, nous vérifions le solde de nos utilisateurs avec la méthode `get`. Ces méthodes sont définies dans le trait `Felt252DictTrait` dans la bibliothèque centrale.
id: Kita dapat membuat sebuah contoh baru tentang faktor-felt252Dict<u64> dengan menggunakan metode ådefault) dan menambahkan dua individu, masing-masing dengan keseimbangan mereka sendiri, menggunakan metode ·inserté. Akhirnya, kita memeriksa keseimbangan pengguna kita dengan metoda ågía. Metode-metode ini didefinisikan dalam struktur folt2Drait.
tr: Default özelliğinin default yöntemini kullanarak yeni bir Felt252Dictu64> örneği oluşturabilir ve insert yöntemini kullanarak her biri kendi dengesine sahip iki birey ekleyebiliriz. Son olarak, kullanıcılarımızın dengesini get yöntemiyle kontrol ederiz. Bu yöntemler Felt252DictTrait çekirdeğinde tanımlanmıştır.
zh_cn: 我们可以使用`默认'特性的`默认'方法创建一个`Felt252Dict<u64'的新实例,并使用`插入'方法增加两人,每个个人都有自己的平衡,最后,我们用`get'方法检查用户的平衡,这些方法在核心图书馆的`Felt252DictTrait'特性中定义。

source: Throughout the book we have talked about how Cairo's memory is immutable, meaning you can only write to a memory cell once but the `Felt252Dict<T>` type represents a way to overcome this obstacle. We will explain how this is implemented later on in ["Dictionaries Underneath"](./ch03-02-dictionaries.md#dictionaries-underneath).
es: A lo largo del libro hemos hablado de cómo la memoria de El Cairo es inmutable, lo que significa que sólo se puede escribir a una celda de memoria una vez, pero el tipo `Felt252Dict<T® representa una manera de superar este obstáculo. Explicaremos cómo esto se implementa más adelante en ["Diccionarios debajo"](./ch03-02-dictionaries.md#dictionaries-subordinaryth).
fr: Tout au long du livre, nous avons parlé de la façon dont la mémoire du Caire est immuable, ce qui signifie que vous ne pouvez écrire à une cellule mémoire qu'une seule fois, mais le type `Felt252Dict<T>` représente un moyen de surmonter cet obstacle. Nous allons expliquer comment cela est mis en œuvre plus tard dans ["Dictionnaires Underneath"](./ch03-02-dictionaries.md#dictionaries-underneath).
id: Sepanjang buku yang telah kita bicarakan tentang bagaimana memori Kairo tidak dapat berubah, berarti Anda hanya dapat menulis ke sebuah sel memori sekali tetapi jenis font <2 Dict<T>. Kami akan menjelaskan bagaimana hal ini diterapkan kemudian di dalam ["Diction Underneath"]. /ch03-02-dictionarys.m#dictionarys-underneath).
tr: Kitap boyunca Kahire'nin hafızasının nasıl değişmez olduğunu konuştuk, yani bir hafıza hücresine sadece bir kez yazabilirsiniz, ancak Felt252DictT> tipi bu engelin üstesinden gelmenin bir yolunu temsil ediyor. Bunun daha sonra ["Dictionaries Underneath"] (./ch03-02-02-dictionaries.md#dictionaries-underneath) 'de nasıl uygulandığını açıklayacağız.
zh_cn: 在整个书中,我们谈到开罗的记忆是不可改变的,这意味着你只能写给一个记忆细胞一次,而“Felt252Dict<T}类型是克服这一障碍的一种方法。我们会解释在[“地下字典” (./ch03-02-词典.md#词典-unununneath) 中如何执行这一点。

source: Building upon our previous example, let us show a code example where the balance of the same user changes:
es: Sobre la base de nuestro ejemplo anterior, vamos a mostrar un ejemplo de código donde el equilibrio del mismo usuario cambia:
fr: S'appuyant sur notre exemple précédent, montrons un exemple de code où le solde du même utilisateur change :
id: Building upon our user example, let us show a code example where the balance of the same user changes:
tr: Önceki örneğimize dayanarak, aynı kullanıcının dengesinin değiştiği bir kod örneği gösterelim:
zh_cn: 以我们先前的例子为基础,让我们展示一个代码示例,其中同一用户的平衡会发生变化:

source: // Insert Alex with 100 balance
es: // Insertar Alex con 100 saldo
fr: // Insérez Alex avec un solde de 100
id: //Masukkan Alex dengan 100 keseimbangan
tr: // Alex'i 100 denge ile ekle
zh_cn: / 插入有100平衡的亚历克斯

source: // Check that Alex has indeed 100 associated with him
es: // Comprobar que Alex ha de hecho 100 asociados con él
fr: // Vérifiez qu'Alex a effectivement 100 associés avec lui
id: #/ Periksa bahwa Alex memang 100 berhubungan dengan dia
tr: // Alex'in gerçekten onunla ilişkili 100 olduğunu kontrol edin
zh_cn: 检查亚历克斯 确实有100 与他有关联

source: "Alex balance is not 100"
es: "El balance Alex no es 100"
fr: "L'équilibre d'Alex n'est pas 100"
id: "Lance Alex tidak 100"
tr: "Alex balance 100 değil"
zh_cn: "时间平衡不是100"

source: // Insert Alex again, this time with 200 balance
es: // Inserte Alex de nuevo, esta vez con 200 saldo
fr: // Insérez à nouveau Alex, cette fois avec un solde de 200
id: //Masukkan Alex lagi, kali ini dengan 200 keseimbangan
tr: // Alex'i tekrar ekle, bu sefer 200 bakiyeyle
zh_cn: /再插入亚历克斯,这一次,以200的平衡

source: // Check the new balance is correct
es: // Compruebe que el nuevo saldo es correcto
fr: // Vérifier que le nouveau solde est correct
id: //Periksa keseimbangan baru adalah benar
tr: // Yeni bakiyenin doğru olduğunu kontrol edin
zh_cn: / 检查新余额是否正确

source: "Alex balance is not 200"
es: "El balance de Alex no es 200"
fr: "L'équilibre d'Alex n'est pas 200"
id: "Lance Alex bukan 200"
tr: "Alex balance 200 değil"
zh_cn: "时间平衡不是200"

source: Notice how in this example we added the 'Alex' individual twice, each time using a different balance and each time that we checked for its balance it had the last value inserted! `Felt252Dict<T>` effectively allows us to "rewrite" the stored value for any given key.
es: Observe cómo en este ejemplo añadimos el individuo 'Alex' dos veces, cada vez usando un balance diferente y cada vez que comprobamos su balance, ¡tenía el último valor insertado! `Felt252Dict<T® efectivamente nos permite "reescribir" el valor almacenado para cualquier clave dada.
fr: Notez comment dans cet exemple nous avons ajouté l'individu 'Alex' deux fois, à chaque fois en utilisant un solde différent et à chaque fois que nous avons vérifié son solde, il avait la dernière valeur insérée! `Felt252Dict<T>` nous permet effectivement de "réécrire" la valeur stockée pour une clé donnée.
id: Perhatikan bagaimana dalam contoh ini kita menambahkan individu 'Alex' dua kali, setiap kali menggunakan keseimbangan yang berbeda dan setiap kali kita memeriksa untuk keseimbangannya, itu memiliki nilai terakhir yang dimasukkan!
tr: Bu örnekte, 'Alex' bireyini her seferinde farklı bir denge kullanarak iki kez eklediğimize ve dengesini kontrol ettiğimiz her seferinde son değeri eklediğine dikkat edin! Felt252DictT> herhangi bir anahtar için depolanan değeri "yeniden yazmamızı" etkili bir şekilde sağlar.
zh_cn: 在此示例中, 我们如何添加“ Alex” 个人两次, 每次使用不同的平衡, 每次检查是否平衡, 都插入了最后的值! `Felt252Dict<T\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Before heading on and explaining how dictionaries are implemented it is worth mentioning that once you instantiate a `Felt252Dict<T>`, behind the scenes all keys have their associated values initialized as zero. This means that if for example, you tried to get the balance of an inexistent user you will get 0 instead of an error or an undefined value. This also means there is no way to delete data from a dictionary. Something to take into account when incorporating this structure into your code.
es: Antes de dirigirnos y explicar cómo se implementan los diccionarios, vale la pena mencionar que una vez que se instale un `Felt252Dict<T®, detrás de las escenas todas las claves tienen sus valores asociados inicializados como cero. Esto significa que si, por ejemplo, intenta obtener el saldo de un usuario inexistente obtendrá 0 en lugar de un error o un valor indefinido. Esto también significa que no hay manera de eliminar datos de un diccionario. Algo que tener en cuenta al incorporar esta estructura en su código.
fr: Avant d'entrer en ligne de compte et d'expliquer comment les dictionnaires sont implémentés, il convient de mentionner qu'une fois que vous avez instantané un `Felt252Dict<T>`, dans les coulisses toutes les clés ont leurs valeurs associées initialisées comme zéro. Cela signifie que si par exemple, vous avez essayé d'obtenir l'équilibre d'un utilisateur inexistant, vous obtiendrez 0 au lieu d'une erreur ou d'une valeur non définie. Cela signifie également qu'il n'y a aucun moyen de supprimer des données d'un dictionnaire. Quelque chose à prendre en compte lors de l'incorporation de cette structure dans votre code.
id: Sebelum menuju dan menjelaskan bagaimana dictionary diimplementasikan itu layak menyebutkan bahwa sekali Anda mencoba untuk mendapatkan keseimbangan pengguna yang tidak ada Anda akan mendapatkan 0 bukan sebuah kesalahan atau nilai yang tidak terdefinisi. Ini juga berarti tidak ada cara untuk menghapus data dari kamus. Sesuatu untuk memperhitungkan ketika menggabungkan struktur ini ke dalam kode Anda.
tr: Sözlüklerin nasıl uygulandığını açmadan ve açıklamadan önce, bir Felt252DictT>'yi anlıklaştırdıktan sonra, sahnelerin arkasında tüm tuşların ilişkili değerlerinin sıfır olarak başlatıldığı anlamına gelir. Bu, örneğin, mevcut olmayan bir kullanıcının dengesini almaya çalışırsanız, bir hata veya tanımlanmamış bir değer yerine 0 elde edeceğiniz anlamına gelir. Bu aynı zamanda bir sözlükten veri silmenin bir yolu olmadığı anlamına gelir. Bu, bir sözlükten veriyi silmenin bir yolu olmadığı anlamına gelir.
zh_cn: 在标题和解释词典如何执行之前,值得一提的是,一旦您在幕后即时输入了 `Felt252Dict <T, 所有密钥都将其相关值初始化为零。 这意味着, 例如,如果您试图获取一个不存在的用户的余额, 您将得到 0, 而不是错误或未定义的值。 这也意味着无法从字典中删除数据。 在将此结构纳入您的代码时, 某些需要考虑的东西 。

source: Until this point, we have seen all the basic features of `Felt252Dict<T>` and how it mimics the same behavior as the corresponding data structures in any other language, that is, externally of course. Cairo is at its core a non-deterministic Turing-complete programming language, very different from any other popular language in existence, which as a consequence means that dictionaries are implemented very differently as well!
es: Hasta este punto, hemos visto todas las características básicas de `Felt252Dict<T® y cómo imita el mismo comportamiento que las estructuras de datos correspondientes en cualquier otro idioma, es decir, externamente, por supuesto. El Cairo es en su núcleo un lenguaje de programación no-determinista Turing-completo, muy diferente de cualquier otro lenguaje popular en existencia, lo que como consecuencia significa que los diccionarios se implementan muy diferente también!
fr: Jusqu'à ce point, nous avons vu toutes les caractéristiques de base de `Felt252Dict<T>` et comment il imite le même comportement que les structures de données correspondantes dans n'importe quelle autre langue, c'est-à-dire, externement bien sûr. Le Caire est au cœur d'un langage de programmation non déterministe Turing-complet, très différent de tout autre langage populaire existant, ce qui signifie que les dictionnaires sont mis en œuvre très différemment aussi!
id: Sampai titik ini, kita telah melihat semua fitur dasar dari åFelt252Dict<T> dan bagaimana ia meniru perilaku yang sama seperti struktur data yang berhubungan dalam bahasa lain, yaitu, secara eksternal tentu saja. Kairo berada di intinya bahasa pemrograman yang tidak lengkap, sangat berbeda dari bahasa populer lainnya yang ada, yang sebagai konsekuensi berarti bahwa kamuri diterapkan sangat berbeda juga!
tr: Bu noktaya kadar, Felt252DictT>'nin tüm temel özelliklerini ve bunun başka bir dilde, yani dışsal olarak karşılık gelen veri yapılarıyla aynı davranışı nasıl taklit ettiğini gördük. Kahire özünde, var olan diğer popüler dillerden çok farklı, belirleyici olmayan bir Turing-tam programlama dilidir, bunun sonucu olarak sözlüklerin de çok farklı bir şekilde uygulandığı anlamına gelir!
zh_cn: 在这一点之前,我们已经看到“Felt252Dict<T”的所有基本特征,以及它如何以任何其他语言,即外部语言,模仿相应的数据结构。 开罗的核心是非决定性的图灵完整编程语言,与现有的任何其他流行语言非常不同,结果意味着字典的执行也非常不同! ”

source: In the following sections, we are going to give some insights about `Felt252Dict<T>` inner mechanisms and the compromises that were taken to make them work. After that, we are going to take a look at how to use dictionaries with other data structures as well as use the `entry` method as another way to interact with them.
es: En las siguientes secciones, vamos a dar algunas ideas acerca de los mecanismos internos `Felt252Dict<T® y los compromisos que se tomaron para que funcionen. Después de eso, vamos a echar un vistazo a cómo utilizar diccionarios con otras estructuras de datos, así como utilizar el método `entrada` como otra forma de interactuar con ellos.
fr: Dans les sections suivantes, nous allons donner quelques indications sur les mécanismes internes `Felt252Dict<T>` et les compromis qui ont été pris pour les faire fonctionner. Après cela, nous allons examiner comment utiliser des dictionnaires avec d'autres structures de données ainsi que d'utiliser la méthode `entry` comme une autre façon d'interagir avec eux.
id: Pada bagian-bagian berikut, kita akan memberikan beberapa wawasan tentang ÉFelt252Dict<T> mekanisme dalam dan kompromi yang diambil untuk membuatnya bekerja. Setelah itu, kita akan melihat bagaimana menggunakan kamus dengan struktur data lainnya dan juga menggunakan metode Ánínís sebagai cara lain untuk berinteraksi dengan mereka.
tr: Aşağıdaki bölümlerde, Felt252DictT> iç mekanizmaları ve onları çalıştırmak için alınan ödünler hakkında bazı bilgiler vereceğiz. Bundan sonra, sözlüklerin diğer veri yapılarıyla nasıl kullanılacağına ve entry yöntemini onlarla etkileşime girmenin başka bir yolu olarak nasıl kullanacağımıza bakacağız.
zh_cn: 在以下各节中,我们将对`Felt252Dict<T}内部机制以及为使这些机制发挥作用而采取的妥协办法'提供一些见解,然后我们将研究如何使用与其他数据结构的字典,以及使用`进入'方法作为与它们互动的另一种方式。

source: Dictionaries Underneath
es: Diccionarios inferiores
fr: Dictionnaires sous-jacents
id: Kamus Di Bawah
tr: Dictionaries Underneath Altyazıları
zh_cn: 词典

source: One of the constraints of Cairo's non-deterministic design is that its memory system is immutable, so in order to simulate mutability, the language implements `Felt252Dict<T>` as a list of entries. Each of the entries represents a time when a dictionary was accessed for reading/updating/writing purposes. An entry has three fields:
es: Una de las limitaciones del diseño no determinista de El Cairo es que su sistema de memoria es inmutable, por lo que para simular la mutabilidad, el lenguaje implementa `Felt252Dict<T® como una lista de entradas. Cada una de las entradas representa un momento en el que se accede a un diccionario con fines de lectura/actualización/escritura. Una entrada tiene tres campos:
fr: Une des contraintes de la conception non déterministe du Caire est que son système de mémoire est immuable, de sorte que pour simuler la mutabilité, le langage implémente `Felt252Dict<T>` comme une liste d'entrées. Chacune des entrées représente un moment où un dictionnaire a été consulté pour la lecture/mise à jour/écriture. Une entrée a trois champs:
id: Salah satu kendala dari desain un-teteristik Kairo adalah bahwa sistem memorinya tidak dapat diubah, sehingga untuk mensimulasikan mutability, bahasa mengimplementasikan Felt252Dict<T> sebagai daftar entri. Setiap entri mewakili waktu ketika sebuah kamus diakses untuk membaca/memperbarui/menulis tujuan. Sebuah entri memiliki tiga bidang:
tr: Kahire'nin deterministik olmayan tasarımının kısıtlamalarından biri, hafıza sisteminin değiştirilemez olmasıdır, bu nedenle Felt252DictT> dilini değiştirilebilirliği simüle etmek için bir giriş listesi olarak uygular. Girişlerin her biri, bir sözlüğe okuma / güncelleme / yazma amacıyla erişildiği bir zamanı temsil eder. Bir girişin üç alanı vardır:
zh_cn: 开罗非决定性设计的一个制约因素是其记忆系统是不可变的,因此,为了模拟变异性,语言将“Felt252Dict<T”作为条目清单。每个条目代表为阅读/更新/写作目的访问字典的时间。一个条目有三个字段:

source: A `key` field that identifies the key for this key-value pair of the dictionary.
es: Un campo `clave` que identifica la clave para este par de claves-valor del diccionario.
fr: Un champ `key` qui identifie la clé de cette paire de valeurs clés du dictionnaire.
id: Sebuah bidang åkey yang mengidentifikasi kunci untuk pasangan kunci bernilai ini dari kamus.
tr: Sözlüğün bu anahtar değeri çiftinin anahtarını tanımlayan bir key alanı.
zh_cn: “关键”字段,用于确定词典中这对关键值的钥匙。

source: A `previous_value` field that indicates which previous value was held at `key`.
es: Un campo `previous_value` que indica qué valor anterior se mantuvo en `key`.
fr: Un champ `previous_value` qui indique quelle valeur précédente était retenue à `key`.
id: Ruas previous_value yang menunjukkan nilai sebelumnya yang diadakan di åkey.
tr: Önceki değerin key'de tutulduğunu gösteren bir previous_value alanı.
zh_cn: " 前价值 " 字段,显示在 " Key " 上持有的先前价值。

source: A `new_value` field that indicates the new value that is held at `key`.
es: Un campo `new_value` que indica el nuevo valor que se mantiene en `key`.
fr: Un champ `new_value` qui indique la nouvelle valeur qui est conservée à `key`.
id: Sebuah bidang baru yang menunjukkan nilai baru yang diadakan di åkey.
tr: key'de tutulan yeni değeri gösteren bir new_value alanı.
zh_cn: `新价值'字段,显示`关键'所持有的新价值。

source: If we try implementing `Felt252Dict<T>` using high-level structures we would internally define it as `Array<Entry<T>>` where each `Entry<T>` has information about what key-value pair it represents and the previous and new values it holds. The definition of `Entry<T>` would be:
es: Si tratamos de implementar `Felt252Dict<T® usando estructuras de alto nivel lo definiríamos internamente como `Array<Entry<T donde cada `Entry<T® tiene información sobre qué par clave-valor representa y los valores anteriores y nuevos que contiene. La definición de `Entry<T® sería:
fr: Si nous essayons de mettre en œuvre `Felt252Dict<T>` en utilisant des structures de haut niveau, nous la définirions en interne comme `Array<Entrée<T>>` où chaque `Entrée<T>` a des informations sur la paire de valeurs clés qu'elle représente et les valeurs précédentes et nouvelles qu'elle détient. La définition de `Entrée<T>` serait:
id: Jika kita mencoba mengimplementasikan Felt252Dict<T> menggunakan struktur tingkat tinggi kita akan mendefinisikannya secara internal sebagai ARray<Entry<T> di mana masing-masing entry<T> memiliki informasi tentang apa pasangan nilai kunci itu mewakili dan nilai-nilai sebelumnya dan nilai-nilai baru yang dipegang. Definisi dari <T> akan menjadi:
tr: Felt252DictT> üst düzey yapıları kullanarak uygulamayı denersek, dahili olarak ArrayEntryT> olarak tanımlarız; burada her EntryT> hangi anahtar değeri çiftini temsil ettiği ve önceki ve yeni değerleri tuttuğu hakkında bilgi sahibi olur. EntryT> tanımı:
zh_cn: 如果我们尝试使用高级结构实施“Felt252Dict<T”,我们将在内部将其定义为“Array<Entry<T”,其中每个“Entry<T”都拥有关于它所代表的关键值配对以及它持有的先前和新的值的信息。

source: For each time we interact with a `Felt252Dict<T>`, a new `Entry<T>` will be registered:
es: Por cada vez que interactúemos con un `Felt252Dict<T®, se registrará un nuevo `Entrada<T®:
fr: Pour chaque interaction avec un `Felt252Dict<T>`, un nouveau `Entry<T>` sera enregistré:
id: Untuk setiap kali kita berinteraksi dengan sebuah Felt252Dict<T>, sebuah Entry baru<T> akan didaftarkan:
tr: Felt252DictT> ile her etkileşimde bulunduğumuzda, yeni bir EntryT> kaydedilecektir:
zh_cn: 每次我们与“Felt252Dict<T”互动时,将登记一个新的“Entry<T”:

source: A `get` would register an entry where there is no change in state, and previous and new values are stored with the same value.
es: Un `get` registraría una entrada donde no hay cambios en el estado, y los valores anteriores y nuevos se almacenan con el mismo valor.
fr: Un `get` enregistrerait une entrée où il n'y a pas de changement d'état, et les valeurs précédentes et nouvelles sont stockées avec la même valeur.
id: Sebuah masukan yang akan mendaftar di mana tidak ada perubahan dalam keadaan, dan nilai-nilai sebelumnya dan baru disimpan dengan nilai yang sama.
tr: Bir get, durum değişikliği olmayan bir girişi kaydeder ve önceki ve yeni değerler aynı değerde saklanır.
zh_cn: " Get " 将登记一个在状态没有变化、以前和新的价值以相同价值储存的条目。

source: An `insert` would register a new `Entry<T>` where the `new_value` would be the element being inserted, and the `previous_value` the last element inserted before this. In case it is the first entry for a certain key, then the previous value will be zero.
es: Un `insértese` registraría un nuevo `Entry<T® donde el `new_value` sería el elemento que se está insertando, y el `previous_value` el último elemento insertado antes de esto. En caso de que sea la primera entrada de una determinada clave, el valor anterior será cero.
fr: Un `insert` enregistrerait un nouvel `Entry<T>` où `new_value` serait l'élément inséré, et le `previous_value` le dernier élément inséré avant cela. Si c'est la première entrée pour une certaine clé, alors la valeur précédente sera zéro.
id: Suatu elemen baru yang dimasukkan akan mendaftarkan elemen baru yang akan dimasukkan sebelum ini. Dalam kasus ini adalah entri pertama untuk kunci tertentu, maka nilai sebelumnya akan menjadi nol.
tr: Bir insert yeni bir EntryT> new_value eklenecek eleman ve previous_value bundan önce eklenen son eleman olacak şekilde kaydedilir. Belirli bir anahtar için ilk giriş olması durumunda, önceki değer sıfır olacaktır.
zh_cn: `插入'将登记一个新的`输入<T ',其中`新价值'是插入的元素,`前置价值'是在此之前插入的最后一个元素。如果它是某个密钥的第一个条目,那么以前的数值将是零。
