Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Writing smart contracts requires various associated operations, such as calling another contract or accessing the contract’s storage, that standalone programs do not require.
es: Escribir contratos inteligentes requiere varias operaciones asociadas, como llamar a otro contrato o acceder al almacenamiento del contrato, que los programas independientes no requieren.
fr: La rédaction de contrats intelligents nécessite diverses opérations connexes, telles que l'appel d'un autre contrat ou l'accès au stockage du contrat, que les programmes autonomes n'exigent pas.
id: Menulis kontrak cerdas membutuhkan berbagai operasi yang terkait, seperti memanggil kontrak lain atau mengakses penyimpanan kontrak yang tidak diperlukan program mandiri.
tr: Akıllı sözleşmeler yazmak, başka bir sözleşmeyi aramak veya bağımsız programların gerektirmediği sözleşmenin deposuna erişmek gibi çeşitli ilişkili işlemler gerektirir.
zh_cn: 书写智能合同需要各种相关业务, 如调用另一合同或进入合同储存,

source: The Starknet contract language supports these operations by using system calls. System calls enable a contract to require services from the Starknet OS. You can use system calls in a function to get information that depends on the broader state of Starknet, which would otherwise be inaccessible, rather than local variables that appear in the function’s scope.
es: El lenguaje de contrato Starknet soporta estas operaciones utilizando llamadas del sistema. Las llamadas del sistema permiten que un contrato requiera servicios del sistema operativo Starknet. Puede utilizar llamadas del sistema en una función para obtener información que depende del estado más amplio de Starknet, que de otro modo sería inaccesible, en lugar de variables locales que aparecen en el alcance de la función.
fr: Le langage du contrat Starknet prend en charge ces opérations en utilisant des appels système. Les appels système permettent à un contrat d'exiger des services du système d'exploitation Starknet. Vous pouvez utiliser des appels système dans une fonction pour obtenir des informations qui dépendent de l'état plus large de Starknet, qui autrement serait inaccessible, plutôt que des variables locales qui apparaissent dans la portée de la fonction.
id: Bahasa kontrak Starknet mendukung operasi ini dengan menggunakan sistem panggilan. Sistem panggilan memungkinkan sebuah kontrak untuk membutuhkan layanan dari OS Starknet. Anda dapat menggunakan sistem panggilan dalam fungsi untuk mendapatkan informasi yang tergantung pada kondisi Starknet yang lebih luas, yang jika tidak dapat diakses, daripada variabel lokal yang muncul dalam lingkup fungsi.
tr: Starknet sözleşme dili, sistem çağrılarını kullanarak bu işlemleri destekler. Sistem çağrıları, Starknet işletim sisteminden hizmet talep etmek için bir sözleşmeyi etkinleştirir. Fonksiyonun kapsamı içinde görünen yerel değişkenler yerine, Starknet'in daha geniş durumuna bağlı olan bilgileri almak için bir işlevdeki sistem çağrılarını kullanabilirsiniz.
zh_cn: Starknet 合同语言使用系统电话支持这些操作。 系统电话使合同能够要求 Starknet OS 服务。 您可以使用系统电话来获取信息, 这些信息取决于更广大的 Starknet 状态, 否则无法获取, 而不是功能范围内出现的本地变量 。

source: Here is a list of the system calls available in Cairo 1.0:
es: Aquí está una lista de las llamadas del sistema disponibles en El Cairo 1.0:
fr: Voici une liste des appels système disponibles au Caire 1.0:
id: Berikut adalah daftar panggilan sistem yang tersedia di Kairo 1.0:
tr: İşte Kahire 1.0'daki sistem çağrılarının bir listesi:
zh_cn: 以下是开罗1.0的系统呼叫列表:

source: [get_block_hash](#get_block_hash)
zh_cn: [get_ block_hash] (# get_ block_hash) (# get_ block_hash) (# get_ block_hash) (# get_ block_hash)

source: [get_execution_info](#get_execution_info)
es: [get_ejecution_info](#get_ejecution_info)
zh_cn: [找到_ 执行_ info] (# get_ 执行_ info)

source: [call_contract](#call_contract)
fr: [contrat d'appel] (#contrat d'appel)
id: [call_contract]Akun#call_contract)
zh_cn: [电话_合同] (#电话_合同)

source: [deploy](#deploy)
es: [desplegar] (#desplegar)
fr: [déploiement] (#déploiement)
id: Font color = "# DF01D7" (deploy)
zh_cn: [部署](#部署)

source: [emit_event](#emit_event)
zh_cn: [emit_event] (# emit_event) (# emit_event)

source: [library_call](#library_call)
es: [biblioteca_call](#biblioteca_call)
fr: [appel_bibliothèque] (#appel_bibliothèque)
id: [pustaka_panggilan][ibrary_call]
zh_cn: [library_call] (# library_call) (# library_call) (# library_call)

source: [send_message_to_L1](#send_message_to_l1)
id: [Kirim_pesan_to_L1][kirim_pesan_ke_l1)
zh_cn: [send_message_to_L1] (# send_message_to_l1) (# send_message_to_l1)

source: [replace_class](#replace_class)
es: [reemplazar_clase](#reemplazar_clase)
fr: [remplacer_classe](#remplace_classe)
zh_cn: [替换_类](#替换_类)

source: [storage_read](#storage_read)
es: [Almacenamiento_lectura](#Almacenamiento_lectura)
fr: [Lisez_stockage](#Lisez_stockage)
id: [Storage_read][storage#storage_read]
zh_cn: [存储重 (# 存储重 )

source: [storage_write](#storage_write)
es: [Almacenamiento_escritura](#Almacenamiento_escritura)
id: [Storage_write][torage#storage_write]
zh_cn: [存储_ write] (# 存储_ write)

source: `get_block_hash`
zh_cn: " 设置路障 # # # # # # # Get_ block_hash # # # # Get_ block_hash # # # # Get_ block_hash # # # # # Get_ block_hash # # # # # # Get_ block_hash # # # # # # # # # # get # block_hash # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

source: Syntax
es: Sintaxis
fr: Syntaxe
id: Sintaksis
tr: Sözdizimi
zh_cn: 语法 语法

source: Description
es: Descripción
fr: Désignation des marchandises
id: Deskripsi
tr: Açıklama
zh_cn: 说明说明

source: Gets the hash of a specific StarkNet block within the range of `[first_v0_12_0_block, current_block - 10]`.
es: Obtiene el hash de un bloque específico de StarkNet dentro del rango de `[first_v0_12_0_block, current_block - 10]`.
fr: Get le hash d'un bloc spécifique StarkNet dans la plage de `[first_v0_12_0_block, current_block - 10]`.
id: Gets the hash of a specific StarkNet block within the range of å[first_v0_12_0_block, current_block - readers.
tr: [first_v0_12_0_block, current_block - 10] aralığında belirli bir StarkNet bloğunun hash'ini alır.
zh_cn: 在`[第一个_v0_12_0_0区块、当前_区块 - 10] 的范围内获取特定的 StarkNet 区块的散列。

source: Return Values
es: Valores de devolución
fr: Valeurs de retour
id: Nilai Kembali
tr: Dönüş Değerleri
zh_cn: 回报值

source: Returns the hash of the given block.
es: Devuelve el hash del bloque dado.
fr: Renvoie le hash du bloc donné.
id: Mengembalikan hash dari blok yang diberikan.
tr: Verilen bloğun hash'ini döndürür.
zh_cn: 返回给定区块的散列。

source: Error Messages
es: Mensajes de error
fr: Messages d'erreur
id: Pesan Galat
tr: Hata Mesajları
zh_cn: 错误消息

source: `Block number out of range`: `block_number` is greater than _`current_block`_`- 10`.
es: `Número de bloque fuera de rango`: `bloque_número` es mayor que `current_block`_`- 10 '.
fr: `Block number out of range`: `block_number` est plus grand que _`current_block`_`- 10`.
id: Nomor blok di luar jangkauan: nomor blok_number lebih besar dari blok_sekarang_10.
tr: Block number out of range: block_number _current_block_- 10'den büyüktür.
zh_cn: `超出范围的区号':`区号_数目'大于`流动_区号_-10'。

source: `0`: `block_number` is less than the first block number of v0.12.0.
es: `0`: `block_number` es inferior al primer número de bloque de v0.12.0.
fr: `0`: `block_number` est inférieur au premier numéro de bloc de v0.12.0.
id: 0: nomor blok_0 kurang dari jumlah blok pertama v0.12.0.
tr: 0: block_number, v0.12.0'ın ilk blok numarasından daha azdır.
zh_cn: `0':`区块号'小于v0.12.0的第一个区块号。

source: Common Library
es: Biblioteca común
fr: Bibliothèque commune
id: Pustaka Umum
tr: Ortak Kütüphane
zh_cn: 共同图书馆

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/0c882679fdb24a818cad19f2c18decbf6ef66153/corelib/src/starknet/syscalls.cairo#L37)
es: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/0c882679fdb24a818cad19f2c18debbf6ef66153/corelib/src/starknet/syscalls.cairo#L37)
id: [syscalls.cairo][19https://github.com/starkware-libs/cairo/cairo/0c8879fb24a18cad19f2c18cdecbf6ef15153/src/starknet/scalls.cairo#L37)
zh_cn: [syscalles.cairo] (https://github.com/starkware-libs/cairo/blob/0c882679fdb24a818cad19f2c18decbf665153/corelib/src/starknet/syscalls.cairo#L37)

source: `get_execution_info`
zh_cn: 获取_ 执行_ info

source: Gets information about the original transaction.
es: Obtiene información sobre la transacción original.
fr: Obtient des informations sur la transaction initiale.
id: Dapatkan informasi tentang transaksi asli.
tr: Orijinal işlem hakkında bilgi alır.
zh_cn: 获取原始交易的信息 。

source: In Cairo 1.0, all block/transaction/execution context getters are batched into this single system call.
es: En El Cairo 1.0, todos los block/transaction/ejecution context getters se agrupan en esta única llamada del sistema.
fr: Au Caire 1.0, tous les getters de contexte bloc/transaction/exécution sont regroupés dans cet appel système unique.
id: Di Kairo 1,0, semua blok/transaksi/eksekusi context getters yang batch ke dalam panggilan sistem tunggal.
tr: Kahire 1.0'da, tüm blok / işlem / yürütme bağlamı alıcıları bu tek sistem çağrısına toplu olarak gönderilir.
zh_cn: 在开罗1.0,所有区块/交易/执行环境抓取器都分批到这个单一的系统呼叫中。

source: Arguments
es: Argumentos
id: Argumen
tr: Tartışmalar
zh_cn: 参数参数

source: None.
es: Ninguno.
fr: Aucune.
id: Tidak ada.
tr: Hiç.
zh_cn: 无。

source: Returns a [struct](https://github.com/starkware-libs/cairo/blob/efbf69d4e93a60faa6e1363fd0152b8fcedbb00a/corelib/src/starknet/info.cairo#L8) containing the execution info.
es: Devuelve un [struct](https://github.com/starkware-libs/cairo/blob/efbf69d4e93a60faa6e1363fd0152b8fcedbb00a/corelib/src/starknet/info.cairo#L8) que contiene la información de ejecución.
fr: Retourne une [struct](https://github.com/starkware-libs/cairo/blob/efbf69d4e93a60faa6e1363fd0152b8fcedbb00a/corelib/src/starknet/info.cairo#L8) contenant les informations d'exécution.
id: Mengembalikan [struct][structps://github.com/starkware-libs/cairo/bbbf69d4e93a60faa1363fd0152b8fcedbb00a/Corelib/src/starknet/info.cairo#Liro8) berisi info eksekusi.
tr: Uygulama bilgilerini içeren bir [struct](https://github.com/starkware-libs/cairo/blob/efbf69d4e93a60faa6e1363fd0152b8fcedbb00a/corelib/src/starknet/info.cairo#L8) döndürür.
zh_cn: 返回 a (https://github.com/starkware-libs/cairo/blob/efbf69d4e93a60faa 66e1363fd01522b8fcedbb00a/corelib/src/starknet/info.cairo#L8) 含有执行信息。

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L35)
id: Font color = "# 404040" siscalls.cairo]://https://gitub.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e58767974f20994d0ba64183/src/starknet/scalls.cairo#L35)
zh_cn: [声传 (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L35)

source: `call_contract`
fr: `appel_contrat`
zh_cn: `呼叫_合同 '

source: Calls a given contract. This system call expects the address of the called contract, a selector for a function within that contract, and call arguments.
es: Convoca un contrato determinado. Esta llamada del sistema espera la dirección del contrato llamado, un selector para una función dentro de ese contrato, y argumentos de convocatoria.
fr: Appele un contrat donné. Cet appel système s'attend à l'adresse du contrat appelé, un sélecteur pour une fonction dans ce contrat, et appel arguments.
id: Memanggil kontrak yang diberikan. Sistem ini mengharapkan alamat dari yang disebut kontrak, pemilih untuk sebuah fungsi dalam kontrak itu, dan panggilan argumen.
tr: Verilen bir sözleşmeyi çağırır. Bu sistem çağrısı, söz konusu sözleşmenin adresini, o sözleşme içindeki bir işlev için bir seçiciyi ve çağrı argümanlarını bekler.
zh_cn: 系统呼叫预期该合同的地址,即该合同内某项职能的选定人,并标注参数。

source: **Note:**
es: **Nota:**
tr: **Not: **
zh_cn: ** 注:**

source: An internal call can’t return Err(\_) as this is not handled by the sequencer and the Starknet OS.
es: Una llamada interna no puede devolver Err(\_) ya que esto no es manejado por el secuenciador y el sistema operativo Starknet.
fr: Un appel interne ne peut pas renvoyer Err(\_) car cela n'est pas géré par le séquenceur et le système d'exploitation Starknet.
id: Sebuah panggilan internal dapat mengembalikan Erro\___) karena ini tidak ditangani oleh pengurut dan OS Starknet.
tr: Dahili bir çağrı Err(_) döndüremez, çünkü bu, sekanslayıcı ve Starknet OS tarafından ele alınmaz.
zh_cn: 内部呼叫无法返回 Err( ), 因为这不是由定序器和 Starknet OS 处理的 。

source: If call_contract_syscall fails, this can’t be caught and will therefore result in the entire transaction being reverted.
es: Si call_contract_syscall falla, esto no puede ser capturado y por lo tanto resultará en que toda la transacción sea revertida.
fr: Si call_contract_syscall échoue, cela ne peut pas être pris et entraînera donc le retour de toute la transaction.
id: Jika call_contract_syscall gagal, ini tidak dapat ditangkap dan oleh karena itu akan mengakibatkan seluruh transaksi yang dikembalikan.
tr: Call_contract_syscall başarısız olursa, bu yakalanamaz ve bu nedenle tüm işlemin geri döndürülmesine neden olur.
zh_cn: 如果调用- contract_syscall 失败, 无法抓住这个机会, 因此会导致整个交易被退回 。

source: _`address`_: The address of the contract you want to call.
es: _`direccion`_: La dirección del contrato al que desea llamar.
fr: _`address`_: L'adresse du contrat que vous souhaitez appeler.
id: Alamat kontrak yang ingin kau hubungi.
tr: _adres_: Aradığınız sözleşmenin adresi.
zh_cn: 地址:您要调用的合同地址 。

source: _`entry_point_selector`_: A selector for a function within that contract, can be computed with the `selector!` macro.
es: _`entry_point_selector`_: Un selector para una función dentro de ese contrato, se puede calcular con la macro `selector!`.
fr: _`entry_point_selector`_: Un sélecteur pour une fonction dans ce contrat, peut être calculé avec la macro `selector!`.
id: Pemilih untuk fungsi dalam kontrak itu, dapat dihitung dengan ahli bedah!
tr: _entry_point_selector_: Bu sözleşme içindeki bir fonksiyon için bir seçici, selector! makrosu ile hesaplanabilir.
zh_cn: \\ entr_ point_ elector } : 合同中函数的选择器, 可以用“ 选择器! ” 宏计算 。

source: _`calldata`_: The calldata array.
es: _`calldata`_: La matriz de calldata.
fr: _`calldata`_: Le tableau calldata.
id: Array calldata.
tr: _calldata_: Calldata dizisi.
zh_cn: 呼叫数据:呼叫数据阵列。

source: The call response, of type `SyscallResult<Span<felt252>>`.
es: La respuesta de llamada, de tipo `SyscallResult<Span<felt252.
fr: La réponse à l'appel, de type `SyscallResult<Span<felt252>>`.
id: Respon panggilan, tipe ¤SiscallResult<Span<felt252>>>.
tr: SyscallResultSpanfelt252> tipinin çağrı yanıtı.
zh_cn: 呼叫响应,类型为“SyscallResult <Span<felt252”。

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L10)
id: Font color = "# 404040" siscalls.cairo]://https://github.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e5876774f20994d0ba64183/src/starknet/scalls.cairo#L10)
zh_cn: [声传 (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L10)

source: **Note:** This is considered a lower-level syntax for calling contracts. If the interface of the called contract is available, then you can use a more straightforward syntax.
es: **Nota:** Esto se considera una sintaxis de nivel inferior para llamar contratos. Si la interfaz del contrato llamado está disponible, entonces puede utilizar una sintaxis más sencilla.
fr: **Note:** Ceci est considéré comme une syntaxe de niveau inférieur pour les appels de contrats. Si l'interface du contrat appelé est disponible, alors vous pouvez utiliser une syntaxe plus simple.
id: **Note:** Ini dianggap sintaks tingkat bawah untuk memanggil kontrak. Jika antarmuka dari kontrak yang disebut tersedia, maka Anda dapat menggunakan sintaks lebih sederhana.
tr: **Not:** Bu, sözleşmeleri çağırmak için daha düşük seviyeli bir sözdizimi olarak kabul edilir. Söz konusu sözleşmenin arayüzü mevcutsa, daha basit bir sözdizimi kullanabilirsiniz.
zh_cn: ** 注:** 这被认为是调用合同的较低级别的语法。如果有所谓的合同的界面,那么您可以使用更直截了当的语法。

source: `deploy`
fr: "déploiement"
zh_cn: `部署 '

source: Deploys a new instance of a previously declared class.
es: Implementa una nueva instancia de una clase previamente declarada.
fr: Déploye une nouvelle instance d'une classe précédemment déclarée.
id: Menyebarkan contoh baru dari kelas yang sebelumnya dinyatakan.
tr: Önceden ilan edilmiş bir sınıfın yeni bir örneğini dağıtır.
zh_cn: 部署一个新例子 之前申报的等级。

source: _`contract_address_salt`_: The salt, an arbitrary value provided by the sender. It is used in the computation of the contract’s address.
es: _`contract_address_salt`_: La sal, un valor arbitrario proporcionado por el remitente. Se utiliza en el cálculo de la dirección del contrato.
fr: _`contract_address_salt`_: Le sel, une valeur arbitraire fournie par l'expéditeur. Il est utilisé dans le calcul de l'adresse du contrat.
id: _Contract_address_salt__: Garam, nilai sewenang-wenang yang disediakan oleh pengirim. Hal ini digunakan dalam komputasi alamat kontrak.
tr: _contract_address_salt_: Gönderici tarafından sağlanan keyfi bir değer olan tuz. Sözleşmenin adresinin hesaplanmasında kullanılır.
zh_cn: 合同_地址_salt:盐,发件人提供的任意价值。用于计算合同地址。

source: _`calldata`_: The constructor’s calldata. An array of felts.
es: _`calldata`_: Calldata del constructor. Una serie de fieltros.
fr: _`calldata`_: Le constructeur='s calldata. Un tableau de feutres.
id: Constructors calldata, array of felts.
tr: _calldata_: Yapılandırıcının calldata'sı. Bir dizi keçe.
zh_cn: @calldata:建筑商的调用数据。

source: _`deploy_from_zero`_: A flag used for the contract address computation. If not set, the caller address will be used as the new contract’s deployer address, otherwise 0 is used.
es: _`deploy_from_zero`_: Un indicador utilizado para el cálculo de la dirección del contrato. Si no se establece, la dirección del llamante se utilizará como la dirección del despliegue del nuevo contrato, de lo contrario se utiliza 0.
fr: _`deploy_from_zero`_: Un drapeau utilisé pour le calcul de l'adresse du contrat. Si ce n'est pas défini, l'adresse de l'appelant sera utilisée comme nouvelle adresse de déploiement du contrat, sinon 0 est utilisé.
id: _BAR_deploy_from_zero__: Sebuah bendera yang digunakan untuk komputasi alamat kontrak. Jika tidak diatur, alamat pemanggil akan digunakan sebagai alamat pendistribusi kontrak baru, atau 0 digunakan.
tr: _deploy_from_zero_: Sözleşme adresi hesaplaması için kullanılan bir bayrak. Ayarlanmamışsa, arayan adresi yeni sözleşmenin konuşlandırıcı adresi olarak kullanılacaktır, aksi takdirde 0 kullanılır.
zh_cn: 由_ zero * 调出 : 合同地址计算所使用的旗帜。 如果不设置, 将使用呼叫地址作为新合同的部署地址, 否则使用 0 。 @ info: whatsthis

source: A tuple wrapped with SyscallResult where:
es: Una tupla envuelta con SyscallResult donde:
fr: Un tuple enroulé avec SyscallResult où:
id: Sebuah tuple dibungkus dengan SyscallResult di mana:
tr: SyscallResult ile sarılmış bir tuple nerede:
zh_cn: 由SyscallResult包着的图普:

source: The first element is the address of the deployed contract, of type `ContractAddress`.
es: El primer elemento es la dirección del contrato desplegado, del tipo `ContractAddress '.
fr: Le premier élément est l'adresse du contrat déployé, de type "ContractAddress".
id: Elemen pertama adalah alamat dari kontrak yang dikerahkan, jenis contractAdrress.
tr: İlk unsur, ContractAddress tipinde konuşlandırılmış sözleşmenin adresidir.
zh_cn: 第一个要素是部署合同的地址,即`合同地址'类型。

source: The second element is the response array from the contract’s constructor, of type `Span::<felt252>`.
es: El segundo elemento es la matriz de respuesta del constructor del contrato, del tipo `Span::<felt252''.
fr: Le deuxième élément est le tableau de réponse du constructeur du contrat, de type `Span::<felt252>`.
id: Elemen kedua adalah susunan tanggapan dari konstruktor kontrak, dari tipe ÁSpan::<felt252>.
tr: İkinci unsur, sözleşmenin yapıcısından gelen yanıt dizisidir, türü Span:felt252>'dir.
zh_cn: 第二个要素是合同施工者的反应阵列,即`span:<felt252_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/4821865770ac9e57442aef6f0ce82edc7020a4d6/corelib/src/starknet/syscalls.cairo#L22)
id: [syscalls.cairo]://githps.com/starkware-libs/cairo/cairo/482186571ac9e574441f6fs0ce82d702a4d6/Corelib/src/starknet/syscalls.cairo#L22)
zh_cn: [缩略语.cairo] (https://github.com/starkware-libs/cairo/blob/4821865770ac9.e57442aef6f0ce82edc7020a4d6/corelib/src/starknet/syscalls.cairo#L22)

source: `emit_event`
zh_cn: `弥撒活动'

source: Emits an event with a given set of keys and data.
es: Emite un evento con un conjunto dado de claves y datos.
fr: Emit un événement avec un ensemble donné de clés et de données.
id: Keluarkan suatu kejadian dengan satu set kunci dan data yang diberikan.
tr: Belirli bir anahtar ve veri kümesine sahip bir olayı belirtir.
zh_cn: 以给定的一组密钥和数据为根据进行活动 。

source: For more information and a higher-level syntax for emitting events, see [Starknet events](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/starknet-events/).
es: Para obtener más información y una sintaxis de mayor nivel para emitir eventos, consulte [Eventos Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/starknet-events/).
fr: Pour plus d'informations et une syntaxe de niveau supérieur pour émettre des événements, voir [Events Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/starknet-events/).
id: Untuk informasi lebih lanjut dan sintaks tingkat lebih tinggi untuk memancarkan peristiwa, lihat [Starknet events][Starknethttps://docs.starknet.io/documentation/archicture_and_concepts/Smart_Contracts/starknet-events/).
tr: Daha fazla bilgi ve yayan olaylar için daha üst düzey bir sözdizimi için [Starknet etkinlikleri](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/starknet-events/) sayfasına bakın.
zh_cn: 关于排放活动的更多信息和更高层次的语法,见[Starknet事件](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_contracts/starknet-events/)。
