Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: We can see that `do_something_with_parse_u8` function takes a `felt252` value as input and calls `parse_u8` function. The `?` operator is used to propagate the error, if any, or unwrap the successful value.
es: Podemos ver que la función `do_something_with_parse_u8` toma un valor `felt252` como entrada y llama a la función `parse_u8`. El operador `?` se utiliza para propagar el error, en su caso, o desenvolver el valor exitoso.
fr: Nous pouvons voir que la fonction `do_something_with_parse_u8` prend une valeur `felt252` comme entrée et appelle `parse_u8` fonction. L'opérateur `?` est utilisé pour propager l'erreur, le cas échéant, ou pour déballer la valeur réussie.
id: Kita dapat melihat bahwa 'do' sesuatu' dengan 'parse_u8' fungsi mengambil nilai ▪felt252) sebagai masukan dan panggilan fungsi 'parse_u8'. Operator digunakan untuk menyebarkan kesalahan, jika ada, atau membuka nilai sukses.
tr: do_something_with_parse_u8 fonksiyonunun girdi olarak felt252 değerini aldığını ve parse_u8 fonksiyonunu çağırdığını görebiliriz.? operatörü, varsa hatayı yaymak veya başarılı değeri açmak için kullanılır.
zh_cn: 我们可以看到,`Do_ something_with_parse_u8' 函数以“felt252” 值作为输入,称为`parse_u8' 函数。`?'运算符被用来传播错误(如果有的话)或解开成功值。

source: And with a little test case:
es: Y con un pequeño caso de prueba:
fr: Et avec un petit cas d'essai :
id: Dan dengan kasus kecil:
tr: Ve küçük bir test davasıyla:
zh_cn: 并用一个小的测试案例:

source: "Result: {}"
es: "Resultado:
fr: "Résultat: {}"
id: "Hasil: [}"
tr: "Sonuç: "
zh_cn: (成绩: )

source: "Error: {}"
fr: "Erreur: {}"
tr: "Hata: "
zh_cn: "错误: "

source: The console will print the error `Invalid Integer`.
es: La consola imprimirá el error `Integer Inválido`.
fr: La console va imprimer l'erreur `Invalid Integer`.
id: Konsol akan mencetak kesalahan yang tidak sah.
tr: Konsol Invalid Integer hatasını yazdıracaktır.
zh_cn: 控制台将打印错误“ 无效的整数 ” 。

source: We saw that recoverable errors can be handled in Cairo using the `Result` enum, which has two variants: `Ok` and `Err`. The `Result<T, E>` enum is generic, with types `T` and `E` representing the successful and error values, respectively. The `ResultTrait` provides methods for working with `Result<T, E>`, such as unwrapping values, checking if the result is `Ok` or `Err`, and panicking with custom messages.
es: Vimos que los errores recuperables se pueden manejar en El Cairo utilizando el enum `Resultado`, que tiene dos variantes: `Ok` y `Err`. El `Resultado<T, E' enum es genérico, con los tipos `T` y `E` que representan los valores de éxito y de error, respectivamente. El `Resultado` proporciona métodos para trabajar con `Resultado<T, E`, tales como valores de desenvolver, comprobar si el resultado es `Ok` o `Errr`, y entrar en pánico con mensajes personalizados.
fr: Nous avons vu que les erreurs récupérables peuvent être traitées au Caire à l'aide de l'enum `Result`, qui a deux variantes: `Ok` et `Err`. L'enum `Result<T, E>` est générique, avec les types `T` et `E` représentant respectivement les valeurs de succès et d'erreur. L' `ResultTrait` fournit des méthodes pour travailler avec `Result<T, E>`, telles que décompresser des valeurs, vérifier si le résultat est `Ok` ou `Err`, et paniquer avec des messages personnalisés.
id: Kami melihat bahwa kesalahan yang dapat dipulihkan dapat ditangani di Kairo menggunakan enum generic, yang memiliki dua varian, yang masing-masing mewakili nilai yang sukses dan galat.
tr: Geri kazanılabilir hataların Kahire'de iki varyantı olan Result enum'u kullanarak ele alınabileceğini gördük: Ok ve Err. ResultT, E> enum, sırasıyla başarılı ve hata değerlerini temsil eden T ve E türleri ile geneldir. ResultTrait, Result gibi çalışma yöntemleri sunar.
zh_cn: 我们看到,在开罗可以使用`Result' enum处理可收回的错误,该`Result'enum有两个变式:`Ok'和`Err'。`Result < T,E enum是通用的,分别代表成功和错误值的`T'和`E'类型。`ResultTrait'提供了处理`Result < T,E的工作方法,例如未包装值,检查结果是否为`Ok'或`Err ',以及用自定义信息惊慌失措。

source: To handle recoverable errors, a function can return a `Result` type and use pattern matching to handle the success or failure of an operation. The `?` operator can be used to implicitly handle errors by propagating the error or unwrapping the successful value. This allows for more concise and clear error handling, where the caller is responsible for managing errors raised by the called function.
es: Para manejar errores recuperables, una función puede devolver un tipo de `Resultado` y utilizar un patrón que coincida para manejar el éxito o el fracaso de una operación. El operador `?` se puede utilizar para manejar errores implícitamente propagando el error o desenvolviendo el valor exitoso. Esto permite un manejo de errores más conciso y claro, donde el llamante es responsable de manejar los errores planteados por la función llamada.
fr: Pour gérer les erreurs récupérables, une fonction peut retourner un type `Résultat` et utiliser un modèle correspondant pour gérer le succès ou l'échec d'une opération. L'opérateur `?` peut être utilisé pour gérer implicitement les erreurs en propageant l'erreur ou en décompilant la valeur réussie. Cela permet une gestion plus concise et plus claire des erreurs, où l'appelant est responsable de la gestion des erreurs soulevées par la fonction appelée.
id: Untuk menangani kesalahan yang dapat dipulihkan, sebuah fungsi dapat mengembalikan jenis ÁResulté dan menggunakan pencocokan pola untuk menangani keberhasilan atau kegagalan suatu operasi. Operator dapat digunakan secara implisit untuk menangani kesalahan dengan menyebarkan kesalahan atau mengurai nilai yang sukses. Hal ini memungkinkan untuk lebih ringkas dan jelas penanganan galat, di mana penelepon bertanggung jawab untuk menangani kesalahan yang dibangkitkan oleh fungsi yang disebut.
tr: Geri kazanılabilir hataları işlemek için, bir işlev bir Result tipini döndürebilir ve bir işlemin başarısını veya başarısızlığını ele almak için kalıp eşlemesini kullanabilir.? operatörü, hatayı yayarak veya başarılı değeri çözerek hataları dolaylı olarak ele almak için kullanılabilir. Bu, arayan kişinin çağrılan işlev tarafından yükseltilen hataları yönetmekten sorumlu olduğu daha özlü ve net hata işleme sağlar.
zh_cn: 要处理可回收错误, 函数可以返回“ Result” 类型, 并使用匹配模式处理操作的成败。 `?'操作员可以通过传播错误或解封成功值来暗中处理错误。 这样可以进行更简洁、更明确的错误处理, 由调用者负责管理调用函数引起的错误。

source: {{#quiz ../quizzes/ch09-02-error-handling-result.toml}}
es: quiz../quizzes/ch09-02-error-manipulación-resultado.toml
fr: {{#quiz../quizes/ch09-02-manipulation de l'erreur-result.toml}}
zh_cn: ./quizzes/ch09-02-error-error-leaking-result.toml

source: Correctness in our programs is the extent to which our code does what we intend it to do. Cairo is designed with a high degree of concern about the correctness of programs, but correctness is complex and not easy to prove. Cairo's linear type system shoulders a huge part of this burden, but the type system cannot catch everything. As such, Cairo includes support for writing tests.
es: La corrección en nuestros programas es la medida en que nuestro código hace lo que pretendemos que haga. El Cairo está diseñado con un alto grado de preocupación sobre la corrección de los programas, pero la corrección es compleja y no es fácil de probar. El sistema de tipo lineal de El Cairo soporta una gran parte de esta carga, pero el sistema de tipo no puede atrapar todo.
fr: L'exactitude dans nos programmes est la mesure dans laquelle notre code fait ce que nous avons l'intention de faire. Le Caire est conçu avec un degré élevé de préoccupation au sujet de l'exactitude des programmes, mais l'exactitude est complexe et pas facile à prouver. Le système de type linéaire du Caire supporte une grande partie de ce fardeau, mais le système de type ne peut pas tout attraper.
id: Kebenaran dalam program kita adalah sejauh mana kode kita melakukan apa yang kita berniat untuk melakukannya. Kairo dirancang dengan tingkat tinggi keprihatinan tentang kebenaran program, tetapi kebenaran itu rumit dan tidak mudah untuk membuktikan. Sistem linear Kairo bahu bagian besar dari beban ini, tetapi sistem tipe tidak bisa menangkap segalanya. Karena demikian, Kairo termasuk dukungan untuk tes menulis.
tr: Programlarımızda doğruluk, kodumuzun yapmayı amaçladığımız şeyi ne ölçüde yaptığıdır. Kahire, programların doğruluğu konusunda yüksek derecede endişeyle tasarlanmıştır, ancak doğruluk karmaşık ve kanıtlanması kolay değildir. Kahire'nin doğrusal tip sistemi bu yükün büyük bir bölümünü taşır, ancak tip sistemi her şeyi yakalayamaz. Bu nedenle Kahire, yazma testleri için destek içerir.
zh_cn: 我们的程序的正确性在于我们的代码在多大程度上做了我们想要做的事情。 开罗的设计高度关注程序的正确性,但正确性是复杂而不容易证明的。 开罗的线性系统承担着这一负担的一大部分,但类型系统无法抓住一切。 因此,开罗包括了对写作测试的支持。

source: Testing is a complex skill: although we can’t cover every detail about how to write good tests in one chapter, we’ll discuss the mechanics of Cairo's testing facilities. We’ll talk about the annotations and macros available to you when writing your tests, the default behavior and options provided for running your tests, and how to organize tests into unit tests and integration tests.
es: Las pruebas son una habilidad compleja: aunque no podemos cubrir todos los detalles sobre cómo escribir buenas pruebas en un capítulo, vamos a discutir la mecánica de las instalaciones de pruebas de El Cairo. Hablaremos de las anotaciones y macros disponibles para usted al escribir sus pruebas, el comportamiento predeterminado y las opciones proporcionadas para ejecutar sus pruebas, y cómo organizar las pruebas en pruebas unitarias y pruebas de integración.
fr: Tester est une compétence complexe: bien que nous ne puissions pas couvrir tous les détails sur la façon d'écrire de bons tests dans un chapitre, nous allons discuter de la mécanique des installations de test du Caire. Nous allons parler des annotations et macros disponibles pour vous lors de l'écriture de vos tests, le comportement par défaut et les options fournies pour exécuter vos tests, et comment organiser des tests en tests unitaires et des tests d'intégration.
id: Tes adalah keterampilan yang rumit: meskipun kita tidak dapat menutupi setiap detail tentang bagaimana menulis tes yang baik dalam satu bab, kita akan membahas mekanisme fasilitas pengujian Kairo. kita akan berbicara tentang anotasi dan macros yang tersedia untuk Anda ketika menulis tes Anda, perilaku baku dan pilihan yang disediakan untuk menjalankan tes Anda, dan bagaimana mengatur tes ke tes unit dan integrasi tes.
tr: Test etmek karmaşık bir beceridir: Bir bölümde iyi testlerin nasıl yazılacağına dair her ayrıntıyı karşılayamasak da, Kahire'nin test tesislerinin mekaniğini tartışacağız. Testlerinizi yazarken kullanabileceğiniz açıklamalardan ve makrolardan, testlerinizi yürütmek için sağlanan varsayılan davranış ve seçeneklerden ve testlerin birim testlere ve entegrasyon testlerine nasıl organize edileceğinden bahsedeceğiz.
zh_cn: 测试是一种复杂的技能:虽然我们无法在一章中涵盖如何写好测试的每一个细节,但我们还是会讨论开罗测试设施的机械学。 我们将讨论您在写测试时可用的说明和宏、运行测试的默认行为和选项,以及如何将测试组织成单位测试和整合测试。

source: The Anatomy of a Test Function
es: La anatomía de una función de prueba
fr: L'anatomie d'une fonction d'essai
id: Anatomi Suatu Fungsi Ujian
tr: Bir Test Fonksiyonunun Anatomisi
zh_cn: 测试函数解剖学

source: Tests are Cairo functions that verify that the non-test code is functioning in the expected manner. The bodies of test functions typically perform these three actions:
es: Las pruebas son funciones de El Cairo que verifican que el código no test funciona de la manera esperada. Los cuerpos de las funciones de prueba normalmente realizan estas tres acciones:
fr: Les tests sont des fonctions du Caire qui vérifient que le code de non-essai fonctionne de la manière prévue.
id: Uji coba adalah fungsi Kairo yang memverifikasi bahwa kode bukan tes berfungsi dengan cara yang diharapkan. Tubuh dari fungsi tes biasanya melakukan tiga aksi ini:
tr: Testler, test olmayan kodun beklenen şekilde çalıştığını doğrulayan Kahire fonksiyonlarıdır. Test fonksiyonlarının gövdeleri tipik olarak şu üç işlemi gerçekleştirir:
zh_cn: 测试是开罗的功能,用于核查非测试代码是否以预期的方式运作。

source: Set up any needed data or state.
es: Configure cualquier dato o estado necesario.
fr: Configurez toutes les données ou l'état nécessaires.
id: Atur data atau keadaan yang diperlukan.
tr: Gerekli herhangi bir veriyi veya durumu ayarlayın.
zh_cn: 设置所需的数据或状态 。

source: Run the code you want to test.
es: Ejecute el código que desea probar.
fr: Exécutez le code que vous voulez tester.
id: Jalankan kode yang ingin kau uji.
tr: Test etmek istediğiniz kodu çalıştırın.
zh_cn: 运行您想要测试的代码 。

source: Assert the results are what you expect.
es: Asegura que los resultados son lo que esperas.
fr: Assister les résultats sont ce que vous attendez.
id: Membantu hasil adalah apa yang Anda harapkan.
tr: Sonuçların beklediğiniz gibi olduğunu varsayın.
zh_cn: 保证结果就是你所期望的

source: Let’s look at the features Cairo provides for writing tests that take these actions, which include:
es: Echemos un vistazo a las características que El Cairo proporciona para las pruebas de escritura que toman estas acciones, que incluyen:
fr: Regardons les caractéristiques du Caire pour écrire des tests qui prennent ces mesures, qui comprennent:
id: Mari kita lihat fitur-fitur yang disediakan Kairo untuk tes penulisan yang mengambil tindakan ini, termasuk:
tr: Kahire'nin şu eylemleri yapan yazma testleri için sağladığı özelliklere bakalım:
zh_cn: 让我们看看开罗为采取这些行动提供了书面测试,其中包括:

source: `#[test]` attribute.
es: Atributo «[test]`.
fr: attribut `#[test]`.
id: atribut.
tr: #[test] özniteliği.
zh_cn: [测试]`属性。

source: `assert!`, `assert_eq!`, `assert_ne!`, `assert_lt!`, `assert_le!`, `assert_gt!` and `assert_ge!` macros.
es: `Assert!`, `assert_eq!`, `assert_ne!`, `assert_lt!`, `assert_le!`, `assert_gt!` y `assert_ge!` macros.
fr: macros `assert!`, `assert_eq!`, `assert_ne!`, `assert_lt!`, `assert_le!`, `assert_gt!` et `assert_ge!`.
id: Assert!, assert_eq!, assert_ne!, essert!, macros!
tr: assert!, assert_eq!, assert_ne!, assert_lt!, assert_le!, assert_gt! ve assert_ge! makroları.
zh_cn: `assrt!'、`assrt_eq!'、`assrt_ne!'、`assrt_lt!'、`assrt_le!'、`assrt_gt!'和`assrt_ge!'宏观。

source: `#[should_panic]` attribute.
es: Atributo •[debería_panic]`.
fr: attribut `#[whould_panic]`.
id: Atribut.
tr: #[should_panic] özniteliği.
zh_cn: `[应_panic]'属性。

source: At its simplest, a test in Cairo is a function that’s annotated with the `#[test]` attribute. Attributes are metadata about pieces of Cairo code; one example is the `#[derive()]` attribute we used with structs in [Chapter 5](ch05-01-defining-and-instantiating-structs.md). To change a function into a test function, add `#[test]` on the line before `fn`. When you run your tests with the `scarb cairo-test` command, Scarb runs Cairo's test runner binary that runs the annotated functions and reports on whether each test function passes or fails.
es: En su más simple, una prueba en El Cairo es una función que está anotada con el atributo "[test]`. Los atributos son metadatos sobre piezas de código de El Cairo; un ejemplo es el atributo "[derive()]` que usamos con las estructuras en [Capítulo 5](ch05-01-defining-and-instantiating-structs.md). Para cambiar una función en una función de prueba, añada "[test]` en la línea antes de "fn". Cuando ejecute sus pruebas con el comando "escarb cairo-test", Scarb ejecuta el binario de corredor de pruebas de El Cairo que ejecuta las funciones anotadas e informa sobre si cada función de prueba pasa o falla.
fr: À son plus simple, un test au Caire est une fonction qui est annotée avec l'attribut `#[test]`. Les attributs sont des métadonnées sur des morceaux du code du Caire; un exemple est l'attribut `#[derive()]` que nous avons utilisé avec des structs dans [Chapitre 5](ch05-01-définissant-et-instantiant-structs.md). Pour changer une fonction en fonction de test, ajoutez `#[test]` sur la ligne avant `fn`. Lorsque vous exécutez vos tests avec la commande `scarb cairo-test`, Scarb exécute le binaire du coureur de test du Caire qui exécute les fonctions annotées et indique si chaque fonction de test passe ou échoue.
id: Pada dasarnya, sebuah tes di Kairo adalah fungsi yang dianotasi dengan atribut yang kita gunakan dengan struktur di [Chapter 5]-01-dening-and-instenting-structs.m). Untuk mengubah fungsi menjadi fungsi tes, tambahkan [#[test] di baris sebelum. Ketika Anda menjalankan tes Anda dengan kartiro-cart Scarb, jalankan tes biner yang berjalan pada setiap fungsi, atau gagal pada setiap fungsi yang dijalankan pada setiap fungsi.
tr: En basit haliyle, Kahire'deki bir test, #[test] özniteliği ile belirtilen bir fonksiyondur. Öznitelikler, Kahire kodunun parçaları hakkında meta verilerdir; bir örnek, [Bölüm 5] (ch05-01-defining-and-strastistating-structs.md) 'deki structs ile birlikte kullandığımız #[derive()] özniteliğidir. Bir fonksiyona değiştirildiğinde
zh_cn: 最简单的是,开罗的测试是一个函数,带有`[测试]'属性的附加说明。属性是开罗代码的元数据;一个例子是[第5章](ch05-01-定义-定义-和验证-structs.md)中使用的“[衍生 属性”属性。要将函数转换为测试函数,请在`fn'之前的线上添加“[测试]”。当您使用“scarb cairo-stest' 命令”进行测试时,Scarb运行开罗的测试选手二进库,该选手运行附加说明的函数,并报告每个测试函数是否通过或失败。

source: Let's create a new project called _adder_ using Scarb with the command `scarb new adder`:
es: Vamos a crear un nuevo proyecto llamado _adder_ usando Scarb con el comando `scarb new adder`:
fr: Crée un nouveau projet appelé _adder_ en utilisant Scarb avec la commande `scarb new adder`:
id: Mari kita buat sebuah proyek baru yang disebut _adder_ menggunakan Scarb dengan perintah thosecarb new adder.:
tr: Scarb'ı scarb new adder komutuyla kullanarak _adder_ adlı yeni bir proje oluşturalım:
zh_cn: 让我们创建一个名为 _adder_的新工程, 使用带有命令“ 切除新添加器” 的刀疤 :

source: In _lib.cairo_, let's remove the existing content and add a `tests` module containing the first test, as shown in Listing 10-1.
es: En _lib.cairo_, eliminemos el contenido existente y añadamos un módulo de `pruebas` que contenga la primera prueba, como se muestra en Listar 10-1.
fr: Dans _lib.cairo_, supprimons le contenu existant et ajoutons un module `tests` contenant le premier test, comme indiqué dans Listing 10-1.
id: Dalam _lib.cairo_, mari kita hapus konten yang ada dan tambahkan modul åtestá berisi tes pertama, seperti yang ditunjukkan dalam Daftar 10-1.
tr: _lib.cairo_'da, mevcut içeriği kaldıralım ve Listeleme 10-1'de gösterildiği gibi ilk testi içeren bir tests modülü ekleyelim.
zh_cn: 在 _lib.cairo_中,让我们删除现有内容,并添加一个包含第一个测试的“测试”模块,如清单10-1所示。

source: <span class="caption">Listing 10-1: A simple test function</span>
es: <span class="caption">Lista 10-1: Una función de prueba simple</span>
fr: <span class="caption">Liste 10-1: Une simple fonction d'essai</span>
id: <span class="caption">Listing 10-1: Sebuah fungsi tes sederhana</span>
tr: span class="caption">Listing 10-1: Basit bir test fonksiyonu/span>
zh_cn: <span类="Caption" > listing 10-1: 一个简单的测试函数 </span>

source: Note the `#[test]` annotation: this attribute indicates this is a test function, so the test runner knows to treat this function as a test. We might also have non-test functions to help set up common scenarios or perform common operations, so we always need to indicate which functions are tests.
es: Tenga en cuenta la anotación de la prueba: este atributo indica que se trata de una función de prueba, por lo que el corredor de la prueba sabe tratar esta función como una prueba. También podríamos tener funciones que no son pruebas para ayudar a establecer escenarios comunes o realizar operaciones comunes, por lo que siempre necesitamos indicar qué funciones son pruebas.
fr: Notez l'annotation `#[test]`: cet attribut indique qu'il s'agit d'une fonction de test, de sorte que le coureur de test sait traiter cette fonction comme un test. Nous pourrions également avoir des fonctions non-test pour aider à définir des scénarios communs ou effectuer des opérations communes, donc nous devons toujours indiquer quelles fonctions sont des tests.
id: Perhatikan anotasi (stest): atribut ini menunjukkan fungsi tes, jadi pelari uji tahu untuk memperlakukan fungsi ini sebagai tes. kita mungkin juga memiliki fungsi non-test untuk membantu mengatur skenario umum atau melakukan operasi umum, jadi kita selalu perlu mengindikasi fungsi yang mana adalah tes.
tr: #[test] eknotasyonuna dikkat edin: bu öznitelik bunun bir test fonksiyonu olduğunu gösterir, bu nedenle test koşucusu bu işlevi bir test olarak ele almayı bilir. Ayrıca, ortak senaryolar kurmaya veya ortak işlemleri gerçekleştirmeye yardımcı olmak için test dışı işlevlere de sahip olabiliriz, bu nedenle her zaman hangi işlevlerin test olduğunu belirtmemiz gerekir.
zh_cn: 注意 {[ test] ` 注释: 此属性表示这是一个测试函数, 所以测试运行者知道将此函数作为测试处理 。 我们还可能有非测试函数来帮助设置共同的假想或执行共同操作, 所以我们总是需要指出哪些函数是测试 。

source: We use the `#[cfg(test)]` attribute for the `tests` module, so that the compiler knows the code it contains needs to be compiled only when running tests. This is actually not an option: if you put a simple test with the `#[test]` attribute in a _lib.cairo_ file, it will not compile. We will talk more about the `#[cfg(test)]` attribute in the next [Testing Organization](ch10-02-test-organization.md) section.
es: Para el módulo `tests` se utiliza el atributo •[cfg(test)]`, de modo que el compilador conoce el código que contiene sólo necesita ser compilado cuando se ejecutan pruebas. Esto no es una opción: si se pone una prueba simple con el atributo •[test]` en un archivo _lib.cairo_, no se compilará. Hablaremos más sobre el atributo •[cfg(test)]` en la siguiente sección [Organización de pruebas](ch10-02-test-organization.md).
fr: Nous utilisons l'attribut `#[cfg(test)]` pour le module `tests`, afin que le compilateur connaisse le code qu'il contient doit être compilé seulement lors de l'exécution des tests. Ce n'est en fait pas une option: si vous mettez un test simple avec l'attribut `#[test]` dans un fichier _lib.cairo_, il ne sera pas compilé. Nous parlerons plus de l'attribut `#[cfg(test)]` dans la section suivante [Testing Organization](ch10-02-test-organization.md).
id: Kami menggunakan atribut untuk modul estimasi, sehingga kompiler tahu kode yang ada perlu dikompilasi hanya ketika menjalankan tes. Ini sebenarnya bukan pilihan: jika Anda menempatkan tes sederhana dengan atribut _lib.cairo_, ini tidak akan dikompilasi. Kita akan berbicara lebih banyak tentang atribut Á dalam bagian selanjutnya [Tg[Test Organization-02-est.m).
tr: #[cfg(test)] özniteliğini tests modülü için kullanıyoruz, böylece derleyici içerdiği kodun yalnızca testler yapılırken derlenmesi gerektiğini biliyor. Bu aslında bir seçenek değil: #[test] özniteliğini bir _lib.cairo_ dosyasına koyarsanız, derlemez. #[cfg(test) özniteliği hakkında daha fazla konuşacağız.
zh_cn: 我们使用`测试'模块的 {{{[cfg(test)]}}`属性,这样汇编者才知道它所包含的代码只有在运行测试时才需要编译。这实际上不是一个选项:如果在 _lib.cairo_文件中用 {[test] 属性进行简单测试,它就不会编译。我们将在下一个[测试组织] (ch10-02-test-orgection.md) 部分更多地讨论“{[cfg(test)]’’属性。
