Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: For each smart wallet we'll use, we must create a Signer within the encrypted keystore and an Account Descriptor. This process is also detailed in the \["Testnet Deployment"\]\[signer creation\] chapter of the Starknet Book.
es: Para cada cartera inteligente que utilicemos, debemos crear un Signer dentro de la tienda de claves cifrada y un Descriptor de Cuenta. Este proceso también se detalla en el capítulo \["Deploración de redes de prueba"\]\[Creación de firmantes\] del Libro Starknet.
fr: Pour chaque portefeuille intelligent que nous utiliserons, nous devons créer un Signer dans le keystore crypté et un Descripteur de compte. Ce processus est également détaillé dans le chapitre \["Testnet Deployment"\]\[signer creation\] du Livre Starknet.
id: Untuk setiap dompet pintar yang akan kita gunakan, kita harus membuat penanda dalam toko kunci terenkripsi dan akun Descriptor. Proses ini juga rinci dalam \["Testnet Deployment"\]\[penciptaan\] bab dari Starknet Book.
tr: Kullanacağımız her akıllı cüzdan için şifreli anahtar deposunda bir Signer ve bir Hesap Tanımlayıcısı oluşturmalıyız. Bu işlem Starknet Kitabının ["Testnet Dağıtımı"][signer creation] bölümünde de detaylandırılmıştır.
zh_cn: 对于我们将要使用的每一个智能钱包, 我们必须在加密的密钥库和账户描述符中创建一个签名人。 这个过程在史塔克内书的\[“ 测试网部署”\]\[ 符号创建] 章节中也有详细描述 。

source: We can create Signers and Account Descriptors for the accounts we want to use for voting. Let's create a smart wallet for voting in our smart contract.
es: Podemos crear Signatarios y Descriptores de Cuenta para las cuentas que queremos usar para votar. Vamos a crear una cartera inteligente para votar en nuestro contrato inteligente.
fr: Nous pouvons créer des Signers et des Descripteurs de comptes pour les comptes que nous voulons utiliser pour voter. Créons un portefeuille intelligent pour voter dans notre contrat intelligent.
id: Kita dapat membuat Signers dan Akun Descriptor untuk akun yang ingin kita gunakan untuk memilih.
tr: Oy vermek için kullanmak istediğimiz hesaplar için Signers ve Account Descriptors oluşturabiliriz. Akıllı sözleşmemizde oy kullanmak için akıllı bir cüzdan oluşturalım.
zh_cn: 我们可以为我们要用于投票的账户创建签名人和账户描述符。 让我们创建一个智能钱包, 用于在智能合同中投票 。

source: Firstly, we create a signer from a private key:
es: En primer lugar, creamos un signatario a partir de una clave privada:
fr: Premièrement, nous créons un signataire à partir d'une clé privée :
id: Pertama, kami membuat penandatangan dari kunci privat:
tr: Öncelikle, özel bir anahtardan bir imzacı oluşturuyoruz:
zh_cn: 首先,我们用私人密钥创建签名人:

source: Then, we create the Account Descriptor by fetching the katana account we want to use:
es: Luego, creamos el Descriptor de Cuenta mediante la búsqueda de la cuenta katana que queremos usar:
fr: Ensuite, nous créons le Descripteur de compte en récupérant le compte katana que nous voulons utiliser:
id: Lalu, kami membuat Akun Descriptor dengan mengambil akun katana yang ingin kami gunakan:
tr: Ardından, kullanmak istediğimiz katana hesabını getirerek Hesap Tanımlayıcıyı oluşturuyoruz:
zh_cn: 然后,我们通过获取我们想要使用的katana账户创建账户描述符:

source: This command will create a new `account0_account.json` file containing the following details:
es: Este comando creará un nuevo archivo `account0_account.json` que contiene los siguientes detalles:
fr: Cette commande créera un nouveau fichier `account0_account.json` contenant les détails suivants:
id: Perintah ini akan membuat sebuah berkas baru yang berisi rincian berikut:
tr: Bu komut, aşağıdaki ayrıntıları içeren yeni bir account0_account.json dosyası oluşturacaktır:
zh_cn: 此命令将创建一个新的“ account0_ account.json” 文件, 包含以下细节 :

source: "version"
es: "versión"
id: "versi"
tr: "sürüm"
zh_cn: "转换"

source: "variant"
es: "variante"
fr: "variante"
id: "varian"
tr: "değişken"
zh_cn: "变异"

source: "type"
es: "tipo"
tr: "tip"
zh_cn: "类型"

source: "open_zeppelin"
id: "open_zeplon"
tr: "open_zeppelin" (İngilizce).
zh_cn: "开放 - 飞艇"

source: "public_key"
es: "tecla_pública"
fr: "clé publique"
id: Kunci_publik
tr: "public_key" (İngilizce).
zh_cn: "公用钥匙"

source: "deployment"
es: "despliegue"
fr: "déploiement"
id: "kekurangan pekerjaan"
tr: "Deployment" (İngilizce).
zh_cn: "部署"

source: "status"
fr: "statut"
zh_cn: "状态"

source: "deployed"
es: "desplegado"
fr: "déployé"
id: "lenyapkan"
tr: "işgal edildi"
zh_cn: "已部署"

source: "class_hash"
es: "clase_hash"
fr: "classe_hash"
tr: "Sınıf_hash"
zh_cn: "类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类- 类

source: "<SMART_WALLET_CLASS_HASH>"
zh_cn: (<SMART_WALLET_CLASS_HASH>) (<SMART_WALLET_CLASS_HASH>)

source: "address"
es: "Dirección"
fr: "adresse"
id: "alamat"
tr: "adres"
zh_cn: "地址"

source: "<SMART_WALLET_ADDRESS>"
zh_cn: (<SMART_WALLET_地址>)

source: You can retrieve the smart wallet class hash (it will be the same for all your smart wallets) with the following command. Notice the use of the `--rpc` flag and the RPC endpoint provided by `katana`:
es: Puede recuperar el hash de clase de cartera inteligente (será el mismo para todas sus carteras inteligentes) con el siguiente comando. Observe el uso de la bandera `--rpc` y el punto final RPC proporcionado por `katana`:
fr: Vous pouvez récupérer le hash de classe portefeuille intelligent (il sera le même pour tous vos portefeuilles intelligents) avec la commande suivante. Remarquez l'utilisation du drapeau `--rpc` et le paramètre RPC fourni par `katana`:
id: Anda dapat mengambil hash dompet cerdas (akan sama untuk semua dompet pintar Anda) dengan perintah berikut.
tr: Akıllı cüzdan sınıfı hash'i (tüm akıllı cüzdanlarınız için aynı olacaktır) aşağıdaki komutla alabilirsiniz. --rpc bayrağının ve katana tarafından sağlanan RPC uç noktasının kullanımına dikkat edin:
zh_cn: 您可以使用以下命令获取智能钱包类散列( 智能钱包类散列将相同) 。 请注意 ` katana'提供的 `- rpc'旗帜和 RPC 端点的使用 :

source: ``` starkli class-hash-at <SMART_WALLET_ADDRESS> --rpc http://0.0.0.0:5050 ```
es: * class-hash-at <SMART_WALLET_ADDRESS> --rpc http://0.0.0.0.5050
id: ▪ starcli class-hash-at <SMART_WALLET_ADDRESS> --rpc http://0.0.0:50
zh_cn: Starkli 类-hash-at <SMART_WALLET_ADIDESS>-rpc <http://0.0. 0.0: 5050\ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \ \

source: For the public key, you can use the `starkli signer keystore inspect` command with the directory of the keystore json file:
es: Para la clave pública, puede utilizar el comando `starkli signator keystore inspection` con el directorio del archivo keystore json:
fr: Pour la clé publique, vous pouvez utiliser la commande `starkli signer keystore inspect` avec le répertoire du fichier json de keystore:
id: Untuk kunci publik, Anda dapat menggunakan kunci penyimpanan kunci dari berkas json penyimpanan kunci:
tr: Genel anahtar için starkli imzalayıcı anahtar deposu teftiş komutunu anahtar deposu json dosyasının dizini ile kullanabilirsiniz:
zh_cn: 对于公用钥匙,您可以使用“starkli signer keytore 检查”命令,并使用键盘 Json 文件目录:

source: This process is identical for `account_1` and `account_2` in case you want to have a second and a third voter.
es: Este proceso es idéntico para `account_1` y `account_2` en caso de que desee tener un segundo y un tercer votante.
fr: Ce processus est identique pour `account_1` et `account_2` si vous voulez avoir un deuxième et un troisième électeur.
id: Proses ini identik dengan proses yang terjadi pada pemilih kedua dan ketiga.
tr: Bu işlem account_1 ve account_2 için aynıdır, eğer ikinci ve üçüncü bir seçmene sahip olmak istiyorsanız.
zh_cn: 如果您想要第二和第三选民,这个过程与`账号_1'和`账号_2'相同。

source: \[starkli installation\]: https://book.starknet.io/ch02-01-basic-installation.html#starkli-installation) \[signer creation\]: https://book.starknet.io/ch02-05-testnet-deployment.html?highlight=signer#creating-a-signer
es: \[starkli installation\]: https://book.starknet.io/ch02-01-basic-installation.html#starkli-installation) \[signer creation\]: https://book.starknet.io/ch02-05-testnet-distribution.html?highlight=signer#creating-a-signer
id: \[starkli\]: https://book.starknet.io/ch02-01-basic-installation.html#starkli-installation) \ \[signer pembuatan\]: https://book.starknet.io/ch02-05-testestnet-deployment.html?highlight=signing-a-signer
tr: [starkli enstalasyon]: https://book.starknet.io/ch02-01-basic-installation.html#starkli-installation] [signer creation]: https://book.starknet.io/ch02-05-testnet-deployment.html?highlight=signer#creating-a-signer
zh_cn: https://book.starknet.io/ch02-01-import-安裝.html#starkli-安裝)\[發號人創 https://book.starknet.io/ch02-05-stestnet-importation.html?highlight=signer#reating-a-signer

source: Contract Deployment
es: Despliegue de contratos
fr: Déploiement du contrat
id: Penyebaran Kontrak
tr: Sözleşme Dağıtımı
zh_cn: 合同部署

source: Before deploying, we need to declare the contract. We can do this with the `starkli declare` command:
es: Antes de desplegar, tenemos que declarar el contrato. Podemos hacer esto con el comando `starkli declara ':
fr: Avant de déployer, nous devons déclarer le contrat. Nous pouvons le faire avec la commande `starkli declare`:
id: Sebelum menyebarkannya, kita harus mengumumkan kontraknya.
tr: Göreve başlamadan önce sözleşmeyi ilan etmeliyiz. Bunu starkli deklarasyonu komutuyla yapabiliriz:
zh_cn: 在部署之前,我们需要宣布合同。

source: If the compiler version you're using is older than the one used by Starkli and you encounter a `compiler-version` error while using the command above, you can specify a compiler version to use in the command by adding the `--compiler-version x.y.z` flag.
es: Si la versión del compilador que está usando es más antigua que la utilizada por Starkli y se encuentra con un error de `compilador-versión` mientras utiliza el comando anterior, puede especificar una versión del compilador para usar en el comando añadiendo la bandera `--compilador-versión x.y.z`.
fr: Si la version du compilateur que vous utilisez est plus ancienne que celle utilisée par Starkli et que vous rencontrez une erreur `compiler-version` en utilisant la commande ci-dessus, vous pouvez spécifier une version du compilateur à utiliser dans la commande en ajoutant le drapeau `--compiler-version x.y.z`.
id: Jika versi kompiler yang Anda gunakan lebih tua daripada versi yang digunakan oleh Starkli dan Anda menghadapi kesalahan kompiler-version ketika menggunakan perintah di atas, Anda dapat menentukan versi kompiler untuk digunakan dalam perintah dengan menambahkan - kompiler-version x.y.zán.
tr: Kullandığınız derleyici sürümü Starkli tarafından kullanılandan daha eskiyse ve yukarıdaki komutu kullanırken bir compiler-version hatasıyla karşılaşırsanız, komutta kullanılacak bir derleyici sürümünü --compiler-version x.y.z bayrağını ekleyerek belirtebilirsiniz.
zh_cn: 如果您正在使用的编译器版本比 Starkli 所使用的版本旧,而您在使用上述命令时遇到“ 编译器版本” 错误,您可以通过添加“-- compiler- version x.y.z” 标志指定一个编译器版本,用于命令中。

source: If you're still encountering issues with the compiler version, try upgrading Starkli using the command: `starkliup` to make sure you're using the latest version of starkli.
es: Si sigues encontrando problemas con la versión del compilador, intenta actualizar Starkli usando el comando: `starkliup` para asegurarte de que estás usando la última versión de Starkli.
fr: Si vous rencontrez toujours des problèmes avec la version du compilateur, essayez de mettre à jour Starkli en utilisant la commande `starkliup` pour vous assurer d'utiliser la dernière version de Starkli.
id: Jika Anda masih menghadapi masalah dengan versi kompiler, coba tingkatkan Starkli menggunakan perintah: Ástarkliupà untuk memastikan Anda menggunakan versi terbaru starkli.
tr: Derleyici sürümüyle ilgili sorunlarla hala karşılaşıyorsanız, Starkli'nin en son sürümünü kullandığınızdan emin olmak için starkliup komutunu kullanarak Starkli'yi yükseltmeyi deneyin.
zh_cn: 如果您仍遇到编译器版本的问题, 请尝试使用命令“ Starkliup ” 来升级 Starkli, 以确保您使用最新版本的 Starkli 。

source: The class hash of the contract is: `0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52`. You can declare this contract on Sepolia testnet and see that the class hash will correspond.
es: El hash de clase del contrato es: `0x06974677a079b7edfadcd70a4d12aac0263a4cda379009fca125e0ab1a9ba52`. Usted puede declarar este contrato en la red de pruebas Sepolia y ver que el hash de clase corresponderá.
fr: Le hash de classe du contrat est: `0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52`. Vous pouvez déclarer le présent contrat sur Sepolia testnet et voir que le hash de classe correspondra.
id: Hash kelas kontrak adalah: 0x06974677a079b7edfad70a4da12aac0263a4cda379fca1ab1aba52. Anda dapat menyatakan kontrak ini pada tesnet Sepolia dan melihat bahwa kelas hash akan sesuai.
tr: Sözleşmenin sınıf hash'i: 0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52'dir. Bu sözleşmeyi Sepolia testnet'te beyan edebilir ve sınıf hash'inin karşılık geleceğini görebilirsiniz.
zh_cn: 合同的等级是:`0x06976777a079b7edfadcd70aa4d12aac02263a4cda379009fca125e0ab1a9ba52',你可以在Sepolia测试网上申报这一合同,并看该类散列是否对应。

source: The `--rpc` flag specifies the RPC endpoint to use (the one provided by `katana`). The `--account` flag specifies the account to use for signing the transaction. The account we use here is the one we created in the previous step. The `--keystore` flag specifies the keystore file to use for signing the transaction.
es: El indicador `--rpc` especifica el punto final RPC a usar (el que proporciona `katana`). El indicador `--account` especifica la cuenta a usar para firmar la transacción. La cuenta que usamos aquí es la que creamos en el paso anterior. El indicador `--keystore` especifica el archivo keystore a usar para firmar la transacción.
fr: L'option `--rpc` spécifie le paramètre RPC à utiliser (celui fourni par `katana`). L'option `--account` spécifie le compte à utiliser pour signer la transaction. Le compte que nous utilisons ici est celui que nous avons créé à l'étape précédente. L'option `--keystore` spécifie le fichier keystore à utiliser pour signer la transaction.
id: Flag RPC menspesifikasikan titik akhir untuk digunakan (yang disediakan oleh ▪katana). Bendera ·--accountán menyatakan akun yang digunakan untuk menandatangani transaksi. Akun yang kita gunakan di sini adalah yang kita buat di langkah sebelumnya. Bendera --keystore Valentina menspesifikasikan berkas keystore untuk menandatangani transaksi.
tr: --rpc bayrağı, RPC uç noktasını kullanır (katana tarafından sağlanan). --account bayrağı, işlemi imzalamak için kullanılacak hesabı belirtir. Burada kullandığımız hesap, bir önceki adımda oluşturduğumuz hesaptır. --keystore bayrağı, işlemi imzalamak için kullanılacak anahtar deposu dosyasını belirtir.
zh_cn: `-rpc'旗帜指定了RPC使用的端点(由`katana'提供的端点);`-account'旗帜指定了用于签署交易的账户;我们在此使用的账户是我们在前一个步骤中创建的账户;`-keystore'旗帜指定了用于签署交易的钥匙文件。

source: Since we are using a local node, the transaction will achieve finality immediately. If you are using the Goerli Testnet, you will need to wait for the transaction to be final, which usually takes a few seconds.
es: Ya que estamos usando un nodo local, la transacción alcanzará la finalidad inmediatamente. Si usted está usando el Goerli Testnet, tendrá que esperar a que la transacción sea final, lo que generalmente toma unos segundos.
fr: Puisque nous utilisons un nœud local, la transaction atteindra immédiatement la finalité. Si vous utilisez le Goerli Testnet, vous devrez attendre que la transaction soit définitive, ce qui prend généralement quelques secondes.
id: Karena kita menggunakan node lokal, transaksi akan mencapai finalitas segera. yang biasanya membutuhkan beberapa detik.
tr: Yerel bir düğüm kullandığımızdan, işlem hemen kesinliğe ulaşır. Goerli Testnet'i kullanıyorsanız, işlemin nihai olmasını beklemeniz gerekir, bu genellikle birkaç saniye sürer.
zh_cn: 由于我们正在使用本地节点, 交易将立即实现终结性 。 如果您正在使用 Goerli 测试网, 您需要等待交易最终完成, 通常需要几秒钟 。

source: The following command deploys the voting contract and registers voter_0, voter_1, and voter_2 as eligible voters. These are the constructor arguments, so add a voter account that you can later vote with.
es: El siguiente comando despliega el contrato de votación y registra votante_0, votante_1 y votante_2 como votantes elegibles. Estos son los argumentos del constructor, por lo que añada una cuenta de votante con la que pueda votar más tarde.
fr: La commande suivante déploie le contrat de vote et enregistre voter_0, voter_1 et voter_2 en tant qu'électeurs éligibles. Ce sont les arguments du constructeur, donc ajoutez un compte d'électeur avec lequel vous pouvez voter ultérieurement.
id: Perintah berikut menyebarkan kontrak pemilihan dan register pemilih_0, pemilih_1, dan pemilih_2 sebagai pemilih yang memenuhi syarat. Ini adalah argumen konstruktor, jadi tambahkan akun pemilih yang dapat anda pilih nanti.
tr: Aşağıdaki komut oylama sözleşmesini dağıtır ve seçmen_0, seçmen_1 ve seçmen_2'yi uygun seçmenler olarak kaydeder. Bunlar kurucu argümanlardır, bu nedenle daha sonra oy kullanabileceğiniz bir seçmen hesabı ekleyin.
zh_cn: 以下指挥部部署投票合同并登记选民:0人、选民:1人、选民2人为合格选民。这些是施工者的论点,因此加上一个选民账户,你以后可以投票。

source: An example command:
es: Un comando de ejemplo:
fr: Une commande exemple :
id: Perintah contoh:
tr: Örnek bir komut:
zh_cn: 示例命令 :

source: In this case, the contract has been deployed at an specific address: `0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349`. This address will be different for you. We will use this address to interact with the contract.
es: En este caso, el contrato se ha desplegado en una dirección específica: `0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349`. Esta dirección será diferente para usted. Usaremos esta dirección para interactuar con el contrato.
fr: Dans ce cas, le contrat a été déployé à une adresse spécifique: `0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349`. Cette adresse sera différente pour vous. Nous utiliserons cette adresse pour interagir avec le contrat.
id: Dalam hal ini, kontrak telah dikerahkan pada sebuah alamat spesifik: 0x05ea3a90be71c7c7fcd845551782188111C4611D13349. Alamat ini akan berbeda untuk Anda. kami akan menggunakan alamat ini untuk berinteraksi dengan kontrak.
tr: Bu durumda, sözleşme belirli bir adreste konuşlandırılmıştır: 0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349. Bu adres sizin için farklı olacaktır. Bu adresi sözleşme ile etkileşimde bulunmak için kullanacağız.
zh_cn: 在这种情况下,合同部署在一个具体地址:`0x05ea3a690be71c7c7cd83945517f82e8861a97d42fca8ec9c468631d11f33349',这个地址对你们不同,我们将使用这个地址与合同互动。

source: Voter Eligibility Verification
es: Verificación de la elegibilidad de los votantes
fr: Vérification de l'admissibilité des électeurs
id: Verifikasi Eligibilitas Pemilih
tr: Seçmen Uygunluk Doğrulaması
zh_cn: 选民资格核查

source: In our voting contract, we have two functions to validate voter eligibility, `voter_can_vote` and `is_voter_registered`. These are external read functions, which mean they don't alter the state of the contract but only read the current state.
es: En nuestro contrato de votación, tenemos dos funciones para validar la elegibilidad del votante, `voter_can_vote` y `is_voter_registered`. Estas son funciones de lectura externa, lo que significa que no alteran el estado del contrato, sino que sólo leen el estado actual.
fr: Dans notre contrat de vote, nous avons deux fonctions pour valider l'éligibilité des électeurs, `voter_can_vote` et `is_voter_registred`. Ce sont des fonctions de lecture externe, ce qui signifie qu'elles ne modifient pas l'état du contrat mais seulement l'état actuel.
id: Dalam kontrak suara kami, kami memiliki dua fungsi untuk memvalidasi keikutsertaan hak pilih, Ávoter_can_vote_vote dan æis_voter_listter. ini adalah fungsi baca eksternal, yang berarti mereka tidak mengubah keadaan kontrak tetapi hanya membaca keadaan saat ini.
tr: Oylama sözleşmemizde, seçmen uygunluğunu doğrulamak için iki işlevimiz var, voter_can_vote ve is_voter_registered. Bunlar dış okuma işlevleridir, yani sözleşmenin durumunu değiştirmezler, sadece mevcut durumu okurlar.
zh_cn: 在我们的投票合同中,我们有两个职能来验证选民资格,即`voter_can_vote'和`is_voter_登记',这些是外部阅读功能,这意味着它们不会改变合同的状况,而只是读取目前的状况。

source: The `is_voter_registered` function checks whether a particular address is registered as an eligible voter in the contract. The `voter_can_vote` function, on the other hand, checks whether the voter at a specific address is currently eligible to vote, i.e., they are registered and haven't voted already.
es: La función `is_voter_registered` comprueba si una dirección en particular está inscrita como votante elegible en el contrato. La función `voter_can_vote`, por otro lado, verifica si el votante en una dirección específica es actualmente elegible para votar, es decir, están registrados y no han votado ya.
fr: La fonction `is_voter_registred` vérifie si une adresse particulière est inscrite comme électeur admissible dans le contrat. La fonction `voter_can_vote`, en revanche, vérifie si l'électeur à une adresse spécifique est actuellement admissible au vote, c'est-à-dire qu'il est inscrit et n'a pas déjà voté.
id: Fungsi åis_voter_listal_listed fungsi cek apakah alamat tertentu terdaftar sebagai pemilih yang memenuhi syarat dalam kontrak. Fungsi tersebut akan terdaftar_can_vote_vote, di sisi lain, memeriksa apakah pemilih pada alamat tertentu saat ini memenuhi syarat untuk memilih, yaitu, mereka terdaftar dan belum memilih sudah.
tr: is_voter_registered işlevi, belirli bir adresin sözleşmede uygun bir seçmen olarak kayıtlı olup olmadığını kontrol eder. Öte yandan, voter_can_vote işlevi, belirli bir adresteki seçmenin şu anda oy kullanmaya uygun olup olmadığını, yani kayıtlı olup olmadıklarını ve daha önce oy vermediklerini kontrol eder.
zh_cn: `ototer_注册'功能检查某一地址是否登记为合同中的合格选民;`voter_can_vote'功能检查某一地址的选民目前是否有资格投票,即他们已经登记,尚未投票。

source: You can call these functions using the `starkli call` command. Note that the `call` command is used for read functions, while the `invoke` command is used for functions that can also write to storage. The `call` command does not require signing, while the `invoke` command does.
es: Puede llamar a estas funciones utilizando el comando `starkli call`. Tenga en cuenta que el comando `call` se utiliza para las funciones de lectura, mientras que el comando `invoke` se utiliza para las funciones que también pueden escribir en el almacenamiento. El comando `call` no requiere firmar, mientras que el comando `invoke` lo hace.
fr: Vous pouvez appeler ces fonctions en utilisant la commande `starkli call`. Notez que la commande `call` est utilisée pour les fonctions de lecture, tandis que la commande `invoke` est utilisée pour les fonctions qui peuvent également écrire dans le stockage. La commande `call` ne nécessite pas de signature, tandis que la commande `invoke` le fait.
id: Anda dapat memanggil fungsi-fungsi ini dengan menggunakan perintah åstarkli panggilan. perhatikan bahwa perintah panggilan tersebut digunakan untuk fungsi membaca, sementara perintah åinvoke digunakan untuk fungsi yang juga dapat ditulis ke penyimpanan. perintah panggilan tidak memerlukan penandatanganan, sementara perintah ▪invoke.
tr: Bu işlevleri starkli call komutunu kullanarak arayabilirsiniz. call komutu okuma işlevleri için kullanılırken, invoke komutu depolamaya da yazabilen işlevler için kullanılır. call komutu imzalama gerektirmez, invoke komutu bunu yaparken.
zh_cn: 您可以使用“Starkli call”命令调用这些函数。请注意,“调用”命令用于读函数,而“调用”命令用于也可以写入存储的函数。“调用”命令不需要签名,而“调用”命令则需要签名。
