Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: If we instead put _hosting.cairo_ in the _src_ directory, the compiler would expect the _hosting.cairo_ code to be in a `hosting` module declared in the crate root, and not declared as a child of the `front_of_house` module. The compiler’s rules for which files to check for which modules’ code means the directories and files more closely match the module tree.
es: Si en su lugar pusiéramos _hosting.cairo_ en el directorio _src_, el compilador esperaría que el código _hosting.cairo_ estuviera en un módulo `hosting` declarado en la raíz de la caja, y no declarado como un hijo del módulo `front_of_house`. Las reglas del compilador para qué archivos para comprobar qué código de módulos significa que los directorios y archivos coinciden más estrechamente con el árbol del módulo.
fr: Si nous mettons à la place _hosting.cairo_ dans le répertoire _src_, le compilateur s'attendrait à ce que le code _hosting.cairo_ soit dans un module `hosting` déclaré dans la racine de caisse, et non déclaré comme enfant du module `front_of_house`. Les règles compilateur=s pour lesquelles les fichiers doivent vérifier pour quels modules= code signifient que les répertoires et les fichiers correspondent plus étroitement à l'arborescence du module.
id: Jika kita alih-alih menempatkan _hosting.cairo_ dalam direktori _sc_, kompiler akan mengharapkan kode _hosting.cairo_ berada dalam modul ·hostingácting root, dan tidak dideklarasikan sebagai anak dari modul ▪front_of_houseól. The compiler Aturan mana berkas untuk memeriksa yang modul-modul dan files lebih dekat cocok dengan pohon modul.
tr: Bunun yerine _src_ dizinine _hosting.cairo_ koyarsak, derleyici, _hosting.cairo_ kodunun sandık kökünde ilan edilen ve front_of_house modülünün çocuğu olarak ilan edilmeyen bir hosting modülünde olmasını bekler. Derleyicinin kuralları, hangi modüllerin kodunun dizinler ve dosyaların modül ağacına daha yakın olduğu anlamına gelir.
zh_cn: 如果我们相反地在 _src_目录中插入 _hosting.cairo_, 编纂者会期望该代码在“wosting.cairo_”模块中,该模块在箱根中被宣布为“winding”模块,而不是被宣布为“front_of_house”模块的子模块。对于哪个模块代码代表更接近模块树的目录和文件,编纂者要检查哪个模块代码的文件规则。

source: We’ve moved each module’s code to a separate file, and the module tree remains the same. The function calls in `eat_at_restaurant` will work without any modification, even though the definitions live in different files. This technique lets you move modules to new files as they grow in size.
es: Hemos movido el código de cada módulo a un archivo separado, y el árbol del módulo sigue siendo el mismo. Las llamadas de función en `eat_at_restaurant` funcionarán sin ninguna modificación, a pesar de que las definiciones viven en diferentes archivos. Esta técnica le permite mover módulos a nuevos archivos a medida que crecen en tamaño.
fr: Nous avons déplacé chaque code de module dans un fichier séparé, et l'arborescence des modules reste la même. La fonction appelle dans `eat_at_restaurant` fonctionnera sans aucune modification, même si les définitions vivent dans des fichiers différents. Cette technique vous permet de déplacer les modules vers de nouveaux fichiers à mesure qu'ils grandissent en taille.
id: Kami telah memindahkan setiap modul kode ke file terpisah, dan pohon modul tetap sama. Panggilan fungsi dalam eat_at_restaurán akan bekerja tanpa modifikasi apapun, meskipun definisi hidup dalam berkas yang berbeda. Teknik ini memungkinkan Anda memindahkan modul ke berkas baru saat mereka tumbuh dalam ukuran yang berbeda.
tr: Her modülün kodunu ayrı bir dosyaya taşıdık ve modül ağacı aynı kaldı. eat_at_restaurant'daki işlev çağrıları, tanımların farklı dosyalarda yaşamasına rağmen herhangi bir değişiklik yapmadan çalışacaktır. Bu teknik, modülleri boyut olarak büyüdükçe yeni dosyalara taşımanızı sağlar.
zh_cn: 我们已将每个模块的代码移到一个单独的文件, 模块树也保持不变。 调用“ eat_ at_ restaurant” 的函数将不作任何修改, 即使定义存在于不同的文件中。 此技术允许您将模块移到新文件, 因为它们在大小上不断增大 。

source: Note that the `use restaurant::front_of_house::hosting;` statement in _src/lib.cairo_ also hasn’t changed, nor does `use` have any impact on what files are compiled as part of the crate. The `mod` keyword declares modules, and Cairo looks in a file with the same name as the module for the code that goes into that module.
es: Nótese que el restaurante `use::front_of_house::hosting;` statement in _src/lib.cairo_ tampoco ha cambiado, ni `use` tiene ningún impacto en los archivos compilados como parte de la caja. La palabra clave `mod` declara módulos, y El Cairo mira en un archivo con el mismo nombre que el módulo para el código que entra en ese módulo.
fr: Notez que le restaurant `use::front_of_house::hosting;` dans _src/lib.cairo_ n'a pas non plus changé, ni `use` n'a aucun impact sur les fichiers compilés dans la caisse. Le mot-clé `mod` déclare les modules, et le Caire regarde dans un fichier avec le même nom que le module pour le code qui va dans ce module.
id: Perhatikan bahwa restoran åuse:front_of_house::hosting; pernyataan dalam _src/lib.cairo_ juga belum berubah, atau memiliki dampak apapun pada apa file disusun sebagai bagian dari peti. Kata kunci menyatakan modul, dan Kairo tampak dalam file dengan nama yang sama sebagai modul untuk kode yang masuk ke modul tersebut.
tr: use restoran::front_of_house::hosting; ifade _src/lib.cairo_ de değişmedi, ne de use kutunun bir parçası olarak hangi dosyaların derlendiği üzerinde herhangi bir etkiye sahip değil. mod anahtar kelimesi modüller ilan eder ve Kahire bu modüle giren kodun modülü ile aynı adı taşıyan bir dosyaya bakar.
zh_cn: 请注意, ` 使用餐厅: : Front_of_house:: hosting;` in_src/lib.cairo_中的语句'也没有改变,使用'也不会对作为箱子的一部分汇编的文件产生任何影响。 `mod' 关键词声明模块, 开罗则在与该模块代码模块相同的名称的文件中查看 。

source: Cairo lets you split a package into multiple crates and a crate into modules so you can refer to items defined in one module from another module. You can do this by specifying absolute or relative paths. These paths can be brought into scope with a `use` statement so you can use a shorter path for multiple uses of the item in that scope. Module code is **private** by default.
es: El Cairo le permite dividir un paquete en múltiples cajas y una caja en módulos para que pueda referirse a elementos definidos en un módulo de otro módulo. Puede hacerlo especificando rutas absolutas o relativas. Estas rutas se pueden introducir en el ámbito de aplicación con una instrucción `use` para que pueda utilizar una ruta más corta para múltiples usos del elemento en ese ámbito. El código del módulo es **privado** por defecto.
fr: Le Caire vous permet de diviser un paquet en plusieurs caisses et une caisse en modules afin que vous puissiez vous référer à des éléments définis dans un module d'un autre module. Vous pouvez le faire en spécifiant des chemins absolus ou relatifs. Ces chemins peuvent être introduits dans la portée avec une instruction `use` afin que vous puissiez utiliser un chemin plus court pour plusieurs utilisations de l'élément dans cette portée. Le code du module est **private** par défaut.
id: Kairo memungkinkan Anda membagi paket ke dalam beberapa peti dan peti menjadi modul sehingga Anda dapat mengacu pada item yang didefinisikan dalam satu modul dari modul lain. Anda dapat melakukan ini dengan menentukan jalur absolut atau relatif. Jalur ini dapat dibawa ke dalam lingkup dengan pernyataan €use € sehingga Anda dapat menggunakan sebuah path pendek untuk beberapa penggunaan objek dalam lingkup tersebut. Kode modul adalah **private** secara baku.
tr: Kahire, bir paketi birden fazla sandık ve bir sandığı modüllere bölmenizi sağlar, böylece bir modülde tanımlanan öğelere başka bir modülden başvurabilirsiniz. Bunu mutlak veya göreceli yollar belirleyerek yapabilirsiniz. Bu yollar, bu kapsamda öğenin birden fazla kullanımı için daha kısa bir yol kullanabilmeniz için bir use ifadesi ile kapsam içine getirilebilir. Modül kodu varsayılan olarak **private ** 'dir.
zh_cn: 开罗允许您将一个软件包分成多个箱和一个箱分成多个模块,这样您就可以参考另一个模块中一个模块中定义的项目。您可以通过指定绝对路径或相对路径来做到这一点。这些路径可以用“使用”语句引入范围,这样您就可以使用较短的路径来在该范围中多用该项目。默认情况下,模块代码是 ** 私有** 。

source: {{#quiz ../quizzes/ch07-05-separate-modules.toml}}
fr: {{#quiz../quizes/ch07-05-separate-modules.toml}}
zh_cn: QQZ./Qizes/ch07-05-eparate-modules.toml_BAR__BAR_QQQZZes/ch07-05-eparate-modules.toml_BAR__BAR__BAR_ QQQZZ./quizzes/ch07-05-smoules.toml_BAR_

source: Every programming language has tools for effectively handling the duplication of concepts. In Cairo, one such tool is generics: abstract stand-ins for concrete types or other properties. We can express the behavior of generics or how they relate to other generics without knowing what will be in their place when compiling and running the code.
es: Cada lenguaje de programación tiene herramientas para manejar eficazmente la duplicación de conceptos. En El Cairo, una de estas herramientas es genérica: stand-ins abstractos para tipos concretos u otras propiedades. Podemos expresar el comportamiento de los genéricos o cómo se relacionan con otros genéricos sin saber lo que estará en su lugar al compilar y ejecutar el código.
fr: Chaque langage de programmation dispose d'outils pour gérer efficacement la duplication des concepts. Au Caire, un tel outil est générique: stand-ins abstraits pour les types de béton ou d'autres propriétés. Nous pouvons exprimer le comportement des génériques ou comment ils se rapportent à d'autres génériques sans savoir ce qui sera à leur place lors de la compilation et de l'exécution du code.
id: Setiap bahasa pemrograman memiliki alat yang efektif untuk menangani duplikasi konsep. Di Kairo, salah satu alat seperti itu adalah generik: stand-in abstrak untuk tipe beton atau sifat lainnya. Kita dapat mengekspresikan perilaku generik atau bagaimana mereka berhubungan dengan generik lain tanpa mengetahui apa yang akan ada di tempat mereka ketika kompilasi dan menjalankan kode.
tr: Her programlama dili, kavramların çoğaltılmasını etkili bir şekilde ele almak için araçlara sahiptir. Kahire'de, bu tür araçlardan biri jeneriktir: beton türleri veya diğer özellikler için soyut stand-in'ler. Jeneriklerin davranışlarını veya kodu derleyip çalıştırırken yerinde ne olacağını bilmeden diğer jeneriklerle nasıl ilişki kurduklarını ifade edebiliriz.
zh_cn: 每种编程语言都有有效处理概念重叠的工具。 在开罗,这种工具之一是通用工具:具体类型或其他属性的抽象备用。 我们可以表达通用语言的行为,或者它们与其他通用语言的关系,而不知道在编译和运行代码时它们的位置。

source: Functions can take parameters of some generic type, instead of a concrete type like `u32` or `bool`, in the same way a function takes parameters with unknown values to run the same code on multiple concrete values. In fact, we’ve already used generics in [Chapter 6](./ch06-01-enums.html#the-option-enum-and-its-advantages) with `Option<T>`.
es: Las funciones pueden tomar parámetros de algún tipo genérico, en lugar de un tipo concreto como `u32` o `bool`, de la misma manera que una función toma parámetros con valores desconocidos para ejecutar el mismo código en múltiples valores concretos. De hecho, ya hemos usado genéricos en [Capítulo 6](./ch06-01-enums.html#the-option-enum-and-its-vantages) con `Option<T».
fr: Les fonctions peuvent prendre des paramètres de certains types génériques, au lieu d'un type concret comme `u32` ou `bool`, de la même manière qu'une fonction prend des paramètres avec des valeurs inconnues pour exécuter le même code sur plusieurs valeurs concrètes. En fait, nous avons déjà utilisé des génériques dans [Chapitre 6](./ch06-01-enums.html#the-option-enum-et-ses-avantages) avec `Option<T>`.
id: Fungsi dapat mengambil parameter dari beberapa tipe generik, bukan tipe beton seperti åu32 (produc) atau åbool), dengan cara yang sama sebuah fungsi mengambil parameter dengan nilai-nilai yang tidak diketahui untuk menjalankan kode yang sama pada beberapa nilai konkrit. Sebenarnya, kita telah menggunakan generik di [Chapter 6]./ch06-01-enums.html#the-option-and-it-apons) dengan ▪Option<T>.
tr: Fonksiyonlar, bazı jenerik tiplerin parametrelerini alabilir, u32 veya bool gibi somut bir tür yerine, aynı şekilde bir fonksiyon birden fazla beton değer üzerinde aynı kodu çalıştırmak için bilinmeyen değerlere sahip parametreleri alır. Aslında, [Bölüm 6](./ch06-01-enums.html#the-option-enum-and-its-advantages> ile jenerikleri zaten kullandık.
zh_cn: 函数可以采用某种通用类型的参数,而不是“ u32” 或“bool” 等具体类型的参数,就像函数以未知值的参数对多个混凝土值运行相同的代码一样。事实上,我们已经在[第6章](./ch06-01-enums.html#the-option-enum-and-its-advantages)和“option<T}”中使用了通用的参数。

source: In this chapter, you’ll explore how to define your own types, functions, and traits with generics.
es: En este capítulo, explorará cómo definir sus propios tipos, funciones y rasgos con genéricos.
fr: Dans ce chapitre, vous explorerez comment définir vos propres types, fonctions et traits avec des génériques.
id: Dalam bab ini, Anda akan mengeksplorasi bagaimana mendefinisikan jenis, fungsi, dan sifat Anda sendiri dengan generik.
tr: Bu bölümde, kendi türlerinizi, işlevlerinizi ve özelliklerinizi jeneriklerle nasıl tanımlayacağınızı keşfedeceksiniz.
zh_cn: 在本章中,您将探索如何定义自己的类型、功能和通用特性。

source: Generics allow us to replace specific types with a placeholder that represents multiple types to remove code duplication. Upon compilation, the compiler creates a new definition for each concrete type that replaces a generic type, reducing development time for the programmer, but code duplication at compile level still exists. This may be of importance if you are writing Starknet contracts and using a generic for multiple types which will cause contract size to increment.
es: Los genéricos nos permiten reemplazar tipos específicos con un marcador de posición que representa varios tipos para eliminar la duplicación de código. Al compilar, el compilador crea una nueva definición para cada tipo concreto que reemplaza a un tipo genérico, reduciendo el tiempo de desarrollo para el programador, pero la duplicación de código a nivel de compilación todavía existe. Esto puede ser importante si está escribiendo contratos Starknet y utilizando un genérico para varios tipos que hará que el tamaño del contrato aumente.
fr: Les génériques nous permettent de remplacer des types spécifiques par un placeholder qui représente plusieurs types pour supprimer la duplication de code. Lors de la compilation, le compilateur crée une nouvelle définition pour chaque type concret qui remplace un type générique, réduisant le temps de développement pour le programmeur, mais la duplication de code au niveau de compilation existe toujours. Cela peut être important si vous écrivez des contrats Starknet et utilisez un générique pour plusieurs types qui fera augmenter la taille du contrat.
id: Generik memungkinkan kita untuk mengganti tipe spesifik dengan pemegang tempat yang mewakili beberapa tipe untuk menghapus duplikasi kode. Sehubungan dengan kompilasi, kompiler menciptakan definisi baru untuk setiap tipe beton yang menggantikan tipe generik, mengurangi waktu pengembangan programmer, tapi kode duplikasi pada tingkat kompilasi masih ada. Ini mungkin penting jika Anda menulis kontrak Starknet dan menggunakan generik untuk berbagai tipe yang akan menyebabkan ukuran kontrak untuk meningkat.
tr: Jenerikler, kod çoğaltma işlemini kaldırmak için belirli türleri birden fazla türü temsil eden bir yer tutucu ile değiştirmemize izin verir. Derleyici derleme üzerine, genel bir türün yerini alan her bir beton türü için yeni bir tanım oluşturur, programcı için geliştirme süresini azaltır, ancak derleme düzeyinde kod çoğaltma hala mevcuttur. Starknet sözleşmeleri yazıyorsanız ve sözleşme boyutunun artmasına neden olacak birden fazla tür için bir genel kullanıyorsanız bu önemli olabilir.
zh_cn: 通用域名允许我们用代表多种类型的占位符替换特定类型, 以消除代码重复。 汇编者在编译时为每个具体类型设定了新的定义, 以取代通用类型, 缩短程序员的开发时间, 但是在编译级别上仍然存在代码重复。 如果您正在签订 Starknet 合同, 并使用通用的多类型合同, 从而导致合同的递增, 这可能很重要 。

source: Then you’ll learn how to use traits to define behavior in a generic way. You can combine traits with generic types to constrain a generic type to accept only those types that have a particular behavior, as opposed to just any type.
es: Entonces aprenderás a usar rasgos para definir el comportamiento de una manera genérica. Puedes combinar rasgos con tipos genéricos para limitar un tipo genérico a aceptar sólo aquellos tipos que tienen un comportamiento particular, en lugar de cualquier tipo.
fr: Ensuite, vous apprendrez à utiliser des caractères pour définir le comportement d'une manière générique. Vous pouvez combiner des caractères avec des types génériques pour contraindre un type générique à accepter uniquement les types qui ont un comportement particulier, par opposition à n'importe quel type.
id: Kemudian Anda akan belajar bagaimana menggunakan sifat untuk mendefinisikan perilaku dengan cara yang umum. Anda dapat menggabungkan sifat-sifat dengan tipe umum untuk membatasi jenis generik untuk menerima hanya jenis-jenis yang memiliki perilaku tertentu, sebagai lawan dari sembarang tipe.
tr: Daha sonra, davranışı genel bir şekilde tanımlamak için özelliklerin nasıl kullanılacağını öğreneceksiniz. Sadece herhangi bir türün aksine, yalnızca belirli bir davranışa sahip olan türleri kabul etmek için genel tiplerle özellikleri birleştirebilirsiniz.
zh_cn: 然后学习如何使用特征来定义一般行为。 您可以将特征和普通类型结合起来, 限制普通类型, 仅接受特定行为类型, 而不是任何类型。

source: Removing Duplication by Extracting a Function
es: Eliminar la duplicación extrayendo una función
fr: Suppression de la duplication par extraction d'une fonction
id: Menghapus Duaplikasi dengan Mengekstrak Suatu Fungsi
tr: Bir Fonksiyon Çıkartarak Çoğaltmanın Kaldırılması
zh_cn: 通过提取函数来消除重复

source: Generics allow us to replace specific types with a placeholder that represents multiple types to remove code duplication. Before diving into generics syntax, let’s first look at how to remove duplication in a way that doesn’t involve generic types by extracting a function that replaces specific values with a placeholder that represents multiple values. Then we’ll apply the same technique to extract a generic function! By learning how to identify duplicated code that can be extracted into a function, you'll start to recognize instances where generics can be used to reduce duplication.
es: Los genéricos nos permiten reemplazar tipos específicos con un marcador de posición que representa varios tipos para eliminar la duplicación de código. Antes de sumergirnos en la sintaxis genérica, primero veamos cómo eliminar la duplicación de una manera que no implique tipos genéricos al extraer una función que sustituya valores específicos con un marcador de posición que represente varios valores. ¡Entonces aplicaremos la misma técnica para extraer una función genérica! Al aprender a identificar el código duplicado que puede extraerse en una función, comenzarás a reconocer instancias en las que los genéricos pueden utilizarse para reducir la duplicación.
fr: Les génériques nous permettent de remplacer des types spécifiques par un placeholder qui représente plusieurs types pour supprimer la duplication de code. Avant de plonger dans la syntaxe générique, laissez-nous d'abord examiner comment supprimer la duplication d'une manière qui n'implique pas des types génériques en extrayant une fonction qui remplace des valeurs spécifiques par un placeholder qui représente des valeurs multiples. Ensuite, nous allons appliquer la même technique pour extraire une fonction générique! En apprenant comment identifier le code dupliqué qui peut être extrait dans une fonction, vous commencerez à reconnaître des cas où des génériques peuvent être utilisés pour réduire la duplication.
id: Generik memungkinkan kita mengganti tipe spesifik dengan pemegang tempat yang mewakili berbagai jenis untuk menghapus duplikasi kode. Sebelum menyelam ke sintak generik, mari kita lihat dulu bagaimana menghilangkan duplikasi dengan cara yang tidak melibatkan tipe umum dengan mengekstrak fungsi yang menggantikan nilai-nilai spesifik dengan pemegang tempat yang mewakili beberapa nilai. Kemudian kita akan menerapkan teknik yang sama untuk mengekstrak fungsi umum! Dengan belajar bagaimana mengidentifikasi kode duplikat yang dapat diekstrak ke dalam fungsi, Anda akan mulai mengenali contoh di mana generic dapat digunakan untuk mengurangi duplikasi.
tr: Jenerikler, kod çoğaltmasını kaldırmak için belirli türleri birden fazla türü temsil eden bir yer tutucu ile değiştirmemize izin verir. Jenerik sözdizimine dalmadan önce, belirli değerleri birden fazla değeri temsil eden bir yer tutucu ile değiştiren bir işlev çıkararak, çoğaltmayı içermeyen bir şekilde çoğaltmanın nasıl kaldırılacağına bakalım. Daha sonra genel bir işlevi çıkarmak için aynı tekniği uygulayacağız! Bir fonksiyona indirilebilecek kopyalanmış kodun nasıl tanımlanacağını öğrenerek, bir fonksiyona indirgeyebilirsiniz.
zh_cn: 通用参数允许我们用代表多种类型的占位符替换特定类型, 以删除代码重复。 在跳入通用语法之前, 让我们首先研究如何通过提取一个函数, 以代表多个值的占位符取代特定值, 从而不包含通用类型, 来消除重复。 然后我们用同样的技术来提取一个通用函数 。 通过学习如何识别可提取到函数中的重复代码, 您将开始识别可以使用通用代码来减少重复的实例 。

source: We begin with a short program that finds the largest number in an array of `u8`:
es: Comenzamos con un programa corto que encuentra el mayor número en una serie de `u8`:
fr: Nous commençons par un programme court qui trouve le plus grand nombre dans un tableau de `u8`:
id: Kita mulai dengan program singkat yang menemukan jumlah terbesar dalam array Áu8:
tr: u8 dizisinde en büyük sayıyı bulan kısa bir programla başlıyoruz:
zh_cn: 我们从一个短程序开始,它发现在一系列`u8'中数量最多:

source: "The largest number is {}"
es: "El número más grande es ""
fr: "Le plus grand nombre est {}"
id: " Angka terbesar adalah {}"
tr: "En büyük sayı "
zh_cn: "人数最多的是""
