Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Implementing a trait on a type is similar to implementing regular methods. The difference is that after `impl`, we put a name for the implementation, then use the `of` keyword, and then specify the name of the trait we are writing the implementation for. If the implementation is for a generic type, we place the generic type name in the angle brackets after the trait name.
es: La implementación de un rasgo en un tipo es similar a la implementación de métodos regulares. La diferencia es que después de `impl`, ponemos un nombre para la implementación, luego usamos la palabra clave `de`, y luego especificamos el nombre del rasgo para el que estamos escribiendo la implementación. Si la implementación es para un tipo genérico, colocamos el nombre de tipo genérico en los corchetes de ángulo después del nombre de rasgo.
fr: La mise en œuvre d'un caractère sur un type est similaire à la mise en œuvre de méthodes régulières. La différence est qu'après `impl`, nous mettons un nom pour l'implémentation, puis utilisons le mot-clé `of`, puis spécifiez le nom du caractère pour lequel nous écrivons l'implémentation. Si l'implémentation est pour un type générique, nous plaçons le nom de type générique dans les crochets d'angle après le nom du caractère.
id: Menimplementasikan sifat pada tipe mirip dengan menerapkan metode biasa. Perbedaannya adalah bahwa setelah melakukan implementasi adalah untuk tipe umum, kita menaruh nama umum untuk implementasi, lalu menggunakan kata kunci, dan kemudian menentukan nama sifat yang kita tulis untuk implementasi. Jika penerapan adalah untuk tipe umum, kita menempatkan nama umum dalam kurung sudut setelah nama sifat.
tr: Bir tür üzerinde bir özellik uygulamak, düzenli yöntemlerin uygulanmasına benzer. Fark, impl'den sonra, uygulama için bir isim koymamız, daha sonra of anahtar kelimesini kullanmamız ve daha sonra uygulama için yazdığımız özelliğin adını belirtmemizdir. Uygulama genel bir tür içinse, genel tip adını özellik adından sonraki açı parantezlerine yerleştiririz.
zh_cn: 在某类型上实施特性与执行常规方法相似,不同之处在于,在“简化”之后,我们为实施设置了名称,然后使用“关键字”的名称,然后指定正在写入执行的特性的名称。如果执行是通用类型,则在特性名称之后将通用类型名称置于括号内。

source: Note that for the trait method to be accessible, there must be an implementation of that trait visible from the scope where the method is called. If the trait is `pub` and the implementation is not, and the implementation is not visible in the scope where the trait method is called, this will cause a compilation error.
es: Tenga en cuenta que para que el método de rasgo sea accesible, debe haber una implementación de ese rasgo visible del alcance donde se llama el método. Si el rasgo es `pub` y la implementación no es, y la implementación no es visible en el alcance donde se llama el método de rasgo, esto causará un error de compilación.
fr: Notez que pour que la méthode des caractères soit accessible, il doit y avoir une mise en œuvre de cette caractéristique visible à partir de la portée où la méthode est appelée. Si la caractéristique est "pub" et que la mise en œuvre n'est pas, et que la mise en œuvre n'est pas visible dans la portée où la méthode des caractères est appelée, cela causera une erreur de compilation.
id: Perhatikan bahwa agar metode perangai dapat diakses, harus ada penerapan sifat tersebut yang terlihat dari ruang lingkup di mana metode ini disebut. Jika sifat tersebut adalah ·pubå dan implementasi tidak, dan implementasi tidak terlihat dalam lingkup di mana metode sifat disebut, ini akan menyebabkan kesalahan kompilasi.
tr: Bu özellik yönteminin erişilebilir olması için, bu özelliğin yöntemin çağrıldığı kapsamdan görünür bir uygulaması olması gerektiğini unutmayın. Eğer özellik pub ise ve uygulama değilse ve uygulama özellik yönteminin çağrıldığı kapsamda görünmezse, bu bir derleme hatasına neden olacaktır.
zh_cn: 请注意,要便于使用特性方法,必须执行该特性,从该方法的名称范围中可以看出。如果该特性是`pub',而该特性不是`pub',而该特性方法的名称范围中无法看到该特性方法,则会造成编译错误。

source: Within the `impl` block, we put the method signatures that the trait definition has defined. Instead of adding a semicolon after each signature, we use curly brackets and fill in the method body with the specific behavior that we want the methods of the trait to have for the particular type.
es: Dentro del bloque `impl`, ponemos las firmas del método que la definición del rasgo ha definido. En lugar de añadir un punto y coma después de cada firma, usamos corchetes rizados y rellenamos el cuerpo del método con el comportamiento específico que queremos que los métodos del rasgo tengan para el tipo particular.
fr: Dans le bloc `impl`, nous mettons les signatures de la méthode que la définition du trait a défini. Au lieu d'ajouter un point-virgule après chaque signature, nous utilisons des crochets bouclés et remplir le corps de la méthode avec le comportement spécifique que nous voulons que les méthodes du trait aient pour le type particulier.
id: Daripada menambahkan setengah koma setelah setiap tanda tangan, kami menggunakan kurung keriting dan mengisi metode tubuh dengan perilaku spesifik yang kami inginkan dari metode sifat yang kami miliki untuk jenis tertentu.
tr: impl bloğu içinde, özellik tanımının tanımladığı yöntem imzalarını koyarız. Her imzadan sonra bir virgül eklemek yerine, kıvırcık parantezler kullanır ve özellik metotlarının belirli tip için sahip olmasını istediğimiz özel davranışla yöntem gövdesini doldururuz.
zh_cn: 在“简化”块内,我们把特质定义定义所定义的方法符号放入其中。我们不是在每次签名后添加分号,而是使用卷括号,在方法体中填充我们想要特定类型特质方法的具体行为。

source: Now that the library has implemented the `Summary` trait on `NewsArticle` and `Tweet`, users of the crate can call the trait methods on instances of `NewsArticle` and `Tweet` in the same way we call regular methods. The only difference is that the user must bring the trait into scope as well as the types. Here’s an example of how a crate could use our `aggregator` crate:
es: Ahora que la biblioteca ha implementado el rasgo `Resumen` en `NewsArticle` y `Tweet`, los usuarios de la caja pueden llamar a los métodos de rasgo en instancias de `NewsArticle` y `Tweet` de la misma manera que llamamos métodos regulares. La única diferencia es que el usuario debe traer el rasgo en el alcance, así como los tipos. He aquí un ejemplo de cómo una caja podría utilizar nuestra caja `agregador`:
fr: Maintenant que la bibliothèque a mis en œuvre le caractère `Sommary` sur `NewsArticle` et `Tweet`, les utilisateurs de la caisse peuvent appeler les méthodes de caractère sur les instances de `NewsArticle` et `Tweet` de la même manière que nous appelons les méthodes régulières. La seule différence est que l'utilisateur doit apporter le caractère dans la portée ainsi que les types. Voici un exemple de comment une caisse pourrait utiliser notre caisse `agrégator`:
id: Sekarang perpustakaan telah mengimplementasikan sifat Summary pada 'NewsArticle' dan 'Tweet', pengguna dari peti itu dapat menyebut metode-metode khas pada contohnya dari 'NewsArticle' dan 'Tweet' dengan cara yang sama kita sebut metode reguler. Satu-satunya perbedaan adalah bahwa pengguna harus membawa sifat-sifat ke dalam lingkup serta jenis-jenisnya.
tr: Artık kütüphane NewsArticle ve Tweet üzerinde Summary özelliğini uyguladığına göre, kasa kullanıcıları, NewsArticle ve Tweet örneklerindeki özellik yöntemlerini düzenli yöntemler olarak adlandırdığımız şekilde arayabilirler. Tek fark, kullanıcının özelliğin yanı sıra türleri de kapsam içine getirmesi gerektiğidir. İşte bir kasanın aggr sandığımızı nasıl kullanabileceğinin bir örneği:
zh_cn: 既然图书馆已经实施了`新闻组'和`新闻组'上的`摘要'特性,箱内的用户可以用我们所称的常规方法同样的方式将特性方法称为`新闻组'和`网络组'。唯一的区别是,用户必须把特性纳入范围和类型。

source: This code prints the following:
es: Este código imprime lo siguiente:
fr: Ce code imprime ce qui suit :
id: Kode ini mencetak hal berikut:
tr: Bu kod aşağıdakileri yazdırır:
zh_cn: 此代码打印如下 :

source: Other crates that depend on the _aggregator_ crate can also bring the `Summary` trait into scope to implement `Summary` on their own types.
es: Otras cajas que dependen de la caja _agregador_ también pueden incorporar el rasgo `Resumen` en el ámbito de aplicación de la `Resumen` en sus propios tipos.
fr: D'autres caisses qui dépendent de la caisse _aggregator_ peuvent également apporter le caractère `Sommary` dans la portée pour mettre en œuvre `Sommary` sur leurs propres types.
id: Peti lain yang tergantung pada peti _aggregator_ dapat juga membawa sifat-sifat yang ada dalam lingkup untuk mengimplementasikan sistemer pada tipe mereka sendiri.
tr: _aggregator_ sandığına bağlı olan diğer sandıklar, Summary özelliğini kendi türlerinde uygulamak için de kapsam içine getirebilir.
zh_cn: 依赖_聚合箱的其他箱子也可以将`摘要'特性带入范围,以在自己的类型上实施`摘要'。

source: Managing and Using External Trait
es: Gestión y uso del rasgo externo
fr: Gestion et utilisation des caractères externes
id: Mengelola dan Menggunakan Sifat Eksternal
tr: Dış Trait'i Yönetmek ve Kullanmak
zh_cn: 管理和利用外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外的外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外外

source: To use traits methods, you need to make sure the correct traits/implementation(s) are imported. In some cases you might need to import not only the trait but also the implementation if they are declared in separate modules. If `CircleGeometry` implementation was in a separate module/file named _circle_, then to define `boundary` method on `Circle` struct, we'd need to import `ShapeGeometry` trait in the _circle_ module.
es: Para utilizar métodos de características, es necesario asegurarse de que se importan los rasgos/implementaciones correctos. En algunos casos es posible que tenga que importar no sólo el rasgo, sino también la aplicación si se declaran en módulos separados. Si la aplicación de `CircleGeometry` estaba en un módulo/archivo separado llamado _circle_, a continuación, para definir el método `frontario` en la estructura `Circle`, tendríamos que importar `ShapeGeometry` en el módulo _circle_.
fr: Pour utiliser les méthodes de caractères, vous devez vous assurer que les caractères/implémentation(s) correct(s) sont importés. Dans certains cas, vous pourriez avoir besoin d'importer non seulement le caractère mais aussi l'implémentation s'ils sont déclarés dans des modules séparés. Si l'implémentation `CircleGeometry` était dans un module/fichier distinct nommé _circle_, alors pour définir la méthode `boundary` sur la structure `Circle`, nous devons importer le caractère `ShapeGeometry` dans le module _circle_.
id: Untuk menggunakan metode perangai, Anda perlu memastikan bahwa perangai/implementasi yang benar (ircleGeometri) diimpor. Dalam beberapa kasus Anda mungkin perlu mengimpor tidak hanya sifat tetapi juga impletasi jika mereka dinyatakan dalam modul terpisah. Jika implementasi cirkelry dalam modul terpisah/berkas bernama _circle_, kemudian untuk mendefinisikan metode Árcleá strucle struct, kita perlu mengimpor sifat auxpeometri dalam modul _circle_.
tr: Özellikler yöntemlerini kullanmak için, doğru özelliklerin/uygulamaların/uygulamaların içe aktarıldığından emin olmanız gerekir. Bazı durumlarda, yalnızca özelliği değil, aynı zamanda ayrı modüllerde beyan edilirse uygulamayı da içe aktarmanız gerekebilir. Eğer CircleGeometri uygulaması ayrı bir modülde/dosyada _circle_ olarak adlandırılmışsa, Circle struct üzerinde boundary yöntemini tanımlamak için circle_Geometri'yi içe aktarmamız gerekir.
zh_cn: 要使用特性方法, 您需要确保导入正确的特性/ 执行 。 在某些情况下, 您需要导入的不仅是特性/ 执行, 如果在不同的模块中声明, 您可能需要导入这些特性/ 执行 。 如果“ 环形测量” 的实施是在名为 _ 环形 的单独模块/ 文件中进行, 然后定义“ 环形” 构造上的“ 边界” 方法, 我们需要在 _ 环形 模块中导入“ 形状” 特性 。

source: If the code was organized into modules like this, where the implementation of a trait was defined in a different module than the trait itself, explicitly importing the relevant trait or implementation is required.
es: Si el código fue organizado en módulos como este, donde la implementación de un rasgo fue definida en un módulo diferente al propio rasgo, explícitamente se requiere importar el rasgo o implementación relevante.
fr: Si le code était organisé en modules comme celui-ci, où l'implémentation d'un caractère était définie dans un module différent de celui lui-même, l'importation explicite du caractère ou de l'implémentation concerné est requise.
id: Jika kode terorganisir dalam modul seperti ini, di mana implementasi sebuah sifat didefinisikan dalam modul yang berbeda daripada sifat itu sendiri, secara eksplisit mengimpor sifat atau implementasi yang relevan diperlukan.
tr: Kod, bir özelliğin uygulanmasının özelliğin kendisinden farklı bir modülde tanımlandığı bu gibi modüller halinde düzenlenmişse, ilgili özelliğin veya uygulamanın açıkça içe aktarılması gerekir.
zh_cn: 如果该代码是按这种模块编排的,那么在不同的模块中与特性本身不同地界定了特性的实施,则需要明确输入相关特性或实施。

source: // Here T is an alias type which will be provided during implementation
es: // Aquí T es un tipo de alias que se proporcionará durante la aplicación
fr: // Ici T est un type d'alias qui sera fourni pendant la mise en œuvre
id: //Di sini T adalah sebuah tipe alias yang akan disediakan selama implementasi
tr: // Burada T, uygulama sırasında sağlanacak bir takma ad türüdür.
zh_cn: 此处T是实施期间将提供的别名类型。

source: // Importing ShapeGeometry is required to implement this trait for Rectangle
es: // Importación de ShapeGeometry es necesario para implementar este rasgo para Rectángulo
fr: // Importation de ShapeGeométrie est nécessaire pour implémenter ce trait pour Rectangle
id: // Mengimpor ShapeGeometri diperlukan untuk mengimplementasikan sifat ini untuk persegi panjang
tr: // Dikdörtgen için bu özelliği uygulamak için ShapeGeometri ithal edilmesi gereklidir
zh_cn: / 执行矩形的这一特性需要导入形状结构测量法。

source: // Implementation RectangleGeometry passes in <Rectangle> // to implement the trait for that type
es: // Implementación RectánguloGeometría pasa en <Rectángulo> // para implementar el rasgo de ese tipo
fr: // Implementation RectangleLa géométrie passe dans <Rectangle> // pour implémenter le caractère pour ce type
id: //Implementasi RectgleGeometri melewati <Rectangle> // untuk mengimplementasikan sifat untuk tipe itu
tr: // Uygulama DikdörtgenGeometrisi Rectangle> // bu tür için özelliği uygulamak için geçer
zh_cn: / 执行在 < 矩形 > / / 执行该类型特性的矩形构造通道

source: // Importing ShapeGeometry is required to implement this trait for Circle
es: // Importación de ShapeGeometry es necesario para implementar este rasgo para Circle
fr: // Importation de FormeGéométrie est nécessaire pour implémenter ce trait pour Circle
id: // Mengimpor ShapeGeometri diperlukan untuk mengimplementasikan sifat ini untuk Lingkaran
tr: // Çember için bu özelliği uygulamak için ShapeGeometri'yi ithal etmek gerekir
zh_cn: / 需要进口形状结构测量法来实施此圆形特性

source: // Implementation CircleGeometry passes in <Circle> // to implement the imported trait for that type
es: // Implementación CírculoGeometría pasa en <Círculo> // para implementar el rasgo importado para ese tipo
fr: // Circle de mise en oeuvreLa géométrie passe dans <Circle> // pour mettre en œuvre le caractère importé pour ce type
id: //Implementasi CircleGeometri lewat dalam <Circle> // untuk mengimplementasikan sifat impor untuk tipe itu
tr: // Uygulama ÇemberiGeometrisi, bu tür için ithal edilen özelliği uygulamak için Circle> // geçer
zh_cn: 在 < 环环圈 > // 用于执行该类型的进口特性的执行圆形构造通行证// 用于执行该类型的进口特性

source: "Rectangle area: {}"
es: "Área de rectángulo:
fr: "Zone du cratangle: {}"
id: "Area Rectangle: {}"
tr: "Dikdörtgen alanı: "
zh_cn: "赤色区域: "

source: "Rectangle boundary: {}"
es: "Límite del rectángulo:
fr: "Lisière du cratangle: {}"
id: Batas Rectangle: {}"
tr: "Yükseliş sınırı: "
zh_cn: "龙形边界: "

source: "Circle area: {}"
es: "Área del círculo:
fr: "Zone de circulation: {}"
id: "Area lingkaran: {}"
tr: "Daire alanı: "
zh_cn: "圆圈区域: "

source: "Circle boundary: {}"
es: "Límite del círculo:
fr: "Circulaire : {}"
id: Batas lingkaran: {}"
tr: "Daire sınırı: "
zh_cn: “圆圈边界:_________________________________________________________________________________________________________________________________________________________________________

source: Note that in this example, `CircleGeometry` and `RectangleGeometry` implementations don't need to be declared as `pub`. Indeed, `ShapeGeometry` trait, which is public, is used to print the result in the `main` function. The compiler will find the appropriate implementation for the `ShapeGeometry` public trait, regardless of the implementation visibility.
es: Cabe señalar que en este ejemplo, las implementaciones de `CircleGeometry` y `RectangleGeometry` no necesitan ser declaradas `pub`. De hecho, el rasgo `ShapeGeometry`, que es público, se utiliza para imprimir el resultado en la función `principal`. El compilador encontrará la aplicación apropiada para el rasgo público `ShapeGeometry`, independientemente de la visibilidad de la aplicación.
fr: Notez que dans cet exemple, les implémentations `CircleGeometry` et `RectangleGeometry` n'ont pas besoin d'être déclarées comme `pub`. En effet, le caractère `ShapeGeometry`, qui est public, est utilisé pour imprimer le résultat dans la fonction `main`. Le compilateur trouvera l'implémentation appropriée pour le caractère public `ShapeGeometry`, quelle que soit la visibilité de l'implémentation.
id: Perhatikan bahwa dalam contoh ini, "CircleGeometry" dan "RectangleGeometry," implementations" tidak perlu dideklarasikan sebagai "CircleGeometry." Memang, sifat umum, yang digunakan untuk mencetak hasil dari fungsi thosemain." Komiler akan menemukan implementasi yang sesuai untuk sifat publik, terlepas dari penerapan visibilitas.
tr: Bu örnekte, CircleGeometri ve RectangleGeometri uygulamalarının pub olarak ilan edilmesine gerek olmadığını unutmayın. Gerçekten de, ShapeGeometri özelliği, main işlevindeki sonucu yazdırmak için kullanılır. Derleyici, uygulama görünürlüğüne bakılmaksızın ShapeGeometri kamusal özelliği için uygun uygulamayı bulacaktır.
zh_cn: 请注意,在这个例子中,`环形计量'和`矩形计量'执行不需要被宣布为`pub ',事实上,`ShapeGhophat'特性是公开的,用来印刷`主要'功能的结果,汇编者将找到`ShapeGhophat'公共特性的适当执行,而不论执行的能见度如何。

source: Impl Aliases
es: Impl Alias
id: Aliase Impl
zh_cn: Impl 别名

source: Implementations can be aliased when imported. This is most useful when you want to instantiate generic implementations with concrete types. For example, let's say we define a trait `Two` that is used to return the value `2` for a type `T`. We can write a trivial generic implementation of `Two` for all types that implement the `One` trait, simply by adding twice the value of `one` and returning it. However, in our public API, we may only want to expose the `Two` implementation for the `u8` and `u128` types.
es: Las implementaciones se pueden alias cuando se importan, lo que es más útil cuando se desea instanciar implementaciones genéricas con tipos concretos. Por ejemplo, digamos que definimos un rasgo `Dos` que se utiliza para devolver el valor `2` para un tipo `T`. Podemos escribir una implementación genérica trivial de `Dos` para todos los tipos que implementan el rasgo `Uno`, simplemente añadiendo el doble del valor de `uno` y devolviéndolo. Sin embargo, en nuestra API pública, podemos sólo querer exponer la implementación `Dos` para los tipos `u8` y `u128`.
fr: Par exemple, disons que nous définissons un trait `Two` qui est utilisé pour retourner la valeur `2` pour un type `T`. Nous pouvons écrire une implémentation générique triviale de `Two` pour tous les types qui implémentent le trait `One`, simplement en ajoutant deux fois la valeur de `One` et en la renvoyant. Cependant, dans notre API publique, nous pouvons seulement vouloir exposer l'implémentation `Two` pour les types `u8` et `u128`.
id: Implementasi dapat dilafalkan ketika diimpor. Ini paling berguna bila Anda ingin mengimplementasi umum instantasi dengan tipe beton. Sebagai contoh, katakanlah kita mendefinisikan sifat yang digunakan untuk mengembalikan nilai tersebut. Namun, di API umum kita, kita mungkin hanya ingin mengungkap penerapan umum yang sepele untuk semua tipe yang mengimplementasi ▪8 dan tipe.
tr: İthal edildiğinde uygulamalar takma adla adlandırılabilir. Bu, genel uygulamaları somut tiplerle anlık hale getirmek istediğinizde en kullanışlıdır. Örneğin, bir T türü için 2 değerini döndürmek için kullanılan bir Two özelliğini tanımladığımızı varsayalım. Two'nun önemsiz bir genel uygulamasını yazabiliriz. One özelliğini uygulayan tüm türler için, sadece One özelliğini iki kez ekleyerek ve döndürerek.
zh_cn: 导入时可以用别名来表示执行。当您想要用具体类型即刻执行通用执行时,这是非常有用的。例如,让我们说,我们定义一个特性`二 ',用来返回`T'类的`2'值。我们可以就所有类型实施`一个'特性的`二 ',简单地将`一个'的值增加一倍,然后将其还原。然而,在我们公开的API中,我们可能只想揭露`u8'和`u128'类的`两个`执行'。

source: <span class="caption"> Listing 8-1: Using impl aliases to instantiate generic impls with concrete types</span>
es: <span class="caption"> Listado 8-1: Uso de alias de impl para instanciar impls genéricos con tipos de hormigón</span>
fr: <span class="caption"> Listage 8-1: Utilisation d'impl alias pour actualiser des impls génériques avec des types de béton</span>
id: <span class="caption"> Listing 8-1: Menggunakan alias impl ke impls generik instantate dengan tipe beton</span>
tr: span class="caption"> Listeleme 8-1: Genel implleri somut tiplerle anlık hale getirmek için impl takma adlarının kullanılması/span>
zh_cn: <span类=“caption” > 列表 8-1:使用光化别名即时化具有具体类型 </span> 的通用 Indipls

source: We can define the generic implementation in a private module, use an impl alias to instantiate the generic implementation for these two concrete types, and make these two implementations public, while keeping the generic implementation private and unexposed. This way, we can avoid code duplication using the generic implementation, while keeping the public API clean and simple.
es: Podemos definir la implementación genérica en un módulo privado, utilizar un impl alias para instanciar la implementación genérica para estos dos tipos concretos, y hacer estas dos implementaciones públicas, manteniendo la implementación genérica privada y no expuesta. De esta manera, podemos evitar la duplicación de código utilizando la implementación genérica, manteniendo la API pública limpia y sencilla.
fr: Nous pouvons définir l'implémentation générique dans un module privé, utiliser un alias impl pour actualiser l'implémentation générique pour ces deux types concrets, et rendre ces deux implémentations publiques, tout en maintenant l'implémentation générique privée et non exposée. De cette façon, nous pouvons éviter la duplication de code en utilisant l'implémentation générique, tout en maintenant l'API publique propre et simple.
id: Kita dapat mendefinisikan implementasi generik dalam modul privat, menggunakan impl alias untuk mempercepat implementasi generik untuk dua tipe beton ini, dan membuat kedua implementasi ini untuk umum, sementara menjaga implementasi umum privat dan tidak terafeksi. Dengan cara ini, kita dapat menghindari duplikasi kode menggunakan implementasi umum, sementara menjaga API publik tetap bersih dan sederhana.
tr: Genel uygulamayı özel bir modülde tanımlayabilir, bu iki beton türü için genel uygulamayı anlık hale getirmek için bir impl takma adı kullanabilir ve bu iki uygulamayı kamuya açık hale getirebilir, genel uygulamayı özel ve teşhir edilmeden tutabiliriz. Bu şekilde, genel uygulamayı kullanarak kod çoğaltılmasını önleyebilir, kamu API'sini temiz ve basit tutarken.
zh_cn: 我们可以在私人模块中定义通用实施,用插头别名来即时执行这两种具体类型的通用实施,并公开这两种实施,同时将通用实施私密和未暴露。 这样,我们可以避免使用通用实施代码的重复,同时保持公共API的简洁和简单化。

source: Negative Impls
es: Implicaciones negativas
fr: Impliqués négatifs
id: Impl Negatif
tr: Negatif İmpls
zh_cn: 负负因数
