Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The `buy_item` function is the main entry point for a user to purchase an item. It retrieves the caller's address. It calls the `get_asset_price` function to get the current price of ETH in USD using the `ETH_USD` asset ID. It calculates the amount of ETH needed to buy the product based on the product price in USD at the corresponding ETH price. It then checks if the caller has enough ETH by calling the `balance_of` method on the ERC20 ETH contract. If the caller has enough ETH, it calls the `transfer_from` method of the `eth_dispatcher` instance to transfer the required amount of ETH from the caller to another contract address.
es: La función `buy_item` es el punto de entrada principal para que un usuario compre un artículo y recupera la dirección de la persona que llama. Llama a la función `get_asset_price` para obtener el precio actual de ETH en USD utilizando el ID del activo `ETH_USD`. Calcula la cantidad de ETH necesaria para comprar el producto sobre la base del precio del producto en USD al precio correspondiente de ETH. A continuación, comprueba si la persona que llama tiene suficiente ETH llamando al método `balance_of` en el contrato ERC20 ETH. Si la persona que llama tiene suficiente ETH, llama al método `transfer_ from` de la instancia `eth_dispatcher` para transferir la cantidad requerida de ETH de la persona que llama a otra dirección del contrato.
fr: La fonction `buy_item` est le point d'entrée principal d'un utilisateur pour acheter un article. Elle récupère l'adresse de l'appelant. Elle appelle la fonction `get_asset_price` pour obtenir le prix actuel d'ETH en USD en utilisant l'identifiant d'actif `ETH_USD`. Elle calcule le montant d'ETH nécessaire pour acheter le produit en fonction du prix du produit en USD au prix correspondant d'ETH. Elle vérifie ensuite si l'appelant a suffisamment d'ETH en appelant la méthode `balance_of` sur le contrat ERC20 ETH. Si l'appelant a assez d'ETH, elle appelle la méthode `transfer_from` de l'instance `eth_dispatcher` pour transférer le montant requis d'ETH de l'appelant à une autre adresse contractuelle.
id: Fungsi åbuy_item_price adalah titik masuk utama bagi pengguna untuk membeli suatu barang. Ia mengambil kembali alamat si pemanggil. Ia menyebut fungsi åget_price_price_price_factions untuk mendapatkan harga saat ini di USD menggunakan ID aset ÁT_USD. Ia menghitung jumlah ETH yang diperlukan untuk membeli produk berdasarkan harga produk di USD dengan harga yang sesuai. Maka cek apakah pemanggil memiliki cukup ETH dengan memanggil metode ERC20th. Jika pemanggil panggilan ETH, maka panggilan EVAL_Deferetth dari metode eth_dispaet ke alamat lain yang diperlukan.
tr: buy_item işlevi, bir kullanıcının bir öğe satın alması için ana giriş noktasıdır. Arayanın adresini alır. ETH_USD varlık kimliğini kullanarak ETH'nin mevcut fiyatını USD cinsinden almak için get_asset_price işlevini çağırır. Yeterli ETH fiyatından USD'deki ürün fiyatına dayalı olarak ETH'yi satın almak için gereken ETH miktarını hesaplar. Daha sonra arayan kişinin yeterli olup olmadığını kontrol eder.
zh_cn: `buy_item' 函数是用户购买物品的主要切入点,它检索了来电者的地址,它称为`get_asset_price'函数,用`ETH_USD' 资产代号以美元取得ETH的现价,它根据以美元计算的产品价格,以相应的ETH价格计算购买产品所需的ETH数量,然后通过在ERC20 ETH 合同中将`平衡'方法称为`平衡'方法,检查来电者是否有足够的ETH。如果来电者有足够的ETH,它称为`ETH_dispatcher'的`转让方法 ',它称为`ETH_dispatcher'实例,将所要求的ETH数量从打电话者转到另一个合同地址。

source: The `get_asset_price` function is the entry point to interact with the Pragma oracle and has been explained in the section above.
es: La función `get_asset_price` es el punto de entrada para interactuar con el oráculo Pragma y se ha explicado en la sección anterior.
fr: La fonction `get_asset_price` est le point d'entrée pour interagir avec l'oracle Pragma et a été expliquée dans la section ci-dessus.
id: Fungsi 'get'_aset_price' adalah titik masuk untuk berinteraksi dengan Pragma oracle dan telah dijelaskan di bagian atas.
tr: get_asset_price işlevi, Pragma kahini ile etkileşime girmek için giriş noktasıdır ve yukarıdaki bölümde açıklanmıştır.
zh_cn: `get_asset_price' 函数是与Praggma oracle互动的切入点,已在上一节作了解释。

source: You can get a detailed guide on consuming data using Pragma price feeds [here](https://docs.pragma.build/Resources/Cairo%201/data-feeds/consuming-data).
es: Puede obtener una guía detallada sobre el consumo de datos utilizando los feeds de precios de Pragma [aquí] (https://docs.pragma.build/Resources/Eliro%201/data-feeds/consuming-data).
fr: Vous pouvez obtenir un guide détaillé sur la consommation de données à l'aide des flux de prix de Pragma [ici] (https://docs.pragma.build/Resources/Cairo%201/data-feeds/mouse-data).
id: Anda bisa mendapatkan panduan rinci untuk mengkonsumsi data menggunakan harga Pragma feed [di sini][di sini]://docs.pragma.build/Resources/Cairo%201/data-feeds/konsuming-data).
tr: Pragma fiyat beslemelerini kullanarak veri tüketme konusunda ayrıntılı bir rehber alabilirsiniz [burada](https://docs.pragma.build/Resources/Cairo%201/data-feeds/eating-data).
zh_cn: 您可以从Praggma价格反馈(https://docs.pragma.building/Resources/Cairo%201/data-feeds/pent-data)获得详细的消费数据指南。

source: Since all blockchains are fundamentally deterministic and most are public ledgers, generating truly unpredictatable randomness on-chain presents a challenge. This randomness is crucial for fair outcomes in gaming, lotteries, and unique generation of NFTs. To address this, verifiable random functions (VRFs) provided by oracles offer a solution. VRFs guarantee that the randomness can't be predicted or tampered with, ensuring trust and transparency in these applications.
es: Dado que todas las cadenas de bloques son fundamentalmente deterministas y la mayoría son libros públicos, generar aleatoriedad realmente impredecible en la cadena presenta un desafío. Esta aleatoriedad es crucial para resultados justos en juegos, loterías y generación única de NFTs. Para abordar esto, funciones aleatorias verificables (VRFs) proporcionados por oráculos ofrecen una solución. Los VRFs garantizan que la aleatoriedad no se puede predecir o manipular, garantizando la confianza y la transparencia en estas aplicaciones.
fr: Comme toutes les blockchains sont fondamentalement déterministes et la plupart sont des livres publics, générant une randomité vraiment imprévisible sur la chaîne présente un défi. Cette randomité est cruciale pour des résultats équitables dans le jeu, les loteries, et la génération unique de NFT. Pour répondre à cela, des fonctions aléatoires vérifiables (VRF) fournies par oracles offrent une solution. Les VRF garantissent que la randomité ne peut pas être prédite ou altérée, assurant la confiance et la transparence dans ces applications.
id: Karena semua rantai blok secara fundamental menentukan dan kebanyakan adalah buku besar publik, menghasilkan fungsi acak yang benar-benar tidak terduga pada rantai menghadirkan sebuah tantangan. keacakan ini merupakan hal yang penting untuk hasil yang adil dalam permainan, lotre, dan generasi unik dari NFT. Untuk mengatasi ini, fungsi acak yang dapat diverifikasi (VRFs) disediakan oleh peramal menawarkan solusi. VRF menjamin bahwa acak tidak dapat diprediksi atau dirusak dengan, memastikan kepercayaan dan transparansi dalam aplikasi ini.
tr: Tüm blok zincirleri temelde deterministik olduğundan ve çoğu kamu defterleri olduğundan, zincir üzerinde gerçekten öngörülemeyen rastgelelik üretmek bir meydan okuma sunar. Bu rastgelelik, oyun, piyango ve benzersiz nesil NFT'lerde adil sonuçlar için çok önemlidir. Bunu ele almak için, kahinler tarafından sağlanan doğrulanabilir rastgele fonksiyonlar (VRF'ler) bir çözüm sunar. VRF'ler, rastgeleliğin tahmin edilemeyeceğini veya bu uygulamalarla oynanamayacağını, güven ve şeffaflığın sağlan garantisini verir.
zh_cn: 由于所有链条基本上都是决定性的,而且大部分是公共分类账,因此在链条上造成真正无法预测的随机性是一个挑战。 这种随机性对于游戏、彩票和独特型NFT的公平结果至关重要。 要解决这个问题,由甲骨文提供的可核查随机功能(VRFs)提供了一种解决方案。 VRFs保证随机性不会被预测或篡改,确保这些应用程序的信任和透明度。

source: Overview on VRFs
es: Sinopsis de los marcos de resultados voluntarios
fr: Aperçu des FRV
id: Ringkasan pada VRF
tr: VRF'lere genel bakış
zh_cn: 风险成果框架概览

source: Pseudo-random but secure: VRFs use a secret key and a nonce (a unique input) to generate an output that appears random. While technically 'pseudo-random', it's practically impossible for another party to predict the outcome without knowing the secret key.
es: Pseudo-aleatorio pero seguro: los VRF utilizan una clave secreta y un nonce (una entrada única) para generar una salida que parece aleatoria. Si bien técnicamente 'pseudo-aleatoria', es prácticamente imposible para otra parte predecir el resultado sin conocer la clave secreta.
fr: Pseudo-random mais sécurisé: les VRF utilisent une clé secrète et un nonce (une entrée unique) pour générer une sortie qui apparaît aléatoire. Alors que techniquement 'pseudo-random', il est pratiquement impossible pour une autre partie de prédire le résultat sans connaître la clé secrète.
id: Pseudo-random but secure: VRFs menggunakan kunci rahasia dan nonce (input unik) untuk menghasilkan keluaran yang muncul secara acak. Sementara secara teknis 'pseudo-random', hampir mustahil bagi partai lain untuk memprediksi hasil tanpa mengetahui kunci rahasia.
tr: Pseudo-rastgele ama güvenli: VRF'ler rastgele görünen bir çıktı oluşturmak için gizli bir anahtar ve bir nonce (benzersiz bir girdi) kullanır. Teknik olarak 'pseudo-rastgele' olsa da, başka bir tarafın gizli anahtarı bilmeden sonucu tahmin etmesi neredeyse imkansızdır.
zh_cn: 假冒- 随机性但安全性: VRFs使用秘密密钥和非密钥( 一种独特的输入) 生成随机输出。 虽然技术上“ 假冒- 随机性 ”, 但另一方几乎不可能在不知道秘密密钥的情况下预测结果 。

source: Verifiable output: VRFs produce not only the random number but also a proof that anyone can use to independently verify that the result was generated correctly according to the function's parameters.
es: Salida verificable: Los VRF producen no sólo el número aleatorio, sino también una prueba de que cualquiera puede utilizar para verificar independientemente que el resultado se generó correctamente de acuerdo con los parámetros de la función.
fr: Sortie vérifiable : les VRF produisent non seulement le nombre aléatoire, mais aussi une preuve que tout le monde peut utiliser pour vérifier indépendamment que le résultat a été généré correctement selon les paramètres de la fonction.
id: Keluaran terverifikasi: VRFs menghasilkan tidak hanya angka acak tetapi juga bukti yang dapat digunakan untuk memverifikasi secara independen bahwa hasil dihasilkan dengan benar sesuai dengan parameter fungsi.
tr: Doğrulanabilir çıktı: VRF'ler sadece rastgele sayıyı değil, aynı zamanda sonucun fonksiyonun parametrelerine göre doğru bir şekilde oluşturulduğunu bağımsız olarak doğrulamak için herkesin kullanabileceği bir kanıt üretir.
zh_cn: 可核实产出: VRF不仅提供随机数字,而且还提供证据,证明任何人都可以用来独立核实结果是否根据函数参数正确产生。

source: Generating Randomness with Pragma
es: Generando Al azar con Pragma
fr: Génération de Randomness avec Pragma
id: Menjangkitkan Keacakan dengan Pragma
tr: Pragma ile Rastgelelik Oluşturmak
zh_cn: 与 Pragma 生成随机

source: [Pragma](https://www.pragma.build/), an oracle on Starknet provides a solution for generating random numbers using VRFs. Let's dive into how to use Pragma VRF to generate a random number in a simple dice game contract.
es: [Pragma](https://www.pragma.build/), un oráculo en Starknet proporciona una solución para generar números aleatorios usando VRFs. Vamos a sumergirnos en cómo utilizar Pragma VRF para generar un número aleatorio en un simple contrato de juego de dados.
fr: [Pragma](https://www.pragma.build/), un oracle sur Starknet fournit une solution pour générer des nombres aléatoires à l'aide de VRF. Plongons dans la façon d'utiliser Pragma VRF pour générer un nombre aléatoire dans un simple contrat de jeu de dés.
id: [Pragma] Cresthttps://www.pragma.build/), sebuah peramal di Starknet menyediakan solusi untuk menghasilkan angka acak menggunakan VRFs. Mari kita menyelam ke dalam bagaimana menggunakan Pragma VRF untuk menghasilkan angka acak dalam kontrak permainan dadu sederhana.
tr: [Pragma](https://www.pragma.build/), Starknet'teki bir kahin, VRF'leri kullanarak rastgele sayılar oluşturmak için bir çözüm sunar. Basit bir zar oyunu sözleşmesinde rastgele bir sayı oluşturmak için Pragma VRF'yi nasıl kullanacağımıza bakalım.
zh_cn: [Pragma] (https://www.pragma.building/), Starknet 上的甲骨文提供了使用 VRF 生成随机数字的解决方案。让我们跳入如何使用 Pragma VRF 在简单的骰子游戏合同中生成随机数字 。

source: Add Pragma as a Dependency
es: Añadir Pragma como dependencia
fr: Ajouter Pragma comme dépendance
id: Tambahkan Pragma sebagai Ketergantungan
tr: Bağımlılık Olarak Pragma Ekle
zh_cn: 将棱镜添加成依赖性

source: Edit your cairo project's `Scarb.toml` file to include the path to use Pragma.
es: Edite el archivo `Scarb.toml` de su proyecto de cairo para incluir la ruta para usar Pragma.
fr: Modifier le fichier `Scarb.toml` de votre projet de cairo pour inclure le chemin pour utiliser Pragma.
id: Edit berkas proyek cairo Anda tentang Scarb.toml.toml untuk menyertakan jalur untuk menggunakan Pragma.
tr: Cairo projenizin Scarb.toml dosyasını Pragma'yı kullanma yolunu içerecek şekilde düzenleyin.
zh_cn: 编辑您的 cairo 工程的 `Scarb.toml' 文件, 以包含使用 Pragma 的路径 。

source: <span class="caption">Listing 16-5 shows a contract interfaces for Pragma VRF and a simple dice game.</span>
es: <span class="caption">Lista 16-5 muestra una interfaz de contrato para Pragma VRF y un juego de dados simple.</span>
fr: <span class="caption">Liste 16-5 montre une interface contractuelle pour Pragma VRF et un jeu de dés simple.</span>
id: <span class="caption">Listing 16-5 menunjukkan antarmuka kontrak untuk Pragma VRF dan permainan dadu sederhana.</span>
tr: span class="caption">Liste 16-5, Pragma VRF için bir sözleşme arabirimi ve basit bir zar oyunu gösterir./span>
zh_cn: <span类=“caption” >Listing 16-5 显示Pragma VRF的合同界面和一个简单的骰子游戏。 </span>

source: Description of Key IPragmaVRF Entrypoints and Their Inputs
es: Descripción de los puntos de entrada IPragmaVRF clave y sus entradas
fr: Description des points d'entrée IPragmaVRF clés et de leurs entrées
id: Keterangan Entri IPragmaVRF dan Masukan Mereka
tr: Anahtar IPragmaVRF Giriş Noktaları ve Girişlerinin Tanımı
zh_cn: 说明主要IPRAGmaVRF切入点及其投入

source: The function `request_randomness_from_pragma` initiates a request for verifiable randomness from the Pragma oracle. It does this by emitting an event that triggers the following actions off-chain:
es: La función `request_randomness_from_pragma` inicia una solicitud de aleatoriedad verificable desde el oráculo Pragma. Lo hace emitiendo un evento que desencadena las siguientes acciones fuera de cadena:
fr: La fonction `request_randomness_from_pragma` lance une demande de aléatoire vérifiable à partir de l'oracle de Pragma. Il le fait en émettant un événement qui déclenche les actions suivantes hors-chaîne:
id: Fungsi ·request_randomness_from_pragma-- memulai permintaan untuk diverifikasi acak dari Pragma Oracle. Ini dilakukan dengan memancarkan peristiwa yang memicu aksi berikut off-chain:
tr: request_randomness_from_pragma işlevi, Pragma kahini tarafından doğrulanabilir rastgelelik için bir istek başlatır. Bunu, aşağıdaki eylemleri zincir dışı tetikleyen bir olay yayarak yapar:
zh_cn: 函数 `request_randomity_from_pragma' 启动从 Praggma 甲骨文中提出可核查随机性请求。 这样做的方式是发布一个触发以下非链外动作的事件:

source: Randomness generation: The oracle generates random values and a corresponding proof.
es: Generación de azar: El oráculo genera valores aleatorios y una prueba correspondiente.
fr: Génération du hasard : L'oracle génère des valeurs aléatoires et une preuve correspondante.
id: Generasi acak: Peramal menghasilkan nilai acak dan bukti yang sesuai.
tr: Rasgelelik jenerasyonu: Kahin rastgele değerler ve karşılık gelen bir kanıt üretir.
zh_cn: 随机生成: 甲骨文生成随机值和相应的证明 。

source: On-chain submission: The oracle submits the generated randomness and proof back to the blockchain via the `receive_random_words` callback function.
es: Sumisión en cadena: El oráculo devuelve la aleatoriedad y la prueba generadas a la cadena de bloques a través de la función de devolución de llamadas `reciep_random_words`.
fr: Soumission en chaîne : L'oracle soumet le caractère aléatoire généré et la preuve à la blockchain via la fonction de callback `receive_random_words`.
id: On-chain submission: The oracle submits the random submits the randenness and product back to the block chain melalui fungsi callback éreceive_random_words.
tr: On-chain submission: Oracle, oluşturulan rastgeleliği ve kanıtı receive_random_words geri çağırma işlevi aracılığıyla blok zincirine geri gönderir.
zh_cn: 链式提交文件:神器通过回馈功能,将生成的随机性和证据通过`收到_random_words'回馈功能送回到链式链条。

source: `request_randomness_from_pragma` Inputs
es: `solicitud_aleatoria_de_pragma` Inputs
fr: `request_randomness_from_pragma` Entrées
id: Permintaan_randomness_from_pragma thoseputs
tr: request_randomness_from_pragma Girişler
zh_cn: `请求-随机性_来自_pragma'输入

source: `seed`: A value used to initialize the randomness generation process. This should be unique to ensure unpredictable results.
es: `semilla`: Un valor utilizado para inicializar el proceso de generación de al azar, que debería ser único para garantizar resultados impredecibles.
fr: `seed`: Une valeur utilisée pour initialiser le processus de génération du hasard, ce qui devrait être unique pour garantir des résultats imprévisibles.
id: Ini harus unik untuk memastikan hasil yang tak terduga.
tr: seed: Rastgelelik oluşturma işlemini başlatmak için kullanılan bir değer. Bu, öngörülemeyen sonuçları sağlamak için benzersiz olmalıdır.
zh_cn: `种子':用于初始化随机生成过程的值,应具有独特性,以确保不可预测的结果。

source: `callback_address`: The contract address where the `receive_random_words` function will be called to deliver the generated randomness. It is typically the address of your deployed contract implementing Pragma VRF.
es: `callback_address`: La dirección del contrato donde se llamará a la función `recibe_random_words` para entregar la aleatoriedad generada. Típicamente es la dirección de su contrato desplegado implementando Pragma VRF.
fr: `callback_address`: L'adresse du contrat où la fonction `receive_random_words` sera appelée pour livrer le hasard généré. C'est généralement l'adresse de votre contrat déployé mettant en œuvre Pragma VRF.
id: Panggilan kembali_address): Alamat kontrak di mana fungsi pemegang kontrak yang digunakan akan dipanggil untuk menyampaikan keacakan yang dihasilkan. Ini biasanya adalah alamat kontrak anda yang digunakan untuk mengimplementasikan Pragma VRF.
tr: callback_address: receive_random_words işlevinin oluşturulan rastgeleliği iletmek için çağrılacağı sözleşme adresidir. Genellikle Pragma VRF'yi uygulayan konuşlandırılmış sözleşmenizin adresidir.
zh_cn: `回召'地址:`收到_随机_words'功能将被调用以提供产生的随机性的合同地址,通常是你部署的落实Praggma VRF合同的地址。

source: `callback_fee_limit`: The maximum amount of gas you're willing to spend on executing the `receive_random_words` callback function.
es: `callback_fee_limit`: La cantidad máxima de gas que está dispuesto a gastar en la ejecución de la función de devolución de llamada `reciep_random_words`.
fr: `callback_fee_limit`: La quantité maximale de gaz que vous êtes prêt à dépenser pour exécuter la fonction de callback `receive_random_words`.
id: Panggilkembali_fee_limit: Jumlah maksimum gas yang akan Anda habiskan untuk menjalankan fungsi panggilan kembali.
tr: callback_fee_limit: receive_random_words geri çağırma işlevini yürütmek için harcamak istediğiniz maksimum gaz miktarı.
zh_cn: `召回_fee_limit':您愿意用于执行`接收_random_words'回调功能的最大气体量。

source: `publish_delay`: The minimum delay (in blocks) between requesting randomness and the oracle fulfilling the request.
es: `publish_delay`: La demora mínima (en bloques) entre la solicitud de aleatoriedad y el oráculo que satisface la solicitud.
fr: `publich_delay`: Le délai minimum (en blocs) entre la demande de aléatoire et l'oracle répondant à la demande.
id: Penundaan minimum (dalam blok) antara meminta acak dan peramal memenuhi permintaan.
tr: publish_delay: Rastgelelik isteme ile isteği yerine getiren kahin arasındaki minimum gecikme (bloklarda).
zh_cn: `出版迟延':请求随机性与满足请求的神器之间的最小延迟(区块内)。

source: `num_words`: The number of random values (each represented as a `felt252`) you want to receive in a single callback.
es: `num_words`: El número de valores aleatorios (cada uno representado como `felt252`) que desea recibir en una sola devolución de llamada.
fr: `num_words`: Le nombre de valeurs aléatoires (chacun représenté par un `felt252`) que vous souhaitez recevoir en un seul callback.
id: Jumlah nilai acak (masing-masing diwakili sebagai ± 252) Anda ingin menerima satu callback.
tr: num_words: Rastgele değerlerin sayısı (her biri felt252 olarak temsil edilir) tek bir geri çağrıda almak istediğiniz.
zh_cn: `numm_words': 随机值数(每个值以`felt252'表示), 您想要在一次回调中收到 。

source: `calldata`: Additional data you want to pass to the `receive_random_words` callback function.
es: `calldata`: Datos adicionales que desea pasar a la función `recept_random_words` callback.
fr: `calldata`: Données supplémentaires que vous souhaitez transmettre à la fonction de callback `receive_random_words`.
id: Data tambahan yang ingin Anda sampaikan ke fungsi pemanggilan balik ·receive_random_words_words_nego.
tr: calldata: receive_random_words geri çağırma işlevine geçmek istediğiniz ek veriler.
zh_cn: `呼叫数据':您要将更多数据传送到`收到_random_words'回调功能。

source: `receive_randomn_words` Inputs
es: Entradas `recibir_aleatorios_palabras`
fr: Entrées `receive_randomn_words`
id: Masukan_randomn_words_receive
tr: receive_randomn_words Girişler
zh_cn: `收到_randomn_words'输入

source: `requester_address`: The contract address that initiated the randomness request.
es: `requester_adress`: La dirección del contrato que inició la solicitud de azar.
fr: `requester_address`: L'adresse du contrat qui a lancé la demande aléatoire.
id: Alamat kontrak yang memulai permintaan acak.
tr: requester_address: Rastgelelik isteğini başlatan sözleşme adresi.
zh_cn: `请购人地址':启动随机性请求的合同地址。

source: `request_id`: A unique identifier assigned to the randomness request.
es: `request_id`: Un identificador único asignado a la solicitud de azar.
fr: `request_id`: Un identificateur unique attribué à la requête aléatoire.
id: Identifier unik yang ditugaskan untuk permintaan acak.
tr: request_id: Rastgelelik isteğine atanan benzersiz bir tanımlayıcı.
zh_cn: `request_id':随机性请求中指定的独特标识符。

source: `random_words`: An array (span) of the generated random values (represented as `felt252`).
es: `random_words`: un array (span) de los valores aleatorios generados (representado como `felt252`).
fr: `random_words`: Un tableau (span) des valeurs aléatoires générées (représenté comme `felt252`).
id: A array (span) dari nilai acak yang dihasilkan (diwakilkan sebagai ▪felt252).
tr: random_words: Oluşturulan rastgele değerlerin bir dizisi (span) (felt252 olarak temsil edilir).
zh_cn: `随机字':生成随机值的数组(span)(表示为`felt252')。

source: `calldata`: Additional data passed along with the initial randomness request.
es: `calldata`: Datos adicionales transmitidos junto con la solicitud inicial de randomidad.
fr: `calldata`: Données supplémentaires transmises avec la demande initiale de randomité.
id: Data tambahan diteruskan dengan permintaan acak awal.
tr: calldata: İlk rastgelelik isteği ile birlikte aktarılan ek veriler.
zh_cn: `呼叫数据':与最初随机性请求同时传送的额外数据。

source: Dice Game Contract
es: Contrato de juego de dados
fr: Contrat de jeu de dés
tr: Zar Oyun Sözleşmesi
zh_cn: 骰子游戏合同
