Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: How does the type system ensure that the Cairo program never tries to write to the same memory cell twice? Consider the following code, where we try to remove the front of the array twice:
es: ¿Cómo asegura el sistema de tipo que el programa de El Cairo nunca intenta escribir a la misma celda de memoria dos veces? Considere el siguiente código, donde tratamos de eliminar el frente de la matriz dos veces:
fr: Comment le système de type s'assure-t-il que le programme Cairo n'essaie jamais d'écrire dans la même cellule mémoire deux fois? Considérez le code suivant, où nous essayons de supprimer le devant du tableau deux fois:
id: Bagaimana sistem tipe memastikan bahwa program Kairo tidak pernah mencoba untuk menulis ke sel memori yang sama dua kali? Pertimbangkan kode berikut, di mana kita mencoba untuk menghapus depan array dua kali:
tr: Tür sistemi, Kahire programının aynı bellek hücresine iki kez yazmaya çalışmamasını nasıl sağlar? Dizinin ön kısmını iki kez kaldırmaya çalıştığımız aşağıdaki kodu düşünün:
zh_cn: 类型系统如何确保开罗程序从未尝试过两次写入相同的内存单元格? 考虑以下代码, 我们试图两次删除阵列的前端 :

source: In this case, we try to pass the same value (the array in the `arr` variable) to both function calls. This means our code tries to remove the first element twice, which would try to write to the same memory cell twice - which is forbidden by the Cairo VM, leading to a runtime error. Thankfully, this code does not actually compile. Once we have passed the array to the `foo` function, the variable `arr` is no longer usable. We get this compile-time error, telling us that we would need Array to implement the Copy Trait:
es: En este caso, tratamos de pasar el mismo valor (el array en la variable `arr`) a ambas llamadas de función. Esto significa que nuestro código intenta eliminar el primer elemento dos veces, lo que intentaría escribir a la misma celda de memoria dos veces - que está prohibido por la VM de El Cairo, lo que conduce a un error de tiempo de ejecución. Afortunadamente, este código no realmente compilar. Una vez que hemos pasado la matriz a la función `foo`, la variable `arr` ya no es utilizable.
fr: Dans ce cas, nous essayons de passer la même valeur (le tableau dans la variable `arr`) aux deux appels de fonction. Cela signifie que notre code essaie de supprimer le premier élément deux fois, ce qui essaie d'écrire dans la même cellule mémoire deux fois - ce qui est interdit par la VM du Caire, conduisant à une erreur d'exécution. Heureusement, ce code ne compile pas réellement. Une fois que nous avons passé le tableau à la fonction `foo`, la variable `arr` n'est plus utilisable. Nous obtenons cette erreur de compilation-temps, nous disant que nous aurions besoin d'Array pour implémenter le Copy Trait:
id: Dalam hal ini, kami mencoba untuk melewati nilai yang sama (array dalam variabel ·arjan) untuk kedua panggilan fungsi. Ini berarti kode kami mencoba menghapus elemen pertama dua kali, yang akan mencoba menulis ke sel memori yang sama dua kali - yang dilarang oleh Kairo VM, mengarah ke runtime error. Syukurlah, kode ini tidak benar-benar mengkompilasi. Setelah kita telah melewati array fungsi ▪foo (profeo), Varia tidak lagi dapat digunakan.
tr: Bu durumda, her iki işlev çağrısına da aynı değeri (arr değişkenindeki dizi) aktarmaya çalışıyoruz. Bu, kodumuzun aynı bellek hücresine iki kez yazmaya çalışacağı anlamına gelir - bu Kahire VM tarafından yasaklanmıştır, bu da bir çalışma hatasına yol açar. Neyse ki, bu kod aslında derlemeye ihtiyaç duymaz. Diziyi foo işlevine geçtikten sonra, değişken ar'dır.
zh_cn: 在此情况下, 我们试图将相同的值( ` arre' 变量中的数组) 传递给两个函数调用 。 这意味着我们的代码试图两次删除第一个元素, 两次试图将第一个元素写入同一个记忆单元格 - 开罗 VM 禁止的两次, 导致运行时间错误 。 幸运的是, 这个代码实际上没有编译 。 一旦我们将数组传送到 ` foo' 函数, 变量` ` 将不再可用 。 我们得到了这个编译时间错误, 告诉我们需要用 Array 来执行副本 Trait :

source: The `Copy` Trait
es: El rasgo `Copiar`
fr: Le "Copier"
id: Trait
tr: Copy Trait
zh_cn: `Copy` Trapit 悲剧

source: If a type implements the `Copy` trait, passing a value of that type to a function does not move the value. Instead, a new variable is created, referring to the same value. The important thing to note here is that this is a completely free operation because variables are a Cairo abstraction only and because _values_ in Cairo are always immutable. This, in particular, conceptually differs from the Rust version of the `Copy` trait, where the value is potentially copied in memory.
es: Si un tipo implementa el rasgo `Copy`, pasar un valor de ese tipo a una función no mueve el valor. En su lugar, se crea una nueva variable, refiriéndose al mismo valor. Lo importante es señalar aquí que se trata de una operación completamente libre porque las variables son una abstracción de El Cairo solamente y porque _values_ en El Cairo son siempre inmutables. Esto, en particular, conceptualmente difiere de la versión Rust del rasgo `Copy`, donde el valor es potencialmente copiado en memoria.
fr: Si un type implémente le caractère `Copy`, passer une valeur de ce type à une fonction ne déplace pas la valeur. Au lieu de cela, une nouvelle variable est créée, se référant à la même valeur. La chose importante à noter ici est qu'il s'agit d'une opération totalement libre parce que les variables ne sont qu'une abstraction du Caire et parce que _values_ au Caire sont toujours immuables. Ceci, en particulier, diffère conceptuellement de la version Rust du caractère `Copy`, où la valeur est potentiellement copiée en mémoire.
id: Jika sebuah tipe menerapkan sifat tersebut, memberikan nilai dari sebuah fungsi tidak menggerakkan nilai. Sebaliknya, sebuah variabel baru diciptakan, mengacu pada nilai yang sama. Hal yang penting untuk dicatat di sini adalah bahwa ini adalah operasi yang benar-benar bebas karena variabel adalah abstraksi Kairo saja dan karena _vales_ Kairo selalu tidak dapat berubah. Hal ini, khususnya, secara konsep yang berbeda dari versi Rust dari sifat (comp), di mana nilai tersebut berpotensi disalin dalam memori.
tr: Bir tür Copy özelliğini uygularsa, bu tür bir değeri bir fonksiyona geçirmek değeri hareket ettirmez. Bunun yerine, aynı değere atıfta bulunan yeni bir değişken oluşturulur. Burada dikkat edilmesi gereken önemli şey, bunun tamamen ücretsiz bir işlem olmasıdır, çünkü değişkenler yalnızca Kahire soyutlamasıdır ve Kahire'deki _values_ her zaman değişmezdir. Bu, özellikle, kavramsal olarak Copy değerinin Rust sürümünden farklıdır.
zh_cn: 如果类型执行“可复制”特性, 将该类型值传递给函数不会移动值。 相反, 创建了一个新的变量, 指着相同的值。 这里需要注意的是, 这是一个完全自由的操作, 因为变量只是开罗的抽象, 而且开罗的 _ 值 总是不可改变的。 这在概念上与“ 可复制” 特性的 Rust 版本不同, 因为它的值有可能在记忆中复制 。

source: All basic types previously described in ["Data Types"](./ch02-02-data-types.md) implement by default the `Copy` trait.
es: Todos los tipos básicos descritos anteriormente en ["Tipos de datos"](./ch02-02-data-types.md) implementan por defecto el rasgo `Copy`.
fr: Tous les types de base décrits précédemment dans ["Types de données"](./ch02-02-data-types.md) implémentent par défaut le caractère `Copy`.
id: Semua tipe dasar yang digambarkan sebelumnya dalam ["Data Types"]. /ch02-02-data-types.md) mengimplementasikan secara baku ciri-cirinya.
tr: Daha önce ["Data Types"](./ch02-02-data-types.md] bölümünde tanımlanan tüm temel türler varsayılan olarak Copy özelliğini uygular.
zh_cn: 在[“数据类型”](./ch02-02-dd)中描述的所有基本类型都默认地执行“复制”特性。

source: While Arrays and Dictionaries can't be copied, custom types that don't contain either of them can be. You can implement the `Copy` trait on your type by adding the `#[derive(Copy)]` annotation to your type definition. However, Cairo won't allow a type to be annotated with Copy if the type itself or any of its components doesn't implement the Copy trait.
es: Mientras que los arreglos y diccionarios no pueden ser copiados, los tipos personalizados que no contienen ninguno de ellos pueden serlo. Puede implementar el rasgo `Copiar` en su tipo añadiendo la anotación '[derive(Copiar)]` a su definición de tipo. Sin embargo, El Cairo no permitirá que un tipo sea anotado con Copiar si el tipo en sí o cualquiera de sus componentes no implementa el rasgo Copiar.
fr: Vous pouvez implémenter le caractère `Copy` sur votre type en ajoutant l'annotation `#[derive(Copy)]` à votre définition de type. Cependant, le Caire ne permettra pas qu'un type soit annoté avec Copie si le type lui-même ou l'un de ses composants n'implémente pas le caractère Copie.
id: Sementara Arrays dan Dictionary tidak dapat disalin, tipe kustom yang tidak dapat memuat salah satu dari mereka dapat. Anda dapat mengimplementasikan sifat pada tipe Anda dengan menambahkan \u2002). Namun, Kairo tidak akan membiarkan sebuah tipe dinotasi dengan Copy jika tipe itu sendiri atau salah satu komponennya tidak mengimplementasikan sifat Copy.
tr: Diziler ve Sözlükler kopyalanamazken, her ikisini de içermeyen özel türler olabilir. Tür tanımınıza #[türev(Kopya)] notasyonu ekleyerek Kopya özelliğini türünüze uygulayabilirsiniz. Bununla birlikte, Kahire, türün kendisi veya herhangi bir bileşeni Kopyalama özelliğini uygulamazsa, bir türün Kopyalama özelliği ile eklenmesine izin vermez.
zh_cn: 虽然无法复制数组和字典, 但不包含其中任何一个的自定义类型也可以复制。 您可以在类型定义中添加“ [derive( Copy) ” 注释, 从而在类型上执行“ 复制” 特性 。 但是, 如果类型本身或其任何组件不执行复制特性, 开罗不允许对类型使用副本附加注释 。

source: // do something with p
es: // hacer algo con p
fr: // faire quelque chose avec p
tr: // p ile bir şeyler yap
zh_cn: 和P做点什么

source: In this example, we can pass `p1` twice to the foo function because the `Point` type implements the `Copy` trait. This means that when we pass `p1` to `foo`, we are actually passing a copy of `p1`, so `p1` remains valid. In ownership terms, this means that the ownership of `p1` remains with the `main` function. If you remove the `Copy` trait derivation from the `Point` type, you will get a compile-time error when trying to compile the code.
es: En este ejemplo, podemos pasar `p1` dos veces a la función foo porque el tipo `Point` implementa el rasgo `Copy`. Esto significa que cuando pasamos `p1` a `foo`, realmente estamos pasando una copia de `p1`, por lo que `p1` sigue siendo válido. En términos de propiedad, esto significa que la propiedad de `p1` permanece con la función `main`. Si elimina la derivación de `Copy` del tipo `Point`, obtendrá un error de tiempo de compilación al intentar compilar el código.
fr: Dans cet exemple, nous pouvons passer `p1` deux fois à la fonction foo parce que le type `Point` implémente le caractère `Copy`. Cela signifie que lorsque nous passons `p1` à `foo`, nous passons en fait une copie de `p1`, de sorte que `p1` reste valide. En termes de propriété, cela signifie que la propriété de `p1` reste avec la fonction `main`. Si vous supprimez le dérivé `Copy` du type `Point`, vous obtiendrez une erreur de compilation lorsque vous essayez de compiler le code.
id: Dalam contoh ini, kita dapat melewati titik 1 dua kali fungsi foo karena tipe foo menerapkan sifat tersebut.
tr: Bu örnekte, Point tipi Copy özelliğini uyguladığı için p1'yi iki kez foo fonksiyonuna geçebiliriz. Bu, p1'den foo'ya geçtiğimizde, aslında p1'nin bir kopyasını geçirdiğimiz anlamına gelir, bu yüzden p1 derleyicisi geçerli kalır. Sahiplik açısından, bu, p1'in sahipliğini ana işlevi ile kalır.
zh_cn: 在这个例子中,我们可以将`p1'两次传给fo函数,因为`point'类型执行`copy'特性,这意味着当我们将`p1'传递到`foo'时,我们实际上正在传递`p1',因此`p1'仍然有效,从所有权的角度来看,这意味着`p1'的所有权仍属于`main'函数。如果删除`point'类型产生的`compy'特性,那么在试图编纂代码时,你就会发现一个编译错误。

source: _Don't worry about the `Struct` keyword. We will introduce this in [Chapter 5](./ch05-00-using-structs-to-structure-related-data.md)._
es: _No te preocupes por la palabra clave `Struct`. Lo introduciremos en [Capítulo 5](./ch05-00-using-structs-to-structure-related-data.md)._
fr: _Ne vous inquiétez pas du mot-clé `Struct`. Nous le présenterons dans [Chapitre 5](./ch05-00-using-structs-to-structure-related-data.md)._
id: _Jangan khawatir tentang kata kuncinya. Kami akan memperkenalkan ini pada [Chapter 5] Allahlog./ch05-00-structs-to-structural-dikaitkan-data.md)._
tr: _Struct anahtar kelimesi için endişelenmeyin. Bunu [Bölüm 5](./ch05-00-using-structs-to-structure-related-data.md) 'de tanıtacağız._
zh_cn: {\fn黑体\fs22\bord1\shad0\3aHBE\4aH00\fscx67\fscy66\2cHFFFFFF\3cH808080}不要担心`Struct'关键字。我们将在[第5章](./ch05-00-using-structs-structs-to-

source: Destroying Values - Example with FeltDict
es: Destruyendo valores - Ejemplo con FeltDict
fr: Détruire des valeurs - Exemple avec FeltDict
id: Menghancurkan Nilai - Teladan dengan Perasaan
tr: Değerleri Yok Etmek - FeltDict ile Örnek
zh_cn: 销毁值 - 费尔特迪克特示例

source: The other way linear types can be _used_ is by being destroyed. Destruction must ensure that the 'resource' is now correctly released. In Rust, for example, this could be closing the access to a file, or locking a mutex. In Cairo, one type that has such behaviour is `Felt252Dict`. For provability, dicts must be 'squashed' when they are destructed. This would be very easy to forget, so it is enforced by the type system and the compiler.
es: La otra forma en que los tipos lineales pueden ser _usados_ es siendo destruidos. La destrucción debe asegurar que el'recurso' sea liberado correctamente. En Rust, por ejemplo, esto podría ser cerrar el acceso a un archivo, o bloquear un mutex. En El Cairo, un tipo que tiene tal comportamiento es `Felt252Dict`. Para la provabilidad, los dictados deben ser 'destruidos' cuando son destruidos. Esto sería muy fácil de olvidar, por lo que es aplicado por el sistema de tipo y el compilador.
fr: Dans Rust, par exemple, cela pourrait être de fermer l'accès à un fichier, ou de verrouiller un mutex. Au Caire, un type qui a un tel comportement est `Felt252Dict`. Pour la provabilité, les dicts doivent être 'écrasés' lorsqu'ils sont destructés. Ce serait très facile à oublier, donc il est appliqué par le système de type et le compilateur.
id: Jenis linear lainnya dapat _used_ adalah dengan dihancurkan. Pemusnah harus memastikan bahwa'resource' sekarang dibebaskan dengan benar. Di Rust, misalnya, ini dapat menutup akses ke file, atau mengunci sebuah bisus. Di Kairo, satu tipe yang memiliki perilaku tersebut adalah OobetFelt252Dictic. Untuk provability, terdicts harus'squashed' ketika mereka dihancurkan. Ini akan sangat mudah untuk melupakan, sehingga itu dipaksa oleh sistem tipe dan kompiler.
tr: Lineer türlerin diğer bir yolu da yok edilmektir. Yıkım, 'kaynak'ın şimdi doğru bir şekilde serbest bırakılmasını sağlamalıdır. Rust'ta, örneğin, bu bir dosyaya erişimi kapatmak veya bir muteks kilitlemek olabilir. Kahire'de, böyle bir davranışa sahip olan bir tür Felt252Dict'dir. Provability için, dicts'squashed' olmalı ve bu yüzden destromed olduğunda, unutmak çok kolay olacaktır.
zh_cn: 线性类型的另一种方式是销毁 。 销毁必须确保“ 资源” 现在被正确释放。 例如, 在 Rust 中, 这可能是关闭对文件的访问, 或者锁定哑巴 。 在开罗, 一种具有类似行为的是“ Felt252Dict ” 。 对于可证实性, 定案在被销毁时必须被“ 压碎 ” 。 这会很容易忘记, 由类型系统和编译者强制执行 。

source: No-op Destruction: the `Drop` Trait
es: Destrucción no op: el rasgo `Drop`
fr: No-op Destruction: le trait "Drop"
id: Pemusnahan no-op: Trait
tr: No-op Yıkım: Drop Trait
zh_cn: 禁止销毁:`拖累'

source: You may have noticed that the `Point` type in the previous example also implements the `Drop` trait. For example, the following code will not compile, because the struct `A` is not moved or destroyed before it goes out of scope:
es: Es posible que haya notado que el tipo `Punto` en el ejemplo anterior también implementa el rasgo `Drop`. Por ejemplo, el siguiente código no se compilará, porque la estructura `A` no se mueve o destruye antes de que quede fuera de su alcance:
fr: Vous avez peut-être remarqué que le type `Point` dans l'exemple précédent implémente également le caractère `Drop`. Par exemple, le code suivant ne sera pas compilé, car la structure `A` n'est pas déplacée ou détruite avant qu'elle ne soit hors de portée:
id: Anda mungkin telah memperhatikan bahwa jenis etta dalam contoh sebelumnya juga menerapkan sifat-sifat tersebut. sebagai contoh, kode berikut tidak akan dikompilasi, karena struct ÉA tidak dipindahkan atau dihancurkan sebelum keluar dari jangkauan:
tr: Önceki örnekte yer alan Point tipinin Drop özelliğini de uyguladığını fark etmiş olabilirsiniz. Örneğin, aşağıdaki kod derlemez, çünkü A yapısı kapsam dışına çıkmadan önce taşınmaz veya yok edilmez:
zh_cn: 你可能注意到,上一个示例中的“点”类型也执行`滴滴'特性。例如,以下代码不会编译,因为`A` 支架在超出范围之前没有移动或销毁:

source: // error: Variable not dropped.
es: // error: Variable no caída.
fr: // Erreur : Variable non supprimée.
id: //kesalahan: Variabel tidak dijatuhkan.
tr: // hata: Değişken düşmedi.
zh_cn: / 错误: 变量未下降 。

source: However, types that implement the `Drop` trait are automatically destroyed when going out of scope. This destruction does nothing, it is a no-op - simply a hint to the compiler that this type can safely be destroyed once it's no longer useful. We call this "dropping" a value.
es: Sin embargo, los tipos que implementan el rasgo `Drop` se destruyen automáticamente al salir del alcance. Esta destrucción no hace nada, es un no-op - simplemente una pista al compilador de que este tipo puede ser destruido de forma segura una vez que ya no es útil.
fr: Cependant, les types qui implémentent le caractère `Drop` sont automatiquement détruits en sortant de la portée. Cette destruction ne fait rien, c'est une non-op - tout simplement un indice pour le compilateur que ce type peut être détruit en toute sécurité une fois qu'il n'est plus utile.
id: Namun, tipe yang mengimplementasikan sifat ÉDropán secara otomatis dihancurkan ketika keluar dari ruang lingkup. kehancuran ini tidak melakukan apa-apa, itu adalah no-op - hanya petunjuk untuk kompiler bahwa jenis ini dapat dihancurkan dengan aman setelah itu tidak lagi berguna. kami menyebutnya "menjatuhkan" nilai.
tr: Bununla birlikte, Drop özelliğini uygulayan türler, kapsam dışına çıkarken otomatik olarak yok edilir. Bu yıkım hiçbir şey yapmaz, bu bir hayır-op - derleyiciye bu türün artık kullanışlı olmadığında güvenli bir şekilde yok edilebileceğine dair bir ipucu. Buna bir değer "dropping" diyoruz.
zh_cn: 然而,实施`滴滴'特性的类型在超出范围时会自动销毁。这种销毁没有任何作用,只是向编译者暗示,一旦不再有用,这种类型就可安全销毁。我们称它为“删除”值。

source: At the moment, the `Drop` implementation can be derived for all types, allowing them to be dropped when going out of scope, except for dictionaries (`Felt252Dict`) and types containing dictionaries. For example, the following code compiles:
es: Por el momento, la aplicación `Drop` se puede derivar de todos los tipos, lo que permite eliminarlos al salir del ámbito de aplicación, excepto los diccionarios (`Felt252Dict`) y los tipos que contienen diccionarios. Por ejemplo, el siguiente código recopila:
fr: À l'heure actuelle, l'implémentation `Drop` peut être dérivée pour tous les types, ce qui permet de les supprimer en cas de sortie de portée, à l'exception des dictionnaires (`Felt252Dict`) et des types contenant des dictionnaires. Par exemple, le code suivant compile:
id: Pada saat ini, implementasi ÉDropé dapat dibuat untuk semua jenis, memungkinkan mereka untuk dijatuhkan ketika keluar dari lingkup, kecuali untuk kamus (æFelt252Dict) dan tipe yang mengandung kamus. Sebagai contoh, kode berikut mengkompilasi:
tr: Şu anda, sözlükler (Felt252Dict) ve sözlükler içeren türler hariç, Drop uygulaması tüm türler için türetilebilir. Örneğin, aşağıdaki kod derlenir:
zh_cn: 目前, " 减少 " 执行可针对所有类型产生,允许在超出范围时予以删除,但词典(`Felt252Dict')和含有词典的类型除外。

source: // Now there is no error.
es: // Ahora no hay error.
fr: // Il n'y a plus d'erreur.
id: /Sekarang tidak ada kesalahan.
tr: // Şimdi hata yok.
zh_cn: / 现在没有错误 。

source: Destruction with a Side-effect: the `Destruct` Trait
es: Destrucción con efectos secundarios: el rasgo de destrucción
fr: Destruction avec un effet secondaire: le "Destruct"
id: Penghancuran dengan efek-sisi: Trait Destruct
tr: Yan Etki ile Yıkım: Destruct Trait
zh_cn: 具有副作用的销毁:`破坏'轨迹

source: When a value is destroyed, the compiler first tries to call the `drop` method on that type. If it doesn't exist, then the compiler tries to call `destruct` instead. This method is provided by the `Destruct` trait.
es: Cuando un valor es destruido, el compilador primero intenta llamar al método `drop` en ese tipo. Si no existe, entonces el compilador intenta llamar a `destruct` en su lugar. Este método es proporcionado por el rasgo `Destruct`.
fr: Quand une valeur est détruite, le compilateur essaie d'abord d'appeler la méthode `drop` sur ce type. S'il n'existe pas, alors le compilateur essaie d'appeler `destruct` à la place. Cette méthode est fournie par le caractère `Destruct`.
id: Ketika nilai dihancurkan, kompiler pertama kali mencoba untuk memanggil metode ådropé pada jenis itu. Jika tidak ada, maka kompiler mencoba untuk memanggil ·destructé sebagai gantinya. Metode ini disediakan oleh sifat yang didestruksikan.
tr: Bir değer yok edildiğinde, derleyici ilk önce bu türdeki drop yöntemini çağırmaya çalışır. Eğer mevcut değilse, derleyici bunun yerine destruct adını vermeye çalışır. Bu yöntem Destruct özelliği ile sağlanır.
zh_cn: 当一个值被销毁时, 编译者首先尝试在这种类型上调用“ 投放” 方法。 如果它不存在, 那么编译者则试图调用“ 销毁”, 由“ 毁损” 特性提供。

source: As said earlier, dictionaries in Cairo are types that must be "squashed" when destructed, so that the sequence of access can be proven. This is easy for developers to forget, so instead dictionaries implement the `Destruct` trait to ensure that all dictionaries are _squashed_ when going out of scope. As such, the following example will not compile:
es: Como se ha dicho anteriormente, los diccionarios en El Cairo son tipos que deben ser "destruidos" cuando se destruyen, de modo que la secuencia de acceso puede ser probada. Esto es fácil de olvidar para los desarrolladores, por lo que los diccionarios implementan el rasgo `Destruct` para asegurarse de que todos los diccionarios están _squashed_ al salir del alcance. Como tal, el siguiente ejemplo no compilará:
fr: Comme nous l'avons déjà dit, les dictionnaires du Caire sont des types qui doivent être "écrasés" lors de la destruction, de sorte que la séquence d'accès peut être prouvée. Ceci est facile pour les développeurs à oublier, donc les dictionnaires implémentent plutôt le caractère `Destruct` pour s'assurer que tous les dictionnaires sont _écrasés_ lors de la sortie de la portée. Ainsi, l'exemple suivant ne sera pas compilé:
id: Seperti yang dikatakan sebelumnya, kamus di Kairo adalah tipe yang harus "dihancurkan" ketika dihancurkan, sehingga urutan akses dapat dibuktikan.
tr: Daha önce de belirtildiği gibi, Kahire'deki sözlükler, yok edildiğinde "kararlanması" gereken türlerdir, böylece erişim sırası kanıtlanabilir. Bu, geliştiricilerin unutması kolaydır, bunun yerine sözlükler, tüm sözlüklerin kapsam dışına çıkarken _squashed_ olmasını sağlamak için Destruct özelliğini uygular. Bu nedenle, aşağıdaki örnek derlemeyecektir:
zh_cn: 如前所述,开罗的字典在被摧毁时必须是“封隔”的字典,这样可以证明访问的顺序。 这对于开发者来说很容易忘记,因此字典执行“ 封隔” 特性,以确保所有字典在超出范围时都“封隔”。 因此,以下示例不会汇编:

source: If you try to run this code, you will get a compile-time error:
es: Si intenta ejecutar este código, obtendrá un error de tiempo de compilación:
fr: Si vous essayez d'exécuter ce code, vous obtiendrez une erreur de compilation-temps:
id: Jika Anda mencoba menjalankan kode ini, Anda akan mendapatkan galat waktu kompilasi:
tr: Bu kodu çalıştırmaya çalışırsanız, derleme zamanı hatası alırsınız:
zh_cn: 如果您尝试运行此代码, 将会有一个编译时间错误 :
