Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Cairo provides the `StorePacking` trait to enable packing struct fields into fewer storage slots. `StorePacking<T, PackedT>` is a generic trait taking the type you want to pack (`T`) and the destination type (`PackedT`) as parameters. It provides two functions to implement: `pack` and `unpack`.
es: El Cairo proporciona el rasgo `StorePacking` para permitir que los campos de estructura de embalaje en menos ranuras de almacenamiento. `StorePacking<T, PackedT® es un rasgo genérico que toma el tipo que desea empaquetar (`T`) y el tipo de destino (`PackedT`) como parámetros. Proporciona dos funciones para implementar: `pack'y `unpack '.
fr: Le Caire fournit le caractère `StorePacking` pour permettre l'emballage des champs de structure dans moins de fentes de stockage. `StorePacking<T, PackedT>` est un caractère générique prenant le type que vous voulez emballer (`T`) et le type de destination (`PackedT`) comme paramètres. Il fournit deux fonctions à implémenter: `pack` et `unpack`.
id: Kairo menyediakan sifat yang sangat unik untuk mengaktifkan pemompaan medan ke dalam lebih sedikit slot penyimpanan. ▪StorePacking<T, PackedT>): adalah sifat umum yang mengambil tipe yang ingin Anda kemas (æT) dan tipe tujuan (PackedT) sebagai parameter. Ini menyediakan dua fungsi untuk mengimplementasikan:
tr: Kahire, yapı alanlarını daha az depolama yuvasına paketlemeyi etkinleştirmek için StorePacking özelliğini sağlar. StorePackingT, PackedT>, paketlemek istediğiniz türü (T) ve varış türünü (PackedT) parametre olarak alan genel bir özelliktir. Uygulamak için iki işlev sağlar: pack ve unpack.
zh_cn: 开罗提供了`打包'特性,使打包场能够进入较少的储存槽。 “打包<T,包装T是一种通用特性,以你想打包的类型(`T')和目的地类型(`打包T')作为参数,它提供了两个功能,可以执行:`pack'和`unpack'。

source: Here is the implementation of the example of the previous chapter:
es: Aquí está la implementación del ejemplo del capítulo anterior:
fr: Voici l'exemple du chapitre précédent :
id: Berikut ini adalah implementasi dari contoh bab sebelumnya:
tr: İşte bir önceki bölümün örneğinin uygulanması:
zh_cn: 以下是前一章实例的执行情况:

source: //don't forget to import it!
es: //no te olvides de importarlo!
fr: //n'oubliez pas de l'importer!
id: /Jangan lupa mengimpornya!
tr: //ithal etmeyi unutmayın!
zh_cn: 别忘了进口!

source: // This will automatically pack the // struct into a single u128
es: // Esto automáticamente empaquetará la estructura // en un único u128
fr: // Cela va automatiquement emballer la structure // dans un seul u128
id: //Ini secara otomatis akan mengepak//struct menjadi sebuah u128 tunggal
tr: // Bu, // yapısını otomatik olarak tek bir u128'e paketleyecektir.
zh_cn: / 这将自动将 // 支架打包成单 u128

source: // this will automatically unpack the // packed-representation into the Sizes struct
es: // esto desempaquetará automáticamente la representación // empaquetada en la estructura Tamaños
fr: // ceci décompressera automatiquement la représentation // emballée dans la structure Tailles
id: //ini secara otomatis akan membongkar//packed-representation ke dalam struktur Ukuran
tr: // bu otomatik olarak // paketlenmiş-temsilini Boyutlar yapısında açar
zh_cn: / 这将自动将 / / 包装的表示解包到 大小 支架中

source: In this code snippet, you see that:
es: En este fragmento de código, se ve que:
fr: Dans cet extrait de code, vous voyez que :
id: Dalam snippet kode ini, Anda lihat bahwa:
tr: Bu kod snippet'inde şunu görüyorsunuz:
zh_cn: 在这个代码片段,你可以看到:

source: `TWO_POW_8` and `TWO_POW_40` are used to shift left in the `pack` function and shift right in the `unpack`function,
es: `Two_POW_8` y `Two_POW_40` se utilizan para cambiar a la izquierda en la función `pack'y cambiar a la derecha en la función `unpack`,
fr: `TWO_POW_8` et `TWO_POW_40` sont utilisés pour déplacer à gauche dans la fonction `pack` et à droite dans la fonction `unpack`,
id: TWOW_POW_8 dan TWO_POW_40 digunakan untuk bergeser ke kiri dalam fungsi paket dan bergeser tepat di fungsi åunpack,
tr: TWO_POW_8 ve TWO_POW_40, pack fonksiyonunda sola kaymak ve unpack işlevinde sağa kaymak için kullanılır,
zh_cn: " TWO_POW_8 " 和 " TWO_POW_40 " 用于在`包装'函数中左移和在`无包装'功能中右移,

source: `MASK_8` and `MASK_32` are used to isolate a variable in the `unpack` function,
es: `MASK_8` y `MASK_32` se utilizan para aislar una variable en la función `unpack`,
fr: `MASK_8` et `MASK_32` sont utilisés pour isoler une variable dans la fonction `unpack`,
id: Dan digunakan untuk mengisolasi variabel dalam fungsi åunpacké,
tr: MASK_8 ve MASK_32, unpack işlevindeki bir değişkeni izole etmek için kullanılır,
zh_cn: `MASK_8'和`MASK_32'用于分离`unpack'函数中的变量,

source: all the variables from the storage are converted to `u128` to be able to use bitwise operators.
es: todas las variables del almacenamiento se convierten a `u128` para poder utilizar operadores de bitwise.
fr: toutes les variables du stockage sont converties en `u128` pour pouvoir utiliser des opérateurs bitwise.
id: semua variabel dari penyimpanan dikonversi menjadi åu128 (128) untuk dapat menggunakan operator bitwise.
tr: Depolamadaki tüm değişkenler bitwise operatörlerini kullanabilmek için u128'ye dönüştürülür.
zh_cn: 存储中的所有变量都转换为“u128”以便使用比特运算符。

source: This technique can be used for any group of fields that fit within the bit size of the packed storage type. For example, if you have a struct with multiple fields whose bit sizes add up to 256 bits, you can pack them into a single `u256` variable. If the bit sizes add up to 512 bits, you can pack them into a single `u512` variable, and so on. You can define your own structs and logic to pack and unpack them.
es: Esta técnica se puede utilizar para cualquier grupo de campos que se ajusten al tamaño de bits del tipo de almacenamiento empaquetado. Por ejemplo, si tiene una estructura con múltiples campos cuyos tamaños de bits suman 256 bits, puede empaquetarlos en una sola variable `u256`. Si los tamaños de bits suman 512 bits, puede empaquetarlos en una sola variable `u512`, y así sucesivamente. Puede definir sus propias estructuras y lógica para empaquetarlos y desempacarlos.
fr: Cette technique peut être utilisée pour n'importe quel groupe de champs qui correspondent à la taille du bit du type de stockage emballé. Par exemple, si vous avez une structure avec plusieurs champs dont les tailles de bit ajoutent jusqu'à 256 bits, vous pouvez les emballer dans une seule variable `u256`. Si les tailles de bit ajoutent jusqu'à 512 bits, vous pouvez les emballer dans une seule variable `u512`, et ainsi de suite. Vous pouvez définir vos propres structures et logiques pour les emballer et les déballer.
id: Teknik ini dapat digunakan untuk setiap kelompok bidang yang sesuai dengan ukuran bit dari jenis penyimpanan yang dikemas. Sebagai contoh, jika Anda memiliki struktur dengan beberapa bidang yang ukuran bit menambahkan hingga 256 bit, Anda dapat mengemasnya menjadi variabel ·u256. Jika ukuran bit ditambahkan menjadi 512 bit, Anda dapat mengemasnya menjadi variabel tunggal ·u12 TM, dan seterusnya. Anda dapat mendefinisikan struktur dan logika Anda sendiri untuk mengemasnya.
tr: Bu teknik, paketlenmiş depolama türünün bit boyutuna uyan herhangi bir alan grubu için kullanılabilir. Örneğin, bit boyutları 256 bit'e kadar olan birden fazla alana sahip bir yapınız varsa, bunları tek bir u256 değişkenine paketleyebilirsiniz. Bit boyutları 512 bit'e kadar eklenirse, bunları tek bir u512 değişkenine paketleyebilirsiniz, vb. Kendi yapılarınızı tanımlayabilir ve bunları paketleyebilirsiniz.
zh_cn: 此技术可用于任何一组适合已包装存储类型比特大小的字段。 例如, 如果您有一个多字段的支流, 其比特大小加256比特, 您可以把它们包装成一个单一的“ u256” 变量。 如果比特大小加512比特, 您可以把它们包装成一个单一的“ u512” 变量, 等等。 您可以定义自己的支流和逻辑来包装和拆包它们。

source: The rest of the work is done magically by the compiler - if a type implements the `StorePacking` trait, then the compiler will know it can use the `StoreUsingPacking` implementation of the `Store` trait in order to pack before writing and unpack after reading from storage. One important detail, however, is that the type that `StorePacking::pack` spits out also has to implement `Store` for `StoreUsingPacking` to work. Most of the time, we will want to pack into a felt252 or u256 - but if you want to pack into a type of your own, make sure that this one implements the `Store` trait.
es: El resto del trabajo lo realiza mágicamente el compilador: si un tipo implementa el rasgo `StorePacking`, entonces el compilador sabrá que puede utilizar la aplicación `StoreUsingPacking` del rasgo `Store` para que funcione antes de escribir y desempacar después de leer desde el almacenamiento. Sin embargo, un detalle importante es que el tipo `StorePacking::pack` escupe también tiene que implementar `Store` para que funcione `StoreUsingPacking`.
fr: Le reste du travail est fait magiquement par le compilateur - si un type implémente le caractère `StorePacking`, alors le compilateur saura qu'il peut utiliser l'implémentation `StoreUsingPacking` du caractère `Store` afin d'emballer avant d'écrire et de décompresser après la lecture du stockage. Un détail important, cependant, est que le type que `StorePacking::pack` crache aussi doit implémenter `Store` pour `StoreUsingPacking` pour fonctionner. La plupart du temps, nous allons vouloir emballer dans un feutre252 ou u256 - mais si vous voulez emballer dans un type de votre propre, assurez-vous que celui-ci implémente le trait `Store`.
id: Sisanya dilakukan secara ajaib oleh kompiler - jika sebuah tipe menerapkan sifat sebelum menulis dan membongkar setelah membaca dari penyimpanan.
tr: İşin geri kalanı, derleyici tarafından sihirli bir şekilde yapılır - bir tür bu StorePacking özelliğini uygularsa, derleyici, depolamadan okuduktan sonra StoreUsingPacking özelliğini paketlemek ve paketlemek için Store özelliğini kullanabileceğini bilecektir. Bununla birlikte, en önemli ayrıntı, StorePacking:pack tükürüğünün Store'u uygulamak için de sahip olmasını isteyeceğiniz türdendir.
zh_cn: 其余的工作由汇编者神奇地完成 -- -- 如果一种类型执行`托盘打包'特性,那么汇编者就会知道它可以使用`托盘打包'执行`托盘打包'特性,以便在书写前打包,在从存储处阅读后打包。然而,一个重要的细节是,`托盘打包::包装`吐口也须执行`托盘 ',以便`托盘打包'工作。在多数情况下,我们想打包到感知252或U256中,但是,如果你想打包到自己的一种类型,请确保这一类型执行`托盘'特性。

source: Components: Lego-Like Building Blocks for Smart Contracts
es: Componentes: Lego-como bloques de construcción para contratos inteligentes
fr: Composants: Blocs de construction Lego-like pour les contrats intelligents
id: Komponen: Lego-Like Building Blocks for Smart Contracts
tr: Bileşenleri: Akıllı Sözleşmeler için Lego-Like Yapı Blokları
zh_cn: 构件: 智能合同的乐高型类似建筑块

source: Developing contracts sharing a common logic and storage can be painful and bug-prone, as this logic can hardly be reused and needs to be reimplemented in each contract. But what if there was a way to snap in just the extra functionality you need inside your contract, separating the core logic of your contract from the rest?
es: El desarrollo de contratos que comparten una lógica y almacenamiento comunes puede ser doloroso y propenso a errores, ya que esta lógica difícilmente puede ser reutilizada y necesita ser aplicada de nuevo en cada contrato. Pero, ¿qué pasa si hubiera una manera de encajar en la funcionalidad adicional que necesita dentro de su contrato, separando la lógica central de su contrato del resto?
fr: Développer des contrats partageant une logique et un stockage communs peut être douloureux et sujet aux bugs, car cette logique peut difficilement être réutilisée et doit être réappliquée dans chaque contrat. Mais qu'en est-il s'il y avait un moyen de saisir simplement la fonctionnalité supplémentaire dont vous avez besoin à l'intérieur de votre contrat, en séparant la logique de base de votre contrat du reste?
id: Mengembangkan kontrak berbagi logika umum dan penyimpanan dapat menyakitkan dan bug-prone, karena logika ini tidak dapat digunakan kembali dan perlu diimplementasikan kembali dalam setiap kontrak. tapi bagaimana jika ada cara untuk snap hanya fungsionalitas ekstra yang Anda butuhkan dalam kontrak Anda, memisahkan logika inti dari kontrak Anda dari sisa?
tr: Ortak bir mantığı ve depolamayı paylaşan sözleşmeler geliştirmek acı verici ve hataya eğilimli olabilir, çünkü bu mantık neredeyse tekrar kullanılamaz ve her sözleşmede yeniden uygulanması gerekir. Ancak, sözleşmenizin temel mantığını diğerlerinden ayırarak, sözleşmenizin içinde ihtiyacınız olan ekstra işlevselliği yakalamanın bir yolu olsaydı ne olurdu?
zh_cn: 制定共享共同逻辑和储存的合同可能会令人痛苦和容易产生错误,因为这一逻辑很难被重新利用,并且需要在每个合同中重新执行。 但如果有办法在合同中打破你所需要的额外功能,将你合同的核心逻辑与其他功能区分开来呢?

source: Components provide exactly that. They are modular add-ons encapsulating reusable logic, storage, and events that can be incorporated into multiple contracts. They can be used to extend a contract's functionality, without having to reimplement the same logic over and over again.
es: Los componentes proporcionan exactamente eso. Son complementos modulares que encapsulan la lógica reutilizable, el almacenamiento y los eventos que se pueden incorporar en múltiples contratos. Se pueden utilizar para ampliar la funcionalidad de un contrato, sin tener que volver a aplicar la misma lógica una y otra vez.
fr: Les composants fournissent exactement cela. Il s'agit d'add-ons modulaires encapsulant la logique réutilisable, le stockage et les événements qui peuvent être incorporés dans plusieurs contrats. Ils peuvent être utilisés pour étendre la fonctionnalité d'un contrat, sans avoir à refaire la même logique encore et encore.
id: Komponen menyediakan persis seperti itu. mereka adalah tambahan modular-on encapsulating logika, penyimpanan, dan peristiwa yang dapat dimasukkan ke dalam beberapa kontrak. mereka dapat digunakan untuk memperpanjang fungsi kontrak, tanpa harus mengimplementasikan logika yang sama lagi dan lagi.
tr: Bileşenler tam olarak bunu sağlar. Birden fazla sözleşmeye dahil edilebilecek yeniden kullanılabilir mantığı, depolamayı ve olayları kapsülleyen modüler eklentilerdir. Aynı mantığı tekrar tekrar uygulamak zorunda kalmadan bir sözleşmenin işlevselliğini genişletmek için kullanılabilirler.
zh_cn: 这些组件正是如此。 它们都是模块化的附加组件,包含可重复使用的逻辑、储存和可以纳入多个合同的事件。 它们可以用来延长合同的功能,而不必一次又一次地执行相同的逻辑。

source: Think of components as Lego blocks. They allow you to enrich your contracts by plugging in a module that you or someone else wrote. This module can be a simple one, like an ownership component, or more complex like a full-fledged ERC20 token.
es: Piense en los componentes como bloques de Lego. Le permiten enriquecer sus contratos mediante la conexión de un módulo que usted o alguien más escribió. Este módulo puede ser simple, como un componente de propiedad, o más complejo como un token ERC20 completo.
fr: Pensez aux composants comme blocs Lego. Ils vous permettent d'enrichir vos contrats en branchant un module que vous ou quelqu'un d'autre avez écrit. Ce module peut être simple, comme un composant de propriété, ou plus complexe comme un jeton ERC20 à part entière.
id: Pikirkan komponen sebagai blok Lego. mereka memungkinkan Anda untuk memperkaya kontrak Anda dengan memasang modul yang Anda atau orang lain tulis. modul ini dapat menjadi sederhana, seperti komponen kepemilikan, atau lebih kompleks seperti ERC20 token penuh.
tr: Bileşenleri Lego blokları olarak düşünün. Sizin veya bir başkasının yazdığı bir modülü takarak sözleşmelerinizi zenginleştirmenizi sağlarlar. Bu modül, bir sahiplik bileşeni gibi basit veya tam teşekküllü bir ERC20 jetonu gibi daha karmaşık olabilir.
zh_cn: 将组件想象成 Lego 区块 。 它们允许您通过插入您或其他人所写的模块来丰富您的合同 。 这个模块可以是一个简单的模块, 像所有制组件一样, 或者像完整的 ERC20 符号一样复杂 。

source: A component is a separate module that can contain storage, events, and functions. Unlike a contract, a component cannot be declared or deployed. Its logic will eventually be part of the contract’s bytecode it has been embedded in.
es: Un componente es un módulo separado que puede contener almacenamiento, eventos y funciones. A diferencia de un contrato, un componente no puede ser declarado o desplegado. Su lógica será eventualmente parte del bytecode del contrato en el que ha sido incrustado.
fr: Un composant est un module séparé qui peut contenir du stockage, des événements et des fonctions. Contrairement à un contrat, un composant ne peut pas être déclaré ou déployé. Sa logique fera éventuellement partie de l'octécode du contrat dans lequel il a été intégré.
id: Komponen adalah modul terpisah yang dapat memuat penyimpanan, acara, dan fungsi. tidak seperti sebuah kontrak, sebuah komponen tidak dapat dideklarasikan atau digunakan. logikanya pada akhirnya akan menjadi bagian dari kontrak bytecode telah tertanam di dalamnya.
tr: Bir bileşen, depolama, olay ve işlevleri içerebilen ayrı bir modüldür. Bir sözleşmenin aksine, bir bileşen ilan edilemez veya dağıtılamaz. Mantığı, sonunda, gömülü olduğu sözleşmenin bytecode'unun bir parçası olacaktır.
zh_cn: 一个组件是一个可以包含存储、事件和功能的单独模块。 与合同不同,一个组件无法申报或部署。 其逻辑最终将成为合同字元编码的一部分。

source: What's in a Component?
es: ¿Qué hay en un componente?
fr: Qu'y a-t-il dans un composant?
id: Apa yang ada di Komponen?
tr: Bileşende ne var?
zh_cn: 组件里有什么?

source: A component is very similar to a contract. It can contain:
es: Un componente es muy similar a un contrato. Puede contener:
fr: Un composant est très similaire à un contrat. Il peut contenir:
id: Komponen sangat mirip dengan kontrak.
tr: Bir bileşen bir sözleşmeye çok benzer. Aşağıdakileri içerebilir:
zh_cn: 构成部分与合同非常相似,可包含:

source: Storage variables
es: Variables de almacenamiento
fr: Variables de stockage
id: Variabel penyimpanan
tr: Depolama değişkenleri
zh_cn: 储存变变数

source: Events
es: Acontecimientos
fr: Événements
id: Kejadian
tr: Etkinlikler
zh_cn: 事件事件事件事件

source: External and internal functions
es: Funciones externas e internas
fr: Fonctions externes et internes
id: Fungsi eksternal dan internal
tr: Dış ve iç fonksiyonlar
zh_cn: 外部和内部职能

source: Unlike a contract, a component cannot be deployed on its own. The component's code becomes part of the contract it's embedded to.
es: A diferencia de un contrato, un componente no se puede implementar por sí solo. El código del componente se convierte en parte del contrato al que está incrustado.
fr: Contrairement à un contrat, un composant ne peut pas être déployé seul. Le code du composant devient partie intégrante du contrat auquel il est intégré.
id: Tidak seperti kontrak, komponen tidak dapat dikerahkan sendiri. kode komponen menjadi bagian dari kontrak itu tertanam ke.
tr: Bir sözleşmeden farklı olarak, bir bileşen kendi başına konuşlandırılamaz. Bileşenin kodu, gömülü olduğu sözleşmenin bir parçası haline gelir.
zh_cn: 与合同不同,部件不能自行部署。 部件的代码成为其嵌入的合同的一部分 。

source: Creating Components
es: Creación de componentes
fr: Création de composants
id: Membuat Komponen
tr: Bileşenlerin Oluşturulması
zh_cn: 创建部件

source: To create a component, first define it in its own module decorated with a `#[starknet::component]` attribute. Within this module, you can declare a ` Storage` struct and `Event` enum, as usually done in [contracts](./ch13-02-anatomy-of-a-simple-contract.md).
es: Para crear un componente, primero definalo en su propio módulo decorado con un atributo "[starknet::component]`. Dentro de este módulo, puede declarar un " Storage " struct y "Event" enum, como se suele hacer en [contracts](./ch13-02-anatomía-of-a-simple-contract.md).
fr: Pour créer un composant, définissez-le d'abord dans son propre module décoré d'un attribut `#[starknet::component]`. Dans ce module, vous pouvez déclarer une structure ` Storage` et `Event` enum, comme habituellement fait dans [contracts](./ch13-02-anatomy-of-a-simple-contract.md).
id: Untuk membuat suatu komponen, pertama definisikan dalam modulnya sendiri dihiasi dengan sebuah enum;[starknet::komponen] atribut. Dalam modul ini, Anda dapat menyatakan sebuah struktur dan ▪Eventá, seperti biasanya dilakukan dalam [kontracts] 1961./ch13-02-anomi-a-simple-contract.m).
tr: Bir bileşen oluşturmak için, önce bir #[starknet::component] özniteliği ile dekore edilmiş kendi modülünde tanımlayın. Bu modül içinde, genellikle [contracts](./ch13-02-anatomy-of-a-simple-contract.md) 'de yapıldığı gibi bir Storage struct ve Event enum ilan edebilirsiniz.
zh_cn: 要创建组件,请先在自己配有“[星网:构件]”属性的模块中定义该组件,在此模块中,您可以按[合同](./ch13-02-剖析-简单合同.md)中通常的做法,申报“存储”构件和“静脉” 元件。

source: The next step is to define the component interface, containing the signatures of the functions that will allow external access to the component's logic. You can define the interface of the component by declaring a trait with the `#[starknet::interface]` attribute, just as you would with contracts. This interface will be used to enable external access to the component's functions using the [dispatcher](./ch15-02-contract-dispatchers-library-dispatchers-and-system-calls.md) pattern.
es: El siguiente paso es definir la interfaz del componente, que contiene las firmas de las funciones que permitirán el acceso externo a la lógica del componente. Puede definir la interfaz del componente declarando un rasgo con el atributo •[starknet:::interface]`, tal como lo haría con los contratos. Esta interfaz se utilizará para habilitar el acceso externo a las funciones del componente utilizando el patrón [dispatcher](./ch15-02-contract-dispatchers-library-dispatchers-and-system-calls.md).
fr: L'étape suivante consiste à définir l'interface du composant, contenant les signatures des fonctions qui permettront l'accès externe à la logique du composant. Vous pouvez définir l'interface du composant en déclarant un trait avec l'attribut `#[starknet::interface]`, tout comme vous le feriez avec les contrats. Cette interface sera utilisée pour permettre l'accès externe aux fonctions du composant en utilisant le modèle [dispatcher](./ch15-02-contract-dispatchers-library-dispatchers-and-system-calls.md).
id: Langkah berikutnya adalah mendefinisikan antarmuka komponen, berisi ciri-ciri fungsi yang akan memungkinkan akses eksternal ke logika komponen. Anda dapat menentukan antarmuka komponen dengan menyatakan suatu sifat dengan atribut ▪[starknet::interface], seperti yang Anda inginkan. Antarmuka ini akan digunakan untuk mengaktifkan akses eksternal ke fungsi komponen menggunakan [distcher] sebelum atau atau distcher-contract-distchers-dispacher-dischers-and-stem-calls.m) pola.
tr: Bir sonraki adım, bileşenin mantığına harici erişim sağlayacak işlevlerin imzalarını içeren bileşen arayüzünü tanımlamaktır. #[starknet:interface] özniteliği ile bir özellik bildirerek bileşenin arayüzünü tanımlayabilirsiniz, tıpkı sözleşmelerde olduğu gibi. Bu arayüz, bileşenin işlevlerine [dispatcher](./ch15-02-contract-dispat-chers.
zh_cn: 下一步是定义组件界面, 包含允许外部访问组件逻辑的功能的签名。 您可以与合同一样, 声明与 {[ Starknet:: interface] 属性的特性, 以此定义组件的界面。 此界面将用于使用 [ dispatcher] (./ch15-02- contract- dispachers-library- dispatterchers- and- system-calls. md) 模式, 使外部能够访问组件的功能 。

source: The actual implementation of the component's external logic is done in an `impl` block marked as `#[embeddable_as(name)]`. Usually, this `impl` block will be an implementation of the trait defining the interface of the component.
es: La implementación real de la lógica externa del componente se realiza en un bloque `impl` marcado como •[embeddable_as(name)]`. Usualmente, este bloque `impl` será una implementación del rasgo que define la interfaz del componente.
fr: La mise en œuvre effective de la logique externe du composant se fait dans un bloc `impl` marqué `#[embeddable_as(name)]`. Habituellement, ce bloc `impl` sera une implémentation du caractère définissant l'interface du composant.
id: In implementasi aktual dari logika eksternal komponen dilakukan dalam sebuah blok ·implocla yang ditandai sebagai "#[terbenturan_as Allahname)]. Biasanya, blok Éimplo ini akan menjadi implementasi dari sifat yang mendefinisikan antarmuka komponen.
tr: Bileşenin dış mantığının gerçek uygulaması, #[embeddable_as(name)]] olarak işaretlenmiş bir impl bloğunda yapılır. Genellikle, bu impl bloğu, bileşenin arayüzünü tanımlayan özelliğin bir uygulaması olacaktır.
zh_cn: 组成部分的外部逻辑的实际实施是在标记为`{{[embedable_as_as(name)]>`的`impl' 区块中完成的。通常,`impl'区块将是执行界定组成部分接口的特性。
