Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Other code that uses `Guess` depends on the guarantee that `Guess` instances will contain only values between `1` and `100`. We can write a test that ensures that attempting to create a `Guess` instance with a value outside that range panics.
es: Otro código que utiliza `Guess` depende de la garantía de que las instancias `Guess` contendrán sólo valores entre `1'y `100 '. Podemos escribir una prueba que garantice que el intento de crear una instancia `Guess` con un valor fuera de ese rango entra en pánico.
fr: Autre code qui utilise `Guess` dépend de la garantie que les instances `Guess` ne contiennent que des valeurs entre `1` et `100`. Nous pouvons écrire un test qui assure que tenter de créer une instance `Guess` avec une valeur en dehors de cette plage panique.
id: Kita dapat menulis tes yang menjamin bahwa upaya untuk membuat sebuah kasus hanya akan mengandung nilai-nilai antara 100 dan 100 orang.
tr: Guess kullanan diğer kodlar, Guess örneklerinin yalnızca 1 ve 100 arasındaki değerleri içereceği garantisine bağlıdır. Guess örneğini, bu aralığın dışında bir değerle oluşturmaya çalışmanın paniklemesini sağlayan bir test yazabiliriz.
zh_cn: 使用`建议'的其他代码取决于保证`建议'实例只包含`1'和`100'之间的数值,我们可以写一个测试,确保试图创建`建议'实例,其数值超出恐慌范围。

source: We do this by adding the attribute `should_panic` to our test function. The test passes if the code inside the function panics; the test fails if the code inside the function doesn’t panic.
es: Lo hacemos añadiendo el atributo ` should_panic` a nuestra función de prueba. La prueba pasa si el código dentro de la función entra en pánico; la prueba falla si el código dentro de la función no entra en pánico.
fr: Nous le faisons en ajoutant l'attribut `whould_panic` à notre fonction de test. Le test passe si le code à l'intérieur de la fonction panique; le test échoue si le code à l'intérieur de la fonction ne panique pas.
id: Kami melakukan ini dengan menambahkan atribut yang seharusnya_panik untuk fungsi tes kami. tes ini akan lulus jika kode dalam panik fungsi; tes gagal jika kode di dalam fungsi tidak panik.
tr: Bunu test fonksiyonumuza should_panic özniteliğini ekleyerek yapıyoruz. Fonksiyonun içindeki kod paniklediğinde test geçer; fonksiyon içindeki kod paniklemezse test başarısız olur.
zh_cn: 我们这样做的方法是将属性`应该'泛泛地'添加到我们的测试功能中。如果函数恐慌中的代码通过测试;如果函数中的代码不惊慌,测试就会失败。

source: We place the `#[should_panic]` attribute after the `#[test]` attribute and before the test function it applies to. Let’s look at the result to see that this test passes:
es: Colocamos el atributo â € ¢[debería_panic]` después del atributo â € [prueba]` y antes de la función de prueba a la que se aplica. Echemos un vistazo al resultado para ver que esta prueba pasa:
fr: Nous plaçons l'attribut `#[whould_panic]` après l'attribut `#[test]` et avant la fonction de test à laquelle il s'applique.
id: Kami menempatkan atribut ı should_panic] setelah atribut (stest) dan sebelum fungsi tes itu berlaku untuk. Mari kita lihat hasilnya untuk melihat apakah tes ini lulus:
tr: #[should_panic] özniteliğini #[test] özniteliğinden sonra ve geçerli olduğu test fonksiyonundan önce yerleştiriyoruz. Bu testin geçtiğini görmek için sonuca bakalım:
zh_cn: 我们把“{{[应_panic]’ ” 属性放在“{[测试]’ 属性之后,放在其应用的测试函数之前。让我们看看结果,看看这个测试是否通过了:

source: Looks good! Now let’s introduce a bug in our code by removing the condition that the `new` function will panic if the value is greater than `100`:
es: ¡Se ve bien! Ahora vamos a introducir un error en nuestro código eliminando la condición de que la `nueva` función entrará en pánico si el valor es mayor que `100`:
fr: Maintenant, laissez-nous introduire un bug dans notre code en supprimant la condition que la fonction `new` paniquera si la valeur est supérieure à `100`:
id: Sekarang mari kita perkenalkan bug dalam kode kita dengan menghapus kondisi bahwa fungsi baru akan panik jika nilainya lebih besar dari 100 °:
tr: İyi görünüyor! Şimdi, değeri 100'den büyükse new işlevinin panikleyeceği koşulu kaldırarak kodumuzda bir hata tanıtalım:
zh_cn: 现在让我们在代码中引入一个错误, 取消如果值超过“ 100”, “ 新” 功能会恐慌的条件 :

source: When we run the test, it will fail:
es: Cuando hagamos la prueba, fallará:
fr: Quand nous passerons le test, il échouera :
id: Ketika kita menjalankan tes, itu akan gagal.
tr: Testi çalıştırdığımızda, başarısız olacak:
zh_cn: 当我们进行测试时,它就会失败:

source: We don’t get a very helpful message in this case, but when we look at the test function, we see that it’s annotated with `#[should_panic]` attribute. The failure we got means that the code in the test function did not cause a panic.
es: No recibimos un mensaje muy útil en este caso, pero cuando miramos a la función de prueba, vemos que está anotado con el atributo •[ should_panic]`. El fracaso que tenemos significa que el código en la función de prueba no causó pánico.
fr: Nous n'obtenons pas un message très utile dans ce cas, mais quand nous regardons la fonction de test, nous voyons qu'il est annoté avec `#[whould_panic]` attribut. L'échec que nous avons obtenu signifie que le code dans la fonction de test n'a pas causé de panique.
id: Kita tidak mendapatkan pesan yang sangat berguna dalam kasus ini, tetapi ketika kita melihat fungsi tes, kita melihat bahwa hal itu menunjukkan dengan atribut [seharusnya_panik]. Kegagalan yang kita dapatkan berarti bahwa kode dalam fungsi tes tidak menyebabkan kepanikan.
tr: Bu durumda çok yardımcı bir mesaj almıyoruz, ancak test fonksiyonuna baktığımızda, #[should_panic] özniteliği ile not edildiğini görüyoruz. Elde ettiğimiz hata, test fonksiyonundaki kodun panik yaratmadığı anlamına gelir.
zh_cn: 但当我们看测试功能时,我们看到它带有`[应该_panic]'属性的附加说明。 我们的失败意味着测试功能中的代码没有引起恐慌。

source: Tests that use `should_panic` can be imprecise. A `should_panic` test would pass even if the test panics for a different reason from the one we were expecting. To make `should_panic` tests more precise, we can add an optional `expected` parameter to the `#[should_panic]` attribute. The test harness will make sure that the failure message contains the provided text. For example, consider the modified code for `GuessImpl` in Listing 10-8 where the `new` function panics with different messages depending on whether the value is too small or too large:
es: Las pruebas que utilizan ` should_panic` pueden ser imprecisas. Una prueba ` should_panic` pasaría incluso si el pánico de la prueba se produce por una razón diferente de la que esperábamos. Para hacer más precisas las pruebas ` should_panic`, podemos añadir un parámetro opcional `esperado` al atributo `[ should_panic]`. El arnés de la prueba se asegurará de que el mensaje de fallo contenga el texto proporcionado. Por ejemplo, considere el código modificado para `GuessImpl` en la lista 10-8 donde la función `nueva` entra en pánico con mensajes diferentes dependiendo de si el valor es demasiado pequeño o demasiado grande:
fr: Pour rendre les tests `should_panic` plus précis, nous pouvons ajouter un paramètre optionnel `attendu` à l`attribut `#[should_panic]`. Le harnais de test s`assurera que le message de défaillance contient le texte fourni. Par exemple, considérez le code modifié pour `GuessImpl` dans l`Listing 10-8 où la fonction `new` panique avec différents messages selon que la valeur est trop petite ou trop grande:
id: Uji coba yang menggunakan seharusnya_panik dapat kurang tepat. Sebuah uji coba yang seharusnya dapat melewati bahkan jika panik tes untuk alasan yang berbeda dari yang kita harapkan. Untuk membuat tes yang seharusnya lebih tepat, kita dapat menambahkan sebuah parameter opsional yang dieksplorasikan ke atribut optional ke \# [seharusnya_panic]. Harnes tes akan memastikan bahwa kegagalan berisi teks yang disediakan. Sebagai contoh, pertimbangkan kode yang dimodifikasi untuk guesslpl dalam Daftar 10-8 fungsi baru dengan pesan yang berbeda apakah terlalu besar atau terlalu besar:
tr: should_panic kullanan testler kesin değildir. Test, beklediğimizden farklı bir nedenden dolayı paniklese bile bir should_panic testi geçer. should_panic testlerini daha kesin hale getirmek için, #[should_panic] özniteliğine isteğe bağlı bir expected parametresi ekleyebiliriz. Test koşum takımı, hata mesajının verilen metni içerdiğinden emin olacaktır.
zh_cn: 使用`应该_panic' 的测试可以是不精确的。即使测试恐慌的原因不同于我们预期的原因,`应该_panic' 的测试也会通过。为了使`应该_panic'的测试更加精确,我们可以在 {[应该_panic] 属性中添加一个可选的`预期的'参数。测试工具将确保失败信息包含所提供的文本。例如,在列出 10-8 的列表中,“新”功能以不同信息产生恐慌,视值是否太小或太大而定。

source: "Guess must be >= 1"
es: "Adivinar debe ser > 1"
fr: "La guesse doit être >= 1"
id: "Tebak harus >= 1"
tr: "Guess should be>=1" (İngilizce).
zh_cn: 猜想必是"1"

source: "Guess must be <= 100"
es: "Adivinar debe ser < = 100"
fr: "La guesse doit être <= 100"
id: "Tebak harus <= 100"
tr: "Guess olmalı = 100"
zh_cn: 猜想必是100

source: <span class="caption">Listing 10-8: `new` implementation that panics with different error messages</span>
es: <span class="caption">Lista 10-8: `nueva` implementación que entra en pánico con diferentes mensajes de error</span>
fr: <span class="caption">Liste 10-8: `new` implémentation qui panique avec différents messages d'erreur</span>
id: <span class="caption">Listing 10-8: implementasi baru yang panik dengan pesan kesalahan yang berbeda</span>
tr: span class="caption">Listing 10-8: new uygulaması farklı hata mesajları ile panik yapar/span>
zh_cn: <span class=" caption" > listing 10-8:`新的'执行,以不同的错误信息产生恐慌 </span>

source: The test will pass because the value we put in the `should_panic` attribute’s `expected` parameter is the string that the `Guess::new` method panics with. We need to specify the entire panic message that we expect.
es: La prueba pasará porque el valor que ponemos en el parámetro `esperado` del atributo `debería_panic` es la cadena con la que entra en pánico el método `Adivina::new`. Necesitamos especificar todo el mensaje de pánico que esperamos.
fr: Le test passera parce que la valeur que nous mettons dans l`attribut `whould_panic`s `attendue` est la chaîne avec laquelle la méthode `Guess::new` panique. Nous devons spécifier l`intégralité du message de panique auquel nous nous attendons.
id: Tes ini akan lulus karena nilai yang kami masukkan ke dalam atribut oposid_panic ·exspected parameter adalah string yang kita harapkan::: metode baru panik dengan.
tr: Test geçecek çünkü should_panic özniteliğinin expected parametresine koyduğumuz değer, Guess::new yönteminin paniklediği dizgedir. Beklediğimiz tüm panik mesajını belirtmemiz gerekiyor.
zh_cn: 测试将会通过, 因为我们在`应该' 泛域属性的`预期'参数中输入的值是`建议:新` 方法恐慌的字符串。 我们需要具体说明我们期待的全部恐慌信息 。

source: To see what happens when a `should_panic` test with an expected message fails, let’s again introduce a bug into our code by swapping the bodies of the `if value < 1` and the `else if value > 100` blocks:
es: Para ver qué sucede cuando falla una prueba ` should_panic` con un mensaje esperado, introduzcamos de nuevo un error en nuestro código intercambiando los cuerpos del `if value < 1` y los bloques `else if > 100`:
fr: Pour voir ce qui se passe quand un test `bould_panic` avec un message attendu échoue, laissez-nous introduire un bug dans notre code en échangeant les corps de la valeur `if < 1` et de la valeur `else si > 100` blocs:
id: Untuk melihat apa yang terjadi ketika sebuah tes seharusnya_panik dengan pesan yang diharapkan gagal, biarkan lagi memperkenalkan bug ke dalam kode kami dengan menukar tubuh dari nilai < 1) dan nilai > 100 blok:
tr: Beklenen bir mesajla should_panic testi başarısız olduğunda ne olduğunu görmek için, if değeri 1 ve else değeri> 100 bloklarının gövdelerini değiştirerek kodumuza bir hata daha tanıtalım:
zh_cn: 为了看到在`应该_panic' 测试与预期电文失败时会发生什么,让我们再次将`如果值 < 1'和`else 如果值 > 100'区块的体体互换,从而将一个错误引入我们的代码:

source: This time when we run the `should_panic` test, it will fail:
es: Esta vez, cuando ejecutemos la prueba ` should_panic`, fallará:
fr: Cette fois, lorsque nous exécuterons le test `should_panic`, il échouera :
id: Kali ini ketika kita menjalankan tes seharusnya_panik, itu akan gagal:
tr: Bu kez should_panic testini çalıştırdığımızda, başarısız olacaktır:
zh_cn: 当我们这次进行`应该`泛美'测试时,它将失败:

source: ```shell $ scarb cairo-test testing guess ... running 1 test test guess::tests::greater_than_100 ... fail (gas usage est.: 26690) failures: guess::tests::greater_than_100 - Panicked with "Guess must be >= 1". Error: test result: FAILED. 0 passed; 1 failed; 0 ignored ```
es: El resultado de la prueba: FAILED. 0 pasó; 1 falló; 0 ignoró.
fr: ```shell $ écharpe cairo-test test test devine... en cours 1 test devine::tests::great_than_100... échec (utilisation du gaz est.: 26690) échecs: devine::tests::great_than_100 - Panicked avec "Guess doit être >= 1". Erreur: résultat du test: FAILED. 0 passé; 1 échoué; 0 ignoré ```
id: ▪shell $ scarb cairo-test tes menebak... berjalan 1 tes menebak:::: greater_than_100... gagal (gunakan gas est.: 26690) kegagalan: dugaan:::::: besar_than_100 -panik dengan "Guess harus >= 1". Error: hasil tes: gagal; 0; 0 diabaikan; 0 diabaikan
tr: shell $ scarb cairo-test test tahmin... çalışan 1 test tahmin::tests::greater_than_100... başarısız (gaz kullanımı est.: 26690) başarısızlıklar: tahmin:::tests:::greater_than_100 - Panicked with "Guess should be>= 1". Hata: test sonucu: FAILED. 0 geçti; 1 başarısız oldu; 0 görmezden gelindi
zh_cn: jell $ warb cairo- test test guess... 运行一次测试猜测 :: tests:: greater_than_100... 失败(气体使用率最高: 26690) 失败 : guess::: tests::: greater_than_ 100 - 被“ Guess must be # # 1” 包围 错误: 测试结果 : FAILED. 0 passed; 1 失败; 0 忽略 {}

source: The failure message indicates that this test did indeed panic as we expected, but the panic message did not include the expected string. The panic message that we did get in this case was `Guess must be >= 1`. Now we can start figuring out where our bug is!
es: El mensaje de fallo indica que esta prueba realmente entró en pánico como esperábamos, pero el mensaje de pánico no incluyó la cadena esperada. El mensaje de pánico que obtuvimos en este caso fue `Adivina debe ser > 1`. Ahora podemos empezar a averiguar dónde está nuestro error!
fr: Le message d'échec indique que ce test a effectivement paniqué comme prévu, mais le message de panique n'a pas inclus la chaîne attendue. Le message de panique que nous avons obtenu dans ce cas était `Guess doit être >= 1`. Maintenant, nous pouvons commencer à déterminer où est notre bug!
id: Pesan kegagalan menunjukkan bahwa tes ini memang panik seperti yang kita harapkan, tetapi pesan panik tidak termasuk string yang diharapkan. Pesan panik yang kita dapatkan dalam kasus ini adalah ▪Guess harus >= 1ltu sekarang kita bisa mulai mencari tahu di mana bug kita berada!
tr: Başarısızlık mesajı, bu testin gerçekten de beklediğimiz gibi panik yaptığını, ancak panik mesajının beklenen dizeyi içermediğini gösterir. Bu durumda aldığımız panik mesajı Guess should be>=1 idi. Şimdi hatamızın nerede olduğunu anlamaya başlayabiliriz!
zh_cn: 失败信息显示,这次测试确实和我们预期的一样惊慌,但恐慌信息没有包括预期的字符串。我们在这个案例中得到的惊慌信息是`Guess必须是 #% 1'。 现在我们可以开始弄清楚我们的错误在哪里了!

source: Running Single Tests
es: Ejecución de pruebas individuales
fr: Essais uniques
id: Menjalankan Tes Tunggal
tr: Tekli Testleri Çalıştırmak
zh_cn: 正在运行的单次测试

source: Sometimes, running a full test suite can take a long time. If you’re working on code in a particular area, you might want to run only the tests pertaining to that code. You can choose which tests to run by passing `scarb cairo-test` an option `-f` (for "filter"), followed by the name of the test you want to run as an argument.
es: A veces, ejecutar una suite de pruebas completa puede tomar mucho tiempo. Si está trabajando en código en un área en particular, es posible que desee ejecutar sólo las pruebas correspondientes a ese código. Puede elegir qué pruebas ejecutar pasando `scarb cairo-test` una opción `-f` (para "filtro"), seguido del nombre de la prueba que desea ejecutar como argumento.
fr: Parfois, l'exécution d'une suite complète de tests peut prendre beaucoup de temps. Si vous travaillez sur un code dans une zone donnée, vous pouvez ne lancer que les tests relatifs à ce code. Vous pouvez choisir les tests à exécuter en passant `scarb cairo-test` une option `-f` (pour "filtre"), suivie du nom du test que vous voulez exécuter comme argument.
id: Kadang-kadang, menjalankan tes suite secara penuh dapat memakan waktu lama. jika anda mengerjakan kode dalam area tertentu, anda mungkin hanya ingin menjalankan tes yang berkaitan dengan kode tersebut. anda dapat memilih tes mana yang dapat dijalankan dengan melewati ▪scarb cairo-test. sebuah pilihan ▪-f ▪ (untuk "filter"), diikuti dengan nama tes yang ingin anda jalankan sebagai argumen.
tr: Bazen, tam bir test paketini çalıştırmak uzun zaman alabilir. Belirli bir alanda kod üzerinde çalışıyorsanız, yalnızca bu kodla ilgili testleri çalıştırmak isteyebilirsiniz. scarb cairo-test bir seçeneği -f (filtre için) geçerek hangi testlerin yapılacağını seçebilirsiniz, ardından bir argüman olarak çalıştırmak istediğiniz testin adı.
zh_cn: 有时,运行一个完整的测试套件需要很长时间。如果您在特定区域进行代码测试,您可能想要只运行与该代码相关的测试。您可以选择通过“scarb cairo-test” 选项进行哪些测试,一个选项是 `-f' (“过滤器”),然后是您想要作为参数运行的测试的名称。

source: To demonstrate how to run a single test, we’ll first create two test functions, as shown in Listing 10-9, and choose which ones to run.
es: Para demostrar cómo ejecutar una sola prueba, primero crearemos dos funciones de prueba, como se muestra en Listado 10-9, y elegiremos cuáles ejecutar.
fr: Pour démontrer comment exécuter un seul test, nous allons d'abord créer deux fonctions de test, comme indiqué dans Listing 10-9, et choisir celles à exécuter.
id: Untuk menunjukkan bagaimana menjalankan tes tunggal, kita pertama akan membuat dua fungsi tes, seperti yang ditunjukkan dalam daftar 10-9, dan memilih yang mana untuk dijalankan.
tr: Tek bir testin nasıl yürütüleceğini göstermek için, önce Listeleme 10-9'da gösterildiği gibi iki test fonksiyonu oluşturacağız ve hangilerinin çalıştırılacağını seçeceğiz.
zh_cn: 为了演示如何进行单一测试, 我们将首先建立两个测试功能, 如列表 10- 9 所示,

source: "result is not 5"
es: "El resultado no es 5"
fr: "le résultat n'est pas 5"
id: "Hasil bukan 5"
tr: "Sonuç 5 değil"
zh_cn: "结果不是5"

source: <span class="caption">Listing 10-9: Two tests with two different names</span>
es: <span class="caption">Lista 10-9: Dos pruebas con dos nombres diferentes</span>
fr: <span class="caption">Liste 10-9: Deux tests avec deux noms différents</span>
id: <span class="caption">Listing 10-9: Dua tes dengan dua nama yang berbeda</span>
tr: span class="caption">Liste 10-9: İki farklı isimle iki test/span>
zh_cn: <span类="Caption" > listing 10-9:两次试验,名称两个不同 </span>

source: We can pass the name of any test function to `cairo-test` to run only that test using the `-f` flag:
es: Podemos pasar el nombre de cualquier función de prueba a `cairo-test` para ejecutar sólo esa prueba utilizando la bandera `-f`:
fr: Nous pouvons passer le nom de n'importe quelle fonction d'essai à `cairo-test` pour exécuter seulement ce test en utilisant le drapeau `-f`:
id: Kita dapat melewati nama dari fungsi tes apapun untuk tes-timur untuk menjalankan tes hanya dengan menggunakan bendera.
tr: Herhangi bir test fonksiyonunun adını -f bayrağını kullanarak sadece bu testi çalıştırmak için cairo-test'ye geçebiliriz:
zh_cn: 我们可以将任何测试功能的名称传递给`Cairo-test',仅使用`f'旗进行测试:

source: Only the test with the name `add_two_and_two` ran; the other test didn’t match that name. The test output lets us know we had one more test that didn’t run by displaying `1 filtered out;` at the end.
es: Sólo la prueba con el nombre `add_two_and_two` corrió; la otra prueba no coincide con ese nombre. La salida de prueba nos permite saber que tuvimos una prueba más que no se ejecutó mostrando `1 filtrado;'al final.
fr: Seul le test avec le nom `add_two_and_two` est exécuté; l'autre test ne correspond pas à ce nom. La sortie du test nous permet de savoir que nous avons eu un autre test qui n'a pas été exécuté en affichant `1 filtré;` à la fin.
id: Hanya tes dengan nama ·add_t_and_wo ran; tes lainnya tidak cocok dengan nama itu. Hasil tes memungkinkan kita tahu bahwa kita memiliki satu tes lagi yang tidak berjalan dengan menampilkan ▪1 disaring; pada akhirnya.
tr: Sadece add_two_and_two adı ile yapılan test koştu; diğer test bu isimle eşleşmedi. Test çıktısı, 1 filtrelenmiş olarak görüntülenerek çalışmayan bir test daha olduğunu bize bildirir; sonunda.
zh_cn: 只有一个名为`add_ 2_和_ 2' 的测试运行; 另一个测试与该名称不匹配。 测试输出让我们知道我们还有另一个测试没有通过显示 `1 过滤出来;'在结尾处。

source: We can also specify part of a test name, and any test whose name contains that value will be run.
es: También podemos especificar parte de un nombre de prueba, y cualquier prueba cuyo nombre contenga ese valor se ejecutará.
fr: Nous pouvons également spécifier une partie d'un nom de test, et tout test dont le nom contient cette valeur sera exécuté.
id: Kita juga dapat menentukan bagian dari nama tes, dan setiap tes yang namanya berisi nilai tersebut akan dijalankan.
tr: Ayrıca bir test adının bir kısmını belirtebiliriz ve bu değeri içeren herhangi bir test çalıştırılacaktır.
zh_cn: 我们还可以指定测试名称的一部分, 任何名称包含该值的测试都将运行 。

source: Ignoring Some Tests Unless Specifically Requested
es: Ignorar algunas pruebas a menos que se soliciten específicamente
fr: Ignorer certains tests à moins d'avoir été spécifiquement demandé
id: Mengabaikan Beberapa Ujian Kecuali secara Khusus Diminta
tr: Özellikle İstenmedikçe Bazı Testleri Görmezden Gelmek
zh_cn: 忽略某些试验,除非有具体要求

source: Sometimes a few specific tests can be very time-consuming to execute, so you might want to exclude them during most runs of `scarb cairo-test`. Rather than listing as arguments all tests you do want to run, you can instead annotate the time-consuming tests using the `#[ignore]` attribute to exclude them, as shown here:
es: A veces algunas pruebas específicas pueden llevar mucho tiempo para ejecutarse, por lo que es posible que desee excluirlas durante la mayoría de las carreras de `scarb cairo-test`. En lugar de enumerar como argumentos todas las pruebas que desea ejecutar, puede anotar las pruebas que consumen mucho tiempo utilizando el atributo `[ignore]` para excluirlas, como se muestra aquí:
fr: Parfois, quelques tests spécifiques peuvent prendre beaucoup de temps à exécuter, de sorte que vous pourriez vouloir les exclure lors de la plupart des exécutions de `scarb cairo-test`. Plutôt que de lister comme arguments tous les tests que vous voulez exécuter, vous pouvez au contraire annoter les tests longs en utilisant l`attribut `#[ignore]` pour les exclure, comme montré ici:
id: Kadang-kadang beberapa tes spesifik dapat sangat memakan waktu untuk dijalankan, sehingga Anda mungkin ingin mengecualikan mereka selama sebagian besar berjalan dari cairo-test. Daripada daftar sebagai argumen semua tes yang Anda lakukan ingin jalankan, Anda dapat menganotasi tes yang memakan waktu menggunakan atribut cairo, sebagaimana ditunjukkan di sini:
tr: Bazen birkaç spesifik testin uygulanması çok zaman alabilir, bu nedenle scarb cairo-test'nin çoğu çalışması sırasında bunları dışlamak isteyebilirsiniz. Çalışmak istediğiniz tüm testleri argüman olarak listelemek yerine, #[ignore] özniteliğini kullanarak zaman alıcı testleri not edebilirsiniz, burada gösterildiği gibi:
zh_cn: 有时候,一些特定的测试执行起来可能非常费时,所以在大多数`scarb cairo-test'的运行过程中,你可能想排除它们。你不用列出所有您想要运行的测试作为参数,而是用`[ignore] 属性来说明耗时测试,以排除它们,如下文所示:

source: // code that takes an hour to run
es: // código que tarda una hora en ejecutarse
fr: // code qui prend une heure pour courir
tr: // çalıştırmak için bir saat süren kod
zh_cn: 需要一小时运行的代码
