Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: You might need to use external packages to leverage the functionality provided by the community. Scarb allows you to use dependencies by cloning packages from their Git repositories. To use an external package in your project with Scarb, simply declare the Git repository URL of the dependency you want to add in a dedicated `[dependencies]` section in your _Scarb.toml_ configuration file. Note that the URL might correspond to the main branch, or any specific commit, branch or tag. For this, you will have to pass an extra `rev`, `branch`, or `tag` field, respectively. For example, the following code imports the main branch of _alexandria_math_ crate from _alexandria_ package:
es: Es posible que necesite utilizar paquetes externos para aprovechar la funcionalidad proporcionada por la comunidad. Scarb le permite utilizar dependencias mediante la clonación de paquetes de sus repositorios Git. Para usar un paquete externo en su proyecto con Scarb, simplemente declare la URL del repositorio Git de la dependencia que desea añadir en una sección dedicada `[dependencias]` en su archivo de configuración _Scarb.toml_. Tenga en cuenta que la URL puede corresponder a la rama principal, o a cualquier confirmación específica, rama o etiqueta. Para ello, tendrá que pasar un campo `rev`, `branch` o `tag` adicional, respectivamente. Por ejemplo, el siguiente código importa la rama principal de _alexandria_math_ crate desde el paquete _alexria_:
fr: Pour utiliser un paquet externe dans votre projet avec Scarb, il suffit de déclarer l'URL du dépôt Git de la dépendance que vous souhaitez ajouter dans une section dédiée `[dependences]` dans votre fichier de configuration _scarb.toml_. Notez que l'URL peut correspondre à la branche principale, ou à tout commit, branche ou balise spécifique. Pour cela, vous devrez passer un champ supplémentaire `rev`, `branch` ou `tag`, respectivement. Par exemple, le code suivant importe la branche principale de _alexandria_math_ crate à partir du paquet _alexandria_:
id: Anda mungkin perlu menggunakan paket eksternal untuk memanfaatkan fungsionalitas yang disediakan oleh komunitas. Scarb memungkinkan Anda untuk menggunakan ketergantungan dengan mengkloning paket dari Git repositoris mereka. Untuk menggunakan paket eksternal di proyek Anda dengan Scarb, cukup menyatakan URL repositori Git dari ketergantungan yang ingin Anda tambahkan dalam sebuah daerah yang didedikasikan[dependncy] dalam berkas konfigurasi _Scarb.toml_ Anda. Perlu dicatat bahwa URL mungkin sesuai dengan cabang utama, atau spesifik apa pun yang dilakukan, atau tag. Untuk ini, Anda harus melewati sebuah bagian tambahan, Ábranch, atau bidang lain. Sebagai contoh. Untuk kode import, kode utama _ria_exat_ex_and paket:
tr: Topluluk tarafından sağlanan işlevsellikten yararlanmak için sırasıyla harici paketler kullanmanız gerekebilir. Scarb, Git depolarından paketleri klonlayarak bağımlılıkları kullanmanıza izin verir. Projenizde Scarb ile harici bir paket kullanmak için, _Scarb.toml_ yapılandırma dosyanızda özel bir [bağımsızlıklar] ana etiketinde eklemek istediğiniz bağımlılığın Git depo URL'sini beyan edin.
zh_cn: 您可能需要使用外部软件包来利用社区提供的功能。 Scarb 允许您使用来自 Git 仓库的克隆软件包来使用依赖性。 要在与 Scarb 的工程中使用外部软件包, 只需声明您想要在您的 _ Scarb.toml_ 配置文件的专用“ [依赖性] ” 部分中添加的依赖性 Git 仓库 URL 。 请注意, URL 可能与主分支或任何特定承诺、 分支或标签相对应。 为此, 您需要通过一个额外的“ rev” 、 “ branch” 或“ Tag” 字段。 例如, 以下代码从 _ alexandria_ 软件包导入主分支 :

source: while the following code imports a specific branch (which is deprecated and should not be used):
es: mientras que el siguiente código importa una rama específica (que es obsoleta y no debe utilizarse):
fr: tandis que le code suivant importe une branche spécifique (qui est dépréciée et ne doit pas être utilisée):
id: sementara kode berikut mengimpor sebuah cabang tertentu (yang sudah ditinggalkan dan tidak boleh digunakan):
tr: Aşağıdaki kod belirli bir dalı içe aktarırken (eskimiştir ve kullanılmamalıdır):
zh_cn: 当下列代码进口一个特定分支(该分支已折旧,不应使用):

source: "cairo-v2.3.0-rc0"
zh_cn: "cairo-v2.3.0-rc0" "cairo-v2.3.0-rc0"

source: If you want to import multiple packages in your project, you need to create only one `[dependencies]` section and list all the desired packages beneath it. You can also specify development dependencies by declaring a `[dev-dependencies]` section.
es: Si desea importar varios paquetes en su proyecto, necesita crear solo una sección `[dependencias]` y listar todos los paquetes deseados debajo de ella. También puede especificar dependencias de desarrollo declarando una sección `[dev-dependencias]`.
fr: Si vous voulez importer plusieurs paquets dans votre projet, vous devez créer une seule section `[dependences]` et lister tous les paquets souhaités sous elle. Vous pouvez également spécifier les dépendances de développement en déclarant une section `[dev-dependences]`.
id: Jika Anda ingin mengimpor beberapa paket dalam proyek Anda, Anda hanya perlu membuat satu bagian å[dependency] dan daftar semua paket yang diinginkan di bawahnya. Anda juga dapat menentukan ketergantungan pengembangan dengan menyatakan sebuah bagian å[dev-dependency].
tr: Projenizde birden fazla paket almak istiyorsanız, yalnızca bir [bağımlılar] bölümü oluşturmanız ve altındaki tüm istenen paketleri listelemeniz gerekir. Bir [dev-bağımlılar] bölümü ilan ederek geliştirme bağımlılıklarını da belirtebilirsiniz.
zh_cn: 如果您想要在您的工程中导入多个软件包, 您只需要创建一个“ [依赖性] ” 区域, 并列出其下所有想要的软件包。 您也可以通过声明一个“ [依赖性] 区域来指定开发依赖性。

source: After that, simply run `scarb build` to fetch all external dependencies and compile your package with all the dependencies included.
es: Después de eso, simplemente ejecute `scarb build` para obtener todas las dependencias externas y compilar su paquete con todas las dependencias incluidas.
fr: Après cela, lancez simplement `scarb build` pour récupérer toutes les dépendances externes et compiler votre paquet avec toutes les dépendances incluses.
id: Setelah itu, berlarilah dengan mudah untuk mengambil semua ketergantungan dari luar dan menyusun paket Anda dengan segala ketergantungan yang termasuk.
tr: Bundan sonra, tüm harici bağımlılıkları almak ve paketinizi dahil edilen tüm bağımlılıklarla derlemek için scarb build'yi çalıştırın.
zh_cn: 在此之后,只需运行`碳碳结构 ',以获取所有外部依赖物,并将你的软件包与包括的所有依赖物一起汇编成册。

source: Note that it is also possible to add dependencies with the `scarb add` command, which will automatically edit the _Scarb.toml_ file for you. For development dependencies, just use the `scarb add --dev` command.
es: Tenga en cuenta que también es posible añadir dependencias con el comando `scarb add`, que editará automáticamente el archivo _Scarb.toml_ para usted. Para las dependencias de desarrollo, simplemente utilice el comando `scarb add --dev`.
fr: Notez qu'il est également possible d'ajouter des dépendances avec la commande `scarb add`, qui va automatiquement modifier le fichier _Scarb.toml_ pour vous. Pour les dépendances de développement, utilisez simplement la commande `scarb add --dev`.
id: Perhatikan bahwa ada kemungkinan juga untuk menambahkan ketergantungan dengan perintah åscarb, yang secara otomatis akan mengubah berkas _Scarb.toml_ untuk anda. Untuk ketergantungan pembangunan, gunakan saja menambahkan --devcarb perintah.
tr: Sizin için _Scarb.toml_ dosyasını otomatik olarak düzenleyecek olan scarb add komutuyla bağımlılıklar eklemenin de mümkün olduğunu unutmayın. Geliştirme bağımlılıkları için, sadece scarb add --dev komutunu kullanın.
zh_cn: 请注意,也可以在“carb add ” 命令中添加依赖性,该命令将自动编辑您所需的 _Scarb.toml_文件。对于开发依赖性,请使用“sccarb add -- dev” 命令。

source: To remove a dependency, simply remove the corresponding line from your _Scarb.toml_ file, or use the `scarb rm` command.
es: Para eliminar una dependencia, simplemente elimine la línea correspondiente de su archivo _Scarb.toml_ o utilice el comando `scarb rm`.
fr: Pour supprimer une dépendance, il suffit de supprimer la ligne correspondante de votre fichier _Scarb.toml_ ou d'utiliser la commande `scarb rm`.
id: Untuk menghapus ketergantungan, cukup hapus baris yang berhubungan dari berkas _Scarb.toml_ Anda, atau gunakan perintah åscarb rmå.
tr: Bir bağımlılığı kaldırmak için, ilgili satırı _Scarb.toml_ dosyanızdan kaldırmanız veya scarb rm komutunu kullanmanız yeterlidir.
zh_cn: 要删除依赖性,只需从您的 _Scarb.toml_文件中删除相应的线条,或使用“sccarb rm”命令。

source: {{#quiz ../quizzes/ch07-04-bringing-paths-into-scope.toml}}
es: quiz../quizzes/ch07-04-traing-paths-to-scope.toml
fr: {{#quiz../quizes/ch07-04-portant-chemins-dans-scope.toml}}
tr: #quiz../quizzes/ch07-04-bring-paths-into-scope.toml
zh_cn: Quiz./quizzes/ch07-04-bringing-paths-in-scope.toml-toml-

source: So far, all the examples in this chapter defined multiple modules in one file. When modules get large, you might want to move their definitions to a separate file to make the code easier to navigate.
es: Hasta ahora, todos los ejemplos en este capítulo definieron múltiples módulos en un archivo. Cuando los módulos se hacen grandes, es posible que desee mover sus definiciones a un archivo separado para hacer el código más fácil de navegar.
fr: Jusqu'à présent, tous les exemples de ce chapitre définissaient plusieurs modules dans un seul fichier. Lorsque les modules deviennent grands, vous pourriez vouloir déplacer leurs définitions dans un fichier séparé pour rendre le code plus facile à naviguer.
id: Sejauh ini, semua contoh dalam bab ini didefinisikan beberapa modul dalam satu berkas. Ketika modul mendapatkan besar, Anda mungkin ingin memindahkan definisi mereka ke berkas terpisah untuk membuat kode lebih mudah untuk menavigasi.
tr: Şimdiye kadar, bu bölümdeki tüm örnekler tek bir dosyada birden fazla modül tanımladı. Modüller genişlediğinde, kodun gezinmesini kolaylaştırmak için tanımlarını ayrı bir dosyaya taşımak isteyebilirsiniz.
zh_cn: 到目前为止, 本章中的所有示例都在一个文件中定义了多个模块。 当模块变大时, 您可能想要将其定义移动到一个单独的文件中, 以使代码更容易导航 。

source: For example, let’s start from the code in Listing 7-7 that had multiple restaurant modules. We’ll extract modules into files instead of having all the modules defined in the crate root file. In this case, the crate root file is _src/lib.cairo_.
es: Por ejemplo, vamos a empezar desde el código en Listado 7-7 que tenía varios módulos de restaurante. Extraeremos módulos en archivos en lugar de tener todos los módulos definidos en el archivo raíz de caja. En este caso, el archivo raíz de caja es _src/lib.cairo_.
fr: Par exemple, on commence à partir du code dans Listing 7-7 qui avait plusieurs modules de restaurant. On extrait des modules dans des fichiers au lieu d'avoir tous les modules définis dans le fichier racine de caisse. Dans ce cas, le fichier racine de caisse est _src/lib.cairo_.
id: Sebagai contoh, mari kita mulai dari kode dalam Daftar 7-7 yang memiliki beberapa modul restoran. Kami akan mengekstrak modul ke dalam berkas daripada memiliki semua modul yang didefinisikan dalam berkas root peti. Dalam hal ini, berkas root peti adalah _src/lib.cairo_.
tr: Örneğin, birden fazla restoran modülüne sahip olan Listeleme 7-7'deki koddan başlayalım. Modülleri, sandık kök dosyasında tanımlanan tüm modüllere sahip olmak yerine dosyalara çıkaracağız. Bu durumda, sandık kök dosyası _src/lib.cairo_'dur.
zh_cn: 例如,让我们从有多个餐厅模块的7-7列表中的代码开始。 我们将将模块提取到文件中, 而不是在箱根文件中定义所有模块。 在这种情况下, 箱根文件是 _src/lib.cairo_ 。

source: First, we’ll extract the `front_of_house` module to its own file. Remove the code inside the curly brackets for the `front_of_house` module, leaving only the `mod front_of_house;` declaration, so that _src/lib.cairo_ contains the code shown in Listing 7-14. Note that this won’t compile until we create the _src/front_of_house.cairo_ file.
es: En primer lugar, extraeremos el módulo `front_of_house` a su propio archivo. Quite el código dentro de los corchetes rizados para el módulo `front_of_house`, dejando sólo la declaración `mod front_of_house;`, de modo que _src/lib.cairo_ contenga el código mostrado en la Lista 7-14. Tenga en cuenta que esto no se compilará hasta que creemos el archivo _src/front_of_house.cairo_.
fr: Tout d'abord, nous allons extraire le module `front_of_house` dans son propre fichier. Supprimez le code à l'intérieur des crochets pour le module `front_of_house`, ne laissant que la déclaration `mod front_of_house;`, de sorte que _src/lib.cairo_ contient le code affiché dans Listing 7-14. Notez que ce won=t compile jusqu'à ce que nous créions le fichier _src/front_of_house.cairo_.
id: Pertama, kami akan mengekstrak modul 'front' of_house' ke filenya sendiri. Hapus kode dalam braket keriting untuk modul 'front'_of'house', hanya menyisakan modul depan_of_house; (pro deklarasi): sehingga _src/lib.cairo_ berisi kode yang ditampilkan dalam Daftar 7-14. Perhatikan bahwa ini tidak akan dikompilasi sampai kita membuat file _sc/front_house_cairo_.cairo.
tr: İlk olarak, front_of_house modülünü kendi dosyasına çıkaracağız. front_of_house modülü için kıvırcık parantez içindeki kodu çıkarın, sadece mod front_of_house; deklarasyonu bırakın, böylece _src/lib.cairo_ Listeleme 7-14'te gösterilen kodu içerir. Bunun _src/front_of_house dosyasını oluşturmadan derlemeyeceğini unutmayın.
zh_cn: 首先,我们将将`front_of_house' 模块提取到自己的文件中。删除`front_of_house'模块括号内的代码,只留下`mod_fof_house;'声明,这样_src/lib.cairo_就包含列表 7-14 中的代码。请注意,在创建_src/front_house.cairo_文件之前,这不会汇编。

source: <span class="caption">Listing 7-14: Declaring the `front_of_house` module whose body will be in _src/front_of_house.cairo_</span>
es: <span class="caption">Lista 7-14: Declarando el módulo `front_of_house` cuyo cuerpo estará en _src/front_of_house.cairo_</span>
fr: <span class="caption">Liste 7-14: Déclaration du module `front_of_house` dont le corps sera dans _src/front_of_house.cairo_</span>
id: <span class="caption">Listing 7-14: Menyatakan modul depan_of_house] yang tubuhnya akan berada di _src/front_of_house.cairo_</span>
tr: span class="caption">Liste 7-14: Vücudu _src/front_of_house.cairo_/span> olacak olan front_of_house modülünü ilan etmek
zh_cn: <span class="caption" > listing 7-14: 宣布`front_of_house' 模块,其身体将位于_src/front_of_house.cairo__/span>

source: Next, place the code that was in the curly brackets into a new file named _src/front_of_house.cairo_, as shown in Listing 7-15. The compiler knows to look in this file because it came across the module declaration in the crate root with the name `front_of_house`.
es: A continuación, coloque el código que estaba entre los corchetes rizados en un nuevo archivo llamado _src/front_of_house.cairo_, como se muestra en Listar 7-15. El compilador sabe buscar en este archivo porque se encontró con la declaración de módulo en la raíz de caja con el nombre `front_of_house`.
fr: Ensuite, placez le code qui était entre crochets dans un nouveau fichier nommé _src/front_of_house.cairo_, comme indiqué dans Listing 7-15. Le compilateur sait regarder dans ce fichier parce qu'il est tombé sur la déclaration du module dans la racine de caisse avec le nom `front_of_house`.
id: Selanjutnya, tempatkan kode yang ada dalam kurung keriting ke dalam berkas baru bernama _src/front_of_house.cairo_, seperti yang ditunjukkan di Listing 7-15. Koiler tahu untuk melihat dalam file ini karena ia menemukan deklarasi modul dalam akar peti dengan nama ▪front_of_house.
tr: Daha sonra, kıvırcık parantez içindeki kodu Listeleme 7-15'te gösterildiği gibi _src/front_of_house.cairo_ adlı yeni bir dosyaya yerleştirin. Derleyici bu dosyaya bakmayı biliyor çünkü front_of_house adı ile sandık kökündeki modül deklarasyonuna rastladı.
zh_cn: 下一步,将卷括号中的代码放在名为 _src/front_of_house.cairo_的新文件中,如列表 7-15所示。汇编者知道在文件中查看,因为它在箱根中发现了名为`front_of_house' 的模块声明。

source: <span class="filename">Filename: src/front_of_house.cairo</span>
fr: <span class="filename">Nom du fichier: src/front_of_house.cairo</span>
id: <nama berkas="> Nama berkas: src/front_of_house.cairo</span>
tr: span class="filename">Dosya adı: src/front_of_house.cairo/span>
zh_cn: <span类="filename" >Filename: src/front_of_house.cairo </span>

source: <span class="caption">Listing 7-15: Definitions inside the `front_of_house` module in _src/front_of_house.cairo_</span>
es: <span class="caption">Lista 7-15: Definiciones dentro del módulo `front_of_house` en _src/front_of_house.cairo_</span>
fr: <span class="caption">Liste 7-15: Définitions à l'intérieur du module `front_of_house` dans _src/front_of_house.cairo_</span>
id: <span class="caption">Listing 7-15: Definisi di dalam modul.front_of_house dalam _src/front_of_house.cairo_</span>
tr: span class="caption">Liste 7-15: _src/front_of_house.cairo_/span>'daki front_of_house modülündeki tanımlar
zh_cn: <span class="Caption" > listing 7-15: 在_src/front_of_house.cairo_/span的“前屋”模块中的定义

source: Note that you only need to load a file using a `mod` declaration _once_ in your module tree. Once the compiler knows the file is part of the project (and knows where in the module tree the code resides because of where you’ve put the `mod` statement), other files in your project should refer to the loaded file’s code using a path to where it was declared, as covered in the ["Paths for Referring to an Item in the Module Tree"](./ch07-03-paths-for-referring-to-an-item-in-the-module-tree.md) chapter. In other words, `mod` is _not_ an “include” operation that you may have seen in other programming languages.
es: Tenga en cuenta que sólo necesita cargar un archivo usando una declaración `mod` _once_ en el árbol del módulo. Una vez que el compilador sepa que el archivo es parte del proyecto (y sepa dónde en el árbol del módulo reside el código debido a dónde ha puesto la declaración `mod`), otros archivos de su proyecto deben referirse al código del archivo cargado utilizando una ruta a donde fue declarado, como se cubre en el capítulo ["Pasos para hacer referencia a un elemento en el árbol del módulo"](./ch07-03-paths-for-referring-to-an-item-in-the-module-tree.md). En otras palabras, `mod` es una operación _not_ que puede haber visto en otros idiomas de programación.
fr: Notez que vous n'avez qu'à charger un fichier en utilisant une déclaration `mod` _once_ dans l'arborescence de votre module. Une fois que le compilateur sait que le fichier fait partie du projet (et sait où dans l'arborescence de module le code réside en raison de l'endroit où vous avez mis l'instruction `mod`), d'autres fichiers de votre projet doivent se référer au code de fichier chargé en utilisant un chemin jusqu'à l'endroit où il a été déclaré, comme couvert dans le chapitre ["Paths for Referenceing to an Item in the Module Tree"](./ch07-03-paths-for-reference-to-an-item-in-the-module-tree.md). En d'autres termes, `mod` est _not_ une opération "include" que vous avez peut-être vue dans d'autres langages de programmation.
id: Perhatikan bahwa Anda hanya perlu memuat sebuah berkas dengan menggunakan sebuah deklarasi _sekali_ dalam pohon modul Anda. Sekali kompiler tahu bahwa file itu adalah bagian dari proyek (dan tahu di mana di pohon modul ada kode karena di mana anda menuliskan pernyataan Áe_on_once_on), berkas lain dalam proyek anda harus mengacu ke kode berkas yang dimuat menggunakan jalur ke mana berkas tersebut dinyatakan, sebagaimana yang tercakup dalam ["Path for Referning to anem in the Tree"]. /ch07-path03-for-referring-an-to-in-the-mod-mod-moded-mod). Dalam bab lainnya, _BAR_
tr: Modül ağacınızda sadece bir mod deklarasyonu _once_ kullanarak bir dosya yüklemeniz gerektiğini unutmayın. Derleyici, dosyanın projenin bir parçası olduğunu bildiğinde (ve modül ağacında kodun nerede olduğunu bildiğinde, mod ifadesini koyduğunuz için) projenizdeki diğer dosyalar, yüklenilen dosyanın koduna ["Paths for Refering" bölümünde belirtildiği gibi bir yol kullanarak başvurmalıdır.
zh_cn: 请注意,您只需在模块树中使用`mod' 声明_once_ 装入文件即可。 一旦汇编者知道文件是项目的一部分(并知道代码在模块树中的位置,因为您已经将`mod' 声明放在哪里),您项目中的其他文件就应该参照已装入文件的代码,使用“提到模块树中某个项目的路径” (./ch07-03-paths-refor-referring-an-emit-in-the-module-tree.md) 章节中包含的路径。换句话说,`mod` is_ not__ a “include” 操作,您可以用其他编程语言看到 。

source: Next, we’ll extract the `hosting` module to its own file. The process is a bit different because `hosting` is a child module of `front_of_house`, not of the root module. We’ll place the file for `hosting` in a new directory that will be named for its ancestors in the module tree, in this case _src/front_of_house/_.
es: A continuación, extraeremos el módulo `hosting` a su propio archivo. El proceso es un poco diferente porque `hosting` es un módulo hijo de `front_of_house`, no del módulo raíz. Colocaremos el archivo para `hosting` en un nuevo directorio que será nombrado por sus antepasados en el árbol del módulo, en este caso _src/front_of_house/_.
fr: Ensuite, nous allons extraire le module `hosting` dans son propre fichier. Le processus est un peu différent car `hosting` est un module enfant de `front_of_house`, pas du module racine. Nous allons placer le fichier pour `hosting` dans un nouveau répertoire qui sera nommé pour ses ancêtres dans l'arborescence du module, dans ce cas _src/front_of_house/_.
id: Selanjutnya, kami akan mengekstrak modul ·hosingé ke filenya sendiri. Proses ini agak berbeda karena modul anak dari ·front_house, bukan modul root. Kami akan menempatkan berkas tersebut dalam direktori baru yang akan dinamai untuk leluhurnya di pohon modul, dalam kasus ini _sc/front_of_house/__.
tr: Daha sonra, hosting modülünü kendi dosyasına çıkaracağız. İşlem biraz farklı çünkü hosting, kök modülün değil, front_of_house'un bir çocuk modülü. hosting dosyasını, modül ağacında ataları için adlandırılacak yeni bir dizine yerleştireceğiz, bu durumda _src/front_of_house/_.
zh_cn: 下一步,我们将将“主办”模块提取到自己的文件中。由于“主办”是一个“前屋”而不是“根”模块的儿童模块,因此程序略有不同。我们将将“主办”文件放置在模块树中为其祖先命名的新目录中,这里是 _src/front_of_house/_。

source: To start moving `hosting`, we change _src/front_of_house.cairo_ to contain only the declaration of the `hosting` module:
es: Para empezar a mover `hosting`, cambiamos _src/front_of_house.cairo_ para que contenga sólo la declaración del módulo `hosting`:
fr: Pour commencer à déplacer `hosting`, nous changeons _src/front_of_house.cairo_ pour ne contenir que la déclaration du module `hosting`:
id: Untuk mulai bergerak ·hostingé, kami mengubah _src/front_of_house.cairo_ untuk hanya berisi deklarasi modul tersebut:
tr: hosting'yi hareket ettirmeye başlamak için, sadece hosting modülünün bildirimini içerecek şekilde _src/front_of_house.cairo_ değerini değiştiririz:
zh_cn: 为了开始移动`东道 ',我们将 _src/front_of_house.cairo_改为只包含`东道'模块声明:

source: Then we create a _src/front_of_house_ directory and a file _hosting.cairo_ to contain the definitions made in the `hosting` module:
es: Luego creamos un directorio _src/front_of_house_ y un archivo _hosting.cairo_ para contener las definiciones hechas en el módulo `hosting`:
fr: Ensuite, nous créons un répertoire _src/front_of_house_ et un fichier _hosting.cairo_ pour contenir les définitions faites dans le module `hosting`:
id: Kemudian kami membuat direktori _sc/front_of_house_ dan sebuah berkas _hosting.cairo_ untuk memuat definisi yang dibuat dalam modul ·hostingá:
tr: Ardından, hosting modülünde yapılan tanımları içeren bir _src/front_of_house_ dizini ve bir _hosting.cairo_ dosyası oluştururuz:
zh_cn: 然后我们创建一个_src/front_of_house_目录和一个文件_ hosting.cairo_,以包含`托管'模块中的定义:

source: <span class="filename">Filename: src/front_of_house/hosting.cairo</span>
fr: <span class="filename">Nom du fichier: src/front_of_house/hosting.cairo</span>
id: <nama berkas="> Nama berkas: src/front_of_house/hosting.cairo</span>
tr: span class="filename">Dosya adı: src/front_of_house/hosting.cairo/span>
zh_cn: <span类="filename" >Filename: src/front_of_house/ hosting.cairo </span>
