Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The `expect_err` and `unwrap_err` methods have the exact opposite behavior. If the `Result` is `Err(x)`, both methods return the value `x`. However, the key difference between the two methods is in case of `Result::Ok()`. The `expect_err` method allows you to provide a custom error message (as a `felt252` value) that will be used when panicking, giving you more control and context over the panic. On the other hand, the `unwrap_err` method panics with a default error message, providing less information about the cause of the panic.
es: Los métodos `expect_err` y `unwrap_err` tienen el comportamiento opuesto exacto. Si el `Resultado` es `Err(x)`, ambos métodos devuelven el valor `x`. Sin embargo, la diferencia clave entre los dos métodos es en el caso de `Resultado::Ok()`. El método `expect_err` le permite proporcionar un mensaje de error personalizado (como un valor `felt252`) que se utilizará cuando entre en pánico, dándole más control y contexto sobre el pánico. Por otro lado, el método `unwrap_err` entra en pánico con un mensaje de error predeterminado, proporcionando menos información sobre la causa del pánico.
fr: Les méthodes `expect_err` et `unwrap_err` ont le comportement opposé exact. Si le `Result` est `Err(x)`, les deux méthodes retournent la valeur `x`. Cependant, la différence clé entre les deux méthodes est dans le cas de `Result::Ok()`. La méthode `expect_err` vous permet de fournir un message d'erreur personnalisé (en tant que valeur `felt252`) qui sera utilisé lors de la panique, vous donnant plus de contrôle et de contexte sur la panique. D'autre part, la méthode `unwrap_err` panique avec un message d'erreur par défaut, fournissant moins d'informations sur la cause de la panique.
id: Metode khusus ini memiliki perilaku yang berbeda. Jika metode ini memiliki perilaku yang benar-benar berbeda, kedua metode tersebut akan mengembalikan nilai (misal 25). Namun, perbedaan kunci antara dua metode tersebut adalah dalam kasus ▪Reult:::Oktal). Metode pengungkapan ini memungkinkan Anda untuk memberikan pesan custom (sebagai nilai felt2523) yang akan digunakan ketika panik, memberi Anda kontrol lebih banyak dan konteks atas panik. Pada sisi lain, metode versuser). Metode yang memungkinkan Anda untuk memberikan pesan default, menyebabkan lebih sedikit tentang kepanikan.
tr: expect_err ve unwrap_err yöntemleri tam tersi bir davranışa sahiptir. Result hatası Err(x) ise, her iki yöntem de x değerini döndürür. Bununla birlikte, iki yöntem arasındaki temel fark Result::Ok() diğer bir hata olduğunda expect_err yöntemi özel bir hata iletisi vermenizi sağlar.
zh_cn: `Expect_er'和`unwrap_er'方法具有完全相反的行为,如果`Result'是`Err(x) ',两种方法都返回了`x'值,但这两种方法之间的关键区别在于`Result:Ok()'。`expect_er'方法允许您提供自定义错误信息(作为`felt252'值),在恐慌时使用,使您对恐慌有更多的控制和上下文。另一方面,`unlop_err'方法以默认错误信息返回了`x'值,减少了关于恐慌原因的信息。

source: A careful reader may have noticed the `<+Drop<T>>` and `<+Drop<E>>` in the first four methods signatures. This syntax represents generic type constraints in the Cairo language, as seen in the previous chapter. These constraints indicate that the associated functions require an implementation of the `Drop` trait for the generic types `T` and `E`, respectively.
es: Un lector cuidadoso pudo haber notado el Drop<T y Drop<E en las primeras firmas de los cuatro métodos. Esta sintaxis representa restricciones genéricas de tipo en el idioma de El Cairo, como se ve en el capítulo anterior. Estas restricciones indican que las funciones asociadas requieren una implementación del rasgo `Drop` para los tipos genéricos `T` y `E`, respectivamente.
fr: Un lecteur attentif a peut-être remarqué les signatures `<+Drop<T>>` et `<+Drop<E>>` dans les quatre premières méthodes. Cette syntaxe représente des contraintes de type génériques dans la langue du Caire, comme le montre le chapitre précédent. Ces contraintes indiquent que les fonctions associées nécessitent une mise en œuvre du caractère `Drop` pour les types génériques `T` et `E`, respectivement.
id: Seorang pembaca yang berhati - hati mungkin memperhatikan <+Drop<T> dan <+Drop<E> dalam empat metode tanda tangan pertama. Sintak ini merupakan kendala umum dalam bahasa Kairo, seperti yang terlihat di bab sebelumnya. Keterbatasan ini menunjukkan bahwa fungsi yang terkait membutuhkan implementasi dari sifat umum untuk tipe umum ÉTÉ dan ÉE, masing-masing.
tr: Dikkatli bir okuyucu, ilk dört yöntem imzasında +DropT> ve +DropE> özelliklerini fark etmiş olabilir. Bu sözdizimi, önceki bölümde görüldüğü gibi Kahire dilindeki genel tip kısıtlamaları temsil eder. Bu kısıtlamalar, ilişkili işlevlerin sırasıyla T ve E jenerik tipleri için Drop özelliğinin uygulanmasını gerektirdiğini göstermektedir.
zh_cn: 仔细阅读者可能注意到前四种方法的签名中的“Drop<T”和“Drop<E”,该语法代表了开罗语言的通用类型限制,如前一章所述,这些限制表明,相关功能要求分别实施“T”和“E”通用类型“Drop”特性。

source: Finally, the `is_ok` and `is_err` methods are utility functions provided by the `ResultTrait` trait to check the variant of a `Result` enum value.
es: Por último, los métodos `is_ok` y `is_err` son funciones de utilidad proporcionadas por el rasgo `ResultTrait'para comprobar la variante de un valor enum `Result '.
fr: Enfin, les méthodes `is_ok` et `is_err` sont des fonctions d'utilité fournies par le caractère `ResultTrait` pour vérifier la variante d'une valeur `Result` enum.
id: Yang terakhir, metode-metode yang digunakan oleh fungsi ▪ResultTrait untuk memeriksa varian dari sebuah nilai enum resol.
tr: Son olarak, is_ok ve is_err yöntemleri, bir Result enum değerinin varyantını kontrol etmek için ResultTrait özelliği tarafından sağlanan yardımcı işlevlerdir.
zh_cn: 最后,`is_ok'和`is_err'方法是`resultTrait'特性提供的效用功能,以检查`result' enum值的变体。

source: `is_ok` takes a snapshot of a `Result<T, E>` value and returns `true` if the `Result` is the `Ok` variant, meaning the operation was successful. If the `Result` is the `Err` variant, it returns `false`.
es: `is_ok` toma una instantánea de un `Resultado<T, valor E® y devuelve `true` si el `Resultado` es la variante `Ok`, lo que significa que la operación tuvo éxito. Si el `Resultado` es la variante `Err`, devuelve `false`.
fr: `is_ok` prend un instantané d`une valeur `Result<T, E>` et retourne `true` si la `Result` est la variante `Ok`, ce qui signifie que l`opération a été réussie. Si la `Result` est la variante `Err`, elle retourne `false`.
id: Nilai dan nilai E> adalah jika result adalah varian yang sama, berarti operasi itu sukses.
tr: is_ok bir ResultT, E> değerinin anlık görüntüsünü alır ve true değerini gönderir Result Ok varyantıysa, işlem başarılı demektir. Result Err varyantıysa, false değerini döndürür.
zh_cn: `是`ok'对`Result<T,E 值和返回`t'进行截图,如果`Result'是`Ok` 变体,意味着操作成功。如果`Result'是`Err'变体,则返回`false'。

source: `is_err` takes a snapshot of a `Result<T, E>` value and returns `true` if the `Result` is the `Err` variant, meaning the operation encountered an error. If the `Result` is the `Ok` variant, it returns `false`.
es: `is_err` toma una instantánea de un `Resultado<T, valor E® y devuelve `true` si el `Resultado` es la variante `Err`, lo que significa que la operación encontró un error. Si el `Resultado` es la variante `Ok`, devuelve `false`.
fr: `is_err` prend un instantané d`une valeur `Result<T, E>` et retourne `true` si la `Result` est la variante `Err`, ce qui signifie que l`opération a rencontré une erreur. Si la `Result` est la variante `Ok`, elle retourne `false`.
id: Nilai dan nilai E> adalah jika reserult adalah varian, berarti operasi mengalami kesalahan. Jika resolt adalah varian thoseok, ia akan kembali.
tr: is_err bir ResultT, E> değerinin anlık görüntüsünü alır ve true değerini gönderir Result Err varyantı ise, işlem bir hatayla karşılaştı demektir. Result Ok varyantıysa, false değerini döndürür.
zh_cn: `是`err'采取`Result<T,E 值和返回`ret'如果`Result'是`err'变体,即操作遇到错误。如果`Result'是`Ok'变体,则返回`false'。

source: These methods are helpful when you want to check the success or failure of an operation without consuming the `Result` value, allowing you to perform additional operations or make decisions based on the variant without unwrapping it.
es: Estos métodos son útiles cuando se desea comprobar el éxito o el fracaso de una operación sin consumir el valor `Resultado`, lo que le permite realizar operaciones adicionales o tomar decisiones basadas en la variante sin desenvolverla.
fr: Ces méthodes sont utiles lorsque vous voulez vérifier le succès ou l'échec d'une opération sans consommer la valeur `Résultat`, vous permettant d'effectuer des opérations supplémentaires ou de prendre des décisions basées sur la variante sans la décompresser.
id: Metode - metode ini sangat membantu apabila Anda ingin memeriksa keberhasilan atau kegagalan suatu operasi tanpa mengkonsumsi nilai ÁResulté, memungkinkan Anda melakukan operasi tambahan atau membuat keputusan - keputusan berdasarkan varian tanpa perlu membungkusnya.
tr: Bu yöntemler, bir işlemin başarısını veya başarısızlığını Result değerini tüketmeden kontrol etmek istediğinizde, ek işlemleri gerçekleştirmenize veya açmadan varyantı temel alarak kararlar vermenize izin verdiğinizde yararlıdır.
zh_cn: 当您想要在不消耗`Result' 值的情况下检查操作的成败,从而允许您进行额外的操作或根据变量作出决定而无需解开变量时,这些方法会很有帮助。

source: You can find the implementation of the `ResultTrait` [here](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).
es: Puede encontrar la aplicación del `ResultTrait` [aquí] (https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).
fr: Vous pouvez trouver la mise en œuvre de la `ResultTrait` [ici](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).
id: Anda dapat menemukan implementasi dari 'ResultTrait' [disini][https://gitub.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).
tr: ResultTrait [burada](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20) uygulamasının uygulanmasını bulabilirsiniz.
zh_cn: 你可以找到`ResultTrait'[此处](https://github.com/starkware-libs/cairo/blob/main/corelib/src/legation.cairo#L20)的执行情况。

source: It is always easier to understand with examples. Have a look at this function signature:
es: Siempre es más fácil de entender con ejemplos. Eche un vistazo a esta firma de función:
fr: Il est toujours plus facile de comprendre avec des exemples. Jetez un oeil à cette signature de fonction:
id: Selalu lebih mudah untuk dipahami dengan contoh. Lihatlah tanda tangan fungsi ini:
tr: Örneklerle anlamak her zaman daha kolaydır. Bu fonksiyon imzasına bir göz atın:
zh_cn: 示例总是容易理解的。请查看此函数签名 :

source: It takes two `u128` integers, `a` and `b`, and returns a `Result<u128, u128>` where the `Ok` variant holds the sum if the addition does not overflow, and the `Err` variant holds the overflowed value if the addition does overflow.
es: Se necesitan dos 'u128` enteros, `a` y `b`, y devuelve un `Resultado<u128, u128, donde la variante `Ok` contiene la suma si la adición no se desborda, y la variante `Err` contiene el valor desbordado si la adición se desborda.
fr: Il prend deux entiers `u128`, `a` et `b`, et retourne un `Résultat<u128, u128>` où la variante `Ok` tient la somme si l'addition ne déborde pas, et la variante `Err` tient la valeur débordée si l'addition déborde.
id: Perlu dua integer, atau integer, dan variannya tidak meluap, dan variannya mengandung nilai yang meluap - luap bila penjumlahan itu meluap.
tr: İki u128 tamsayısı, a ve b alır ve Resultu128, u128> eki taşmazsa Ok varyantı toplamı tutar ve Err varyantı, ekleme taşarsa taşan değeri tutar.
zh_cn: 它需要两个`u128'整数,`a'和`b',并返回一个`Result<u128, u128 ',其中`Ok'变式持有未溢出时的金额,而`Err'变式持有未溢出时的溢出值。

source: Now, we can use this function elsewhere. For instance:
es: Ahora, podemos usar esta función en otro lugar. Por ejemplo:
fr: Maintenant, nous pouvons utiliser cette fonction ailleurs. Par exemple:
id: Sekarang, kita dapat menggunakan fungsi ini di tempat lain.
tr: Şimdi, bu işlevi başka bir yerde kullanabiliriz. Örneğin:
zh_cn: 现在,我们可以在别处使用此函数。例如:

source: Here, it accepts two `u128` integers, `a` and `b`, and returns an `Option<u128>`. It uses the `Result` returned by `u128_overflowing_add` to determine the success or failure of the addition operation. The `match` expression checks the `Result` from `u128_overflowing_add`. If the result is `Ok(r)`, it returns `Option::Some(r)` containing the sum. If the result is `Err(r)`, it returns `Option::None` to indicate that the operation has failed due to overflow. The function does not panic in case of an overflow.
es: En este caso, acepta dos enteros `u128`, `a` y `b`, y devuelve una `Opción<u128`. Utiliza el `Resultado` devuelto por `u128_overflowing_add` para determinar el éxito o el fracaso de la operación de adición. La expresión `match` comprueba el `Resultado` de `u128_overflowing_add`. Si el resultado es `Ok(r)`, devuelve `Opción::Some(r)` que contiene la suma. Si el resultado es `Errr(r)`, devuelve `Opción::Ninguna` para indicar que la operación ha fallado debido al desbordamiento. La función no entra en pánico en caso de desbordamiento.
fr: Ici, il accepte deux entiers `u128`, `a` et `b`, et retourne une `Option<u128>`. Il utilise le `Result` retourné par `u128_overflowing_add` pour déterminer le succès ou l'échec de l'opération d'ajout. L'expression `match` vérifie la `Result` de `u128_overflowing_add`. Si le résultat est `Ok(r)`, il retourne `Option::Some(r)` contenant la somme. Si le résultat est `Err(r)`, il retourne `Option::None` pour indiquer que l'opération a échoué en raison d'un débordement. La fonction ne panique pas en cas de débordement.
id: Di sini, ia menerima dua bilangan 1228 integer, dan kembali ke sini untuk menentukan keberhasilan atau kegagalan operasi penambahan. Ekspresi yang tidak cocok memeriksa ekspresi <u128>. Ia menggunakan ▪Resolting_d. Jika hasilnya adalah ▪128_overflowing_ad), ia kembali option: Ada yang berisi. Jika hasilnya adalah Ár), ia kembali ke operasi yang telah gagal.
tr: Burada, iki u128 tamsayısını, a ve b kabul eder ve bir Optionu128> döndürür. Ek işlemin başarısını veya başarısızlığını belirlemek için u128_overflowing_add tarafından döndürülen Result işaretini kullanır. match ifadesi Result değerini u128_overflowing_add'den alır.
zh_cn: 在此,它接受两个`u128'整数,`a'和`b',并返回一个`option<u128'。它使用`u128_overflowing_add'返回的`Result'来决定添加操作的成败。`match'表达式检查`u128_overflowing_add'中的`result'。如果结果为`Ok(r) ',它返回包含该金额的`option:oma(r)'。如果结果为`rr(r) ',它返回`opp:no'来表示操作因溢出而失败。如果溢出,该功能不会引起恐慌。

source: Let's take another example:
es: Tomemos otro ejemplo:
fr: Prenons un autre exemple :
id: Mari kita ambil contoh lain:
tr: Başka bir örnek ele alalım:
zh_cn: 让我们举另一个例子:

source: In this example, the `parse_u8` function takes a `felt252` and tries to convert it into a `u8` integer using the `try_into` method. If successful, it returns `Result::Ok(value)`, otherwise it returns `Result::Err('Invalid integer')`.
es: En este ejemplo, la función `parse_u8` toma una `felt252` e intenta convertirla en un entero `u8` usando el método `try_into`. Si tiene éxito, devuelve `Resultado::Ok(valor)`, de lo contrario devuelve `Resultado::Errr('Inválido entero')`.
fr: Dans cet exemple, la fonction `parse_u8` prend une `felt252` et essaie de la convertir en un entier `u8` en utilisant la méthode `try_into`. Si elle est réussie, elle retourne `Résultat::Ok(value)`, sinon elle retourne `Résultat::Err('Invalid integer')`.
id: Dalam contoh ini, fungsi åparse_u8 mengambil sebuah °252) dan mencoba mengubahnya menjadi integer (integer = integer = integer). jika berhasil, ia akan kembali lagi:: Okórze), jika tidak, ia akan kembali ▪Resolult::::Err (Err (Err harta karun) integer).
tr: Bu örnekte, parse_u8 fonksiyonu bir felt252 alır ve try_into yöntemini kullanarak u8 tamsayısına dönüştürmeye çalışır. Başarılı olursa, Result::Ok(value) değerini döndürür, aksi takdirde Result:Err('Invalid tamsayı') değerini gönderir.
zh_cn: 在此示例中, `parse_ u8' 函数需要一个`felt252', 并试图使用` try_ into' 方法将其转换为`u8' 整数, 如果成功, 它返回`Result::: Ok(价值) ', 否则它返回`Result:Err(“无效整数”)' 。

source: Our two test cases are:
es: Nuestros dos casos de prueba son:
fr: Nos deux cas d'essai sont les suivants :
id: Dua kasus percobaan kami adalah:
tr: İki test vakamız şunlardır:
zh_cn: 我们的两个测试案例是:

source: // should not panic
es: // no debe entrar en pánico
fr: // ne devrait pas paniquer
id: / //seharusnya tidak panik
tr: // panik yapmamalı
zh_cn: 不应该惊慌

source: // should panic
es: // debería entrar en pánico
fr: // devrait paniquer
id: //harus panik
tr: // paniğe kapılmalı
zh_cn: /应该惊慌

source: Don't worry about the `#[cfg(test)]` attribute for now. We'll explain in more detail its meaning in the next [Testing Cairo Programs](./ch10-01-how-to-write-tests.md) chapter.
es: Por ahora, no te preocupes por el atributo "[cfg(test)]`. Explicaremos con más detalle su significado en el siguiente capítulo [Testing Cairo Programs](./ch10-01-how-to-write-tests.md).
fr: Ne vous inquiétez pas de l'attribut `#[cfg(test)]` pour le moment. Nous allons expliquer plus en détail sa signification dans le prochain chapitre [Testing Cairo Programs](./ch10-01-how-to-write-tests.md).
id: Jangan khawatir tentang atribut untuk saat ini. Kami akan menjelaskan secara lebih rinci artinya dalam bab berikutnya [Program Tes Kairo]./ch10-01-how-to-writes-test.md).
tr: Şimdilik #[cfg(test)] özniteliği için endişelenmeyin. Bir sonraki [Testing Cairo Programs](./ch10-01-how-to-write-tests.md) bölümünde anlamını daha ayrıntılı olarak açıklayacağız.
zh_cn: 不要担心 @[cfg(test)]`属性。我们将在下一章[测试开罗方案](./ch10-01-hoow-to-write-stests. md)中更详细地解释其含义。

source: `#[test]` attribute means the function is a test function, and `#[should_panic]` attribute means this test will pass if the test execution panics.
es: El atributo «[test]`» significa que la función es una función de prueba, y el atributo «[ should_panic]` significa que esta prueba pasará si la ejecución de la prueba entra en pánico.
fr: `#[test]` attribut signifie que la fonction est une fonction de test, et `#[whould_panic]` attribut signifie que ce test passera si l'exécution du test panique.
id: atribut ini berarti fungsi adalah fungsi tes, dan atribut [seharusnya_panik] berarti tes ini akan lulus jika percobaan panik.
tr: #[test] özniteliği, fonksiyonun bir test fonksiyonu olduğu anlamına gelir ve #[should_panic] özniteliği, test yürütmesi paniklediğinde bu testin geçeceği anlamına gelir.
zh_cn: `[测试]`属性是指函数是一个测试函数,`[shall_panic]’属性是指当测试执行恐慌时该测试会通过。

source: The first one tests a valid conversion from `felt252` to `u8`, expecting the `unwrap` method not to panic. The second test function attempts to convert a value that is out of the `u8` range, expecting the `unwrap` method to panic with the error message `Invalid integer`.
es: La primera prueba una conversión válida de `felt252` a `u8`, esperando que el método `unwrap` no entre en pánico. La segunda función de prueba intenta convertir un valor que está fuera del rango `u8`, esperando que el método `unwrap` entre en pánico con el mensaje de error `Entero inválido`.
fr: Le premier teste une conversion valide de `felt252` à `u8`, en s'attendant à ce que la méthode `unwrap` ne panique pas. La deuxième fonction de test tente de convertir une valeur qui est hors de la gamme `u8`, en s'attendant à ce que la méthode `unwrap` panique avec le message d'erreur `Invalid integer`.
id: Yang pertama menguji konversi yang valid dari nomor 252 sampai ·u8, mengharapkan metode pertama untuk tidak panik. Percobaan fungsi kedua untuk mengubah nilai yang berada di luar jangkauan ·u8, mengharapkan metode åun wrapping yang panik dengan pesan galat integer yang tidak valid.
tr: İlki, felt252'den u8'ye geçerli bir dönüşümü test eder, unwrap yönteminin paniklememesini bekler. İkinci test fonksiyonu, u8 aralığının dışında olan bir değeri dönüştürmeye çalışır, unwrap yönteminin Geçersiz tamsayı hata mesajıyla panik yapmasını bekler.
zh_cn: 第一项测试从`felt252'有效转换为`u8',预期`unbrap'方法不会惊慌;第二项测试功能试图转换“u8”范围以外的数值,预计`unbrap'方法会用错误信息`无效整数'惊慌失措。

source: The `?` Operator
es: ¿La operadora?
fr: L'opérateur `?`
id: Operator.
tr: ? Operatörü
zh_cn: `?`接线员

source: The last operator we will talk about is the `?` operator. The `?` operator is used for more idiomatic and concise error handling. When you use the `?` operator on a `Result` or `Option` type, it will do the following:
es: El último operador del que hablaremos es el operador `?`. El operador `?` se utiliza para una manipulación de errores más idiomática y concisa. Cuando utilice el operador `?` en un tipo `Resultado` o `Opción`, hará lo siguiente:
fr: Le dernier opérateur dont nous parlerons est l'opérateur `?`. L'opérateur `?` est utilisé pour gérer les erreurs plus idiomatiques et concises. Lorsque vous utilisez l'opérateur `?` sur un type `Résultat` ou `Option`, il fera ce qui suit:
id: Operator terakhir yang akan kita bicarakan adalah operatornya. operatornya digunakan untuk tipe yang lebih sederhana dan ringkas. ketika Anda menggunakan operator pada jenis resolte atau opsi, ia akan melakukan hal berikut:
tr: Konuşacağımız son operatör? operatörüdür.? operatörü daha basit ve özlü hata işleme için kullanılır. Result veya Option tipinde? operatörünü kullandığınızda, aşağıdakileri yapacaktır:
zh_cn: 我们谈论的最后一个操作员是`?'操作员。`?'操作员用于更专门和简洁的错误处理。当您在`Result'或`option'类型上使用``?'操作员时,它将采取以下行动:

source: If the value is `Result::Ok(x)` or `Option::Some(x)`, it will return the inner value `x` directly.
es: Si el valor es `Resultado::Ok(x)` o `Opción::Some(x)`, devolverá el valor interno `x` directamente.
fr: Si la valeur est `Résultat::Ok(x)` ou `Option::Some(x)`, elle retournera directement la valeur intérieure `x`.
id: Jika nilainya adalah "Result:: Okłx" atau "Option": "Some Allahx," maka nilai dalam akan dikembalikan langsung.
tr: Eğer değer Result::Ok(x) veya Option::Some(x) ise, x iç değerini doğrudan döndürür.
zh_cn: 如果数值为`Result::Ok(x)'或`Option:some(x) ',则该数值将直接返回内值`x'。

source: If the value is `Result::Err(e)` or `Option::None`, it will propagate the error or `None` by immediately returning from the function.
es: Si el valor es `Resultado::Err(e)` o `Opción::Ninguno`, propagará el error o `Ninguno` regresando inmediatamente de la función.
fr: Si la valeur est `Résultat::Err(e)` ou `Option::None`, elle propage l'erreur ou `None` en revenant immédiatement de la fonction.
id: Jika nilainya adalah "Result::Erróe" atau "Opsi": "None," maka ia akan menyebarkan kesalahan atau tidak." dengan segera kembali dari fungsinya.
tr: Eğer değer Result::Err(e) veya Option::None ise, fonksiyondan hemen geri dönerek hatayı ya da None'u yayar.
zh_cn: 如果数值为`Result:Err(e)'或`Option:No`,则该数值会通过立即从函数返回而传播错误或`none'。

source: The `?` operator is useful when you want to handle errors implicitly and let the calling function deal with them.
es: El operador `?` es útil cuando desea manejar errores implícitamente y dejar que la función de llamada se ocupe de ellos.
fr: L'opérateur `?` est utile quand vous voulez gérer les erreurs implicitement et laisser la fonction d'appel traiter avec eux.
id: Operator sangat berguna ketika Anda ingin menangani kesalahan secara implisit dan membiarkan fungsi panggilan berurusan dengan mereka.
tr: ? operatörü, hataları dolaylı olarak ele almak ve arama işlevinin bunlarla ilgilenmesine izin vermek istediğinizde kullanışlıdır.
zh_cn: `?'操作员在想暗中处理错误并让调用功能处理错误时是有用的。

source: // DO SOMETHING
es: // HACER ALGO
fr: // Faire quelque chose
id: //Lakukan SESUATU
tr: // BİR ŞEY YAP
zh_cn: 做点什么
