Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: If you are developing smart contracts for production use, it is highly recommended to conduct external audits performed by security experts.
es: Si está desarrollando contratos inteligentes para el uso de la producción, es muy recomendable realizar auditorías externas realizadas por expertos en seguridad.
fr: Si vous développez des contrats intelligents pour l'utilisation de la production, il est fortement recommandé d'effectuer des audits externes effectués par des experts en sécurité.
id: Jika Anda mengembangkan kontrak cerdas untuk penggunaan produksi, sangat dianjurkan untuk melakukan audit eksternal yang dilakukan oleh para pakar keamanan.
tr: Üretim kullanımı için akıllı sözleşmeler geliştiriyorsanız, güvenlik uzmanları tarafından gerçekleştirilen dış denetimlerin yapılması şiddetle tavsiye edilir.
zh_cn: 如果您正在制订智能生产使用合同,强烈建议由安保专家进行外部审计。

source: Mindset
fr: L'esprit
zh_cn: 心心集

source: Cairo is a highly safe language inspired by Rust. It is designed in a way that forces you to cover all possible cases. Security issues on Starknet mostly arise from the way smart contract flows are designed, not much from the language itself.
es: El Cairo es un lenguaje altamente seguro inspirado en Rust. Está diseñado de una manera que te obliga a cubrir todos los casos posibles. Los problemas de seguridad en Starknet surgen principalmente de la forma en que se diseñan los flujos de contratos inteligentes, no mucho de la lengua en sí.
fr: Le Caire est un langage très sûr inspiré par Rust. Il est conçu d'une manière qui vous oblige à couvrir tous les cas possibles. Les problèmes de sécurité sur Starknet proviennent principalement de la façon dont les flux de contrats intelligents sont conçus, pas beaucoup de la langue elle-même.
id: Kairo adalah bahasa yang sangat aman yang terinspirasi oleh Rust ini dirancang dengan cara yang memaksa Anda untuk menutup semua kasus yang mungkin masalah keamanan di Starknet sebagian besar muncul dari cara kontrak pintar dirancang, tidak banyak dari bahasa itu sendiri.
tr: Kahire, Rust'tan ilham alan son derece güvenli bir dildir. Sizi olası tüm vakaları kapsamaya zorlayan bir şekilde tasarlanmıştır. Starknet'teki güvenlik sorunları çoğunlukla akıllı sözleşme akışlarının dilden çok fazla değil, tasarlanma biçiminden kaynaklanmaktadır.
zh_cn: 开罗是受鲁斯特启发的高度安全的语言。 其设计方式迫使你覆盖所有可能的案例。 史塔克内特的安全问题主要来自智能合同流动的设计方式,而不是语言本身。

source: Adopting a security mindset is the initial step in writing secure smart contracts. Try to always consider all possible scenarios when writing code.
es: Adoptar una mentalidad de seguridad es el paso inicial en la escritura de contratos inteligentes seguros. Trate de considerar siempre todos los escenarios posibles al escribir código.
fr: Adopter un état d'esprit de sécurité est l'étape initiale dans l'écriture de contrats intelligents sécurisés. Essayez de toujours considérer tous les scénarios possibles lors de l'écriture de code.
id: Mengadopsi pola pikir keamanan adalah langkah awal dalam menulis kontrak cerdas yang aman. Cobalah untuk selalu mempertimbangkan semua skenario yang mungkin ketika menulis kode.
tr: Güvenlik zihniyetini benimsemek, güvenli akıllı sözleşmeler yazmanın ilk adımıdır. Kod yazarken her zaman olası tüm senaryoları göz önünde bulundurmaya çalışın.
zh_cn: 采用安全心态是写好安全智能合同的第一步。 尽量在写代码时总是考虑到所有可能的情况。

source: Viewing Smart Contracts as Finite State Machines
es: Viendo contratos inteligentes como máquinas de estado finito
fr: Voir les contrats intelligents comme des machines d'État Finite
id: Memandang Kontrak Cerdas sebagai Mesin Negara Bagian Finite
tr: Akıllı Sözleşmeleri Sonlu Devlet Makineleri Olarak Görmek
zh_cn: 将智能合同视为有限国家机器

source: Transactions in smart contracts are atomic, meaning they either succeed or fail without making any changes.
es: Las transacciones en contratos inteligentes son atómicas, lo que significa que tienen éxito o fracasan sin hacer ningún cambio.
fr: Les transactions dans les contrats intelligents sont atomiques, ce qui signifie qu'elles réussissent ou échouent sans apporter de changements.
id: Transaksi dalam kontrak pintar adalah atom, berarti mereka berhasil atau gagal tanpa membuat perubahan apapun.
tr: Akıllı sözleşmelerdeki işlemler atomiktir, yani herhangi bir değişiklik yapmadan başarılı olurlar veya başarısız olurlar.
zh_cn: 智能合同中的交易是原子交易,意味着它们要么成功,要么失败,不作任何改变。

source: Think of smart contracts as state machines: they have a set of initial states defined by the constructor constraints, and external functions represent a set of possible state transitions. A transaction is nothing more than a state transition.
es: Piense en los contratos inteligentes como máquinas estatales: tienen un conjunto de estados iniciales definidos por las restricciones del constructor, y las funciones externas representan un conjunto de posibles transiciones del estado. Una transacción no es más que una transición del estado.
fr: Considérez les contrats intelligents comme des machines d'état : elles ont un ensemble d'états initiaux définis par les contraintes du constructeur, et les fonctions externes représentent un ensemble de transitions d'état possibles. Une transaction n'est rien de plus qu'une transition d'état.
id: Pikirkan kontrak cerdas sebagai mesin negara: mereka memiliki satu set negara bagian awal didefinisikan oleh batasan konstruktor, dan fungsi eksternal mewakili set kemungkinan transisi negara. transaksi tidak lebih dari transisi negara.
tr: Akıllı sözleşmeleri devlet makineleri olarak düşünün: constructor kısıtlamaları ile tanımlanan bir dizi başlangıç durumu vardır ve harici işlevler bir dizi olası durum geçişini temsil eder. Bir işlem bir devlet geçişinden başka bir şey değildir.
zh_cn: 将智能合同视为国家机器:它们拥有一套由建筑师限制定义的初始状态,外部功能代表一系列可能的状态转型。 交易只不过是国家转型。

source: The `assert!` or `panic!` macros can be used to validate conditions before performing specific actions. You can learn more about these on the [Unrecoverable Errors with panic](./ch09-01-unrecoverable-errors-with-panic.md) page.
es: Las macros `asertar!` o `panic!` se pueden utilizar para validar las condiciones antes de realizar acciones específicas. Puede obtener más información sobre estas en la página [Errores irrecuperables con pánico](./ch09-01-irrecuperable-errors-with-panic.md).
fr: Les macros `assert!` ou `panic!` peuvent être utilisées pour valider les conditions avant d'effectuer des actions spécifiques. Vous pouvez en savoir plus sur celles-ci sur la page [Inrecoverable Errors with panic](./ch09-01-unrecoverable-errors-with-panic.md).
id: Makro dapat digunakan untuk memvalidasi kondisi sebelum melakukan aksi tertentu. Anda dapat mempelajari lebih banyak tentang ini pada halaman [ Error Tak Dapat Dicover dengan panik]./ch09-01-unrecoverable-erers-with-panic.md).
tr: assert! veya panic! makroları, belirli eylemleri gerçekleştirmeden önce koşulları doğrulamak için kullanılabilir. Bunlar hakkında daha fazla bilgiyi [Paniğe sahip kurtarılamaz Hatalar](./ch09-01-unrecoverable-errors-with-panic.md) sayfasından edinebilirsiniz.
zh_cn: `assirt!'或`panic!' 宏可用于在采取具体行动之前验证条件。您可以在[惊慌中无法弥补的错误](./ch09-01-无法恢复的-erors- with-panic.md)页面上了解更多关于这些条件的信息。

source: These validations can include:
es: Estas validaciones pueden incluir:
fr: Ces validations peuvent comprendre:
id: Validasi ini dapat mencakup:
tr: Bu doğrulamalar şunları içerebilir:
zh_cn: 这些验证可包括:

source: Inputs provided by the caller
es: Aportaciones proporcionadas por la persona que llama
fr: Entrées fournies par l'appelant
id: Masukan yang disediakan oleh pemanggil
tr: Arayan tarafından sağlanan girişler
zh_cn: 打电话者提供的投入

source: Execution requirements
es: Requisitos de ejecución
fr: Exigences en matière d'exécution
id: Eksekusi persyaratan
tr: Yürütme gereksinimleri
zh_cn: 执行要求

source: Invariants (conditions that must always be true)
es: Invariantes (condiciones que siempre deben ser ciertas)
fr: Invariants (conditions qui doivent toujours être vraies)
id: Invarian (kondisi yang harus selalu benar)
tr: Değişmeyenler (her zaman doğru olması gereken durumlar)
zh_cn: 变化(条件必须始终是真实的)

source: Return values from other function calls
es: Devuelve valores de otras llamadas a funciones
fr: Valeurs de retour d'autres appels de fonction
id: Nilai kembali dari pemanggilan fungsi lain
tr: Diğer işlev çağrılarından değerleri döndür
zh_cn: 从其他函数调用返回值

source: For example, you could use the `assert!` macro to validate that a user has enough funds to perform a withdraw transaction. If the condition is not met, the transaction will fail and the state of the contract will not change.
es: Por ejemplo, podría utilizar la macro `asertar!` para validar que un usuario tiene fondos suficientes para realizar una transacción de retiro. Si la condición no se cumple, la transacción fallará y el estado del contrato no cambiará.
fr: Par exemple, vous pouvez utiliser la macro `assert!` pour valider qu'un utilisateur dispose de suffisamment de fonds pour effectuer une opération de retrait. Si la condition n'est pas remplie, la transaction échouera et l'état du contrat ne changera pas.
id: Sebagai contoh, Anda bisa menggunakan makro untuk mengesahkan bahwa pengguna memiliki dana yang cukup untuk melakukan transaksi penarikan.
tr: Örneğin, assert! makrosunu kullanarak, bir kullanıcının geri çekme işlemini gerçekleştirmek için yeterli paraya sahip olduğunu doğrulayabilirsiniz. Durum karşılanmazsa, işlem başarısız olur ve sözleşmenin durumu değişmez.
zh_cn: 例如,您可以使用`assirt!'宏来验证用户是否有足够资金进行撤回交易。如果不符合条件,交易就会失败,合同状况也不会改变。

source: "Insufficient funds"
es: "Fondos insuficientes"
fr: "Insuffisance des fonds"
id: "Dana tidak cukup"
tr: "Yetersiz fonlar"
zh_cn: “资金不足资金”

source: Using these functions to check conditions adds constraints that help clearly define the boundaries of possible state transitions for each function in your smart contract. These checks ensure that the behavior of the contract stays within the expected limits.
es: El uso de estas funciones para comprobar las condiciones añade restricciones que ayudan a definir claramente los límites de las posibles transiciones de estado para cada función en su contrato inteligente. Estas comprobaciones aseguran que el comportamiento del contrato se mantenga dentro de los límites esperados.
fr: L'utilisation de ces fonctions pour vérifier les conditions ajoute des contraintes qui aident à définir clairement les limites des transitions d'état possibles pour chaque fonction de votre contrat intelligent. Ces vérifications garantissent que le comportement du contrat reste dans les limites prévues.
id: Menggunakan fungsi ini untuk memeriksa kondisi menambah batasan yang membantu dengan jelas menentukan batas kemungkinan transisi keadaan untuk setiap fungsi dalam kontrak pintar Anda. Cek ini memastikan bahwa perilaku kontrak tetap dalam batas yang diharapkan.
tr: Koşulları kontrol etmek için bu işlevleri kullanmak, akıllı sözleşmenizdeki her bir işlev için olası durum geçişlerinin sınırlarını açıkça tanımlamaya yardımcı olan kısıtlamalar ekler. Bu kontroller, sözleşmenin davranışının beklenen sınırlar içinde kalmasını sağlar.
zh_cn: 使用这些功能来检查条件会增加一些限制,有助于明确界定您智能合同中每项功能可能发生国家过渡的界限。 这些检查确保了合同行为保持在预期限度内。

source: Recommendations
es: Recomendaciones
fr: Recommandations
id: Rekomendasi
tr: Öneriler
zh_cn: 建议建议建议建议建议建议建议

source: Checks Effects Interactions Pattern
es: Controla el Patrón de Interacciones de Efectos
fr: Contrôle des effets Interactions Pattern
id: Memeriksa Dampak Pola Interaksi
tr: Kontroller Etkiler Etkileşimler Desen
zh_cn: 检查效果互动模式

source: The Checks Effects Interactions pattern is a common design pattern used to prevent reentrancy attacks on Ethereum. While reentrancy is harder to achieve in Starknet, it is still recommended to use this pattern in your smart contracts.
es: El patrón Checks Effects Interactions es un patrón de diseño común utilizado para prevenir los ataques de reentrancy en Ethereum. Aunque la reentrancy es más difícil de lograr en Starknet, se recomienda seguir usando este patrón en sus contratos inteligentes.
fr: Le modèle Checks Effects Interactions est un modèle de conception commun utilisé pour prévenir les attaques de réentrance sur Ethereum. Bien que la réentrance est plus difficile à réaliser dans Starknet, il est toujours recommandé d'utiliser ce modèle dans vos contrats intelligents.
id: pola Checks Effects Interactions adalah pola desain umum yang digunakan untuk mencegah serangan reentrancy pada Etherum. sementara reentrancy lebih sulit untuk dicapai di Starknet, masih disarankan untuk menggunakan pola ini dalam kontrak cerdas Anda.
tr: Checks Effects Interactions deseni, Ethereum'a yeniden giriş saldırılarını önlemek için kullanılan yaygın bir tasarım desenidir. Starknet'te yeniden giriş yapmak daha zor olsa da, akıllı sözleşmelerinizde bu deseni kullanmanız önerilir.
zh_cn: 检查效果相互作用模式是一种常见的设计模式,用来防止Etheum再次受到攻击。虽然在斯塔克内特很难实现再现,但仍建议在你的智能合同中使用这种模式。

source: The pattern consists of following a specific order of operations in your functions:
es: El patrón consiste en seguir un orden específico de operaciones en sus funciones:
fr: Le modèle consiste à suivre un ordre spécifique d'opérations dans vos fonctions:
id: Pola terdiri dari mengikuti urutan spesifik operasi dalam fungsi Anda:
tr: Kalıp, işlevlerinizdeki belirli bir işlem sırasını takip etmekten oluşur:
zh_cn: 该模式包括按您职务中具体操作顺序排列的操作模式:

source: **Checks**: Validate all conditions and inputs before performing any state changes.
es: **Comprobaciones**: Validar todas las condiciones e entradas antes de realizar cualquier cambio de estado.
fr: **Checks**: Valider toutes les conditions et entrées avant d'effectuer des changements d'état.
id: **Checks**: Validate semua kondisi dan masukan sebelum melakukan perubahan keadaan.
tr: **Kontroller**: Herhangi bir durum değişikliği gerçekleştirmeden önce tüm koşulları ve girdileri doğrulayın.
zh_cn: ** 检查**:在进行任何状态变化之前,验证所有条件和投入。

source: **Effects**: Perform all state changes.
es: **Efectos**: Realizar todos los cambios de estado.
fr: **Effets**: Effectuez tous les changements d'état.
id: ** Effects**: Lakukan semua perubahan keadaan.
tr: **Efektler**: Tüm durum değişikliklerini gerçekleştirin.
zh_cn: ** 效果**:进行所有状态变化。

source: **Interactions**: All external calls to other contracts should be made at the end of the function.
es: ** Interacciones**: Todas las llamadas externas a otros contratos deben hacerse al final de la función.
fr: **Interactions**: Tous les appels externes à d'autres contrats doivent être effectués à la fin de la fonction.
id: Semua panggilan eksternal ke kontrak lain harus dibuat pada akhir fungsi.
tr: **İşlemler**: Diğer sözleşmelere yapılan tüm dış aramalar fonksiyonun sonunda yapılmalıdır.
zh_cn: ** 互动**:所有向其他合同发出的外部电话都应在职能结束时发出。

source: Access Control
es: Control de acceso
fr: Contrôle d'accès
id: Kontrol Akses
tr: Erişim Kontrolü
zh_cn: 出入控制

source: Access control is the process of restricting access to certain features or resources. It is a common security mechanism used to prevent unauthorized access to sensitive information or actions. In smart contracts, some functions may often be restricted to specific users or roles.
es: El control de acceso es el proceso de restringir el acceso a ciertas características o recursos. Es un mecanismo de seguridad común utilizado para prevenir el acceso no autorizado a información o acciones sensibles. En contratos inteligentes, algunas funciones pueden estar a menudo restringidas a usuarios o roles específicos.
fr: Le contrôle d'accès est le processus de restriction de l'accès à certaines fonctionnalités ou ressources. Il s'agit d'un mécanisme de sécurité commun utilisé pour empêcher l'accès non autorisé à des informations ou à des actions sensibles.
id: Kendali akses adalah proses membatasi akses ke fitur atau sumber daya tertentu. Ini adalah mekanisme keamanan umum yang digunakan untuk mencegah akses yang tidak sah terhadap informasi atau aksi yang sensitif. Dalam kontrak cerdas, beberapa fungsi sering kali dibatasi oleh pengguna atau peran tertentu.
tr: Erişim kontrolü, belirli özelliklere veya kaynaklara erişimi kısıtlama işlemidir. Hassas bilgilere veya eylemlere yetkisiz erişimi önlemek için kullanılan yaygın bir güvenlik mekanizmasıdır. Akıllı sözleşmelerde, bazı işlevler genellikle belirli kullanıcılar veya rollerle sınırlandırılabilir.
zh_cn: 出入控制是限制获取某些特征或资源的过程,是用来防止未经授权获取敏感信息或行动的一个共同安全机制,在智能合同中,某些职能往往仅限于特定的用户或角色。

source: You can implement the access control pattern to easily manage permissions. This pattern consists of defining a set of roles and assigning them to specific users. Each function can then be restricted to specific roles.
es: Puede implementar el patrón de control de acceso para administrar fácilmente los permisos. Este patrón consiste en definir un conjunto de roles y asignarlos a usuarios específicos. Cada función puede restringirse a roles específicos.
fr: Vous pouvez implémenter le modèle de contrôle d'accès pour gérer facilement les permissions. Ce modèle consiste à définir un ensemble de rôles et à les assigner à des utilisateurs spécifiques. Chaque fonction peut alors être limitée à des rôles spécifiques.
id: Anda dapat mengimplementasikan pola kendali akses untuk mengelola hak akses dengan mudah. Pola ini terdiri dari mendefinisikan satu set peran dan memberikannya kepada pengguna tertentu. Setiap fungsi dapat dibatasi untuk peran spesifik.
tr: İzinleri kolayca yönetmek için erişim kontrol modelini uygulayabilirsiniz. Bu kalıp, bir dizi rolü tanımlamak ve belirli kullanıcılara atamaktan oluşur. Her işlev daha sonra belirli rollerle sınırlandırılabilir.
zh_cn: 您可以使用访问控制模式来方便地管理权限。这个模式包括定义一组角色并将其分配给特定的用户。然后,每个功能可以局限于特定的角色。

source: // Role 'owner': only one address
es: // Rol 'propietario': sólo una dirección
fr: // Rôle 'propriétaire' : une seule adresse
id: //Kehendak 'owner': hanya satu alamat
tr: // Rol'sahibi': sadece bir adres
zh_cn: 角色“所有人”:只有一个地址

source: // Role 'role_a': a set of addresses
es: // Rol 'role_a': un conjunto de direcciones
fr: // Rôle 'role_a' : un ensemble d'adresses
id: //Gabung 'role_a': satu set alamat
tr: // Rol 'role_a': bir dizi adres
zh_cn: 角色“作用_a”:一套地址

source: // Guard functions to check roles
es: // Funciones de guardia para comprobar roles
fr: // Fonctions de garde pour vérifier les rôles
id: //Guard fungsi untuk memeriksa peran
tr: // Rolleri kontrol etmek için Guard fonksiyonları
zh_cn: / 警卫职能检查角色

source: "Not owner"
es: "No es dueño"
fr: "Pas propriétaire"
id: "Bukan pemilik"
tr: "Sahibi değil"
zh_cn: "不是所有者"

source: "Not role A"
es: "No papel A"
fr: "Pas le rôle A"
tr: "A rolü değil"
zh_cn: "不是角色A"

source: // You can easily combine guards to perform complex checks
es: // Usted puede combinar fácilmente guardias para realizar comprobaciones complejas
fr: // Vous pouvez facilement combiner des gardes pour effectuer des vérifications complexes
id: //Anda dapat dengan mudah menggabungkan penjaga untuk melakukan pemeriksaan kompleks
tr: // Kolayca karmaşık kontroller yapmak için muhafızları birleştirebilirsiniz
zh_cn: 你可以很容易地把警卫合在一起 来进行复杂的检查

source: "Not allowed"
es: "No se permite"
fr: "Non autorisé"
id: "Tidak diperbolehkan"
tr: "İzin verilmiyor"
zh_cn: "不允许"

source: // Functions to manage roles
es: // Funciones para administrar roles
fr: // Fonctions de gestion des rôles
id: / Fungsi untuk mengelola peran
tr: // Rolleri yönetmek için fonksiyonlar
zh_cn: / 管理作用的职能

source: // You can now focus on the business logic of your contract // and reduce the complexity of your code by using guard functions
es: // Ahora puede centrarse en la lógica de negocio de su contrato // y reducir la complejidad de su código mediante el uso de funciones de guardia
fr: // Vous pouvez maintenant vous concentrer sur la logique commerciale de votre contrat // et réduire la complexité de votre code en utilisant des fonctions de garde
id: /Anda sekarang dapat fokus pada logika bisnis kontrak Anda / / dan mengurangi kompleksitas kode Anda dengan menggunakan fungsi penjaga
tr: // Artık sözleşmenizin iş mantığına odaklanabilirsiniz // ve koruma işlevlerini kullanarak kodunuzun karmaşıklığını azaltabilirsiniz
zh_cn: 现在您可以关注您的合同的商业逻辑 并且通过使用警卫功能 降低您的代码的复杂性

source: Testing smart contracts is a critical part of the development process. It is important to ensure that smart contracts behave as expected and that they are secure.
es: La prueba de contratos inteligentes es una parte crítica del proceso de desarrollo. Es importante garantizar que los contratos inteligentes se comporten como se esperaba y sean seguros.
fr: La mise à l'essai de contrats intelligents est un élément essentiel du processus de développement. Il est important de s'assurer que les contrats intelligents se comportent comme prévu et qu'ils sont sécurisés.
id: Menguji kontrak cerdas adalah bagian penting dari proses pengembangan penting untuk memastikan kontrak cerdas berperilaku seperti yang diharapkan dan bahwa mereka aman.
tr: Akıllı sözleşmelerin test edilmesi, geliştirme sürecinin kritik bir parçasıdır. Akıllı sözleşmelerin beklendiği gibi davranmasını ve güvenli olmasını sağlamak önemlidir.
zh_cn: 测试智能合同是发展进程的一个关键部分,必须确保智能合同按预期行事,并确保其安全。

source: In a previous section of the Cairo Book, we learned how to write and structure our tests for Cairo programs. We demonstrated how these tests could be run using the `scarb` command-line tool. While this approach is useful for testing standalone Cairo programs and functions, it lacks functionality for testing smart contracts that require control over the contract state and execution context. Therefore, in this section, we will introduce how to use Starknet Foundry, a smart contract development toolchain for Starknet, to test your Cairo contracts.
es: En una sección anterior del Libro de El Cairo, aprendimos a escribir y estructurar nuestras pruebas para los programas de El Cairo. Demostramos cómo estas pruebas podrían ejecutarse utilizando la herramienta de línea de comandos `scarb`. Si bien este enfoque es útil para probar programas y funciones de El Cairo independientes, carece de funcionalidad para probar contratos inteligentes que requieren control sobre el estado del contrato y el contexto de ejecución. Por lo tanto, en esta sección, vamos a introducir cómo utilizar Starknet Foundry, una cadena de herramientas de desarrollo de contratos inteligentes para Starknet, para probar sus contratos de El Cairo.
fr: Dans une section précédente du livre du Caire, nous avons appris comment écrire et structurer nos tests pour les programmes du Caire. Nous avons démontré comment ces tests pouvaient être exécutés à l'aide de l'outil de ligne de commande `scarb`. Bien que cette approche soit utile pour tester les programmes et fonctions du Caire autonome, il manque de fonctionnalité pour tester des contrats intelligents qui nécessitent un contrôle sur l'état du contrat et le contexte d'exécution.
id: Dalam bagian sebelumnya dari Kairo Book, kami belajar cara menulis dan menstruktur tes kami untuk program Kairo. kami menunjukkan bagaimana tes ini dapat dijalankan menggunakan alat baris perintah. kami akan memperkenalkan cara menggunakan Starknet Foundry, sebuah alat pengembangan kontrak cerdas bagi Starknet, untuk menguji kontrak Anda di Kairo.
tr: Kahire Kitabı'nın önceki bir bölümünde, Kahire programları için testlerimizi nasıl yazacağımızı ve yapılandıracağımızı öğrendik. Bu testlerin scarb komut satırı aracını kullanarak nasıl yürütülebileceğini gösterdik. Bu yaklaşım bağımsız Kahire programlarını ve işlevlerini test etmek için kullanışlı olsa da, sözleşme durumu ve yürütme bağlamı üzerinde kontrol gerektiren akıllı sözleşmeleri test etmek için işlevsellikten yoksundur. Bu nedenle, bu bölümde, Starknet Foundry, akıllı bir sözleşme geliştirme aracı olarak nasıl kullanılacağını tanıtacağız.
zh_cn: 在《开罗书》前一节,我们学会了如何写作和构建开罗程序测试。我们展示了这些测试如何使用“切割”指令线工具进行。这种方法虽然有助于测试独立的开罗程序和功能,但缺乏测试需要控制合同状态和执行背景的智能合同的功能。因此,在本节中,我们将介绍如何使用斯塔克内特·菲茨里(Starknet Foundry)这个为斯塔克内特设计的智能合同开发工具链来测试您的开罗合同。
