Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: **The `use` keyword**: Within a scope, the `use` keyword creates shortcuts to items to reduce repetition of long paths. In any scope that can refer to `backyard::garden::vegetables::Asparagus`, you can create a shortcut with `use backyard::garden::vegetables::Asparagus;` and from then on you only need to write `Asparagus` to make use of that type in the scope.
es: ** La palabra clave `use`**: Dentro de un alcance, la palabra clave `use` crea atajos a los elementos para reducir la repetición de rutas largas. En cualquier ámbito que pueda referirse a `backyard::garden::vegetables::Asparagus`, se puede crear un atajo con `use backdoor::garden::vegetables::Asparagus;` y a partir de entonces sólo es necesario escribir `Asparagus` para hacer uso de ese tipo en el alcance.
fr: **Le mot-clé `use`**: Dans une portée, le mot-clé `use` crée des raccourcis vers des éléments pour réduire la répétition de longs chemins. Dans toute portée qui peut se référer à `backyard::garden::vegetables::Asparagus`, vous pouvez créer un raccourci avec `use backyard::garden::vegetables::Asparagus;` et à partir de là, vous devez seulement écrire `Asparagus` pour utiliser ce type dans la portée.
id: * Kata kunci yang digunakan: Dalam lingkup, kata kunci yang digunakan dapat membuat jalan pintas untuk mengurangi pengulangan jalur yang panjang. Dalam ruang lingkup yang dapat mengacu ke halaman belakang: Gardenen::vegeles: Asparagus::: Asparagus, Anda dapat membuat jalan pintas dengan halaman belakang thoseus::::::veables:: Asparagus; dan mulai saat itu Anda hanya perlu menulis ▪Asparagaux untuk membuat tipe tersebut dalam ruang lingkup.
tr: ** use anahtar kelimesi **: Bir kapsam dahilinde, use anahtar kelimesi, uzun yolların tekrarını azaltmak için öğelere kısayollar oluşturur. backyard::garden::vegetables::Asparagus'a atıfta bulunabilecek herhangi bir kapsamda, use arka bahçesi:garden:::getables:::::Asparagus; ile bir kısayol oluşturabilirsiniz ve o andan itibaren yalnızca As'ı yazmanız gerekir.
zh_cn: ** `使用'关键词**:在范围范围内,`使用'关键词为减少长路重复的项目创造捷径。在任何可提及`后院:园林::蔬菜::Asparagus'的任何范围内,你可以用`后院:园林:蔬菜:Asparagus;'创建一个捷径,从此以后,您只需在范围内使用“Asparagus”。

source: Here we create a crate named `backyard` that illustrates these rules. The crate’s directory, also named `backyard`, contains these files and directories:
es: Aquí creamos una caja llamada `backyard` que ilustra estas reglas. El directorio de la caja, también llamado `backyard`, contiene estos archivos y directorios:
fr: Ici, nous créons une caisse nommée `backyard` qui illustre ces règles. Le répertoire de caisse, également nommé `backyard`, contient ces fichiers et répertoires:
id: Di sini kita membuat sebuah peti bernama °backyard yang menggambarkan aturan-aturan ini.
tr: Burada bu kuralları gösteren backyard adlı bir sandık oluşturuyoruz. backyard olarak da adlandırılan sandığın dizini şu dosyaları ve dizinleri içerir:
zh_cn: 在这里,我们创建了一个名为`后院'的箱子,用以说明这些规则。

source: The crate root file in this case is _src/lib.cairo_, and it contains:
es: El archivo raíz de caja en este caso es _src/lib.cairo_, y contiene:
fr: Le fichier racine de caisse dans ce cas est _src/lib.cairo_, et il contient :
id: Berkas root peti dalam kasus ini adalah _src/lib.cairo_, dan berisi:
tr: Bu durumda sandık kök dosyası _src/lib.cairo_'dir ve şunları içerir:
zh_cn: 本案中的箱根文件是_src/lib.cairo_,包含:

source: "I'm growing {:?}!"
es: "¡Estoy creciendo!"
fr: "Je grandis {:?}!"
id: "Aku tumbuh [:]!"
tr: "Büyüyorum :?!"
zh_cn: "我正在成长♪♪♪♪♪♪♪♪♪♪我正在成长♪♪♪♪♪♪我正在成长♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪我正在成长♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪

source: The `pub mod garden;` line imports the `garden` module. Using `pub` to make `garden` publicly accessible, or `pub(crate)` if you really want to make `garden` only available for your crate, is optional to run our program here, as the `main` function resides in the same module as `pub mod garden;` declaration. Nevertheless, not declaring `garden` as `pub` will make it not accessible from any other package. This line tells the compiler to include the code it finds in _src/garden.cairo_, which is:
es: El `pub mod garden;` line importa el módulo `jardín`. Usar `pub` para hacer que `jardín` sea accesible al público, o `pub(crate)` si realmente desea poner `jardín` sólo disponible para su caja, es opcional para ejecutar nuestro programa aquí, ya que la función `main` reside en el mismo módulo que `pub mod garden;` declaración. Sin embargo, no declarar `jardín` como `pub` hará que no sea accesible desde ningún otro paquete. Esta línea le dice al compilador que incluya el código que encuentra en _src/garden.cairo_, que es:
fr: La ligne `pub mod Garden;` importe le module `garden`. L`utilisation de `pub` pour rendre `garden` accessible au public, ou `pub(create)` si vous voulez vraiment rendre `garden` disponible uniquement pour votre caisse, est facultative pour exécuter notre programme ici, car la fonction `main` réside dans le même module que `pub mod Garden;` déclaration. Néanmoins, ne pas déclarer `garden` comme `pub` ne le rendra pas accessible à partir d`un autre paquet. Cette ligne indique au compilateur d`inclure le code qu`il trouve dans _src/garden.cairo_, qui est:
id: Dengan menggunakan modul 'copub mod garden' untuk membuat akses publik, atau 'pub://crate' jika Anda benar-benar ingin membuat 'production' hanya tersedia untuk peti Anda, adalah pilihan untuk menjalankan program kami di sini, sebagai fungsi ▪mainan' berada di modul yang sama dengan modifikasi kebun; walaupun demikian, tidak menyatakan (trbi) sebagai ·bub 1932 yang tidak akan membuatnya dapat diakses dari paket lain. Garis ini berisi kode untuk menemukan _s / erc / ergard_, yang mana.
tr: pub mod bahce; line, garden modülünü ithal eder. pub'yi kamuya açık hale getirmek için pub veya pub(crate) kullanmak, garden'i yalnızca kasanız için kullanılabilir hale getirmek istiyorsanız, main işlevinin diğer pub mod bahçesi ile aynı modülde yer aldığı gibi, burada da programımızı çalıştırmak isteğe bağlıdır.
zh_cn: `pub mod花园;`线条进口`garden' 模块;使用`pub'使`garden'向公众开放,或`pub(crate) ',如果你真想将`garden'只供你的箱子使用,就可选择在这里运行我们的程序,因为`主要'功能与`pub mod花园;`声明'一样,存在于同一个模块中。然而,不宣布`garden'为`pub'将使它无法从任何其他软件包中检索。

source: <span class="filename">Filename: src/garden.cairo</span>
fr: <span class="filename">Nom du fichier: src/garden.cairo</span>
id: <nama berkas="pan"> Nama berkas: src/garden.cairo</span>
tr: span class="filename">Dosya adı: src/garden.cairo/span>
zh_cn: <span类="filename" >Filename: src/garden.cairo </span>

source: Here, `pub mod vegetables;` means the code in _src/garden/vegetables.cairo_ is included too. That code is:
es: Aquí, `pub mod verduras;` significa que el código en _src/garden/vegetables.cairo_ también está incluido. Ese código es:
fr: Ici, `pub mod légumes;` signifie le code dans _src/garden/végétables.cairo_ est également inclus. Ce code est:
id: Ini, sayuran mod åpub; itu berarti kode dalam _src/garden/vegetables.cairo_ termasuk juga.
tr: Burada, pub mod sebzeleri; _src/garden/vegetables.cairo_ içindeki kodu da içerir. Bu kod:
zh_cn: 这里,`pub mod 蔬菜;'是指_src/garden/vegetables.cairo_中的代码也包括在内。

source: The line `use garden::vegetables::Asparagus;` lets us bring the `Asparagus` type into scope, so we can use it in the `main` function.
es: La línea `usar jardín::vegetables::Asparagus;` nos permite traer el tipo `Asparagus` en el alcance, por lo que podemos utilizarlo en la función `main`.
fr: La ligne `utiliser jardin::végétables::Asparagus;` nous permet d'apporter le type `Asparagus` dans la portée, afin que nous puissions l'utiliser dans la fonction `main`.
id: Barisan kebun åuse:: vegetables: Asparagus; lets us bring the åAsparagus type into scope, so we can use it in the åmain function.
tr: use garden::vegetables::Asparagus; satırı Asparagus tipini kapsam içine sokmamıza izin verir, böylece main işlevinde kullanabiliriz.
zh_cn: `使用花园::蔬菜::Asparagus;`让我们将`Asparagus'类型纳入范围,这样我们就可以在`主要'功能中使用。

source: Now let’s get into the details of these rules and demonstrate them in action!
es: Ahora vamos a entrar en los detalles de estas reglas y demostrarlas en acción!
fr: Maintenant, laissez-nous entrer dans les détails de ces règles et de les démontrer en action!
id: Sekarang, mari kita bahas perincian peraturan - aturan ini dan mempertunjukkan tindakan mereka!
tr: Şimdi bu kuralların ayrıntılarına girelim ve bunları eylemde gösterelim!
zh_cn: 现在让我们讨论这些规则的细节,

source: Grouping Related Code in Modules
es: Agrupar código relacionado en módulos
fr: Grouper le code associé dans les modules
id: Kode Berkaitan Kelompok dalam Modul
tr: Modüllerde İlgili Kodu Gruplama
zh_cn: 模块中分组相关代码

source: _Modules_ let us organize code within a crate for readability and easy reuse. Modules also allow us to control the privacy of items, because code within a module is private by default. Private items are internal implementation details not available for outside use. We can choose to make modules and the items within them public, which exposes them to allow external code to use and depend on them.
es: _Módulos_ vamos a organizar código dentro de una caja para legibilidad y fácil reutilización. Los módulos también nos permiten controlar la privacidad de los elementos, porque el código dentro de un módulo es privado por defecto. Los elementos privados son detalles de implementación interna no disponibles para uso externo. Podemos elegir hacer que los módulos y los elementos dentro de ellos sean públicos, lo que los expone para permitir que el código externo los use y dependa de ellos.
fr: _Modules_ Organisons le code dans une caisse pour une lisibilité et une réutilisation facile. Les modules nous permettent également de contrôler la confidentialité des éléments, car le code dans un module est privé par défaut. Les éléments privés sont des détails d'implémentation interne non disponibles pour une utilisation externe. Nous pouvons choisir de rendre les modules et les éléments qui les composent publics, ce qui les expose pour permettre l'utilisation du code externe et en dépendre.
id: _Modules_ mari kita mengatur kode dalam sebuah peti untuk dibaca kembali dan mudah digunakan. Modul juga memungkinkan kita untuk mengontrol privasi item, karena kode dalam modul adalah privat secara baku. Objek pribadi adalah rincian implementasi internal yang tidak tersedia untuk penggunaan luar. Kita dapat memilih untuk membuat modul dan item di dalamnya publik, yang mengekspos mereka untuk mengijinkan kode eksternal untuk digunakan dan bergantung pada mereka.
tr: _Modüller_ okunabilirlik ve kolay yeniden kullanım için bir sandık içinde kod düzenlememize izin verin. Modüller ayrıca öğelerin gizliliğini kontrol etmemize izin verir, çünkü bir modül içindeki kod varsayılan olarak özeldir. Özel öğeler, harici kullanım için mevcut olmayan dahili uygulama ayrıntılarıdır. Modülleri ve bunların içindeki öğeleri halka açık hale getirmeyi seçebiliriz, bu da harici kodun kullanılmasına izin verir ve bunlara bağlıdır.
zh_cn: _Modules_让我们在箱内组织可读性和易于再利用的代码。模块还允许我们控制项目的隐私,因为模块中的代码默认是私有的。私有项目是内部执行细节,外部无法使用。我们可以选择将模块和其中的项目公开,让它们使用外部代码并依赖它们。

source: As an example, let’s write a library crate that provides the functionality of a restaurant. We’ll define the signatures of functions but leave their bodies empty to concentrate on the organization of the code, rather than the implementation of a restaurant.
es: Como ejemplo, vamos a escribir una caja de la biblioteca que proporciona la funcionalidad de un restaurante. Vamos a definir las firmas de las funciones, pero dejar sus cuerpos vacíos para concentrarse en la organización del código, en lugar de la implementación de un restaurante.
fr: À titre d'exemple, nous allons écrire une caisse de bibliothèque qui fournit la fonctionnalité d'un restaurant. Nous allons définir les signatures des fonctions mais laisser leur corps vide pour se concentrer sur l'organisation du code, plutôt que l'implémentation d'un restaurant.
id: Sebagai contoh, mari kita tulis sebuah peti perpustakaan yang menyediakan fungsi sebuah restoran.
tr: Örnek olarak, bir restoranın işlevselliğini sağlayan bir kütüphane kasası yazalım. Fonksiyonların imzalarını tanımlayacağız, ancak vücutlarını bir restoranın uygulanmasından ziyade kodun organizasyonuna konsantre olmak için boş bırakacağız.
zh_cn: 举例来说,让我们写一个提供餐厅功能的图书馆箱。 我们将定义功能的签名,但让身体空空无一人,专心于代码的组织,而不是餐厅的实施。

source: In the restaurant industry, some parts of a restaurant are referred to as _front of house_ and others as _back of house_. Front of house is where customers are; this encompasses where the hosts seat customers, servers take orders and payment, and bartenders make drinks. Back of house is where the chefs and cooks work in the kitchen, dishwashers clean up, and managers do administrative work.
es: En la industria de los restaurantes, algunas partes de un restaurante se conocen como _front of house_ y otras como _back of house_. Front of house es donde están los clientes; esto abarca donde los anfitriones se sientan los clientes, los servidores reciben pedidos y pagos, y los camareros hacen bebidas. Back of house es donde los chefs y cocineros trabajan en la cocina, lavaplatos limpian, y los gerentes hacen trabajo administrativo.
fr: Dans l'industrie de la restauration, certaines parties d'un restaurant sont appelées _front de maison_ et d'autres comme _back de maison_. Le devant de la maison est où se trouvent les clients; cela comprend où les clients de siège d'hôte, les serveurs prennent les commandes et le paiement, et les barmans font des boissons.
id: Dalam industri restoran, beberapa bagian dari sebuah restoran disebut _front of house_ and others as _back of house_. Front of house is where custoers are; this melingles where the host seat pelanggan, server mengambil pesanan dan pembayaran, dan bartender membuat minuman. Back of house is where the chefs and cooks works in the kitry, pencuci piring membersihkan, dan manajer melakukan pekerjaan administratif.
tr: Restoran endüstrisinde, bir restoranın bazı kısımları _ house_ ve diğerleri _back of house_ olarak adlandırılır. Evin ön tarafı müşterilerin olduğu yerdir; bu, ev sahibi koltuk müşterilerinin, sunucuların sipariş ve ödeme aldığı ve barmenlerin içki yaptığı yerleri kapsar. Evin arkası, şeflerin ve aşçıların mutfakta çalıştığı, bulaşık makinelerinin temizlendiği ve yöneticilerin idari işler yaptığı yerdir.
zh_cn: 在餐饮业中,餐馆的某些部分被称为“前门”,其他部分称为“后门”,而其他部分则称为“后门”。 住前门是顾客所在的地方;这包括接待座位顾客、服务员接受订单和付款以及酒保饮酒的地方。 后门是厨师和厨师在厨房工作的地方,洗碗者清洁,管理人员做行政工作。

source: To structure our crate in this way, we can organize its functions into nested modules. Create a new package named _restaurant_ by running `scarb new restaurant`; then enter the code in Listing 7-1 into _src/lib.cairo_ to define some modules and function signatures. Here’s the front of house section:
es: Para estructurar nuestra caja de esta manera, podemos organizar sus funciones en módulos anidados. Cree un nuevo paquete llamado _restaurant_ ejecutando `scarb new restaurant`; a continuación, introduzca el código en Listar 7-1 en _src/lib.cairo_ para definir algunos módulos y firmas de funciones. Aquí está la parte delantera de la sección de casa:
fr: Pour structurer notre caisse de cette façon, nous pouvons organiser ses fonctions en modules imbriqués. Créez un nouveau paquet nommé _restaurant_ en exécutant `scarb new restaurant`; puis entrez le code dans Listing 7-1 dans _src/lib.cairo_ pour définir certains modules et signatures de fonctions. Voici la section avant de la maison:
id: Untuk menyusun peti dengan cara ini, kita dapat mengatur fungsinya ke modul nested. Buat paket baru bernama _restaurant_ dengan menjalankan restoran baru åscarb; kemudian masukkan kode dalam Listing 7-1 ke _src/lib.cairo_ untuk menentukan beberapa modul dan tanda-tangan fungsi. Di sini sini adalah bagian depan daerah rumah:
tr: Sandıklarımızı bu şekilde yapılandırmak için işlevlerini iç içe modüller halinde düzenleyebiliriz. scarb new restaurant çalıştırarak _restaurant_ adında yeni bir paket oluşturun; daha sonra bazı modülleri ve işlev imzalarını tanımlamak için 7-1 numaralı Listeleme kodunu _src/lib.cairo_ içine girin. İşte ev bölümünün ön kısmı:
zh_cn: 要以这种方式构建我们的箱子, 我们可以将其功能组织成嵌入的模块。 通过运行“ 碎纸新餐厅” 创建一个名为 restaurant 的新软件包; 然后将列表 7-1 中的代码输入 _src/lib.cairo_ 以定义某些模块和功能签名。 下面是房子区域前面的部分 :

source: <span class="caption">Listing 7-1: A `front_of_house` module containing other modules that then contain functions</span>
es: <span class="caption">Lista 7-1: Un módulo `front_of_house` que contiene otros módulos que luego contienen funciones</span>
fr: <span class="caption">Liste 7-1: Un module `front_of_house` contenant d'autres modules qui contiennent ensuite des fonctions</span>
id: <span class="caption">Listing 7-1: Sebuah modul di muka_of_house# yang berisi modul lain yang kemudian berisi fungsi</span>
tr: span class="caption">Liste 7-1: Daha sonra işlevleri içeren diğer modülleri içeren bir front_of_house modülü/span>
zh_cn: <span类=“Caption” > listing 7-1: “front_of_house” 模块,包含其他模块,然后包含函数 </span>

source: We define a module with the `mod` keyword followed by the name of the module (in this case, `front_of_house`). The body of the module then goes inside curly brackets. Inside modules, we can place other modules, as in this case with the modules `hosting` and `serving`. Modules can also hold definitions for other items, such as structs, enums, constants, traits, and functions.
es: Definimos un módulo con la palabra clave `mod` seguida del nombre del módulo (en este caso, `front_of_house`). El cuerpo del módulo va entonces dentro de los corchetes rizados. Dentro de los módulos, podemos colocar otros módulos, como en este caso con los módulos `hosting` y `serving`. Los módulos también pueden contener definiciones para otros elementos, como structs, enums, constantes, rasgos y funciones.
fr: Nous définissons un module avec le mot-clé `mod` suivi du nom du module (dans ce cas, `front_of_house`). Le corps du module entre ensuite entre crochets. À l'intérieur des modules, nous pouvons placer d'autres modules, comme dans ce cas avec les modules `hosting` et `serving`. Les modules peuvent également contenir des définitions pour d'autres éléments, tels que structs, enums, constantes, traits et fonctions.
id: Kami mendefinisikan modul dengan kata kunci ·modà diikuti dengan nama modul (dalam hal ini, di depan_of_house). Tubuh modul kemudian masuk ke dalam braket keriting. Di dalam modul, kita dapat menempatkan modul lain, seperti dalam hal ini modul-modil ·hosting, dan ▪serviderà. Modul-modulasi juga dapat menyimpan definisi untuk hal-hal lain, seperti struktur, enum, konstanta, karakter, dan fungsi.
tr: mod anahtar kelimesi ile modülün adını takip eden bir modül tanımlıyoruz (bu durumda, front_of_house). Modülün gövdesi daha sonra kıvırcık parantezlerin içine girer. Modüllerin içine, bu durumda hosting ve serving modüllerinde olduğu gibi başka modüller yerleştirebiliriz. Modüller ayrıca structs, enums, sabit fonksiyonlar, özellikler gibi diğer öğeler için de tanım tutabilir.
zh_cn: 我们定义模块时使用“模式”关键字,然后是模块的名称(此处指的是`front_of_house')。模块的正文放在卷轴内。在模块内,我们可以放置其他模块,如模块“托管”和`serve'。模块还可以保留其他项目的定义,如结构、圆柱、常数、特性和函数。

source: By using modules, we can group related definitions together and name why they’re related. Programmers using this code can navigate the code based on the groups rather than having to read through all the definitions, making it easier to find the definitions relevant to them. Programmers adding new functionality to this code would know where to place the code to keep the program organized.
es: Mediante el uso de módulos, podemos agrupar definiciones relacionadas y nombrar por qué están relacionadas. Los programadores que utilizan este código pueden navegar el código basado en los grupos en lugar de tener que leer a través de todas las definiciones, lo que hace más fácil encontrar las definiciones relevantes para ellos. Los programadores que agregan nueva funcionalidad a este código sabrían dónde colocar el código para mantener el programa organizado.
fr: En utilisant des modules, nous pouvons regrouper les définitions liées et nommer pourquoi elles sont liées. Les programmeurs utilisant ce code peuvent naviguer sur le code basé sur les groupes plutôt que d'avoir à lire toutes les définitions, ce qui facilite la recherche des définitions qui leur sont pertinentes. Les programmeurs ajoutant de nouvelles fonctionnalités à ce code sauront où placer le code pour garder le programme organisé.
id: Dengan menggunakan modul, kita dapat menghubungkan definisi bersama-sama dan nama mengapa mereka terkait. Programmer menggunakan kode ini dapat menavigasi kode berdasarkan pada kelompok daripada harus membaca melalui semua definisi, membuatnya lebih mudah untuk menemukan definisi yang relevan dengan mereka. Programmer menambahkan fungsionalitas baru ke kode ini akan tahu di mana untuk menempatkan kode untuk menjaga program terorganisir.
tr: Modülleri kullanarak, ilgili tanımları bir araya getirebilir ve neden ilişkili olduklarını adlandırabiliriz. Bu kodu kullanan programcılar, tüm tanımları okumak yerine koda dayalı olarak gezinebilir, bu da ilgili tanımları bulmayı kolaylaştırır. Bu koda yeni işlevsellik ekleyen programcılar, programı düzenli tutmak için kodu nereye yerleştireceklerini bilirler.
zh_cn: 通过使用模块,我们可以将相关定义组合在一起,并命名它们为何相关。 使用此代码的程序员可以浏览基于组的代码,而不必阅读所有定义,这样更容易找到与其相关的定义。 在代码中添加新功能的程序员将知道如何设置代码以保持程序的组织。

source: Earlier, we mentioned that _src/lib.cairo_ is called the crate root. The reason for this name is that the content of this file forms a module named after the crate name at the root of the crate’s module structure, known as the _module tree_.
es: Anteriormente, mencionamos que _src/lib.cairo_ se llama la raíz de la caja. La razón de este nombre es que el contenido de este archivo forma un módulo llamado así por el nombre de la caja en la raíz de la estructura del módulo de la caja, conocido como el árbol _módulo_.
fr: Plus tôt, nous avons mentionné que _src/lib.cairo_ est appelé la racine de la caisse. La raison de ce nom est que le contenu de ce fichier forme un module nommé d'après le nom de la caisse à la racine de la structure du module de la caisse, connue sous le nom d'arborescence de _module_.
id: Sebelumnya, kami menyebutkan bahwa _src/lib.cairo_ disebut akar peti. Alasan untuk nama ini adalah bahwa isi dari berkas ini membentuk sebuah modul bernama setelah nama peti di akar struktur modul peti yang dikenal sebagai _module tree_.
tr: Daha önce, _src/lib.cairo_ 'nın sandık kökü olarak adlandırıldığını söylemiştik. Bu ismin nedeni, bu dosyanın içeriğinin, sandığa ait modül yapısının kökündeki sandığa adını veren ve _module tree_ olarak bilinen bir modül oluşturmasıdır.
zh_cn: 早些时候,我们曾提到,_src/lib.cairo_被称为箱根。之所以使用这个名称,是因为这个文件的内容组成了一个模块,以箱模块结构根部的箱名命名,称为_module tree_。

source: Listing 7-2 shows the module tree for the structure in Listing 7-1.
es: El listado 7-2 muestra el árbol de módulos para la estructura en el listado 7-1.
fr: Listing 7-2 montre l'arborescence du module pour la structure dans Listing 7-1.
id: Daftar 7-2 menunjukkan pohon modul untuk struktur dalam Daftar 7-1.
tr: Listeleme 7-2, Listeleme 7-1'deki yapı için modül ağacını gösterir.
zh_cn: 列表 7-2 显示列表 7-1 结构的模块树 。
