Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: You received the error message `Cannot assign to an immutable variable.` because you tried to assign a second value to the immutable `x` variable.
es: Recibió el mensaje de error `No se puede asignar a una variable inmutable.` porque trató de asignar un segundo valor a la variable `x` inmutable.
fr: Vous avez reçu le message d'erreur `Impossible d'attribuer à une variable immuable.` parce que vous avez essayé d'attribuer une deuxième valeur à la variable immuable `x`.
id: Anda menerima pesan galat yang tidak dapat diberikan ke variabel yang dapat berubah. Karena Anda mencoba untuk menetapkan nilai kedua ke variabel yang dapat berubah.
tr: Değiştirilemez bir değişkene atama yapılamaz. hata iletisini aldınız, çünkü x değişkenine ikinci bir değer atamaya çalıştınız.
zh_cn: 您收到了错误消息 `无法指定为不可更改的变量 。'因为你试图为不可更改的“ x” 变量指定第二个值 。

source: It’s important that we get compile-time errors when we attempt to change a value that’s designated as immutable because this specific situation can lead to bugs. If one part of our code operates on the assumption that a value will never change and another part of our code changes that value, it’s possible that the first part of the code won’t do what it was designed to do. The cause of this kind of bug can be difficult to track down after the fact, especially when the second piece of code changes the value only _sometimes_.
es: Es importante que obtengamos errores de tiempo de compilación cuando intentamos cambiar un valor que es designado como inmutable porque esta situación específica puede conducir a errores. Si una parte de nuestro código opera bajo la suposición de que un valor nunca cambiará y otra parte de nuestro código cambia ese valor, es posible que la primera parte del código no haga lo que fue diseñado para hacer. La causa de este tipo de error puede ser difícil de rastrear después del hecho, especialmente cuando la segunda pieza de código cambia el valor sólo _a veces_.
fr: Il est important que nous obtenions des erreurs de compilation-temps lorsque nous essayons de changer une valeur qui est désignée comme immuable parce que cette situation spécifique peut conduire à des bogues. Si une partie de notre code fonctionne sur l'hypothèse qu'une valeur ne changera jamais et qu'une autre partie de notre code change cette valeur, il est possible que la première partie du code ne fasse pas ce qu'il a été conçu pour faire. La cause de ce type de bogue peut être difficile à suivre après le fait, surtout lorsque le deuxième morceau de code ne change la valeur que _parfois_.
id: Sangat penting bahwa kita mendapatkan kesalahan kompilasi-waktu ketika kita mencoba untuk mengubah nilai yang ditunjuk sebagai tidak dapat berubah karena situasi spesifik ini dapat menyebabkan bug. jika salah satu bagian dari kode kita bekerja pada asumsi bahwa nilai tidak akan pernah berubah dan bagian lain dari kode kita berubah nilai itu, itu mungkin bahwa bagian pertama dari kode ini akan melakukan apa yang dirancang untuk dilakukan. Penyebab bug semacam ini dapat sulit untuk melacak setelah fakta, terutama ketika sepotong kode mengubah hanya nilai _somes_.
tr: Bu özel durum hatalara yol açabileceğinden, değiştirilemez olarak belirlenen bir değeri değiştirmeye çalıştığımızda derleme zamanı hataları almamız önemlidir. Kodumuzun bir kısmı bir değerin asla değişmeyeceğini ve kodumuzun başka bir parçasının bu değeri değiştireceğini varsayarak çalışırsa, kodun ilk parçasının yapmak için tasarlandığı şeyi yapmaması mümkündür. Bu tür bir hatanın nedeni, özellikle ikinci parçanın değerini takip etmek zor olabilir.
zh_cn: 重要的是,当我们试图改变一个被指定为不可改变的值时,当我们试图改变一个被指定为不可改变的值时,我们就会发现编译时间错误,因为这一具体情况可能导致错误。 如果我们的代码的一部分是基于一个值永远不会改变的假设操作的,而我们的代码的另一部分则会改变这个值,那么代码的第一部分可能不会做它设计要做的事情。 这种错误的原因在事后很难找到,特别是当第二部分代码只改变值时。

source: Cairo, unlike most other languages, has immutable memory. This makes a whole class of bugs impossible, because values will never change unexpectedly. This makes code easier to reason about.
es: El Cairo, a diferencia de la mayoría de los otros idiomas, tiene memoria inmutable. Esto hace imposible toda una clase de errores, porque los valores nunca cambiarán inesperadamente. Esto hace que el código sea más fácil de razonar.
fr: Le Caire, contrairement à la plupart des autres langues, a une mémoire immuable. Cela rend toute une classe de bogues impossible, car les valeurs ne changeront jamais de façon inattendue. Cela rend le code plus facile à raisonner.
id: Kairo, tidak seperti kebanyakan bahasa lain, memiliki memori yang dapat berubah. ini membuat seluruh kelas bug tidak mungkin, karena nilai-nilai tidak akan berubah tiba-tiba. ini membuat kode lebih mudah untuk dipikirkan.
tr: Kahire, diğer dillerin aksine, değişmez bir hafızaya sahiptir. Bu, bütün bir böcek sınıfını imkansız kılar, çünkü değerler asla beklenmedik bir şekilde değişmez. Bu, kodun akla gelmesini kolaylaştırır.
zh_cn: 开罗与其他大多数语言不同,它有着不可改变的记忆。 这使得一整类的错误不可能存在,因为价值永远不会意外地改变。 这让代码更容易解释。

source: But mutability can be very useful, and can make code more convenient to write. Although variables are immutable by default, you can make them mutable by adding `mut` in front of the variable name. Adding `mut` also conveys intent to future readers of the code by indicating that other parts of the code will be changing the value associated to this variable.
es: Pero la mutabilidad puede ser muy útil y puede hacer que el código sea más conveniente para escribir. Aunque las variables son inmutables por defecto, puede hacer que sean mutables añadiendo `mut` delante del nombre de la variable. Agregar `mut` también transmite la intención a los futuros lectores del código indicando que otras partes del código cambiarán el valor asociado a esta variable.
fr: Mais la mutabilité peut être très utile, et peut rendre le code plus pratique à écrire. Bien que les variables soient immuables par défaut, vous pouvez les rendre mutables en ajoutant `mut` devant le nom de la variable. Ajouter `mut` transmet également l'intention aux futurs lecteurs du code en indiquant que d'autres parties du code changeront la valeur associée à cette variable.
id: Tapi perubahan bisa sangat berguna, dan dapat membuat kode lebih mudah ditulis. Meskipun variabel tidak dapat berubah secara baku, Anda dapat membuatnya dapat bermutasi dengan menambahkan nilai yang terkait dengan variabel ini.
tr: Ancak değiştirilebilirlik çok yararlı olabilir ve kodu yazmak için daha uygun hale getirebilir. Değişkenler varsayılan olarak değiştirilemez olsa da, değişken adının önüne mut ekleyerek onları değiştirilebilir hale getirebilirsiniz. mut eklemek, kodun diğer bölümlerinin bu değişkenle ilişkili değeri değiştireceğini belirterek, kodun gelecekteki okuyucularına da niyeti iletir.
zh_cn: 但易变性可以非常有用, 并且可以让代码更方便地写入。 虽然变量默认是不可变的, 但是您可以通过在变量名称前面添加“ mot” 来使其变异性。 添加“ mut” 也可以通过显示代码的其他部分将改变与该变量相关的值, 向代码的未来阅读者表达其意图 。

source: However, you might be wondering at this point what exactly happens when a variable is declared as `mut`, as we previously mentioned that Cairo's memory is immutable. The answer is that the _value_ is immutable, but the _variable_ isn't. The value associated to the variable can be changed. Assigning to a mutable variable in Cairo is essentially equivalent to redeclaring it to refer to another value in another memory cell, but the compiler handles that for you, and the keyword `mut` makes it explicit. Upon examining the low-level Cairo Assembly code, it becomes clear that variable mutation is implemented as syntactic sugar, which translates mutation operations into a series of steps equivalent to variable shadowing. The only difference is that at the Cairo level, the variable is not redeclared so its type cannot change.
es: Sin embargo, usted podría preguntarse en este punto qué sucede exactamente cuando una variable se declara como `mut`, como mencionamos anteriormente que la memoria de El Cairo es inmutable. La respuesta es que el _value_ es inmutable, pero el _variable_ no lo es. El valor asociado a la variable puede ser cambiado. Asignar a una variable mutable en El Cairo es esencialmente equivalente a volver a declarar que se refiere a otro valor en otra celda de memoria, pero el compilador maneja eso para usted, y la palabra clave `mut` lo hace explícito. Al examinar el código de la Asamblea de El Cairo de bajo nivel, se hace evidente que la mutación variable se implementa como azúcar sintáctico, que traduce operaciones de mutación en una serie de pasos equivalentes a sombra variable. La única diferencia es que en el nivel de El Cairo, la variable no se vuelve a declarar por lo que su tipo no puede cambiar.
fr: Cependant, vous vous demandez peut-être à ce stade ce qui se passe exactement lorsqu'une variable est déclarée comme étant `mut`, comme nous l'avons déjà mentionné, la mémoire du Caire est immuable. La réponse est que la _value_ est immuable, mais la _variable_ n'est pas. La valeur associée à la variable peut être modifiée. L'attribution à une variable mutable au Caire est essentiellement équivalente à la redéclaration de la variable pour renvoyer à une autre valeur dans une autre cellule mémoire, mais le compilateur gère cela pour vous, et le mot-clé `mut` la rend explicite.
id: Namun, Anda mungkin bertanya-tanya pada titik ini apa yang sebenarnya terjadi ketika variabel dinyatakan sebagai åmuté, seperti yang sebelumnya kami sebutkan bahwa memori Kairo tidak dapat berubah. Jawabannya adalah bahwa _value_ tidak dapat berubah, tapi _variable_ isn apos; t. Nilai yang terkait dengan variabel dapat diubah. Sebagaimana kita sebelumnya disebutkan kepada variabel mutable di Kairo pada dasarnya setara dengan mendeklarasikan kembali ke dalam sel memori lain, tetapi menangani compiler yang untuk Anda, dan kata kunci yang membuatnya eksplisit. setelah memeriksa tingkat rendah- Kairo Assembly kode, itu menjadi variabel yang diimplementasikan sebagai gula yang diimplementasikan ke dalam proses mutasi, yang diterjemahkan ke dalam rangkaian operasi yang sama.
tr: Ancak, bu noktada bir değişkenin mut olarak ilan edildiğinde tam olarak ne olduğunu merak ediyor olabilirsiniz, daha önce Kahire'nin belleğinin değişmez olduğunu belirttiğimiz gibi. Cevap, _value_ değişkeninin değişkeni olan değişkeni, değişkenin değişkeni olan değişkeni değil, değişkenin değişkeni olan değişkeni, değişkenin değişkeni olan değişkeni, değişkeni başka bir hücredeki başka bir değere atıfta bulunmak için onu yeniden ifade etmeye eşdeğerdir.
zh_cn: 然而,您可能会在这一点上想知道当变量被宣布为“ mut ” 时,当变量被宣布为“ mut ”, 正如我们先前提到的开罗的内存是不可变的。 答案是 _ value_ 是不可变的, 但却不是。 变量的相关值可以被更改。 在开罗指定为可变变量实质上相当于重新声明它指另一个内存单元格中的另一个值, 但编译者会处理该变量, 而关键词“ mut ” 则让它变得清晰。 在审查开罗大会的低级别代码时, 很明显变异是作为合成糖执行的, 它将变异操作转化为一系列与变影相等的步骤。 唯一不同的是, 在开罗一级, 该变量没有被重新声明, 其类型无法改变 。

source: For example, let’s change _src/lib.cairo_ to the following:
es: Por ejemplo, cambiemos _src/lib.cairo_ a lo siguiente:
fr: Par exemple, laissez passer _src/lib.cairo_ à ce qui suit :
id: Sebagai contoh, mari kita ubah _src/lib.cairo_ ke berikut:
tr: Örneğin, aşağıdaki _src/lib.cairo_'yi değiştirelim:
zh_cn: 例如,让我们将 _src/lib.cairo_改为:

source: When we run the program now, we get this:
es: Cuando ejecutamos el programa ahora, obtenemos esto:
fr: Lorsque nous exécutons le programme maintenant, nous obtenons ceci:
id: Ketika kita menjalankan program sekarang, kita mendapatkan ini:
tr: Programı şimdi çalıştırdığımızda, şunu elde ediyoruz:
zh_cn: 当我们现在运行这个程序时, 我们得到这个:

source: We’re allowed to change the value bound to `x` from `5` to `6` when `mut` is used. Ultimately, deciding whether to use mutability or not is up to you and depends on what you think is clearest in that particular situation.
es: Se nos permite cambiar el valor vinculado a `x` de `5` a `6` cuando se utiliza `mut`. En última instancia, decidir si usar o no la mutabilidad depende de usted y depende de lo que usted considere más claro en esa situación particular.
fr: Nous sommes autorisés à changer la valeur liée à `x` de `5` à `6` quand `mut` est utilisé. En fin de compte, décider s'il faut utiliser la mutabilité ou non est à vous et dépend de ce que vous pensez être le plus clair dans cette situation particulière.
id: Pada akhirnya, memutuskan apakah menggunakan mutability atau tidak tergantung pada apa yang Anda pikir paling jelas dalam situasi seperti itu.
tr: mut kullanıldığında x'ye bağlı değeri 5'den 6'ya değiştirmemize izin verilir. Sonuçta, mutasyona uğrayıp uğramamaya karar vermek size bağlıdır ve o özel durumda en net ne düşündüğünüze bağlıdır.
zh_cn: 我们被允许将`x'的定值从`5'改为`6'时使用` mut',最终决定是否使用变异性取决于你,取决于你认为在这一特定情况下最清楚什么。

source: Constants
es: Constantes
fr: Constantes
id: Konstanta
tr: Sabitler
zh_cn: 常数常数

source: Like immutable variables, _constants_ are values that are bound to a name and are not allowed to change, but there are a few differences between constants and variables.
es: Como variables inmutables, _constants_ son valores que están ligados a un nombre y no se les permite cambiar, pero hay algunas diferencias entre constantes y variables.
fr: Comme les variables immuables, _constants_ sont des valeurs liées à un nom et qui ne sont pas autorisées à changer, mais il y a quelques différences entre les constantes et les variables.
id: Seperti variabel yang tidak dapat berubah, _konstant_ adalah nilai yang terikat pada suatu nama dan tidak diperbolehkan untuk berubah, tetapi ada beberapa perbedaan antara konstanta dan variabel.
tr: Değiştirilemeyen değişkenler gibi, _constants_ bir isme bağlı olan ve değişmesine izin verilmeyen değerlerdir, ancak sabitler ve değişkenler arasında birkaç fark vardır.
zh_cn: 和不可变变量一样, _contaants_ 是受名称约束且不允许更改的数值,但常数和变量之间有一些差异。

source: First, you aren’t allowed to use `mut` with constants. Constants aren’t just immutable by default—they’re always immutable. You declare constants using the `const` keyword instead of the `let` keyword, and the type of the value _must_ be annotated. We’ll cover types and type annotations in the next section, [“Data Types”](./ch02-02-data-types.md), so don’t worry about the details right now. Just know that you must always annotate the type.
es: En primer lugar, no se le permite utilizar `mut` con constantes. Las constantes no son sólo inmutables por defecto - siempre son inmutables. Declara constantes utilizando la palabra clave `const` en lugar de la palabra clave `let`, y el tipo de valor _must_ ser anotado. Vamos a cubrir los tipos y anotaciones de tipo en la siguiente sección, [ "Tipos de datos"](./ch02-02-data-types.md), así que no se preocupe por los detalles en este momento. Sólo sepa que siempre debe anotar el tipo.
fr: Tout d'abord, vous n'êtes pas autorisé à utiliser `mut` avec des constantes. Les constantes ne sont pas simplement immuables par défaut — elles sont toujours immuables. Vous déclarez les constantes en utilisant le mot-clé `const` au lieu du mot-clé `let`, et le type de la valeur _must_ être annoté. Nous allons couvrir les types et les annotations de type dans la section suivante, [=Types de données=](./ch02-02-data-types.md), donc ne vous inquiétez pas des détails en ce moment. Sachez juste que vous devez toujours annoter le type.
id: Pertama, Anda tidak diperbolehkan menggunakan kata kunci åconsté dengan konstanta. Konstanta tidak hanya tidak dapat berubah secara baku. Anda menyatakan konstanta menggunakan kata kunci åconst, bukan dengan kata kunci, dan tipe nilai _must_dinotasi. kita akan menutup tipe dan mengetik annotasi di bagian berikutnya, [Neta Types]. /ch02-data-types.md), jadi jangan khawatir tentang rincian sekarang.
tr: İlk olarak, sabitlerle mut kullanmanıza izin verilmez. Sabitler sadece varsayılan olarak değiştirilemez değildir - her zaman değişmezler. let anahtar kelimesi yerine const anahtar kelimesini kullanarak sabitleri beyan edersiniz ve _mt_ değerinin türü açıklamalıdır. Her zaman bir sonraki bölümdeki ["Data Types"] [noktalamalar"] ve [datam"lar] ile ilgili kaygılarınızı gidereceğiz.
zh_cn: 首先,您不允许使用“ mut' with stants ” 。 常数不仅仅是默认的不可变的 — — 常数总是不可变的。 您声明常数使用“ const'keys ” 而不是“ let'key, 值类型 _ must_ be a 附加说明 。 我们将在下一节中包含类型和类型说明, [“数据类型 ” (./ch02-02- data-types. md), 所以不要担心现在的细节 。 只要知道您必须总是注意该类型 。

source: Constant variables can be declared with any usual data type, including structs, enums and fixed-size arrays.
es: Las variables constantes pueden ser declaradas con cualquier tipo de datos habitual, incluyendo structs, enums y arrays de tamaño fijo.
fr: Les variables constantes peuvent être déclarées avec n'importe quel type de données habituel, y compris les structures, les enums et les tableaux de taille fixe.
id: Variabel konstan dapat dideklarasikan dengan tipe data biasa, termasuk struct, enums dan ukuran tetap.
tr: Sabit değişkenler, structlar, enumlar ve sabit boyutlu diziler de dahil olmak üzere herhangi bir olağan veri türü ile ilan edilebilir.
zh_cn: 常数变量可以用任何通常的数据类型来声明,包括支架、柱形和固定尺寸阵列。

source: Constants can only be declared in the global scope, which makes them useful for values that many parts of code need to know about.
es: Las constantes sólo pueden ser declaradas en el ámbito global, lo que las hace útiles para valores que muchas partes del código necesitan conocer.
fr: Les constantes ne peuvent être déclarées qu'à l'échelle mondiale, ce qui les rend utiles pour les valeurs que de nombreuses parties du code doivent connaître.
id: Konstanta hanya dapat dinyatakan dalam lingkup global, yang membuatnya berguna bagi nilai-nilai yang perlu diketahui banyak bagian dari kode.
tr: Sabitler yalnızca küresel kapsamda ilan edilebilir, bu da onları birçok kod parçasının bilmesi gereken değerler için kullanışlı kılar.
zh_cn: 常数只能在全球范围内申报,因此对守则许多部分需要了解的价值有用。

source: The last difference is that constants may natively be set only to a constant expression, not the result of a value that could only be computed at runtime.
es: La última diferencia es que las constantes se pueden establecer nativamente sólo a una expresión constante, no el resultado de un valor que sólo podría ser calculado en tiempo de ejecución.
fr: La dernière différence est que les constantes peuvent nativement être définies seulement à une expression constante, pas le résultat d'une valeur qui ne pourrait être calculée qu'à l'exécution.
id: Perbedaan terakhir adalah bahwa konstanta mungkin hanya diatur ke ekspresi konstan, bukan hasil dari nilai yang hanya dapat dihitung pada waktu-jalan.
tr: Son fark, sabitlerin doğal olarak sadece çalışma zamanında hesaplanabilen bir değerin sonucu değil, sabit bir ifadeye ayarlanabilmesidir.
zh_cn: 最后一个区别是,常数只能由本地设定为常数表达式,而不是只能在运行时计算的数值结果。

source: Here’s an example of constants declaration:
es: He aquí un ejemplo de la declaración de constantes:
fr: Voici un exemple de déclaration des constantes:
id: Berikut ini adalah contoh dari pernyataan konstan:
tr: İşte sabitler deklarasyonunun bir örneği:
zh_cn: 以下是常数声明的例子:

source: Nonetheless, it is possible to use the `consteval_int!` macro to create a `const` variable that is the result of some computation:
es: Sin embargo, es posible utilizar la macro `consteval_int!` para crear una variable `const` que es el resultado de algún cálculo:
fr: Néanmoins, il est possible d'utiliser la macro `consteval_int!` pour créer une variable `const` qui est le résultat d'un certain calcul:
id: Meskipun demikian, kita dapat menggunakan kata "consteval_int"! makro untuk membuat variabel ·const) yang merupakan hasil dari beberapa komputasi:
tr: Bununla birlikte, bazı hesaplamaların sonucu olan bir const değişkeni oluşturmak için consteval_int! makrosunu kullanmak mümkündür:
zh_cn: 尽管如此,仍有可能使用`conteval_int!' 宏来创建某种计算结果得出的` contal_int!' 变量:

source: We will dive into more detail about macros in the [dedicated section](./ch11-05-macros.md).
es: Nos sumergiremos en más detalles sobre macros en la [sección dedicada](./ch11-05-macros.md).
fr: Nous plongerons dans plus de détails sur les macros dans la [section dédiée](../ch11-05-macros.md).
id: Kita akan menyelam lebih detail tentang makro di bagian [didedikasi]. /ch11-05-macros.md).
tr: [özgün bölüm](./ch11-05-macros.md) 'deki makrolar hakkında daha fazla ayrıntıya dalacağız.
zh_cn: 我们将更详细地阐述[专门章节](./ch11-05-macros.md)中的宏。

source: Cairo's naming convention for constants is to use all uppercase with underscores between words.
es: La convención de El Cairo para nombrar constantes es usar todas las mayúsculas con subrayados entre palabras.
fr: La convention du Caire pour la désignation des constantes est d'utiliser toutes les majuscules avec des accents entre les mots.
id: Konvensi penamaan Kairo untuk konstanta adalah menggunakan semua huruf besar dengan garis bawah antara kata-kata.
tr: Kahire'nin sabitler için isimlendirme kongresi, kelimeler arasında altı çizili tüm büyükleri kullanmaktır.
zh_cn: 开罗对常数的命名惯例是使用所有大写字母,在两字之间加下划线。

source: Constants are valid for the entire time a program runs, within the scope in which they were declared. This property makes constants useful for values in your application domain that multiple parts of the program might need to know about, such as the maximum number of points any player of a game is allowed to earn, or the speed of light.
es: Las constantes son válidas durante todo el tiempo que se ejecuta un programa, dentro del ámbito en el que fueron declaradas. Esta propiedad hace que las constantes sean útiles para valores en el dominio de tu aplicación que varias partes del programa podrían necesitar saber, como el número máximo de puntos que cualquier jugador de un juego puede ganar, o la velocidad de la luz.
fr: Les constantes sont valables pendant toute la durée d'exécution d'un programme, dans la portée dans laquelle elles ont été déclarées. Cette propriété rend les constantes utiles pour les valeurs dans votre domaine d'application que plusieurs parties du programme pourraient avoir besoin de connaître, comme le nombre maximum de points que tout joueur d'un jeu est autorisé à gagner, ou la vitesse de la lumière.
id: Konstanta valid untuk seluruh waktu program berjalan, dalam lingkup di mana mereka dideklarasikan. Properti ini membuat konstanta berguna untuk nilai-nilai dalam domain aplikasi Anda bahwa beberapa bagian dari program mungkin perlu tahu tentang, seperti jumlah maksimum poin setiap pemain game diperbolehkan untuk menghasilkan, atau kecepatan cahaya.
tr: Sabitler, bir programın çalıştığı süre boyunca, ilan edildikleri kapsam dahilinde geçerlidir. Bu özellik, uygulama alanınızdaki sabitleri, bir oyunun herhangi bir oyuncusunun kazanmasına izin verilen maksimum puan sayısı veya ışık hızı gibi, programın birden fazla bölümünün bilmesi gereken değerler için kullanışlı hale getirir.
zh_cn: 常数在程序运行的整个期间有效, 在程序声明的范围内。 此属性使常数对程序多个部分可能需要知道的应用程序域中的值有用, 如允许任何玩家赚取的最大点数, 或光速 。
