Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: When sending messages from Starknet to Ethereum, you will have to use the `send_message_to_l1` syscall in your Cairo contracts. This syscall allows you to send messages to the `StarknetMessaging` contract on L1. Unlike `L1->L2` messages, `L2->L1` messages must be consumed manually, which means that you will need your Solidity contract to call the `consumeMessageFromL2` function of the `StarknetMessaging` contract explicitly in order to consume the message.
es: Al enviar mensajes desde Starknet a Ethereum, tendrá que usar el `send_message_to_l1` syscall en sus contratos de El Cairo. Esta syscall le permite enviar mensajes al contrato `StarknetMessaging` en L1. A diferencia de los mensajes `L1->L2`, los mensajes `L2->L1` deben ser consumidos manualmente, lo que significa que necesitará su contrato de Solididad para llamar a la función `consumoMessagingFromL2` del contrato `StarknetMessaging` explícitamente para consumir el mensaje.
fr: Lorsque vous envoyez des messages de Starknet à Ethereum, vous devrez utiliser le syscall `send_message_to_l1` dans vos contrats du Caire. Ce syscall vous permet d'envoyer des messages au contrat `StarknetMessage` sur L1. Contrairement aux messages `L1->L2`, `L2->L1` doivent être consommés manuellement, ce qui signifie que vous aurez besoin de votre contrat Solidity pour appeler la fonction `consumeMessageFromL2` du contrat `StarknetMessage` explicitement afin de consommer le message.
id: Ketika mengirim pesan dari Starknet ke Ethereum, Anda harus menggunakan kontrak ·StarknetMesaging pada L1. Tidak seperti pesan L1->L2, pesan-pesan yang akan dikonsumsi secara manual, yang berarti Anda akan membutuhkan kontrak Soliditas untuk memanggil fungsi SIGL2.
tr: Starknet'ten Ethereum'a mesaj gönderirken, Kahire sözleşmelerinizde send_message_to_l1 syscall'ı kullanmanız gerekecektir. Bu syscall, L1'deki StarknetMessage sözleşmesine mesaj göndermenizi sağlar. L1->L2 mesajlarının aksine, L2->L1 mesajlarının elle tüketilmesi gerekir, bu da Solidconsume sözleşmenize ihtiyacınız olacağı anlamına gelir.
zh_cn: 在从 Starknet 发送信件到 Etheum 时, 您必须使用您的开罗合同中的 ` send_ message_ to_ l1' syscall 。 此语句提醒允许您将信息发送到 L1 上的` StarknetMessage'合同 。 与 ` L1 - > L2'电文不同, ` L2 > L1'电文必须手工处理, 这意味着您需要您的可靠合同将` StarknetMessing'合同的` consumesingMessage fromL2'功能明确称为` StarknetMessmaking'合同中的` consessageMessing'功能, 才能使用该电文。

source: To send a message from L2 to L1, what we would do on Starknet is:
es: Para enviar un mensaje de L2 a L1, lo que haríamos en Starknet es:
fr: Pour envoyer un message de L2 à L1, ce que nous ferions sur Starknet est :
id: Untuk mengirim pesan dari L2 ke L1, apa yang akan kita lakukan di Starknet adalah:
tr: L2'den L1'e bir mesaj göndermek için Starknet'te yapacağımız şey:
zh_cn: 发送L2到L1的信息 我们在Starknet上会做的是:

source: // Note here, we "serialize" my_felt, as the payload must be // a `Span<felt252>`.
es: // Tenga en cuenta aquí, "serializamos" my_felt, como la carga útil debe ser // un `Span<felt252».
fr: // Notez ici que nous "sérialisons" my_felt, car la charge utile doit être // un `Span<felt252>`.
id: //Ingat di sini, kita "serialisasi" my_felt, karena muatannya pasti / sebuah Span<felt252>.
tr: // Burada not edin, my_felt'i "serialize ediyoruz", çünkü yük // a Spanfelt252> olmalıdır.
zh_cn: / 注意这里, 我们“ 序列化” 我的... fellt, 因为有效载荷必须是 / / `span<felt252\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: We simply build the payload and pass it, along with the L1 contract address, to the syscall function.
es: Simplemente construimos la carga útil y la pasamos, junto con la dirección del contrato L1, a la función syscall.
fr: Nous construisons simplement la charge utile et la transmettons, avec l'adresse du contrat L1, à la fonction syscall.
id: Kami hanya membangun muatan dan lulus, bersama dengan alamat kontrak L1, ke fungsi syscall.
tr: Biz sadece yükü inşa ediyoruz ve L1 sözleşme adresi ile birlikte syscall fonksiyonuna geçiyoruz.
zh_cn: 我们只是建造有效载荷,并将它连同L1合同地址一起传送到交响功能。

source: On L1, the important part is to build the same payload sent by the L2. Then you call `consumeMessageFromL2` in you Solidity contract by passing the L2 contract address and the payload. Please be aware that the L2 contract address expected by the `consumeMessageFromL2` is the address of the contract that sends the message on the L2 by calling `send_message_to_l1_syscall`.
es: En L1, la parte importante es construir la misma carga útil enviada por la L2. A continuación, llame a `consumoMessageFromL2` en usted contrato de solidez pasando la dirección del contrato L2 y la carga útil. Tenga en cuenta que la dirección del contrato L2 esperada por el `consumoMessageFromL2` es la dirección del contrato que envía el mensaje en la L2 llamando a `send_message_to_l1_syscall`.
fr: Sur L1, la partie importante est de construire la même charge utile envoyée par le L2. Ensuite, vous appelez `consumeMessageFromL2` dans votre contrat Solidity en passant l'adresse du contrat L2 et la charge utile. Veuillez noter que l'adresse du contrat L2 attendue par le `consumeMessageFromL2` est l'adresse du contrat qui envoie le message sur le L2 en appelant `send_message_to_l1_syscall`.
id: Pada L1, bagian yang penting adalah untuk membangun muatan yang sama yang dikirim oleh L2. Kemudian Anda memanggil L2 Message FromL2 dalam diri Anda kontrak Soliditas dengan melewati alamat kontrak L2 dan muatan. Harap menyadari bahwa alamat kontrak L2 yang diharapkan oleh L2consumeMessage FromL2, adalah alamat kontrak yang mengirimkan pesan pada L2 dengan memanggil Á_mesage_tol_scall.1_sycall.
tr: L1'de önemli olan, L2 tarafından gönderilen aynı yükü oluşturmaktır. Ardından, L2 sözleşme adresini ve yükü geçerek Solidity sözleşmenizde consumeMessageFromL2'yi ararsınız. consumeMessageFromL2 tarafından beklenen L2 sözleşme adresinin, send_message_to_calls_calls1'i arayarak L2'ye mesajı gönderen sözleşmenin adresi olduğunu unutmayın.
zh_cn: 关于L1, 重要部分是建造L2发送的同一有效载荷, 然后通过L2合同地址和有效载荷,在您的合同中称为`ConsumeMessage FromL2 ',通过“Send_Message_to_l1_syscall”, 将“ConsumeMessage FromL2” 所预期的L2合同地址作为合同地址,通过“send_Message_to_l1_syscall” 发送L2上的信息。

source: // You can use the message hash if you want here.
es: // Puede utilizar el hash del mensaje si lo desea aquí.
fr: // Vous pouvez utiliser le hash du message si vous le souhaitez ici.
id: //Anda dapat menggunakan hash pesan jika anda ingin di sini.
tr: // Burada isterseniz hash iletisini kullanabilirsiniz.
zh_cn: / 您可以在这里使用信件散列 。

source: // We expect the payload to contain only a felt252 value (which is a uint256 in Solidity).
es: // Esperamos que la carga útil contenga sólo un valor feelt252 (que es un uint256 en Solidity).
fr: // Nous nous attendons à ce que la charge utile ne contienne qu'une valeur feutre252 (qui est un uint256 dans Solidity).
id: /Kamimengharapkan payload hanya berisi nilai felt252 (yang merupakan uint256 di Solidity).
tr: // Yükün sadece bir keçe252 değeri içermesini bekliyoruz (bu, Solidity'de bir uint256'dır).
zh_cn: 我们预计有效载荷只含有一种感觉252值(即五分制256在固体中)。

source: "Invalid payload"
es: "Carga útil inválida"
fr: "Charge utile non valide"
id: Muatan tidak sah.
tr: "Geçersiz yük"
zh_cn: "无效有效载荷"

source: // From here, you can safely use `my_felt` as the message has been verified by StarknetMessaging.
es: // A partir de aquí, puede utilizar de forma segura `my_felt` ya que el mensaje ha sido verificado por StarknetMessaging.
fr: // D'ici, vous pouvez utiliser `my_felt` en toute sécurité car le message a été vérifié par StarknetMessaging.
id: //Dari sini, Anda dapat menggunakan aman-hidup seperti pesan telah diverifikasi oleh Starknet Messaging.
tr: // Buradan, mesaj StarknetMesaging tarafından doğrulandığı için my_felt'yi güvenle kullanabilirsiniz.
zh_cn: / 从这里,你可以安全地使用“我的'felt'”,因为电文已经由斯塔克内特通讯公司核实。

source: "Invalid value"
es: "Valor inválido"
fr: "Valeur invalide"
id: "nilai tidak sah"
tr: "Geçersiz değer"
zh_cn: “无效值”

source: As you can see, in this context we don't have to verify which contract from L2 is sending the message (as we do on the L2 to verify which contract from L1 is sending the message). But we are actually using the `consumeMessageFromL2` of the `StarknetCore` contract to validate the inputs (the contract address on L2 and the payload) to ensure we are only consuming valid messages.
es: Como puede ver, en este contexto no tenemos que verificar qué contrato de L2 está enviando el mensaje (como lo hacemos en el L2 para verificar qué contrato de L1 está enviando el mensaje), pero en realidad estamos utilizando el `ConsumoMensaje de L2` del contrato `StarknetCore` para validar las entradas (la dirección del contrato en L2 y la carga útil) para asegurarnos de que sólo estamos consumiendo mensajes válidos.
fr: Comme vous pouvez le voir, dans ce contexte, nous n'avons pas à vérifier quel contrat de L2 envoie le message (comme nous le faisons sur le L2 pour vérifier quel contrat de L1 envoie le message). Mais nous utilisons en fait le "consumeMessageFromL2` du contrat `StarknetCore` pour valider les entrées (l'adresse du contrat sur L2 et la charge utile) pour nous assurer que nous ne consommons que des messages valides.
id: Seperti yang Anda lihat, dalam konteks ini kita tidak perlu memverifikasi kontrak dari L2 mana yang mengirimkan pesan (seperti yang kita lakukan pada L2 untuk memverifikasi kontrak dari L1 mengirim pesan). Tapi kita benar-benar menggunakan Áconsume Message FromL2 (seperti yang kita lakukan pada L2 untuk mengesahkan masukan (alamat kontrak di L2 dan payload) untuk memastikan kita hanya mengkonsumsi pesan yang valid.
tr: Gördüğünüz gibi, bu bağlamda, L2'den hangi sözleşmenin mesajı gönderdiğini doğrulamak zorunda değiliz (L1'den hangi sözleşmenin mesajı gönderdiğini doğrulamak için L2'de yaptığımız gibi). Ama aslında StarknetCore sözleşmesinin consumeMessageFromL2'sini, girdileri doğrulamak için kullanıyoruz (L2 üzerindeki sözleşme adresi ve yük).
zh_cn: 如你所见,在此情况下,我们不必核实L2的哪些合同发出电文(正如我们在L2上所做的那样,以核实L1的合同发出电文),但我们实际上正在使用`StarknetCore'合同的`Message FromL2'合同的`consumeMessage FromL2'来验证投入(L2和有效载荷的合同地址),以确保我们只使用有效电文。

source: **Note:** The `consumeMessageFromL2` function of the `StarknetCore` contract is expected to be called from a Solidity contract, and not directly on the `StarknetCore` contract. The reason of that is because the `StarknetCore` contract is using `msg.sender` to actually compute the hash of the message. And this `msg.sender` must correspond to the `to_address` field that is given to the function `send_message_to_l1_syscall` that is called on Starknet.
es: **Nota:** La función `Consumo de Mensajes de L2` del contrato `StarknetCore` se llama desde un contrato de Solidity, y no directamente en el contrato `StarknetCore`. La razón de esto es porque el contrato `StarknetCore` está usando `msg.sender` para calcular realmente el hash del mensaje. Y este `msg.sender` debe corresponder al campo `to_addirction` que se da a la función `send_message_to_l1_syscall` que se llama en Starknet.
fr: **Note :** La fonction `consumeMessageFromL2` du contrat `StarknetCore` devrait être appelée à partir d'un contrat Solidity, et non pas directement sur le contrat `StarknetCore`. La raison en est que le contrat `StarknetCore` utilise `msg.sender` pour calculer le hash du message. Et ce `msg.sender` doit correspondre au champ `to_address` qui est donné à la fonction `send_message_to_l1_syscall` qui est appelée sur Starknet.
id: *Note:** The Áconsume Message FromL2-- fungsi dari kontrak StarknetCore diduga berasal dari kontrak Solientity, dan tidak secara langsung pada kontrak ▪StarknetCore. Alasan dari itu adalah karena kontrak thoseStarknetCore menggunakan msg.sender untuk benar-benar menghitung hash pesan. Dan msg.der ini harus sesuai dengan lapangan aux_address yang diberikan kepada fungsi yang diberikan kepada fungsi directory_sendme_stoages_1s_slists.
tr: **Not:** StarknetCore sözleşmesinin consumeMessageFromL2 işlevinin bir Solidity sözleşmesinden çağrılması bekleniyor ve Starknet_Core sözleşmesinde doğrudan değil. Bunun nedeni, StarknetCore sözleşmesinin, mesajın hashini hesaplamak için msg.sender işlevinin kullanılmasıdır.
zh_cn: ** 注:** `StarknetCore'合同的`Message FromL2'功能预计将从“StarknetCore'合同中称为`starknetCore'合同,而不是直接在`StarknetCore'合同中称为`consumeMessage FromL2 ',原因是`StarknetCore'合同正在使用`msg.sender'来实际计算电文的散数。而此`msg.sender'必须与调用在Starknet的函数`send_message_to_l1_syscall'的`to_desend_message_to_l1_ssscall'的字段相对应。

source: It is important to remember that on L1 we are sending a payload of `uint256`, but the basic data type on Starknet is `felt252`; however, `felt252` are approximately 4 bits smaller than `uint256`. So we have to pay attention to the values contained in the payload of the messages we are sending. If, on L1, we build a message with values above the maximum `felt252`, the message will be stuck and never consumed on L2.
es: Es importante recordar que en L1 estamos enviando una carga útil de `uint256`, pero el tipo de datos básicos en Starknet es `felt252`; sin embargo, `felt252` son aproximadamente 4 bits más pequeños que `uint256`. Así que tenemos que prestar atención a los valores contenidos en la carga útil de los mensajes que estamos enviando. Si, en L1, construimos un mensaje con valores por encima del máximo `felt252`, el mensaje se quedará atascado y nunca se consumirá en L2.
fr: Il est important de se rappeler que sur L1 nous envoyons une charge utile de `uint256`, mais le type de données de base sur Starknet est `felt252`; cependant, `felt252` sont environ 4 bits plus petits que `uint256`. Donc, nous devons prêter attention aux valeurs contenues dans la charge utile des messages que nous envoyons. Si, sur L1, nous construisons un message avec des valeurs au-dessus du `felt252` maximum, le message sera coincé et jamais consommé sur L2.
id: Sangat penting untuk diingat bahwa pada L1 kita mengirimkan muatan yang kurang dari 4 bit kurang dari 256. jadi kita harus memperhatikan nilai-nilai yang terkandung dalam muatan pesan yang kita kirim. jika, pada L1, kita membangun pesan dengan nilai-nilai yang maksimal di atas felt252, pesan akan terjebak dan tidak pernah dikonsumsi pada L2.
tr: L1'de bir yük uint256 gönderdiğimizi hatırlamak önemlidir, ancak Starknet'teki temel veri türü felt252'dir; Bununla birlikte, felt252'den yaklaşık 4 bit daha küçüktür. Bu nedenle, gönderdiğimiz mesajların yükünde bulunan değerlere dikkat etmeliyiz. L1'de, yukarıdaki değerleri içeren bir mesaj oluşturursak, maksimum
zh_cn: 必须记住,在L1上,我们正在发送一个有效载荷`unit256 ',但Starknet上的基本数据类型是`felt252';然而,`felt252'大约小于`unit256'4位,因此,我们必须注意我们发送的信息的有效载荷中所含的值。如果在L1上,我们用最大`felt252'的值建立一条信息,信息将卡在L2上,永远不消耗在L2上。

source: Cairo Serde
fr: Serde du Caire
tr: Kahire Serde
zh_cn: 开罗塞尔德

source: Before sending messages between L1 and L2, you must remember that Starknet contracts, written in Cairo, can only understand serialized data. And serialized data is always an array of `felt252`. In Solidity we have `uint256` type, and `felt252` are approximately 4 bits smaller than `uint256`. So we have to pay attention to the values contained in the payload of the messages we are sending. If, on L1, we build a message with values above the maximum `felt252`, the message will be stuck and never consumed on L2.
es: Antes de enviar mensajes entre L1 y L2, debe recordar que los contratos de Starknet, escritos en El Cairo, sólo pueden entender datos seriados. Y los datos seriados son siempre una matriz de `felt252`. En Solidity tenemos `uint256` tipo, y `felt252` son aproximadamente 4 bits más pequeños que `uint256`. Por lo tanto, tenemos que prestar atención a los valores contenidos en la carga útil de los mensajes que estamos enviando. Si, en L1, creamos un mensaje con valores por encima del `felt252` máximo, el mensaje se quedará atascado y nunca se consumirá en L2.
fr: Avant d'envoyer des messages entre L1 et L2, vous devez vous rappeler que les contrats Starknet, écrits au Caire, ne peuvent comprendre que les données sérialisées. Et les données sérialisées sont toujours un tableau de `felt252`. Dans Solidity, nous avons `uint256` type, et `felt252` sont environ 4 bits plus petits que `uint256`. Donc, nous devons prêter attention aux valeurs contenues dans la charge utile des messages que nous envoyons. Si, sur L1, nous construisons un message avec des valeurs au-dessus de la `felt252` maximale, le message sera bloqué et jamais consommé sur L2.
id: Sebelum mengirim pesan antara L1 dan L2, Anda harus ingat bahwa kontrak Starknet, yang ditulis di Kairo, hanya dapat memahami data serial. dan data serial selalu berupa array dari L1 dan L1.
tr: L1 ve L2 arasında mesaj göndermeden önce, Kahire'de yazılan Starknet sözleşmelerinin yalnızca serileştirilmiş verileri anlayabileceğini unutmayın. Serileştirilmiş veriler her zaman bir dizi felt252'dir. Katılıkta uint256 tipine sahibiz ve felt252, uint256'dan yaklaşık 4 bit daha küçük değildir. Bu nedenle, bir Lload'da bulunan değerlere dikkat etmeliyiz.
zh_cn: 在发送 L1 和 L2 之间的信息之前, 您必须记住, 在开罗写的 Starknet 合同只能理解序列数据。 而序列数据总是一系列的“ felt252 ” 。 在“ Soliity” 中, 我们拥有“ unt256 ” 类型, 而“ felt252 ” 大约比 ` unt256 ” 小4位。 所以我们必须注意我们发送的信息的有效载荷中包含的值 。 如果在 L1 上, 我们构建了一个超过最大 ` felt252 '值的信息, 信息将卡在L2 上, 永远不会被消耗在 L2 上 。

source: So for instance, an actual `uint256` value in Cairo is represented by a struct like:
es: Así, por ejemplo, un valor real `uint256` en El Cairo está representado por una estructura como:
fr: Ainsi, par exemple, une valeur `uint256` réelle au Caire est représentée par une structure comme:
id: Sebagai contoh, nilai sebenarnya dari 256 di Kairo diwakili oleh sebuah struktur seperti:
tr: Örneğin, Kahire'deki gerçek bir uint256 değeri aşağıdaki gibi bir yapı ile temsil edilir:
zh_cn: 例如,开罗的实际`5int256'价值就表现为:

source: which will be serialized as **TWO** felts, one for the `low`, and one for the `high`. This means that to send only one `u256` to Cairo, you'll need to send a payload from L1 with **TWO** values.
es: que se serializará como **WO** fieltros, uno para el `bajo`, y uno para el `alto`. Esto significa que para enviar sólo un `u256` a El Cairo, usted tendrá que enviar una carga útil de L1 con **WO** valores.
fr: Ce qui signifie que pour envoyer un seul `u256` au Caire, vous devrez envoyer une charge utile de L1 avec des valeurs **TWO**.
id: Yang mana akan diserialisasikan sebagai perasaan **TWO**, satu untuk nada rendah, dan satu untuk tinggi itu. ini berarti hanya untuk mengirim satu nilai-nilai 0.256 ke Kairo, anda perlu mengirim muatan dari L1 dengan nilai-nilai **TWO**.
tr: bir tanesi low için, diğeri de high için olmak üzere **TWO** keçeleri olarak serileştirilecektir. Bu, Kahire'ye sadece bir u256 göndermek için, L1'den **TWO** değerleri ile bir yük yüklemesi göndermeniz gerektiği anlamına gelir.
zh_cn: 其序列编号为**TWO**感觉,“低”为1,“高”为1,这意味着如果只向开罗发送一个`U256',你将需要从L1发送一个带有**TWO**值的有效载荷。

source: // Let's send the value 1 as a u256 in cairo: low = 1, high = 0.
es: // Vamos a enviar el valor 1 como un u256 en el cairo: bajo = 1, alto = 0.
fr: // Envoyons la valeur 1 comme u256 dans cairo: low = 1, high = 0.
tr: // 1 değerini cairo cinsinden u256 olarak gönderelim: düşük = 1, yüksek = 0.
zh_cn: 让我们把价值1 以 u256 在cairo: 低= 1, 高= 0。

source: If you want to learn more about the messaging mechanism, you can visit the [Starknet documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
es: Si desea obtener más información sobre el mecanismo de mensajería, puede visitar la [Documentación Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
fr: Si vous souhaitez en savoir plus sur le mécanisme de messagerie, vous pouvez consulter la [documentation Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Réseau_Architecture/messaging-mechanism/).
id: Jika Anda ingin mengetahui lebih banyak tentang mekanisme pesan, Anda dapat mengunjungi [Trekumentasi Starknet][Architecture/Architecture/messaging-mechanism/).
tr: Mesajlaşma mekanizması hakkında daha fazla bilgi edinmek isterseniz [Starknet documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/message-mechanism/) adresini ziyaret edebilirsiniz.
zh_cn: 如果您想更多地了解信息传递机制,请访问[Starknet文件] (https://docs.starknet.io/documentation/architecture_and_concepts/Network_Archarture/Message-mechanism/)。

source: You can also find a [detailed guide here](https://github.com/glihm/starknet-messaging-dev) to test the messaging system locally.
es: También puede encontrar una [guía detallada aquí](https://github.com/glihm/starknet-messaging-dev) para probar el sistema de mensajería localmente.
fr: Vous pouvez également trouver un [guide détaillé ici](https://github.com/glihm/starknet-messaging-dev) pour tester localement le système de messagerie.
id: Anda juga dapat menemukan sebuah panduan [detailed di sini][https://gitub.com/glihm/starknet-message-dev) untuk menguji pesan sistem lokal.
tr: Ayrıca, mesajlaşma sistemini yerel olarak test etmek için bir [ayrıntılı kılavuz burada] (https://github.com/glihm/starknet-message-dev) bulabilirsiniz.
zh_cn: 您也可在当地(https://github.com/glihm/starknet-message-dev)找到一个[此处详细指南](https://github.com/glihm/starknet-Message-dev)测试发信系统。
