Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Entry and Finalize
es: Entrada y finalización
fr: Entrée et finalisation
id: Entri dan Finalize
tr: Giriş ve Sona Erdirme
zh_cn: 并最后审定

source: In the ["Dictionaries Underneath"](./ch03-02-dictionaries.md#dictionaries-underneath) section, we explained how `Felt252Dict<T>` internally worked. It was a list of entries for each time the dictionary was accessed in any manner. It would first find the last entry given a certain `key` and then update it accordingly to whatever operation it was executing. The Cairo language gives us the tools to replicate this ourselves through the `entry` and `finalize` methods.
es: En la sección ["Diccionarios debajo"](./ch03-02-dictionarys.md#dictionarys-underneath) explicamos cómo funcionaba internamente `Felt252Dict<T®. Era una lista de entradas para cada vez que se accedía al diccionario de cualquier manera. Primero encontraría la última entrada dada una cierta `clave` y luego la actualizaría en consecuencia a cualquier operación que estuviera ejecutando. El idioma de El Cairo nos da las herramientas para replicar esto nosotros mismos a través de los métodos `entrada` y `finalizar`.
fr: Dans la section [./ch03-02-dictionaries.md#dictionaries-underneath), nous avons expliqué comment fonctionnait `Felt252Dict<T>` en interne. Il s'agissait d'une liste d'entrées pour chaque fois que le dictionnaire était accessible de quelque manière que ce soit. Il trouverait d'abord la dernière entrée donnée une certaine `clé` et ensuite la mettre à jour en fonction de l'opération qu'il exécute. Le langage du Caire nous donne les outils pour reproduire nous-mêmes à travers les méthodes `entry` et `finalize`.
id: Dalam bagian ["Dictionary Underneath"] (Dictionary Underneath"). /ch03-02-Dictionary.md#dictionary-underneground), kami menjelaskan bagaimana "Felt252Dict<T> secara internal bekerja. Ini adalah daftar masukan untuk setiap kali kamus diakses dengan cara apapun. Pertama kali akan menemukan entri terakhir diberikan ▪keyán dan kemudian memperbaruinya sesuai dengan operasi apapun itu. Bahasa Kairo memberi kita alat untuk mereplikasi ini melalui metode SPEAKentry dan quest finalisasi.
tr: ["Dictionaries Underneath"](./ch03-02-dictionaries.md#dictionaries-underneath] bölümünde, Felt252DictT>'nin dahili olarak nasıl çalıştığını açıkladık. Sözlük herhangi bir şekilde erişildiğinde her girişin bir listesiydi. Önce belirli bir key verilen son girişi bulur ve daha sonra bu işlemi yapmak için bize göre günceller.
zh_cn: 我们解释了“Felt252Dict<T”的内部工作方式,这是每次以任何方式访问字典时的条目清单,首先找到最后一个条目,给它一个特定的`关键',然后根据它执行的任何操作对它进行相应的更新。开罗语言为我们提供了通过`输入'和`最后化'方法复制它的工具。

source: The `entry` method comes as part of `Felt252DictTrait<T>` with the purpose of creating a new entry given a certain key. Once called, this method takes ownership of the dictionary and returns the entry to update. The method signature is as follows:
es: El método `entrada` viene como parte de `Felt252DictTrait<T® con el propósito de crear una nueva entrada dada una cierta clave. Una vez llamado, este método toma la propiedad del diccionario y devuelve la entrada a actualizar. La firma del método es la siguiente:
fr: La méthode `entry` fait partie de `Felt252DictTrait<T>` dans le but de créer une nouvelle entrée avec une certaine clé. Une fois appelée, cette méthode prend la propriété du dictionnaire et retourne l'entrée à la mise à jour. La signature de la méthode est la suivante:
id: Metode reentry datang sebagai bagian dari åFelt252DictTrait<T> dengan tujuan membuat entri baru yang diberikan kunci tertentu. Setelah dipanggil, metode ini mengambil kepemilikan kamus dan mengembalikan entri untuk memperbarui. Metode signature adalah sebagai berikut:
tr: entry yöntemi, belirli bir anahtar verilen yeni bir girdi oluşturmak amacıyla Felt252DictTraitT> 'nin bir parçası olarak gelir. Bir kez çağrıldığında, bu yöntem sözlüğün mülkiyetini alır ve güncellemek için girdiyi döndürür. Yöntem imzası aşağıdaki gibidir:
zh_cn: `输入'方法作为`Felt252DictTrait <T'的一部分而出现,目的是创建一个给定某个密钥的新条目。该方法一旦被调用,即取得对字典的所有权,并返回条目更新。方法签字如下:

source: The first input parameter takes ownership of the dictionary while the second one is used to create the appropriate entry. It returns a tuple containing a `Felt252DictEntry<T>`, which is the type used by Cairo to represent dictionary entries, and a `T` representing the value held previously. The `nopanic` notation simply indicates that the function is guaranteed to never panic.
es: El primer parámetro de entrada se hace cargo del diccionario, mientras que el segundo se utiliza para crear la entrada apropiada. Devuelve una tupla que contiene una `Felt252DictEntry<T®, que es el tipo utilizado por El Cairo para representar las entradas del diccionario, y una `T` que representa el valor mantenido anteriormente. La notación `nopanic` simplemente indica que la función está garantizada para nunca entrar en pánico.
fr: Le premier paramètre d'entrée prend la propriété du dictionnaire tandis que le second est utilisé pour créer l'entrée appropriée. Il retourne un tuple contenant un `Felt252DictEntry<T>`, qui est le type utilisé par le Caire pour représenter les entrées de dictionnaire, et un `T` représentant la valeur détenue précédemment. La notation `nopanic` indique simplement que la fonction est garantie de ne jamais paniquer.
id: Parameter masukan pertama mengambil kepemilikan kamus sementara yang kedua digunakan untuk membuat entri yang sesuai. Ini mengembalikan sebuah tuple yang berisi nolet 252 Dict Entry<T>, yang merupakan tipe yang digunakan oleh Kairo untuk mewakili masukan kamus, dan sebuah tuple yang mewakili nilai yang diadakan sebelumnya. Nopanicâ notasi hanya menunjukkan bahwa fungsi dijamin untuk tidak pernah panik.
tr: İlk girdi parametresi, uygun girdiyi oluşturmak için kullanılırken sözlüğün mülkiyetini alır. Kahire tarafından sözlük girdilerini temsil etmek için kullanılan tür olan Felt252DictEntryT> içeren bir tuple döndürür ve daha önce tutulan değeri temsil eden bir T notasyonudur. nopanic notasyonu, işlevin asla paniklememesinin garanti edildiğini gösterir.
zh_cn: 第一个输入参数对字典拥有所有权, 而第二个参数用于创建合适的条目。 它返回含有“ Felt252Dictintry < T” 的图普, 这是开罗用来代表字典条目的类型, 并返回代表先前持有的值的“ T” 。 “ 普遍” 符号只是表示函数保证永远不惊慌。

source: The next thing to do is to update the entry with the new value. For this, we use the `finalize` method which inserts the entry and returns ownership of the dictionary:
es: Lo siguiente que hay que hacer es actualizar la entrada con el nuevo valor. Para esto, utilizamos el método `finalizar` que inserta la entrada y devuelve la propiedad del diccionario:
fr: La prochaine chose à faire est de mettre à jour l'entrée avec la nouvelle valeur. Pour cela, nous utilisons la méthode `finalise` qui insère l'entrée et retourne la propriété du dictionnaire:
id: Hal berikutnya yang harus dilakukan adalah memperbarui entri dengan nilai baru untuk ini, kita menggunakan metode akhir yang menyisipkan entri dan mengembalikan kepemilikan kamus:
tr: Bir sonraki yapılacak şey, girdiyi yeni değerle güncellemektir. Bunun için, girdiyi ekleyen ve sözlüğün mülkiyetini iade eden finalize yöntemini kullanıyoruz:
zh_cn: 接下来要做的是用新值更新条目。 为此, 我们使用“ 最终化” 方法, 插入字典的条目和返回所有权 :

source: This method receives the entry and the new value as parameters, and returns the updated dictionary.
es: Este método recibe la entrada y el nuevo valor como parámetros, y devuelve el diccionario actualizado.
fr: Cette méthode reçoit l'entrée et la nouvelle valeur en tant que paramètres, et retourne le dictionnaire mis à jour.
id: Metode ini menerima entri dan nilai baru sebagai parameter, dan mengembalikan kamus yang diperbarui.
tr: Bu yöntem girdiyi ve yeni değeri parametre olarak alır ve güncellenmiş sözlüğü döndürür.
zh_cn: 此方法接收条目和新值作为参数, 并返回更新的字典 。

source: Let us see an example using `entry` and `finalize`. Imagine we would like to implement our own version of the `get` method from a dictionary. We should then do the following:
es: Veamos un ejemplo usando `entrada` y `finalizar`. Imaginemos que quisiéramos implementar nuestra propia versión del método `get` de un diccionario. Entonces deberíamos hacer lo siguiente:
fr: Voyons un exemple utilisant `entry` et `finalize`. Imaginez que nous aimerions mettre en œuvre notre propre version de la méthode `get` à partir d'un dictionnaire. Nous devrions alors faire ce qui suit:
id: Mari kita lihat sebuah contoh yang menggunakan kamus.
tr: entry ve finalize kullanarak bir örnek görelim. Bir sözlükten get yönteminin kendi sürümünü uygulamak istediğimizi düşünün. O zaman şunları yapmalıyız:
zh_cn: 让我们以`进入'和`最后定本'为例,想象一下我们想从字典中执行我们自己版本的`获取'方法。

source: Create the new entry to add using the `entry` method.
es: Crear la nueva entrada para añadir usando el método `entrada`.
fr: Créez la nouvelle entrée à ajouter en utilisant la méthode `entry`.
id: Buat entry baru untuk menambahkan menggunakan metoda réentry.
tr: entry yöntemini kullanarak eklemek için yeni girişi oluşturun.
zh_cn: 创建使用“输入”方法添加的新条目。

source: Insert back the entry where the `new_value` equals the `previous_value`.
es: Inserte de nuevo la entrada donde el `nuevo_valor` es igual al `valor_anterior`.
fr: Insérer en arrière l'entrée où la valeur `new_value` est égale à la valeur `previous_value`.
id: Masukkan kembali ke tempat di mana nilai baru sama dengan previous_value.
tr: new_value'nin previous_value'ye eşit olduğu girdiyi geri ekleyin.
zh_cn: 在“新价值”等于“前一价值”的条目后插入“新价值”的条目。

source: Return the value.
es: Devuelve el valor.
fr: Retourne la valeur.
id: Kembalikan nilainya.
tr: Değeri iade et.
zh_cn: 回报价值。

source: Implementing our custom get would look like this:
es: La implementación de nuestro get personalizado se vería así:
fr: Mettre en œuvre notre get personnalisé ressemblerait à ceci:
id: Mengimplementasikan kustom kami mendapatkan akan terlihat seperti ini:
tr: Bizim özel almak uygulamak şu şekilde görünecektir:
zh_cn: 执行我们的习俗 看起来像这样:

source: // Get the new entry and the previous value held at `key`
es: // Obtener la nueva entrada y el valor anterior mantenido en `key`
fr: // Obtenez la nouvelle entrée et la valeur précédente à `key`
id: //Dapatkan entri baru dan nilai sebelumnya disimpan di åkey
tr: // Yeni girişi ve key'de tutulan önceki değeri alın
zh_cn: // 获取新条目和先前的“ Key' ” 中保存的值

source: // Store the value to return
es: // Almacenar el valor a devolver
fr: // Conservez la valeur à retourner
id: //Simpan nilai untuk kembali
tr: // Geri dönmek için değeri depola
zh_cn: / 存储要返回的值

source: // Update the entry with `prev_value` and get back ownership of the dictionary
es: // Actualizar la entrada con `prev_value` y recuperar la propiedad del diccionario
fr: // Mettre à jour l'entrée avec `prev_value` et récupérer la propriété du dictionnaire
id: //Perbarui entri dengan óprev_value dan dapatkan kembali kepemilikan kamus
tr: // prev_value ile girişi güncelleyin ve sözlüğün mülkiyetini geri alın
zh_cn: / 以“prev_value”更新条目,并恢复对字典的所有权

source: // Return the read value
es: // Devuelve el valor de lectura
fr: // Retourne la valeur de lecture
id: //Kembalikan nilai baca
tr: // Okuma değerini döndür
zh_cn: / 返回读数

source: The `ref` keyword means that the ownership of the variable will be given back at the end of the function. This concept will be explained in more detail in the ["References and Snapshots"](./ch04-02-references-and-snapshots.md) section.
es: La palabra clave `ref` significa que la propiedad de la variable se devolverá al final de la función. Este concepto se explicará con más detalle en la sección ["Referencias y instantáneas"](./ch04-02-references-and-snapshots.md).
fr: Le mot-clé `ref` signifie que la propriété de la variable sera restituée à la fin de la fonction. Ce concept sera expliqué plus en détail dans la section ["Références et Snapshots"](./ch04-02-références-et-snapshots.md).
id: Kata kuncinya berarti kepemilikan variabel akan diberikan kembali pada akhir fungsi. Konsep ini akan dijelaskan secara lebih rinci dalam bagian ["Perubahan dan Snapshots"]./ch04-02-referensi-and-snappshots.md).
tr: ref anahtar kelimesi, değişkenin mülkiyetinin fonksiyonun sonunda geri verileceği anlamına gelir. Bu kavram ["References and Snapshots"] (./ch04-02-references-and-snapshots.md) bölümünde daha ayrıntılı olarak açıklanacaktır.
zh_cn: `ref'关键字是指变量的所有权将回溯到函数的末尾,这一概念将在[“参考和抓图”(./ch04-02-references-and-snapshots.md)部分更详细地解释。

source: Implementing the `insert` method would follow a similar workflow, except for inserting a new value when finalizing. If we were to implement it, it would look like the following:
es: La aplicación del método `insertar` seguiría un flujo de trabajo similar, excepto para insertar un nuevo valor al finalizar. Si lo hiciéramos, parecería lo siguiente:
fr: La mise en œuvre de la méthode `insert` suivrait un flux de travail similaire, à l'exception de l'insertion d'une nouvelle valeur lors de la finalisation. Si nous devions la mettre en œuvre, cela ressemblerait à ce qui suit :
id: Mengimplementasikan metode æinserté akan mengikuti alur kerja yang sama, kecuali untuk menyisipkan nilai baru ketika menyelesaikan.
tr: insert yöntemini uygulamak, sonuçlandırırken yeni bir değer eklemek dışında, benzer bir iş akışını izleyecektir. Eğer uygulayacak olsaydık, aşağıdaki gibi görünürdü:
zh_cn: 实施`插入'方法将遵循类似的工作流程,除非在最后敲定时插入新的值。

source: // Get the last entry associated with `key` // Notice that if `key` does not exist, `_prev_value` will // be the default value of T.
es: // Obtener la última entrada asociada con `key` // Observe que si `key` no existe, `_prev_value` será // el valor predeterminado de T.
fr: // Obtenez la dernière entrée associée à `key` // Notez que si `key` n'existe pas, `_prev_value` sera // la valeur par défaut de T.
id: //Dapatkan masukan terakhir yang berhubungan dengan ıkey / / / / Perhatikan bahwa jika åkey tidak ada, 'prev_value' akan / / menjadi nilai baku dari T.
tr: // key ile ilişkili son girdiyi alın // key yoksa, _prev_value // T'nin varsayılan değeri olacağına dikkat edin.
zh_cn: / 获得与`关键'//通知相关的最后一个条目,即如果`关键'不存在,则`prev_value'将//是T的默认值。

source: // Insert `entry` back in the dictionary with the updated value, // and receive ownership of the dictionary
es: // Inserta `entrada` en el diccionario con el valor actualizado, // y recibe la propiedad del diccionario
fr: // Insérez `entry` de retour dans le dictionnaire avec la valeur mise à jour, // et recevez la propriété du dictionnaire
id: //Masukkan kembali dalam kamus dengan nilai terbaru,//dan menerima kepemilikan kamus
tr: // entry'yi güncellenmiş değerle sözlüğe geri ekleyin, // ve sözlüğün mülkiyetini alın
zh_cn: //在字典中加上`输入',加上更新值,///和接受对字典的所有权。

source: As a finalizing note, these two methods are implemented in a similar way to how `insert` and `get` are implemented for `Felt252Dict<T>`. This code shows some example usage:
es: Como nota final, estos dos métodos se aplican de manera similar a la forma en que se aplican `insertar` y `obtener` para `Felt252Dict<T®. Este código muestra algunos ejemplos de uso:
fr: En guise de conclusion, ces deux méthodes sont mises en œuvre de la même manière que `insert` et `get` sont mises en œuvre pour `Felt252Dict<T>`. Ce code montre un exemple d'utilisation:
id: Sebagai catatan akhir, kedua metode ini diterapkan dengan cara yang sama dengan bagaimana åinsert dan ågetÃ diimplementasikan untuk <T 252 Dict. Kode ini menunjukkan beberapa contoh penggunaan:
tr: Nihai bir not olarak, bu iki yöntem Felt252DictT> için insert ve get'nin nasıl uygulandığına benzer şekilde uygulanır. Bu kod bazı örnek kullanımları gösterir:
zh_cn: 最后一点是,这两种方法的实施方式与Felt252Dict<T_BAR_Felt252Dit_T_BAR__BAR_如何实施“插入”和“获取”方法相类似。

source: // Get the last entry associated with `key`
es: // Obtener la última entrada asociada con `key`
fr: // Obtenez la dernière entrée associée à `key`
id: //Dapatkan entri terakhir yang terkait dengan kunci
tr: // key ile ilişkili son girdiyi alın
zh_cn: // 获取与`关键'相关的最后一个条目

source: // Notice that if `key` does not exist, `_prev_value` will
es: // Tenga en cuenta que si `clave` no existe, `_prev_value '
fr: // Notez que si `key` n'existe pas, `_prev_value` sera
id: //perhatian jika kunci tidak ada,_prev_value akan
tr: // key yoksa, _prev_value'nin var olacağını unutmayın.
zh_cn: / 通知,如果`关键`不存在,`prev_value'将

source: // be the default value of T.
es: // ser el valor predeterminado de T.
fr: // soit la valeur par défaut de T.
id: ///Jadilah nilai dasar dari T.
tr: // T'nin varsayılan değeri ol.
zh_cn: / 是 T 的默认值 。

source: // Insert `entry` back in the dictionary with the updated value,
es: // Inserta `entrada` en el diccionario con el valor actualizado,
fr: // Insérer `entry` de retour dans le dictionnaire avec la valeur mise à jour,
id: //Masukkan kembali dalam kamus dengan nilai terbaru,
tr: // Güncellenmiş değerle entry'yi sözlüğe geri ekleyin,
zh_cn: / 在字典中加上`输入',加上更新值,

source: // and receive ownership of the dictionary
es: // y recibir la propiedad del diccionario
fr: // et recevoir la propriété du dictionnaire
id: //dan menerima kepemilikan kamus
tr: // ve sözlüğün mülkiyetini almak
zh_cn: / 并获得对字典的所有权

source: "Expecting 100"
es: "Esperando 100"
fr: "En attente de 100"
id: "Menduga 100"
tr: "Fazla 100"
zh_cn: "预期100"

source: Dictionaries of Types not Supported Natively
es: Diccionarios de tipos no apoyados por los nativos
fr: Dictionnaires de types non pris en charge par les Autochtones
id: Kamus Tipe yang Tidak Didukung Asli
tr: Yerli Olarak Desteklenmeyen Türlerin Sözlükleri
zh_cn: 不支持类型词典

source: One restriction of `Felt252Dict<T>` that we haven't talked about is the trait `Felt252DictValue<T>`. This trait defines the `zero_default` method which is the one that gets called when a value does not exist in the dictionary. This is implemented by some common data types, such as most unsigned integers, `bool` and `felt252` - but it is not implemented for more complex types such as arrays, structs (including `u256`), and other types from the core library. This means that making a dictionary of types not natively supported is not a straightforward task, because you would need to write a couple of trait implementations in order to make the data type a valid dictionary value type. To compensate this, you can wrap your type inside a `Nullable<T>`.
es: Una restricción de `Felt252Dict<T® de la que no hemos hablado es el rasgo `Felt252DictValue<T®. Este rasgo define el método `zero_default` que es el que se llama cuando un valor no existe en el diccionario. Esto se implementa por algunos tipos de datos comunes, como la mayoría de los enteros no firmados, `bool` y `felt252` - pero no se implementa para tipos más complejos como arrays, structs (incluyendo `u256`), y otros tipos de la biblioteca central. Esto significa que hacer un diccionario de tipos no soportados nativamente no es una tarea sencilla, porque necesitarías escribir un par de implementaciones de rasgo para hacer que el tipo de datos sea un tipo de valor válido del diccionario. Para compensar esto, puedes envolver tu tipo dentro de un `Nullable<T.
fr: Une restriction de `Felt252Dict<T>` dont nous n'avons pas parlé est le trait `Felt252DictValue<T>`. Ce trait définit la méthode `zero_default` qui est appelée quand une valeur n'existe pas dans le dictionnaire. Ceci est implémenté par certains types de données communs, tels que la plupart des entiers non signés, `bool` et `felt252` - mais il n'est pas implémenté pour des types plus complexes tels que les tableaux, les structures (y compris `u256`), et d'autres types de la bibliothèque centrale. Cela signifie que faire un dictionnaire de types non pris en charge nativement n'est pas une tâche simple, parce que vous auriez besoin d'écrire quelques implémentations de caractères pour faire du type de données un type de valeur de dictionnaire valide. Pour compenser cela, vous pouvez envelopper votre type à l'intérieur d'un `Nullable<T>`.
id: Salah satu pembatasan dari Felt252Dict<T> yang belum kita bicarakan adalah sifat yang tidak ada dalam kamus. Ini diterapkan oleh beberapa tipe data umum, seperti tipe integer yang belum ditandai, ▪bool dan ERTI252-- tapi itu tidak diterapkan untuk tipe yang lebih kompleks seperti array, struct (termasuk 25), dan dari tipe-tipe inti lainnya. Ini berarti bahwa membuat kamu tidak akan membutuhkan sebuah tipe yang tepat untuk membuat sebuah tipe data yang valid karena kamu akan membuat sebuah tipe yang valid.
tr: Felt252DictT> hakkında konuşmadığımız bir kısıtlama Felt252DictValueT> özelliğidir. Bu özellik, sözlükte bir değer bulunmadığında çağrılan zero_default yöntemini tanımlar. Bu, imzasız tamsayılar, bool ve felt25 gibi bazı yaygın veri türleri tarafından uygulanır.
zh_cn: “Felt252Dict<T” 中我们没有谈到的一个限制是“Felt252DictValue<T”的特性。 此特性定义了“ 零- 默认” 方法, 即当字典中不存在值时被调用的方法。 这是用一些常见的数据类型执行的, 如大多数未符号的整数、 `bool' 和`felt252', 但对于阵列、 strutcts( 包括` u256' ) 和核心库中的其他类型等更复杂的类型没有执行。 这意味着, 制作本地不支持的类型的字典并不是一项简单的任务, 因为您需要写几个特性执行功能, 才能使数据类型成为有效的字典值类型。 为了补偿这一点, 您可以在“ Nullable < T” 中包装您的类型。

source: `Nullable<T>` is a smart pointer type that can either point to a value or be `null` in the absence of value. It is usually used in Object Oriented Programming Languages when a reference doesn't point anywhere. The difference with `Option` is that the wrapped value is stored inside a `Box<T>` data type. The `Box<T>` type is a smart pointer that allows us to use a dedicated `boxed_segment` memory segment for our data, and access this segment using a pointer that can only be manipulated in one place at a time. See [Smart Pointers Chapter](./ch11-02-smart-pointers.md) for more information.
es: `Nulable<T® es un tipo de puntero inteligente que puede apuntar a un valor o ser `null` en ausencia de valor. Usualmente se utiliza en lenguajes de programación orientados a objetos cuando una referencia no apunta a ninguna parte. La diferencia con `Opción` es que el valor envuelto se almacena dentro de un tipo de datos `Box<T́. El tipo `Box<T́ es un puntero inteligente que nos permite utilizar un segmento de memoria dedicado `boxed_segment` para nuestros datos, y acceder a este segmento utilizando un puntero que sólo puede ser manipulado en un lugar a la vez. Véase [Smart Pointers Chapter](./ch11-02-smart-pointers.md) para obtener más información.
fr: `Nullable<T>` est un type de pointeur intelligent qui peut pointer vers une valeur ou être `null` en l'absence de valeur. Il est habituellement utilisé dans les langages de programmation orientés objet lorsqu'une référence ne pointe nulle part. La différence avec `Option` est que la valeur enveloppée est stockée dans un type de données `Box<T>`. Le type `Box<T>` est un pointeur intelligent qui nous permet d'utiliser un segment de mémoire `boxed_segment` dédié pour nos données, et d'accéder à ce segment en utilisant un pointeur qui ne peut être manipulé qu'à un seul endroit à la fois. Voir [Smart Pointers Chapter](./ch11-02-smart-pointers.md) pour plus d'informations.
id: Dalam tidak adanya nilai. Hal ini biasanya digunakan dalam tipe Programming Bahasa Oriented Objek ketika sebuah referensi tidak menunjuk di mana saja. Perbedaan dengan otopsi adalah bahwa nilai yang dibungkus dalam tipe data ÉBox<T>. Tipe data tersebut adalah tipe penunjuk cerdas yang memungkinkan kita untuk menggunakan segmen memori yang didedikasikan untuk data kita, dan ini hanya dapat digunakan di satu tempat pada satu tempat.
tr: NullableT>, değer yokluğunda bir değere işaret edebilen veya null olabilen akıllı bir işaretçi türüdür. Bir referans herhangi bir yere işaret etmediğinde genellikle Nesne Yönlü Programlama Dillerinde kullanılır. Option ile fark, sarılmış değerin bir BoxT> veri türünde depolanabilmesidir. BoxT> tipi, bu kullanım için akıllı bir işaretçidir.
zh_cn: `Nullallble<T}是一种智能指针类型,可以指向一个值,也可以指向一个值,或者在没有值的情况下是`Nullble<T'。当一个引用没有指向任何地方时,它通常用于对象定向编程语言。与`Option'的区别在于包包藏值存储在`Box<T}数据类型中。`Box<T}类型是一个智能指针,它使我们能够为我们的数据使用专用的`boxed_segment'内存部分,并使用只能一次在一个地方操作的指针访问此段。更多信息见[Smart指针章](./ch11-02-Smart-point-pointers.md)。
