Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: `Trait not found. Not a trait.`: this error can occur when you're not importing the component's impl block correctly in your contract. Make sure to respect the following syntax:
es: `Trato no encontrado. No es un rasgo.`: este error puede ocurrir cuando no está importando correctamente el bloque de impl del componente en su contrato. Asegúrese de respetar la siguiente sintaxis:
fr: `Traitement non trouvé. Pas un trait.`: cette erreur peut se produire lorsque vous n'importez pas correctement le bloc impl du composant dans votre contrat. Assurez-vous de respecter la syntaxe suivante:
id: Tidak ditemukan. Tidak ada sifat. Kesalahan ini dapat terjadi ketika Anda tidak mengimpor blok impl komponen dengan benar dalam kontrak Anda. Pastikan untuk menghormati sintaks berikut:
tr: Trait bulunamadı. Bir özellik değil.: Bu hata, bileşenin impl bloğunu sözleşmenizde doğru bir şekilde içe aktarmadığınızda ortaya çıkabilir. Aşağıdaki sözdizimlerine saygı gösterdiğinizden emin olun:
zh_cn: `未找到交易, 没有特性.': 未在合同中正确导入组件的分解块时, 可能会发生此错误 。 请务必尊重以下语法 :

source: `Plugin diagnostic: name is not a substorage member in the contract's Storage. Consider adding to Storage: (...)`: the compiler helps you a lot debugging this by giving you recommendation on the action to take. Basically, you forgot to add the component's storage to your contract's storage. Make sure to add the path to the component's storage annotated with the `#[substorage(v0)]` attribute to your contract's storage.
es: `Plugin diagnostic: name is not a substorage member in the contract's Storage. Considere añadir a Storage: (...)`: el compilador le ayuda mucho a depurar esto dándole una recomendación sobre la acción a tomar. Básicamente, olvidó agregar el almacenamiento del componente al almacenamiento de su contrato. Asegúrese de añadir la ruta al almacenamiento del componente anotado con el atributo '[substorage(v0)]` al almacenamiento de su contrato.
fr: `Plugin diagnostic: name is not a substorage member in the contract's Storage. Envisagez d'ajouter à Storage: (...)`: le compilateur vous aide beaucoup à déboger cela en vous donnant des recommandations sur l'action à prendre. Fondamentalement, vous avez oublié d'ajouter le stockage du composant au stockage de votre contrat. Assurez-vous d'ajouter le chemin au stockage du composant annoté avec l'attribut `#[substorage(v0)]` au stockage de votre contrat.
id: Nama bukan substorage anggota dalam penyimpanan kontrak. Pertimbangkan untuk menambahkan ke Penyimpanan: (): compiler membantu Anda banyak debugging ini dengan memberikan Anda rekomendasi pada tindakan untuk mengambil. Pada dasarnya, Anda lupa untuk menambahkan komponen penyimpanan kontrak Anda. Pastikan untuk menambahkan jalan ke penyimpanan komponen yang diberi nama dengan "# [substorauxv0] atribut ke penyimpanan kontrak Anda.
tr: Plugin diagnostic: name is not a substorage member in the contract's Storage. Storage'a eklemeyi düşünün: (...): derleyici size eylem hakkında tavsiye vererek bunu hata ayıklamanıza yardımcı olur. Temel olarak, bileşenin depolamasını sözleşmenizin deposuna eklemeyi unuttunuz. #[substorages] özniteliğinizle belirtilen bileşenin depolamasına yol eklediğinizden emin olun.
zh_cn: `插件诊断: 名称不是合同储存中的子存储成员。 考虑添加到存储中 : (......) `: 编译器通过向您推荐要采取的行动来帮助您调试它。 基本上, 您忘记将部件的存储添加到合同的存储中。 请确定将部件的存储路径添加到 {[ 子存储(v0)] 中, 附加“ 合同储存中的属性 ” 。

source: `Plugin diagnostic: name is not a nested event in the contract's Event enum. Consider adding to the Event enum:` similar to the previous error, the compiler tells you that you forgot to add the component's events to your contract's events. Make sure to add the path to the component's events to your contract's events.
es: `Plugin diagnostic: name is not an nided event in the contract's Event enum. Considere añadir al Evento enum:` similar al error anterior, el compilador le dice que olvidó agregar los eventos del componente a los eventos del contrato. Asegúrese de agregar la ruta a los eventos del componente a los eventos del contrato.
fr: `Plugin diagnostic: name is not a itemed event in the contrat's Event enum. Envisagez d'ajouter à l'enum Event:` similaire à l'erreur précédente, le compilateur vous indique que vous avez oublié d'ajouter les événements du composant aux événements de votre contrat. Assurez-vous d'ajouter le chemin vers les événements du composant aux événements de votre contrat.
id: Pertimbangkan untuk menambahkannya ke Event Enum: yang mirip dengan kesalahan sebelumnya, kompiler memberitahu Anda bahwa Anda lupa untuk menambahkan peristiwa komponen pada acara kontrak Anda.
tr: Plugin diagnostik: ad, sözleşmenin Etkinlik enum'unda yerleşik bir olay değildir. Olay enum'una eklemeyi düşünün: önceki hataya benzer şekilde, derleyici, bileşenin olaylarını sözleşmenizin etkinliklerine eklemeyi unuttuğunuzu söyler. Bileşenin olaylarını sözleşmenizin etkinliklerine eklediğinizden emin olun.
zh_cn: `插件诊断 : 名称不是合同“ 事件” 中的嵌套事件 。 考虑在“ 事件” 中添加 : “ 类似于先前的错误, 编译者告诉您您忘记将部件的事件添加到合同的事件中 。 请确保将部件事件路径添加到合同“ 事件 ” 中 。

source: Appendix F - Useful Development Tools
es: Apéndice F - Herramientas de desarrollo útiles
fr: Annexe F - Outils de développement utiles
id: Lampiran Alat Pengembangan F - Berguna
tr: Ek F - Faydalı Geliştirme Araçları
zh_cn: 附录F - 有用的发展工具

source: In this appendix, we talk about some useful development tools that the Cairo project provides. We’ll look at automatic formatting, quick ways to apply warning fixes, a linter, and integrating with IDEs.
es: En este apéndice, hablamos de algunas herramientas de desarrollo útiles que ofrece el proyecto de El Cairo. Vamos a ver el formateo automático, formas rápidas de aplicar correcciones de advertencia, un linter, y la integración con IDEs.
fr: Dans cette annexe, nous parlons de quelques outils de développement utiles que le projet du Caire fournit. Nous allons examiner le formatage automatique, les moyens rapides d'appliquer des correctifs d'avertissement, un linter, et l'intégration avec les IDE.
id: Dalam apendiks ini, kita berbicara tentang beberapa alat pengembangan berguna yang disediakan proyek Kairo. kita akan melihat formatting otomatis, cara cepat untuk menerapkan perbaikan peringatan, liter, dan mengintegrasikan dengan IDE.
tr: Bu ekte, Kahire projesinin sağladığı bazı yararlı geliştirme araçlarından bahsediyoruz. Otomatik biçimlendirmeye, uyarı düzeltmelerini uygulamanın hızlı yollarına, bir linter'a ve IDE'lerle bütünleşmeye bakacağız.
zh_cn: 在本附录中,我们谈论了开罗项目提供的一些有用的发展工具。 我们将研究自动格式化、快速应用警告修补、隔热和与IDES整合的方法。

source: Automatic Formatting with `scarb fmt`
es: Formato automático con `scarb fmt`
fr: Formatage automatique avec `scarb fmt`
id: Pemformatan otomatis dengan fmt åscarb
tr: scarb fmt ile otomatik biçimlendirme
zh_cn: “scarb fmt” 自动格式化

source: Scarb projects can be formatted using the `scarb fmt` command. If you're using the Cairo binaries directly, you can run `cairo-format` instead. Many collaborative projects use `scarb fmt` to prevent arguments about which style to use when writing Cairo: everyone formats their code using the tool.
es: Los proyectos de Scarb se pueden formatear usando el comando `scarb fmt`. Si está usando los binarios de El Cairo directamente, puede ejecutar `cairo-formato` en su lugar. Muchos proyectos de colaboración utilizan `scarb fmt` para evitar argumentos sobre qué estilo usar al escribir El Cairo: cada uno formatea su código usando la herramienta.
fr: Les projets Scarb peuvent être formatés en utilisant la commande `scarb fmt`. Si vous utilisez les binaires du Caire directement, vous pouvez exécuter `cairo-format` à la place. De nombreux projets collaboratifs utilisent `scarb fmt` pour empêcher les arguments sur le style à utiliser lors de l'écriture du Caire: tout le monde formate leur code à l'aide de l'outil.
id: Proyek-proyek scarb dapat diformat dengan menggunakan perintah fmt. Jika Anda menggunakan binaries Kairo secara langsung, Anda dapat menjalankan åcairo-formatán. Banyak proyek kolaboratif menggunakan thosecarb fmt. untuk mencegah argumen tentang gaya mana yang digunakan ketika menulis Kairo: semua orang format kode mereka menggunakan alat tersebut.
tr: Scarb projeleri scarb fmt komutu kullanılarak biçimlendirilebilir. Kahire ikililerini doğrudan kullanıyorsanız, bunun yerine cairo-format çalıştırabilirsiniz. Birçok işbirlikçi proje, Kahire'yi yazarken hangi stili kullanacağına dair argümanları önlemek için scarb fmt kullanır: herkes aracı kullanarak kodlarını biçimlendirir.
zh_cn: 疤痕项目可以使用“ scarb fmt” 命令格式化。 如果您直接使用开罗二进制文件, 您可以运行“ cairo-format ” 。 许多合作项目使用“ scarb Fmt ” 来防止在撰写开罗文件时使用哪种样式的争论: 每个人都使用工具格式化代码 。

source: To format any Cairo project, enter the following inside the project directory:
es: Para formatear cualquier proyecto de El Cairo, introduzca lo siguiente dentro del directorio del proyecto:
fr: Pour formater n'importe quel projet du Caire, entrez ce qui suit dans le répertoire du projet :
id: Untuk memformat projek Kairo mana pun, masukkan berikut di dalam direktori projek:
tr: Herhangi bir Kahire projesini biçimlendirmek için, proje dizininin içine aşağıdakileri girin:
zh_cn: 要格式化开罗工程,请在项目目录内输入以下内容:

source: IDE Integration Using `cairo-language-server`
es: Integración IDE Usando `cairo-lenguaje-servidor'
fr: Intégration de l'IDE en utilisant `cairo-language-server`
id: IDE Integration Uring ▪cairo-language-server)
tr: IDE Entegrasyon cairo-language-server kullanarak
zh_cn: IDE 利用“开罗语言服务器”实现一体化

source: To help IDE integration, the Cairo community recommends using the [`cairo-language-server`](https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-language-server)<!-- ignore -->. This tool is a set of compiler-centric utilities that speaks the [Language Server Protocol](http://langserver.org/)<!-- ignore -->, which is a specification for IDEs and programming languages to communicate with each other. Different clients can use `cairo-language-server`, such as [the Cairo extension for Visual Studio Code](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1).
es: Para ayudar a la integración del IDE, la comunidad de El Cairo recomienda que se utilice el [`cairo-language-server`] (https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-language-server)<!-- ignore -->. Esta herramienta es un conjunto de utilidades centradas en compiladores que habla el [Protocolo de servidor de idiomas](http://langserver.org/)<!-- ignore -->, que es una especificación para que los IDE y los lenguajes de programación se comuniquen entre sí. Diferentes clientes pueden utilizar el `cairo-language-server`, como [la extensión de El Cairo para el Código de Visual Studio](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1).
fr: Pour faciliter l'intégration de l'IDE, la communauté du Caire recommande d'utiliser le [`cairo-language-server``](https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-language-server)<!-- ignore -->. Cet outil est un ensemble d'utilitaires centrés sur le compilateur qui parle le [Protocole de serveur de langue](http://langserver.org/)<!-- ignore -->, qui est une spécification pour les IDE et les langages de programmation pour communiquer entre eux.
id: Untuk membantu integrasi IDE, komunitas Kairo merekomendasikan penggunaan [Negara-Lang-server] -->. Alat ini adalah perangkat dari utilitas kompiler-entris yang menggunakan Protokol Server-Starkware/cairo/tree/main/crates/cairo-lang-lang-server)< --> yang khusus untuk program dan bahasa untuk setiap klien lain. Yang berbeda dapat menggunakan protilitas yang menggunakan protokol server-sayogira, seperti penghidupan Visual.org/ -->, yang khusus untuk programing dan pemograman dengan setiap klien lain.
tr: IDE entegrasyonuna yardımcı olmak için, Kahire topluluğu [cairo-language-server](https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-language-server]!-- görmezden gelin --> için [Language Server Protocol](http://lang.org/) görmezden gelinen bir derleyici-merkezli yardımcı program kümesidir.
zh_cn: 为了帮助IDE的一体化,开罗社区建议使用[`cairo-langue-server'] (https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-lanng-lange-server) <! -- 忽略 > 。这个工具是一套能够使用[Language Server协议](http://langserver.org/)的编译者中心公用设施(http://langserver.org/) <!- 忽略 -- >,这是IDEs和编程语言相互交流的规格。不同的客户可以使用“cairo-lango-server”,例如[视觉工作室代码开罗扩展] (https://markedplace.visualstudiostudio.com/items?itemsNames=starkware.cairo1]。

source: Visit the `vscode-cairo` [page](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)<!-- ignore --> to install it on VSCode. You will get abilities such as autocompletion, jump to definition, and inline errors.
es: Visite el `vscode-cairo` [página](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)<!-- ignore --> para instalarlo en VSOde. Obtendrá habilidades como autocompletado, salto a la definición y errores en línea.
fr: Visitez le `vscode-cairo` [page](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)<!-- ignorez --> pour l'installer sur VSCode. Vous obtiendrez des capacités telles que l'autocomplètement, le saut vers la définition et les erreurs inline.
id: Kunjungi åvscode-cairo--iro [page][page] 1964https://marketplace.vistudio.com/items?item=starkware.cairo1)<-- abaikan --> untuk memasangnya di VSCode. Anda akan memperoleh kemampuan seperti pelengkapan otomatis, melompat ke definisi, dan kesalahan inline.
tr: vscode-cairo [sayfa](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)!-- görmezden gelin -> VSCode'a yüklemek için. Otomatik tamamlama, tanıma atlama ve satır içi hatalar gibi yetenekler elde edeceksiniz.
zh_cn: 访问“ vscode-cairo” [page] (https://markedplace. visualstudio.com/items?itemName=starkware.cairo1) <!- 忽略 -- -- 将其安装在 VSCode 上。 您将获得自动补全、 跳转到定义和内嵌错误等能力 。

source: Note: If you have Scarb installed, it should work out of the box with the Cairo VSCode extension, without a manual installation of the language server.
es: Nota: Si usted tiene Scarb instalado, debe funcionar fuera de la caja con la extensión de El Cairo VSCode, sin una instalación manual del servidor de idiomas.
fr: Remarque: Si vous avez installé Scarb, il devrait fonctionner hors de la boîte avec l'extension Cairo VSCode, sans une installation manuelle du serveur de langue.
id: Catatan: Jika Anda memasang Scarb, kotak itu harus bekerja di luar kotak dengan ekstensi VSCode Kairo, tanpa instalasi manual server bahasa.
tr: Not: Scarb yüklüyse, dil sunucusunun manuel kurulumu olmadan Kahire VSCode uzantısı ile kutunun dışında çalışmalıdır.
zh_cn: 注:如果您安装了刀疤,应使用开罗VSCode扩展名在盒子外工作,无需人工安装语言服务器。

source: Appendix G - Installing the Cairo Binaries
es: Apéndice G - Instalación de los binarios de El Cairo
fr: Annexe G - Installation des Binaires du Caire
id: Lampiran G - Memasang Binary Kairo
tr: Ek G - Kahire Binarylerinin Kurulması
zh_cn: 附录G -- -- 建立《开罗财年》

source: If you want to have access to the Cairo binaries, for anything that you could not achieve by purely using Scarb you can install them by following the instructions below.
es: Si quieres tener acceso a los binarios de El Cairo, para cualquier cosa que no puedas lograr usando Scarb puedes instalarlos siguiendo las siguientes instrucciones.
fr: Si vous voulez avoir accès aux binaires du Caire, pour tout ce que vous ne pourriez pas obtenir en utilisant purement Scarb, vous pouvez les installer en suivant les instructions ci-dessous.
id: Jika Anda ingin memiliki akses ke binaries Kairo, untuk apa pun yang Anda tidak bisa mencapai hanya dengan menggunakan Scarb Anda dapat menginstal mereka dengan mengikuti instruksi di bawah ini.
tr: Kahire ikililerine erişmek istiyorsanız, sadece Scarb'ı kullanarak elde edemeyeceğiniz herhangi bir şey için aşağıdaki talimatları izleyerek bunları yükleyebilirsiniz.
zh_cn: 如果您想要进入开罗二进制书,对于任何纯粹使用刀疤无法达到的目标,都可以按照以下指示安装。

source: Prerequisites
es: Requisitos previos
fr: Préalables
id: Prasyarat
tr: Önkoşullar
zh_cn: 先决条件

source: You will need to have [Rust](https://www.rust-lang.org) and [Git](https://git-scm.com/) installed.
es: Deberá instalarse [Rust](https://www.rust-lang.org) y [Git](https://git-scm.com/).
fr: Vous devrez installer [Rust](https://www.rust-lang.org) et [Git](https://git-scm.com/).
id: Anda akan memerlukan [Rut][Rust][https://www.rust-lang.org) dan [Git] althttps://git-scm.com/) terpasang.
tr: [Rust](https://www.rust-lang.org) ve [Git](https://git-scm.com/) yüklü olması gerekir.
zh_cn: (https://www.rust-lang.org)和[Git] (https://git-scm.com/)需要安装[鲁斯特](https://www.rust-lang.org)和[Git]。

source: To install Rust, you first need the [`rustup`](https://www.rust-lang.org/tools/install) tool. It allows you to install Rust using the following command:
es: Para instalar Rust, primero necesita la herramienta [`rustup`](https://www.rust-lang.org/tools/install). Le permite instalar Rust usando el siguiente comando:
fr: Pour installer Rust, vous avez d'abord besoin de l'outil [`rustup`](https://www.rust-lang.org/tools/install). Il vous permet d'installer Rust en utilisant la commande suivante:
id: Untuk memasang Rust, pertama - tama Anda membutuhkan alat [artistup] mereka://www.rust-lang.org/tool/install). Anda dapat memasang Rust menggunakan perintah berikut:
tr: Rust'ı yüklemek için önce [rustup](https://www.rust-lang.org/tools/install) aracına ihtiyacınız var. Rust'ı aşağıdaki komutu kullanarak yüklemenizi sağlar:
zh_cn: 要安装 Rust, 您首先需要使用 [`rustup'] (https://www.rust- lang. org/tools/安装) 工具。 它允许您使用以下命令安装 Rust :

source: # Install stable Rust
es: # Instalar Rust estable
fr: # Installer stable Rust
id: # Pasang stabil Rust
tr: # Kararlı Rust takın
zh_cn: {\fn方正粗倩简体\fs12\an8\1cHFFFF00\b0}安放稳定的鲁斯特

source: Follow the link for information on how to install [Git](https://git-scm.com/downloads).
es: Siga el enlace para obtener información sobre cómo instalar [Git](https://git-scm.com/downloads).
fr: Suivez le lien pour savoir comment installer [Git](https://git-scm.com/downloads).
id: Ikuti link untuk informasi tentang cara menginstal [Git][Git]https://git-scm.com/downloads).
tr: [Git] nasıl kurulacağı hakkında bilgi için bağlantıyı takip edin(https://git-scm.com/downloads).
zh_cn: 如何安装[ Git] 信息的链接( https:// git- scm.com/ downloads) 。

source: The next step is to install Cairo. We will download Cairo manually, using Cairo repository or with an installation script. You’ll need an internet connection for the download.
es: El siguiente paso es instalar El Cairo. Descargaremos El Cairo manualmente, utilizando el repositorio de El Cairo o con un script de instalación. Necesitará una conexión a Internet para la descarga.
fr: La prochaine étape est d'installer Cairo. Nous allons télécharger Cairo manuellement, en utilisant le dépôt Cairo ou avec un script d'installation. Vous aurez besoin d'une connexion internet pour le téléchargement.
id: Langkah berikutnya adalah memasang Kairo. kita akan mengunduh Kairo secara manual, menggunakan repositori Kairo atau dengan skrip instalasi. anda akan membutuhkan koneksi internet untuk mengunduh.
tr: Bir sonraki adım Kahire'yi kurmaktır. Kahire'yi manuel olarak, Kahire deposunu kullanarak veya bir kurulum senaryosuyla indireceğiz. İndirmek için bir internet bağlantısına ihtiyacınız olacak.
zh_cn: 下一步是安装开罗。 我们将使用开罗存储库或安装脚本手动下载开罗。 您需要互联网连接才能下载。

source: Installing Cairo with a Script ([Installer](https://github.com/franalgaba/cairo-installer) by [Fran](https://github.com/franalgaba))
es: Instalación de El Cairo con un Script ([Installer](https://github.com/franalgaba/cairo-installer) por [Fran](https://github.com/franalgaba))
fr: Installer le Caire avec un script ([Installer](https://github.com/franalgaba/cairo-installer) par [Fran](https://github.com/franalgaba)
id: Menginstal Kairo dengan Skrip (Installer)[Installer][Https://gitub.com/franalgaba/cairo-installer) oleh [Fran]bahttps://github.com/franalgaba)))
tr: [Fran](https://github.com/franalgaba/cairo-installer) tarafından Kahire'yi bir Script ([Installer]) ile yüklemek
zh_cn: 由[法 (https://github.com/franalgaba/cairo-安裝者)以脚本安装开罗(https://github.com/franalgaba)

source: Install
es: Instalar
fr: Installer
id: Pasang
tr: Yükle
zh_cn: 安装安装

source: If you wish to install a specific release of Cairo rather than the latest head, set the `CAIRO_GIT_TAG` environment variable (e.g. `export CAIRO_GIT_TAG=v2.5.1`).
es: Si desea instalar una versión específica de El Cairo en lugar de la última cabeza, establezca la variable de entorno `CAIRO_GIT_TAG` (por ejemplo, `exportar CAIRO_GIT_TAG=v2.5.1`).
fr: Si vous souhaitez installer une version spécifique du Caire plutôt que la dernière tête, définissez la variable d'environnement `CAIRO_GIT_TAG` (par exemple `export CAIRO_GIT_TAG=v2.5.1`).
id: Jika Anda ingin menginstal rilis spesifik Kairo daripada kepala terbaru, atur variabel lingkungan ▪CAIRO_GIT_TAGG Rasulé (mis. ▪export CAIRO_GIT_TAG=v2,1).
tr: Kahire'nin en son kafa yerine belirli bir sürümünü yüklemek istiyorsanız, CAIRO_GIT_TAG ortam değişkenini (örneğin export CAIRO_GIT_TAG=v2.5.1) ayarlayın.
zh_cn: 如果您希望安装一个具体版本的开罗,而不是最新的首页,请设置“CAIRO_GIT_TAG”环境变量(例如,`出口CAIRO_GIT_TAG=v2.5.1')。

source: After installing, follow [these instructions](#set-up-your-shell-environment-for-cairo) to set up your shell environment.
es: Después de instalar, siga [estas instrucciones](#set-up-your-shell-environment-for-cairo) para configurar el entorno de su shell.
fr: Après l'installation, suivez [ces instructions] (#set-up- your-shell-environment-for-cairo) pour configurer votre environnement shell.
id: Setelah memasang, ikuti [intruksi ini][#set-up-your-shell-environment-for-cairo) untuk mengatur lingkungan shell Anda.
tr: Kurulumdan sonra, kabuk ortamınızı kurmak için [#set-up-your-shell-environment-for-cairo] 'yu izleyin.
zh_cn: 在安装后,按照[这些指示](#设置你的壳壳环境为开罗)来设置你的壳环境。

source: Update
es: Actualizar
fr: Mise à jour
id: Perbarui
tr: Güncelle
zh_cn: 更新更新更新

source: ``` rm -fr ~/.cairo curl -L https://github.com/franalgaba/cairo-installer/raw/main/bin/cairo-installer | bash ```
id: rm -fr ~/.cairo curl -L https://github.com/franalgaba/cairo-installer/raw/main/bin/cairo-installer ▪
zh_cn: https://github.com/franalgaba/cairo-安贝/raw/main/bin/cairo-安贝 bash

source: Uninstall
es: Desinstalar
fr: Désinstaller
id: Hapus
tr: Kaldır
zh_cn: 解除安装

source: Cairo is installed within `$CAIRO_ROOT` (default: ~/.cairo). To uninstall, just remove it:
es: El Cairo está instalado dentro de `$CAIRO_ROOT` (default: ~/.cairo). Para desinstalar, sólo tiene que eliminarlo:
fr: Le Caire est installé dans `$CAIRO_ROOT` (par défaut: ~/.cairo). Pour désinstaller, il suffit de le supprimer:
id: Kairo dipasang di dalam ÁCAIRO_ROOTå (baku: ~/.cairo). Untuk melepaskan, hapus saja:
tr: Kahire, $CAIRO_ROOT (varsayılan: /.cairo) içinde kuruludur. Kaldırmak için, sadece kaldırın:
zh_cn: 开罗安装在`$CAIRO_ROOT'内(默认值:~/.cairo)。

source: then remove these three lines from .bashrc:
es: a continuación, eliminar estas tres líneas de.bashrc:
fr: puis enlever ces trois lignes de.bashrc:
id: lalu hapus ketiga baris ini dari.bassrc:
tr: Sonra bu üç satırı.bashrc'den kaldırın:
zh_cn: 然后从.bashrc 中删除这三条线 :

source: "$HOME/.cairo/target/release:$PATH"
fr: "$HOME/.cairo/cible/release:$PATH"
tr: "$HOME/.cairo/target/release:$PATH" (İngilizce).
zh_cn: "$HOME/.cairo/目标/释放:$PATH"

source: and finally, restart your shell:
es: y finalmente, reinicie su shell:
fr: et enfin, redémarrez votre shell :
id: dan akhirnya, start ulang shell Anda:
tr: ve son olarak, kabuğunuzu yeniden başlatın:
zh_cn: 最后,重新开始你的贝壳:

source: Set Up your Shell Environment for Cairo
es: Establezca su entorno Shell para El Cairo
fr: Configurez votre environnement Shell pour le Caire
id: Mengatur Lingkungan Shell Anda untuk Kairo
tr: Kahire için Kabuk Ortamını Ayarla
zh_cn: 为开罗设置你的壳壳环境
