Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The Cairo programming language provides several specific functions that serve a special purpose. We will not cover all of them in this book, but using the names of these functions as names of other items is not recommended.
es: El lenguaje de programación de El Cairo proporciona varias funciones específicas que sirven a un propósito especial. No cubriremos todos ellos en este libro, pero el uso de los nombres de estas funciones como nombres de otros elementos no se recomienda.
fr: Le langage de programmation du Caire fournit plusieurs fonctions spécifiques qui servent un but particulier. Nous ne les couvrirons pas toutes dans ce livre, mais l'utilisation des noms de ces fonctions comme noms d'autres éléments n'est pas recommandée.
id: Bahasa pemrograman Kairo menyediakan beberapa fungsi spesifik yang memiliki tujuan khusus. kami tidak akan menutup semuanya dalam buku ini, tetapi menggunakan nama fungsi ini sebagai nama dari item lain tidak dianjurkan.
tr: Kahire programlama dili, özel bir amaca hizmet eden birkaç özel işlev sunar. Bu kitapta hepsini kapsamayacağız, ancak bu işlevlerin adlarını diğer öğelerin adları olarak kullanmak önerilmez.
zh_cn: 开罗节目制作语言提供若干具体功能,用于特殊目的,我们在本书中不涵盖所有功能,但建议不使用这些功能的名称作为其他项目的名称。

source: `assert` - This function checks a boolean expression, and if it evaluates to false, it triggers the panic function.
es: `assert` - Esta función comprueba una expresión booleana, y si se evalúa a false, desencadena la función de pánico.
fr: `assert` - Cette fonction vérifie une expression booléenne, et si elle évalue à faux, elle déclenche la fonction panique.
id: - Fungsi ini memeriksa ekspresi boolean, dan jika dievaluasi untuk palsu, itu memicu fungsi panik.
tr: assert - Bu fonksiyon bir boolean ifadesini kontrol eder ve yanlış olarak değerlendirilirse panik fonksiyonunu tetikler.
zh_cn: `资产'- 此函数检查布林表达式, 如果评估为假, 则触发恐慌功能 。

source: `panic` - This function acknowledges the occurrence of an error and terminates the program.
es: `panic` - Esta función reconoce la ocurrencia de un error y termina el programa.
fr: `panic` - Cette fonction reconnaît l'occurrence d'une erreur et met fin au programme.
id: - Fungsi ini mengakui terjadinya kesalahan dan mengakhiri program.
tr: panic - Bu fonksiyon bir hatanın meydana geldiğini kabul eder ve programı sonlandırır.
zh_cn: `西班牙' - 此函数确认发生错误并终止程序。

source: Appendix B - Operators and Symbols
es: Apéndice B - Operadores y símbolos
fr: Annexe B - Opérateurs et symboles
id: Lampiran B - Operator dan Simbol
tr: Ek B - Operatörler ve Semboller
zh_cn: 附录B -- -- 操作员和符号

source: This appendix contains a glossary of Cairo's syntax, including operators and other symbols that appear by themselves or in the context of paths, generics, macros, attributes, comments, tuples, and brackets.
es: Este apéndice contiene un glosario de la sintaxis de El Cairo, incluyendo operadores y otros símbolos que aparecen por sí mismos o en el contexto de rutas, genéricos, macros, atributos, comentarios, tuplas y paréntesis.
fr: Cette annexe contient un glossaire de la syntaxe du Caire, y compris les opérateurs et autres symboles qui apparaissent par eux-mêmes ou dans le contexte de chemins, génériques, macros, attributs, commentaires, tuples et crochets.
id: Apendiks ini berisi glossary sintaks Kairo, termasuk operator dan simbol lain yang muncul sendiri atau dalam konteks jalur, generik, makro, atribut, komentar, tuples, dan kurung.
tr: Bu ek, Kahire'nin sözdiziminin bir sözlüğünü içerir; operatörler ve kendi başlarına veya yollar, jenerikler, makrolar, nitelikler, yorumlar, tuple'lar ve parantezler bağlamında görünen diğer semboller de dahil olmak üzere.
zh_cn: 本附录载有开罗语法词汇表,包括操作员和其他符号本身或路径、非专利、宏观、属性、评论、图普尔和括号上出现的其他符号。

source: Operators
es: Operadores
fr: Opérateurs
id: Operator
tr: Operatörler
zh_cn: 运算符

source: Table B-1 contains the operators in Cairo, an example of how the operator would appear in context, a short explanation, and whether that operator is overloadable. If an operator is overloadable, the relevant trait to use to overload that operator is listed.
es: La Tabla B-1 contiene a los operadores en El Cairo, un ejemplo de cómo el operador aparecería en contexto, una breve explicación, y si el operador es sobrecargable. Si un operador es sobrecargable, el rasgo relevante a utilizar para sobrecargar a ese operador se enumera.
fr: Le tableau B-1 présente les opérateurs au Caire, un exemple de la façon dont l'opérateur apparaîtrait dans son contexte, une brève explication et si cet opérateur est surchargé. Si un opérateur est surchargé, la caractéristique pertinente à utiliser pour surcharger cet opérateur est répertoriée.
id: Tabel B-1 berisi operator di Kairo, contoh bagaimana operator akan muncul dalam konteks, penjelasan singkat, dan apakah operator yang overloadable. Jika operator kelebihan beban, sifat relevan untuk digunakan untuk overload operator yang terdaftar.
tr: Tablo B-1, Kahire'deki operatörleri, operatörün bağlamda nasıl görüneceğine, kısa bir açıklamaya ve bu operatörün aşırı yüklenebilir olup olmadığına dair bir örnek içerir. Bir operatör aşırı yüklenebilirse, bu operatörün aşırı yüklenmesi için kullanılacak ilgili özellik listelenir.
zh_cn: 表B-1载有开罗的操作员,一个操作员如何在上下文中出现的例子,一个简短的解释,以及操作员是否超载。 如果操作员超载,则列出该操作员超载的相关特性。

source: Operator
es: Operador
fr: Opérateur
tr: Operatör
zh_cn: 运算器操作员

source: Explanation
es: Explicación
fr: Explication
id: Penjelasan
tr: Açıklama
zh_cn: 解释解释解释 解释解释

source: Overloadable?
es: ¿Sobrecargable?
fr: Surchargeable?
id: Berlebihan?
tr: Aşırı yüklenebilir mi?
zh_cn: 超载?

source: `!expr`
id: ! Expré!
zh_cn: `[!! Exdr '

source: Logical complement
es: Complemento lógico
fr: Complément logique
id: komplemen Logis
tr: Mantıksal tamamlayıcı
zh_cn: 逻辑补充

source: `Not`
es: `No '
fr: "Pas"
id: Tidak ada.
tr: Hayır
zh_cn: `不是'

source: Bitwise NOT
es: Bitwise NO
fr: N'EST PAS BITWUEL
id: Jangan Bitwise
zh_cn: 位元不顺位

source: `BitNot`
fr: 'BitPas'
id: BitNoté
zh_cn: `不`

source: `expr != expr`
id: Expr!= expré
zh_cn: " Exter! " = expr`

source: Non-equality comparison
es: Comparación de la falta de igualdad
fr: Comparaison de la non-égalité
id: Pembandingan bukan kualitas
tr: Eşitsizlik karşılaştırması
zh_cn: 不平等比较

source: `expr % expr`
id: expr % exprå
zh_cn: `Exmer % exprer '

source: Arithmetic remainder
es: Restos aritméticos
fr: Reste arithmétique
id: Sisa Aritmatika
tr: Aritmetik kalıntı
zh_cn: 论论余余

source: `var %= expr`
id: ▪var %= exprNeal
zh_cn: `var {____\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Arithmetic remainder and assignment
es: Resto y asignación aritméticos
fr: Reliure arithmétique et affectation
id: Sisa dan tugas Aritmatika
tr: Aritmetik kalıntı ve atama
zh_cn: 相对余量和派任

source: `expr & expr`
id: ▪expr & exprå
zh_cn: `Exter & expr '

source: Bitwise AND
es: Bitwise Y
fr: BISUEL ET
id: "Addwise AND"
tr: Bitwise VE
zh_cn: 按比位和

source: `BitAnd`
id: BitAndrofs-type
zh_cn: `比尔和'

source: `expr && expr`
id: expr && expré
zh_cn: `Expr'Expr { { expr` { expr } { expr { { expr { } { expr { } { expr { { { expr } { { expr { { { { { { } { expr { { { {

source: Short-circuiting logical AND
es: Lógico de cortocircuito y
fr: Logique de court-circuit ET
id: Short-cirching logical AND
tr: Kısa devre mantıklı ve
zh_cn: 短路路逻辑和

source: `expr * expr`
id: Expr * expré
zh_cn: `Exder * depr '

source: Arithmetic multiplication
es: Multiplicación aritmética
fr: Multiplication arithmétique
id: Perkalian Aritmatika
tr: Aritmetik çarpma
zh_cn: A. 物理乘数

source: `Mul`
id: Mol.
zh_cn: `穆勒 '

source: `var *= expr`
id: Árvar *= expré
zh_cn: `var {____\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Arithmetic multiplication and assignment
es: Multiplicación y asignación aritmética
fr: Multiplication arithmétique et affectation
id: Perkalian dan tugas Aritmetik
tr: Aritmetik çarpma ve atama
zh_cn: A. 相对性乘数和任务

source: `MulEq`
id: MolEq
zh_cn: `穆勒埃克 '

source: Snapshot
fr: Capture instantanée
zh_cn: 抓图

source: Desnap
fr: Desnapé
zh_cn: 后发

source: `expr + expr`
zh_cn: `Exder + expr '

source: Arithmetic addition
es: Adición aritmética
fr: Addition arithmétique
id: Tambahan Aritmatika
tr: Aritmetik ekleme
zh_cn: 修 修 修 修 修 修 修 修 修 修 修 修 修 修 修 修 修

source: `Add`
fr: `Ajouter`
id: Tambahkan
zh_cn: `Add'号

source: `var += expr`
id: ▪var += exprå
zh_cn: `var {____\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Arithmetic addition and assignment
es: Adición y asignación aritmética
fr: Addition arithmétique et affectation
id: Tambahan dan tugas Aritmatika
tr: Aritmetik ekleme ve atama
zh_cn: 修配和派任

source: `expr, expr`
id: Expr, expré
zh_cn: `Exter, depr '

source: Argument and element separator
es: Argumento y separador de elementos
fr: Argument et séparateur d'éléments
id: Argumen dan pemisah elemen
tr: Argüman ve eleman ayırıcı
zh_cn: 参数和元素分隔符

source: `-expr`
id: - Expré.
zh_cn: ` - 发光 '

source: Arithmetic negation
es: Negación aritmética
fr: Négation arithmétique
id: Negatif Aritmetik
tr: Aritmetik olumsuzlama
zh_cn: 理论否定

source: `expr - expr`
id: [ Gambar di hlm.
zh_cn: `Exprer - expr`

source: Arithmetic subtraction
es: Sustracción aritmética
fr: Soustraction arithmétique
id: pengurangan Aritmetik
tr: Aritmetik çıkarma
zh_cn: 亚性减法

source: Arithmetic subtraction and assignment
es: Sustracción y asignación aritmética
fr: Soustraction arithmétique et affectation
id: pengurangan dan tugas Aritmetik
tr: Aritmetik çıkarma ve atama
zh_cn: A. 相对减法和任务

source: `fn(...) -> type`, <code>\|...\| -> type</code>
id: -> tipe, <kode>\Negara -> tipe</kode>
zh_cn: `fn(...) - > 类型 ', < code_...\\\ > > 类型 </code>

source: Function and closure return type
es: Función y tipo de retorno de cierre
fr: Type de retour de fonction et de fermeture
id: Fungsi dan tipe kembali penutupan
tr: Fonksiyon ve kapatma dönüş tipi
zh_cn: 函数和关闭返回类型

source: `expr.ident`
id: Expr.ident those.expr.ident
zh_cn: `非常身份 '

source: Member access
es: Acceso de los miembros
fr: Accès des membres
id: Akses anggota
tr: Üye erişimi
zh_cn: 成员访问

source: `expr / expr`
zh_cn: `Exter / depr '

source: Arithmetic division
es: División aritmética
fr: Division arithmétique
id: Pembagian Aritmatika
tr: Aritmetik bölme
zh_cn: 亚学分

source: `Div`
id: (Divé)
zh_cn: `第`第``

source: Arithmetic division and assignment
es: División y asignación aritmética
fr: Division arithmétique et affectation
id: Divisi Aritmetik dan tugas
tr: Aritmetik bölünme ve atama
zh_cn: 相对分解和任务

source: `pat: type`, `ident: type`
es: `Pat: tipo`, `ident: tipo`
id: ±pat: tipe ±, ±ident: tipe
zh_cn: `空间:类型 ',`身份:类型 '

source: Constraints
es: Limitaciones
fr: Contraintes
id: Kendala
tr: Kısıtlamalar
zh_cn: 制约因素

source: `ident: expr`
fr: "identique: expr"
id: - Expré.
zh_cn: `日期:日期`

source: Struct field initializer
es: Iniciador de campo de estructura
fr: Initialisateur de champ de structure
id: Penginisialisasi ruas struktur
tr: Struct alan başlatıcısı
zh_cn: Struct 字段初始化器

source: `expr;`
id: Ekspr; mereka tidak tahu apa-apa tentang hal itu.
zh_cn: `Exter; '

source: Statement and item terminator
es: Declaración y terminación de los temas
fr: Déclaration et terminateur d'articles
id: Pengakhir pernyataan dan butir
tr: Açıklama ve madde sonlandırıcı
zh_cn: 报表和项目

source: `expr < expr`
id: Expr < exprNeal
zh_cn: `Exder < depr '

source: Less than comparison
es: Menos que la comparación
fr: Moins que la comparaison
id: Kurang dari perbandingan
tr: Karşılaştırmadan daha az
zh_cn: 低于比较

source: `PartialOrd`
fr: "Ordonnance partielle"
zh_cn: `部分命令 '

source: `expr <= expr`
id: Expr <= exprNeal
zh_cn: `Expr'Expr { { expr` { expr } { expr { { expr { } { expr { } { expr { { { expr } { { expr { { { { { { } { expr { { { {

source: Less than or equal to comparison
es: Menos o igual a la comparación
fr: Inférieur ou égal à la comparaison
id: Kurang dari atau sama dengan perbandingan
tr: Karşılaştırmadan daha az veya eşit
zh_cn: 小于或等于比较

source: Assignment
es: Asignación
fr: Attribution
id: Penugasan
tr: Atama
zh_cn: 派 派 派

source: `expr == expr`
id: Expr == Expré
zh_cn: `Exer = expr = = Expr = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =

source: Equality comparison
es: Comparación de la igualdad
fr: Comparaison entre les hommes et les femmes
id: Perbandingan kualitas
tr: Eşitlik karşılaştırması
zh_cn: 平等比较

source: Part of match arm syntax
es: Parte de la sintaxis del brazo de partido
fr: Partie de la syntaxe des bras de correspondance
id: Bagian dari sintaks lengan yang cocok
tr: Eşleme kolu sözdiziminin bir parçası
zh_cn: 匹配的 arm 语法部分

source: `expr > expr`
id: [ Gambar di hlm.
zh_cn: `Exder > Expr '

source: Greater than comparison
es: Mayor que la comparación
fr: Plus grande que la comparaison
id: Lebih besar dari perbandingan
tr: Karşılaştırmadan daha büyük
zh_cn: 大于比较

source: `expr >= expr`
id: ESPPR >= exprNeal
zh_cn: `Expr'Expr { { expr` { expr } { expr { { expr { } { expr { } { expr { { { expr } { { expr { { { { { { } { expr { { { {

source: Greater than or equal to comparison
es: Mayor o igual a la comparación
fr: Supérieur ou égal à la comparaison
id: Lebih besar dari atau sama dengan perbandingan
tr: Karşılaştırmadan daha büyük veya eşit
zh_cn: 大于或等于比较

source: `expr ^ expr`
id: ESPPR ^ exprNeal
zh_cn: `Exter = expr`

source: Bitwise exclusive OR
es: Exclusivo bitwise OR
fr: Exclusivité bitwise OU
id: Eksklusif Bitwise OR
tr: Bitwise özel VEYA
zh_cn: 按位元算的独家 OR

source: <code>expr \| expr</code>
id: <kode>expr \pr</kode>
zh_cn: <code>expr {} expr </code> 。 <code> > expr < expr </code>

source: Bitwise OR
es: Bitwise O
fr: Bitwise OU
tr: Bitwise VEYA
zh_cn: 按位数 OR

source: `BitOr`
zh_cn: `比尔'

source: <code>expr \|\| expr</code>
id: <kode>expr \___\pr</kode>
zh_cn: <code>expr {} expr </code> 。 <code> > expr < expr </code>

source: Short-circuiting logical OR
es: OR lógico de cortocircuito
fr: Logique de court-circuit OU
id: Sirkuit pendek OR
tr: Kısa devre mantıksal VEYA
zh_cn: 短路逻辑

source: expr?
zh_cn: 发件人?

source: Error propagation
es: Propagación de errores
fr: Transmission des erreurs
id: Propagasi galat
tr: Hata yayılımı
zh_cn: 错误传播

source: <span class="caption">Table B-1: Operators</span>
es: <span class="caption">Tabla B-1: Operadores</span>
fr: <span class="caption">Tableau B-1: Opérateurs</span>
id: <span class="caption">Tabel B-1: Operator</span>
tr: span class="caption">Tablo B-1: Operatörler/span>
zh_cn: <span类=“Caption” >表B-1:运算符 </span>

source: Non Operator Symbols
es: Símbolos no operativos
fr: Symboles non opérateurs
id: Simbol Non Operator
tr: Operatör Olmayan Semboller
zh_cn: 编号 编号 编号 号 号 编号 号 号 编号 号 号 编号 号 号 号 号号无号号 号号无号号号只有号和无号号号号只有只有只有只有只有号号只有只有只有只有号号号。

source: The following list contains all symbols that are not used as operators; that is, they do not have the same behavior as a function or method call.
es: La siguiente lista contiene todos los símbolos que no se utilizan como operadores; es decir, no tienen el mismo comportamiento que una llamada a función o método.
fr: La liste suivante contient tous les symboles qui ne sont pas utilisés comme opérateurs, c'est-à-dire qu'ils n'ont pas le même comportement qu'un appel de fonction ou de méthode.
id: Daftar berikut berisi semua simbol yang tidak digunakan sebagai operator; yaitu, mereka tidak memiliki perilaku yang sama sebagai fungsi atau panggilan metode.
tr: Aşağıdaki liste, operatör olarak kullanılmayan tüm sembolleri içerir; yani, bir işlev veya yöntem çağrısı ile aynı davranışa sahip değildirler.
zh_cn: 以下列表包含所有未用作操作员的符号;也就是说,它们的行为与函数或方法调用没有相同。

source: Table B-2 shows symbols that appear on their own and are valid in a variety of locations.
es: La Tabla B-2 muestra símbolos que aparecen por su cuenta y son válidos en una variedad de ubicaciones.
fr: Le tableau B-2 montre les symboles qui apparaissent seuls et qui sont valides dans divers endroits.
id: Tabel B-2 menunjukkan simbol yang muncul sendiri dan valid di berbagai lokasi.
tr: Tablo B-2, kendi başlarına görünen ve çeşitli yerlerde geçerli olan sembolleri gösterir.
zh_cn: 表B-2显示自发出现并在各种地点有效的符号。

source: Symbol
es: Símbolo
fr: Symbole
id: Simbol
tr: Sembol
zh_cn: 符号符号符号

source: `..._u8`, `..._usize`, `..._bool`, etc.
id: ..._u8, °C..._Musiasi, ±..._bool, dll.
tr: ..._u8,..._usize,..._bool, vb.
zh_cn: ``.u8',`._usize`,`._bool`,等等。

source: Numeric literal of specific type
es: Literales numéricos de tipo específico
fr: Littéralement numérique de type spécifique
id: Literal numerik dari tipe spesifik
tr: Belirli tipteki sayısal literal
zh_cn: 特定类型数值字数

source: String literal
es: Cadena literal
fr: Chaîne littérale
tr: Dize harfi
zh_cn: 字符字符字符串字数

source: Short string, 31 ASCII characters maximum
es: Cadena corta, 31 caracteres ASCII como máximo
fr: Chaîne courte, 31 caractères ASCII maximum
id: String pendek, 31 karakter ASCII maksimum
tr: Kısa dize, 31 ASCII karakter maksimum
zh_cn: 短字符串, 31 ASCII 最大字符数

source: “Ignored” pattern binding
es: Encuadernación del patrón “ignorado”
fr: Reliure du motif -Ignoré-Ignoré-
id: Pembatas pola
tr: "Uygunsuz" desen bağlama
zh_cn: “未承认”有约束力模式

source: <span class="caption">Table B-2: Stand-Alone Syntax</span>
es: <clase span="caption">Tabla B-2: Sintaxis Stand-Alone</span>
fr: <span class="caption">Tableau B-2: Syntaxe de l'autonomie permanente</span>
id: <span class="caption">Tabel B-2: Stand-Alone Sintaks</span>
tr: span class="caption">Tablo B-2: Stand-Alone Syntax/span>
zh_cn: <span类=“caption” >表B-2:单方语法 </span>

source: Table B-3 shows symbols that are used within the context of a module hierarchy path to access an item.
es: La tabla B-3 muestra los símbolos que se utilizan en el contexto de una ruta de jerarquía de módulo para acceder a un elemento.
fr: Le tableau B-3 montre les symboles qui sont utilisés dans le contexte d'un chemin hiérarchique de module pour accéder à un élément.
id: Tabel B-3 menampilkan simbol yang digunakan dalam konteks dari suatu path hirarki modul untuk mengakses suatu butir.
tr: Tablo B-3, bir öğeye erişmek için bir modül hiyerarşi yolu bağlamında kullanılan sembolleri gösterir.
zh_cn: 表B-3显示模块结构路径中用于访问某个项目的符号。

source: `ident::ident`
fr: «identifiant:ident»
id: Insiden:: teridentifikasi
zh_cn: `身份:身份:身份`

source: Namespace path
es: Ruta del espacio de nombres
fr: Emplacement de l'espace de noms
id: Path Namespace
tr: Namespace yolu
zh_cn: 命名空间路径

source: `super::path`
fr: "super::chemin"
id: Aku tak tahu harus berkata apa.
tr: süper::path
zh_cn: `超级:病道'

source: Path relative to the parent of the current module
es: Ruta relativa al padre del módulo actual
fr: Chemin par rapport au parent du module actuel
id: Path relatif terhadap induk modul kini
tr: Geçerli modülün ebeveynine göre yol
zh_cn: 相对于当前模块父的当前模块的路径

source: `trait::method(...)`
es: `ratio::método(...)'
fr: «caractère::méthode(...)»
zh_cn: `trait::方法(...) '

source: Disambiguating a method call by naming the trait that defines it
es: Desambiguar una llamada de método nombrando el rasgo que la define
fr: Dissocier un appel de méthode en nommant le caractère qui le définit
id: Menyalurkan sebuah metode panggilan dengan menyebutkan sifat yang mendefinisikannya
tr: Tanımlayan özelliği adlandırarak bir yöntem çağrısını ayrıştırmak
zh_cn: 通过命名界定该功能的特性来使一种方法调用不同

source: <span class="caption">Table B-3: Path-Related Syntax</span>
es: <span class="caption">Tabla B-3: Sintaxis relacionada con el camino</span>
fr: <span class="caption">Tableau B-3: Syntaxe liée au chemin</span>
id: <span class="caption">Tabel B-3: Path-Related Sintaks</span>
zh_cn: <span类=“caption” >表B-3:与路径相关的语法 </span>

source: Table B-4 shows symbols that appear in the context of using generic type parameters.
es: La tabla B-4 muestra los símbolos que aparecen en el contexto del uso de parámetros de tipo genérico.
fr: Le tableau B-4 montre les symboles qui apparaissent dans le contexte de l'utilisation de paramètres génériques de type.
id: Tabel B-4 menampilkan simbol yang muncul dalam konteks menggunakan parameter tipe generik.
tr: Tablo B-4, genel tip parametrelerin kullanılması bağlamında görünen sembolleri gösterir.
zh_cn: 表B-4显示使用通用类型参数时出现的符号。

source: `path<...>`
es: `path<...â € ~
fr: 'chemin<...>'
id: Jalan <...>
tr: yol...>
zh_cn: 路由... ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Specifies parameters to generic type in a type (e.g., `Array<u8>`)
es: Especifica los parámetros del tipo genérico en un tipo (por ejemplo, `Array<u8».)
fr: Spécifie les paramètres du type générique dans un type (par exemple, `Array<u8>`)
id: Spesifikasikan parameter ke tipe generik dalam sebuah tipe (misalnya, ARray<u8>)
tr: Bir tipteki genel tipe parametreleri belirtir (örneğin, Arrayu8>)
zh_cn: 指定类型中通用类型的参数(例如,`Array<u8\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\可以\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: `path::<...>`, `method::<...>`
es: `path:::<..., `método::<...
fr: 'chemin: <...>`,'méthode: <...>`
zh_cn: 病历: < _________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________ 方法:<_____________________________________________________________________________________________________________________________________________

source: Specifies parameters to a generic type, function, or method in an expression; often referred to as turbofish
es: Especifica parámetros para un tipo, función o método genérico en una expresión; a menudo se conoce como turbofish
fr: Spécifie les paramètres d'un type, d'une fonction ou d'une méthode générique dans une expression; souvent appelé turbofish
id: Tentukan parameter ke jenis umum, fungsi, atau metode dalam sebuah ekspresi; sering disebut sebagai turbofish
tr: Parametreleri genel bir türe, fonksiyona veya yönteme bir ifadede belirtir; genellikle turbofish olarak adlandırılır.
zh_cn: 指定表达式中通用类型、函数或方法的参数;通常称为涡轮鱼

source: `fn ident<...> ...`
fr: "Identifiez-vous "...>..."
id: Jadi identitas<...>...
zh_cn: " 身份 " <. >.`

source: Define generic function
es: Definir función genérica
fr: Définir la fonction générique
id: Definisikan fungsi generik
tr: Jenerik fonksiyonu tanımla
zh_cn: 定义通用功能

source: `struct ident<...> ...`
fr: 'identifiant de la structure<...>...`
id: Mengidentifikasi identitas<...>...
zh_cn: " 站点身份 " <. >.`
