Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: However, simply defining the functions in the implementation block is not enough. The implementation block must be annotated with the `#[abi(embed_v0)]` attribute. This attribute exposes the functions defined in this implementation to the outside world — forget to add it and your functions will not be callable from the outside. All functions defined in a block marked as `#[abi(embed_v0)]` are consequently _public functions_.
es: Sin embargo, simplemente definir las funciones en el bloque de implementación no es suficiente. El bloque de implementación debe estar anotado con el atributo •[abi(embed_v0)]`. Este atributo expone las funciones definidas en esta implementación al mundo exterior —olvídese de añadirlo y sus funciones no serán susceptibles de ser llamadas desde el exterior. Todas las funciones definidas en un bloque marcado como •[abi(embed_v0)]` son en consecuencia _funciones públicas_.
fr: Cependant, la simple définition des fonctions dans le bloc d'implémentation n'est pas suffisante. Le bloc d'implémentation doit être annoté avec l'attribut `#[abi(embed_v0)]`. Cet attribut expose les fonctions définies dans cette implémentation au monde extérieur — oublions de l'ajouter et vos fonctions ne seront pas appelables de l'extérieur. Toutes les fonctions définies dans un bloc marqué `#[abi(embed_v0)]` sont donc _public functions_.
id: Namun, hanya mendefinisikan fungsi-fungsi dalam blok implementasi tidak cukup. Blok implementasi harus dianotasi dengan atribut <0). Atribut ini mengekspos fungsi yang didefinisikan dalam implementasi ini ke dunia luar lupa untuk menambahkannya dan fungsi-fungsi Anda tidak akan dapat dipanggil dari luar. Semua fungsi yang didefinisikan dalam sebuah blok yang ditandai sebagai ▪[abireadyembed_v0]
tr: Bununla birlikte, uygulama bloğundaki işlevleri basitçe tanımlamak yeterli değildir. Uygulama bloğu #[abi(embed_v0)]] özniteliği ile açıklanmalıdır. Bu öznitelik, bu uygulamada tanımlanan işlevleri dış dünyaya ifşa eder - eklemeyi unutmayın ve işlevleriniz dışarıdan çağrılabilir olmayacaktır. #[abi(embed_v0)] olarak işaretlenmiş bir blokta tanımlanan tüm işlevler sonuç olarak _public fonksiyonlardır.
zh_cn: 然而,仅仅界定执行区块中的功能是不够的。 执行区块必须附加“ {{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}} 属性。此属性使执行区块中界定的功能暴露给外部世界—— 忘记添加它, 您的功能不会从外部调用。 在标为{{{{{{{{{{{{{{{{{{{{{{{}}}}}}}}的所有功能因此都是_ 公共功能。}

source: Because the `SimpleStorage` contract is defined as a module, we need to access the interface defined in the parent module. We can either bring it to the current scope with the `use` keyword, or refer to it directly using `super`.
es: Dado que el contrato `SimpleStorage` se define como un módulo, tenemos que acceder a la interfaz definida en el módulo padre. Podemos llevarlo al alcance actual con la palabra clave `usar`, o referirnos directamente a él usando `super`.
fr: Comme le contrat `SimpleStorage` est défini comme un module, nous devons accéder à l'interface définie dans le module parent. Nous pouvons soit l'amener à la portée actuelle avec le mot-clé `use`, soit y faire référence directement en utilisant `super`.
id: Karena kontrak 'SimpleStorage' ini didefinisikan sebagai modul, kita perlu mengakses antarmuka yang didefinisikan dalam modul induk.
tr: SimpleStorage sözleşmesi bir modül olarak tanımlandığından, ana modülde tanımlanan arayüze erişmemiz gerekir. use anahtar kelimesi ile mevcut kapsamına getirebilir veya super kullanarak doğrudan ona başvurabiliriz.
zh_cn: 由于`简单'合同被定义为模块,我们需要访问母模块中定义的界面,我们可以用`使用'关键字将其带入当前范围,或者直接使用`超级'将其提及。

source: When writing the implementation of an interface, the `self` parameter in the trait methods **must** be of type `ContractState`. The `ContractState` type is generated by the compiler, and gives access to the storage variables defined in the `Storage` struct. Additionally, `ContractState` gives us the ability to emit events. The name `ContractState` is not surprising, as it’s a representation of the contract’s state, which is what we think of `self` in the contract interface trait. When `self` is a snapshot of `ContractState`, only read access is allowed, and emitting events is not possible.
es: Al escribir la aplicación de una interfaz, el parámetro `auto` en los métodos de rasgo ** debe ser de tipo `ContractState`. El tipo `ContractState` es generado por el compilador, y da acceso a las variables de almacenamiento definidas en la estructura `Almacenamiento`. Además, `ContractState` nos da la capacidad de emitir eventos. El nombre `ContractState` no es sorprendente, ya que es una representación del estado del contrato, que es lo que pensamos de `auto` en el rasgo de interfaz del contrato. Cuando `auto` es una instantánea de `ContractState`, sólo se permite el acceso de lectura, y no es posible emitir eventos.
fr: Lors de l'écriture de la mise en œuvre d'une interface, le paramètre `self` dans les méthodes de caractères **doit** être de type `ContractState`. Le type `ContractState` est généré par le compilateur, et donne accès aux variables de stockage définies dans la structure `Storage`. De plus, `ContractState` nous donne la possibilité d'émettre des événements. Le nom `ContractState` n'est pas surprenant, car il représente l'état du contrat, ce qui est ce que nous pensons de `self` dans le trait d'interface du contrat. Quand `self` est un instantané de `ContractState`, seul l'accès à la lecture est autorisé, et l'émission d'événements n'est pas possible.
id: Ketika menulis implementasi dari sebuah antarmuka, sebuah parameter diri sendiri dalam metode sifat ** Must** akan bertipe seperti kontractate. Tipe kontractate yang dihasilkan oleh compiler, dan memberikan akses ke variabel penyimpanan yang didefinisikan dalam struktur thosetorage. Selain itu, ▪ Kontractántate memberi kita kemampuan untuk memancarkan peristiwa. Nama Contractate those is not surprictate, karena itu merupakan presentation of the constructs state, yaitu apa yang kita pikirkan tentang dirinya dalam interfaces.
tr: Bir arayüzün uygulanmasını yazarken, özellik yöntemlerindeki self parametresi **ContractState türünde olmalıdır. ContractState tipi derleyici tarafından oluşturulur ve Storage yapısında tanımlanan depolama değişkenlerine erişim sağlar. Ayrıca, ContractState'ın kendisi bize olayları yayma yeteneği vermez. ContractState adı şaşırtıcı değildir.
zh_cn: 在撰写接口实施时,特性方法中的`自我'参数** 必须是`缔约国'类型。`缔约国'类型由汇编者产生,并允许查阅`压力'结构中定义的储存变量。此外,`缔约国'使我们有能力发布事件。`缔约国'的名称并不奇怪,因为它代表了合同状态,而这正是我们在合同界面特征中认为`自我'的形式。当`自我'是`缔约国'的缩影时,只允许阅读访问,而排放事件是不可能的。

source: Accessing and Modifying the Contract's State
es: Acceso y modificación del Estado del contrato
fr: Accès et modification de l'État du contrat
id: Mengakses dan Mengubah Negara Bagian Kontrak
tr: Sözleşmenin Devletine Erişim ve Değiştirilmesi
zh_cn: A. 进入和修改合同国

source: Two methods are commonly used to access or modify the state of a contract:
es: Para acceder o modificar el estado de un contrato se utilizan comúnmente dos métodos:
fr: Deux méthodes sont couramment utilisées pour accéder ou modifier l'état d'un contrat:
id: Dua metode umumnya digunakan untuk mengakses atau memodifikasi keadaan sebuah kontrak:
tr: Bir sözleşmenin durumuna erişmek veya değiştirmek için yaygın olarak iki yöntem kullanılır:
zh_cn: 获取或修改合同状况通常使用两种方法:

source: `read`, which returns the value of a storage variable. This method is called on the variable itself and does not take any argument.
es: `read`, que devuelve el valor de una variable de almacenamiento. Este método se llama a la variable en sí y no toma ningún argumento.
fr: `read`, qui retourne la valeur d'une variable de stockage. Cette méthode est appelée sur la variable elle-même et ne prend aucun argument.
id: Metode ini disebut pada variabel itu sendiri dan tidak mengambil argumen apapun.
tr: read, bir depolama değişkeninin değerini döndürür. Bu yöntem değişkenin kendisinde adlandırılır ve herhangi bir argüman almaz.
zh_cn: `read', 返回存储变量的价值, 此方法由变量本身调用, 不考虑任何参数 。

source: `write`, which allows to write a new value in a storage slot. This method is also called on the variable itself and takes one argument, which is the value to be written. Note that `write` may take more than one argument, depending on the type of the storage variable. For example, writing on a mapping requires 2 arguments: the key and the value to be written.
es: `write`, que permite escribir un nuevo valor en una ranura de almacenamiento. Este método también se llama a la variable en sí y toma un argumento, que es el valor a escribir. Tenga en cuenta que `write` puede tomar más de un argumento, dependiendo del tipo de la variable de almacenamiento. Por ejemplo, escribir en una asignación requiere 2 argumentos: la clave y el valor a escribir.
fr: `write`, qui permet d'écrire une nouvelle valeur dans un emplacement de stockage. Cette méthode est également appelée sur la variable elle-même et prend un argument, qui est la valeur à écrire. Notez que `write` peut prendre plus d'un argument, en fonction du type de la variable de stockage. Par exemple, écrire sur un mapping nécessite 2 arguments: la clé et la valeur à écrire.
id: Metode ini juga disebut pada variabel itu sendiri dan mengambil satu argumen, yang merupakan nilai untuk ditulis. Perlu dicatat bahwa tulisan dapat mengambil lebih dari satu argumen, tergantung pada tipe variabel penyimpanan. Sebagai contoh, menulis pada pemetaan membutuhkan 2 argumen: kunci dan nilai untuk ditulis.
tr: write, bir depolama yuvasında yeni bir değer yazmasına izin verir. Bu yöntem aynı zamanda değişkenin kendisinde de adlandırılır ve yazılacak değer olan bir argüman alır. write'ın depolama değişkeninin türüne bağlı olarak birden fazla argüman alabileceğini unutmayın. Örneğin, bir haritalama üzerinde yazma 2 argüman gerektirir: anahtar ve yazılacak değer.
zh_cn: ` write',它允许在存储槽中写入新值,这种方法也要求变量本身,并采用一个参数,即要写入的值。请注意,根据存储变量的类型,“write”可能需要一个以上的参数。例如,在绘图上写入需要两个参数:键和要写入的值。

source: Reminder: if the contract state is passed as a snapshot with `@` instead of passed by reference with `ref`, attempting to modify the contract state will result in a compilation error.
es: Recordatorio: si el estado del contrato se pasa como una instantánea con en lugar de pasar por referencia con `ref`, intentar modificar el estado del contrato dará lugar a un error de compilación.
fr: Rappel : si l'état du contrat est passé comme un instantané avec `@` au lieu de passer par référence avec `ref`, essayer de modifier l'état du contrat entraînera une erreur de compilation.
id: Pengingat: jika negara kontrak dilewatkan sebagai sebuah snapshot dengan those@Neué daripada dilewatkan oleh referensi dengan årefé, mencoba untuk memodifikasi negara kontrak akan menghasilkan kesalahan kompilasi.
tr: Hatırlatma: Sözleşme durumu ref ile referansla geçmek yerine ile anlık görüntü olarak geçerse, sözleşme durumunu değiştirmeye çalışmak derleme hatası ile sonuçlanacaktır.
zh_cn: 提醒:如果合同状态作为快照以通过,而不是以`ref'通过,试图修改合同状态将导致编译错误。

source: This contract does not do much apart from allowing anyone to store a single number that is accessible by anyone in the world. Anyone could call `set` again with a different value and overwrite the current number. Nevertheless, each value stored in the storage of the contract will still be stored in the history of the blockchain. Later in this book, you will see how you can impose access restrictions so that only you can alter the number.
es: Este contrato no hace mucho aparte de permitir a cualquier persona almacenar un solo número que es accesible por cualquier persona en el mundo. Cualquiera podría llamar `set` de nuevo con un valor diferente y sobrescribir el número actual. Sin embargo, cada valor almacenado en el almacenamiento del contrato todavía se almacenará en la historia del blockchain. Más adelante en este libro, usted verá cómo se puede imponer restricciones de acceso para que sólo usted puede alterar el número.
fr: Ce contrat ne fait pas grand-chose à part permettre à quiconque de stocker un numéro unique accessible par n'importe qui dans le monde. N'importe qui pourrait appeler `set` à nouveau avec une valeur différente et écraser le numéro courant. Néanmoins, chaque valeur stockée dans le stockage du contrat sera toujours stockée dans l'historique de la blockchain. Plus tard dans ce livre, vous verrez comment vous pouvez imposer des restrictions d'accès afin que vous puissiez seulement modifier le numéro.
id: Kontrak ini tidak banyak berbeda dari membiarkan orang menyimpan satu nomor yang dapat diakses oleh siapa pun di dunia. namun, setiap nilai yang disimpan dalam penyimpanan kontrak akan tetap disimpan dalam sejarah rantai blok. kemudian di buku ini, Anda akan melihat bagaimana Anda dapat memaksakan pembatasan akses sehingga hanya Anda yang dapat mengubah nomor tersebut.
tr: Bu sözleşme, herhangi birinin dünyadaki herhangi biri tarafından erişilebilen tek bir numarayı depolamasına izin vermekten başka bir şey yapmaz. Herkes set'yi farklı bir değerle tekrar arayabilir ve mevcut sayının üzerine yazabilir. Bununla birlikte, sözleşmenin depolanmasında depolanan her değer hala blok zincirinin geçmişinde saklanacaktır. Bu kitapta daha sonra, yalnızca sayıyı değiştirebilmeniz için erişim kısıtlamalarını nasıl empoze edebileceğinizi göreceksiniz.
zh_cn: 除了允许任何人存储世界上任何人都可以进入的单一号码之外,这一合同没有多大作用,任何人都可以以不同的价值再次调用`设置'并覆盖当前号码,然而,合同储存中的每个价值将仍然保存在块链的历史中。在这本书的后面,你会看到如何实施访问限制,以便只有您才能改变号码。

source: In the previous section, we gave an introductory example of a smart contract written in Cairo, describing the basic blocks to build smart contracts on Starknet. In this section, we'll be taking a deeper look at all the components of a smart contract, step by step.
es: En la sección anterior, dimos un ejemplo introductorio de un contrato inteligente escrito en El Cairo, describiendo los bloques básicos para construir contratos inteligentes en Starknet. En esta sección, vamos a echar un vistazo más profundo a todos los componentes de un contrato inteligente, paso a paso.
fr: Dans la section précédente, nous avons donné un exemple introductif d'un contrat intelligent écrit au Caire, décrivant les blocs de base pour construire des contrats intelligents sur Starknet. Dans cette section, nous allons jeter un regard plus profond sur tous les composants d'un contrat intelligent, étape par étape.
id: Di bagian sebelumnya, kami memberikan contoh pengantar kontrak cerdas yang ditulis di Kairo, menggambarkan blok dasar untuk membangun kontrak cerdas di Starknet.
tr: Bir önceki bölümde, Starknet üzerinde akıllı sözleşmeler yapmak için temel blokları tanımlayan Kahire'de yazılmış akıllı bir sözleşmenin giriş örneğini verdik. Bu bölümde, akıllı bir sözleşmenin tüm bileşenlerine adım adım daha derinlemesine bakacağız.
zh_cn: 在前一节,我们给出了一个在开罗写成的智能合同的介绍性例子,描述了在史塔克内特建立智能合同的基本基石。在本节,我们将更深入地审视智能合同的所有组成部分,一步一步地。

source: When we discussed [_interfaces_](./ch13-02-anatomy-of-a-simple-contract.md#the-interface-the-contracts-blueprint), we specified the difference between the two types of _public functions_, i.e., _external functions_ and _view functions_, and we mentioned how to interact with the _storage_ of a contract.
es: Cuando discutimos [_interfaces_](./ch13-02-anatomía-de-un-contrato simple.md#la-interface-los-contratos-plano), especificamos la diferencia entre los dos tipos de _funciones públicas_, es decir, _funciones externas_ y _ver funciones_, y mencionamos cómo interactuar con el _almacenamiento_ de un contrato.
fr: Lorsque nous avons discuté de [_interfaces_](./ch13-02-anatomy-of-a-simple-contract.md#the-interface-the-contracts-blueprint), nous avons précisé la différence entre les deux types de fonctions _publiques_, c'est-à-dire les fonctions _externes_ et _view_, et nous avons mentionné comment interagir avec le _stockage_ d'un contrat.
id: Ketika kita membahas [_interfaces_][/ch13-02-anatomy-of-a-simple-contract.m#the-interface-the-contracts-blueprint), kita menentukan perbedaan antara dua jenis fungsi _public_, misalnya., fungsi _external_ dan _view fungsi_, dan kita menyebutkan bagaimana berinteraksi dengan _storage_ kontrak.
tr: [_interfaces_](./ch13-02-anatomy-of-a-simple-contract.md#the-interface-the-contracts-blueprint) konusunu ele aldığımızda, iki tür _public functions_, yani _external functions_ ve _view functions_ arasındaki farkı belirttik ve bir sözleşmenin _storage_ ile nasıl etkileşime gireceğimizi belirttik.
zh_cn: 当我们讨论[_interfaces_] (./ch13-02-anatomy- a-simple Contract. md# the-interface-the-contract-blueprint)时,我们具体说明了两种类型的公共功能之间的区别,即_外部功能_和_view 函数_,我们提到如何与合同的_storage_ 互动。

source: At this point, you should have multiple questions that come to mind:
es: En este punto, usted debe tener múltiples preguntas que vienen a la mente:
fr: À ce stade, vous devriez avoir plusieurs questions qui viennent à l'esprit:
id: Pada titik ini, Anda harus memiliki beberapa pertanyaan yang datang ke pikiran:
tr: Bu noktada, akla gelen birden fazla sorunuz olmalıdır:
zh_cn: 此时此刻,你应该想到许多问题:

source: How can I store more complex data types?
es: ¿Cómo puedo almacenar tipos de datos más complejos?
fr: Comment puis-je stocker des types de données plus complexes?
id: Bagaimana saya dapat menyimpan lebih banyak tipe data yang kompleks?
tr: Daha karmaşık veri türlerini nasıl saklayabilirim?
zh_cn: 我怎样才能储存更复杂的数据类型?

source: How do I define internal/private functions?
es: ¿Cómo defino las funciones internas/privadas?
fr: Comment définir les fonctions internes/privées?
id: Bagaimana saya mendefinisikan internal/private fungsi?
tr: İç/özel fonksiyonları nasıl tanımlarım?
zh_cn: 如何界定内部/私人职能?

source: How can I emit events? How can I index them?
es: ¿Cómo puedo emitir eventos? ¿Cómo puedo indexarlos?
fr: Comment puis-je émettre des événements? Comment puis-je les indexer?
id: Bagaimana aku bisa mengeluarkan sesuatu?
tr: Olayları nasıl yayabilirim? Onları nasıl indeksleyebilirim?
zh_cn: 我怎样才能发布事件?我怎样能为它们索引?

source: Is there a way to reduce the boilerplate?
es: ¿Hay alguna manera de reducir la placa de caldera?
fr: Y a-t-il un moyen de réduire la plaque de chaudière?
id: Apakah ada cara untuk mengurangi boilerplate?
tr: Kazan plakasını azaltmanın bir yolu var mı?
zh_cn: 有没有办法减少锅炉板?

source: Luckily, we'll be answering all these questions in this chapter. Let's consider the `NameRegistry` contract in Listing 14-1 that we'll be using throughout this chapter:
es: Por suerte, responderemos a todas estas preguntas en este capítulo. Consideremos el contrato `NameRegistry` en Listar 14-1 que usaremos a lo largo de este capítulo:
fr: Heureusement, nous répondrons à toutes ces questions dans ce chapitre. Considérons le contrat `NameRegistry` dans Listing 14-1 que nous utiliserons tout au long de ce chapitre:
id: Untungnya, kita akan menjawab semua pertanyaan di bab ini.
tr: Neyse ki, bu bölümde tüm bu soruları cevaplayacağız. Listeleme 14-1'deki NameRegistry sözleşmesini bu bölüm boyunca kullanacağımızı düşünelim:
zh_cn: 幸运的是,我们将在本章中回答所有这些问题。让我们考虑在14-1清单中“注册”合同,我们将在整个本章中使用:

source: // Public functions inside an impl block
es: // Funciones públicas dentro de un bloque de impl
fr: // Fonctions publiques à l'intérieur d'un bloc impl
id: // Fungsi Publik dalam sebuah blok impl
tr: // Bir impl bloğu içindeki genel işlevler
zh_cn: / 内分块内的公共职能

source: // Standalone public function
es: // Función pública autónoma
fr: // Fonction publique autonome
id: // Fungsi publik Standalone
tr: // Bağımsız kamu işlevi
zh_cn: /独立公共职能

source: // Could be a group of functions about a same topic
es: // Podría ser un grupo de funciones sobre un mismo tema
fr: // Peut être un groupe de fonctions sur un même sujet
id: //Bisa jadi sekelompok fungsi tentang topik yang sama
tr: // Aynı konuyla ilgili bir grup fonksiyon olabilir
zh_cn: / 可以是有关同一专题的一组职能

source: // Free function
es: // Función gratuita
fr: // Fonction libre
id: // Fungsi bebas
tr: // Serbest fonksiyon
zh_cn: // 自由功能

source: <span class="caption">Listing 14-1: Our reference contract for this chapter</span>
es: <span class="caption">Lista 14-1: Nuestro contrato de referencia para este capítulo</span>
fr: <span class="caption">Liste 14-1: Notre contrat de référence pour ce chapitre</span>
id: <span class="caption">Listing 14-1: Kontrak referensi kami untuk bab</span>
tr: span class="caption">Liste 14-1: Bu bölüm için referans sözleşmemiz/span>
zh_cn: <span类=“caption” > listing 14-1:我们关于本章的参考合同 </span>

source: The most common way for interacting with a contract’s storage is through storage variables. As stated previously, storage variables allow you to store data that will be stored in the contract's storage that is itself stored on the blockchain. These data are persistent and can be accessed and potentially modified anytime once the contract is deployed.
es: La forma más común de interactuar con el almacenamiento de un contrato es a través de variables de almacenamiento. Como se ha indicado anteriormente, las variables de almacenamiento le permiten almacenar datos que se almacenarán en el almacenamiento del contrato que se almacena en sí mismo en la cadena de bloques. Estos datos son persistentes y pueden ser accedidos y potencialmente modificados en cualquier momento una vez que el contrato se despliega.
fr: Comme indiqué précédemment, les variables de stockage vous permettent de stocker des données qui seront stockées dans le stockage du contrat qui est lui-même stocké sur la blockchain. Ces données sont persistantes et peuvent être consultées et éventuellement modifiées à tout moment une fois le contrat déployé.
id: Cara yang paling umum untuk berinteraksi dengan sebuah kontrak yang disimpan di penyimpanan adalah melalui variabel penyimpanan. Seperti yang dinyatakan sebelumnya, variabel penyimpanan memungkinkan Anda untuk menyimpan data yang akan disimpan dalam penyimpanan kontrak yang sendiri disimpan di blok rantai. Data ini gigih dan dapat diakses dan berpotensi dimodifikasi kapan saja setelah kontrak dikerahkan.
tr: Bir sözleşmenin depolamasıyla etkileşime girmenin en yaygın yolu depolama değişkenleridir. Daha önce de belirtildiği gibi, depolama değişkenleri, sözleşmenin depolama alanında saklanacak verileri blok zincirinde saklamanıza izin verir. Bu veriler kalıcıdır ve sözleşme konuşlandırıldıktan sonra her zaman erişilebilir ve potansiyel olarak değiştirilebilir.
zh_cn: 与合同储存进行互动的最常见方式是通过存储变量。 如前所述,存储变量允许您存储存储在合同储存中的数据,而该储存本身就存储在链条上。 这些数据具有持久性,一旦合同部署,随时都可以访问和修改。

source: Storage variables in Starknet contracts are stored in a special struct called `Storage`:
es: Las variables de almacenamiento en los contratos Starknet se almacenan en una estructura especial llamada `Almacenamiento`:
fr: Les variables de stockage dans les contrats Starknet sont stockées dans une structure spéciale appelée `Storage`:
id: Variabel penyimpanan di kontrak Starknet disimpan dalam struktur khusus yang disebut Storage:
tr: Starknet sözleşmelerindeki depolama değişkenleri Storage adı verilen özel bir yapıda saklanır:
zh_cn: Starknet合同中的储存变数储存在一个称为`储存'的特殊支架中:
