Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: If we were to call `value_in_cents(Coin::Quarter(UsState::Alaska))`, `coin` would be `Coin::Quarter(UsState::Alaska)`. When we compare that value with each of the match arms, none of them match until we reach `Coin::Quarter(state)`. At that point, the binding for `state` will be the value `UsState::Alaska`. We can then use that binding in `println!` macro, thus getting the inner state value out of the `Coin` enum variant for `Quarter`.
es: Si llamáramos `value_in_cents(Coin::Quarter(UsState::Alaska))`, `coin` sería `Coin::Quarter(UsState::Alaska)`. Cuando comparamos ese valor con cada uno de los brazos de partido, ninguno de ellos coincide hasta que alcancemos `Coin::Quarter(state)`. En ese momento, la unión para `state` será el valor `UsState::Alaska`. Podemos entonces utilizar esa unión en `println!` macro, obteniendo así el valor de estado interno de la variante `Coin` enum para `Quarter`.
fr: Si nous devions appeler `value_in_cents(Coin::Quarter(UsState::Alaska)`, `coin` serait `Coin::Quarter(UsState::Alaska)`. Lorsque nous comparons cette valeur avec chacun des bras de correspondance, aucun d'entre eux ne correspond jusqu'à ce que nous atteignions `Coin::Quarter(state)`. À ce moment, la liaison pour `state` sera la valeur `UsState:::Alaska`. Nous pouvons alors utiliser cette liaison dans la macro `println!`, afin d'obtenir la valeur de l'état intérieur de la variante `Coin` enum pour `Quarter`.
id: Jika kita harus memanggil årvalue_in_cents[Coin::Qarter Allahnate::::Alaska), kita harus memanggil åcoin_Coinin:Quarter Allahtate::Alaska. Ketika kita membandingkan nilai tersebut dengan setiap senjata, tidak satupun dari mereka cocok sampai kita mencapai "Coin:Quarter Nation". Pada saat itu, mengikat untuk negara bagian Ástate:Alaska:Alaska.
tr: value_in_cents(Coin:Quarter(UsState:Alaska) olarak adlandırsaydık, coin Coin::Quarter(UsState:Alaska) olurdu. Bu değeri maç kollarının her biriyle karşılaştırdığımızda, hiçbiri Coin:Quarter(state) değerine ulaşana kadar eşleşmez. Bu noktada, Coin:Quarter(state) için bağlayıcı olacaktır.
zh_cn: 如果我们将`价值'(Coin::Queen(Us State:Alaska))称为`价值 ',`coin'将是`coin:Queen(Us State:Alaska) ',当我们将该数值与每件匹配的军火进行比较时,在达到`coin:Quel(state)'之前,没有任何一个匹配。此时,`国家'的约束力将是`Us State:Alaska'的数值。然后,我们可以在`println!'宏观中使用该约束力,从而将`Coin' enum变体的内值从`comin' 变体中获取出来。

source: Matching with `Option<T>`
es: Coincidiendo con `Opción<TÃ3n
fr: Correspondance avec `Option<T>`
id: Cocok dengan <T>
tr: OptionT> ile eşleşiyor
zh_cn: 与“可选<T}”匹配

source: In the previous section, we wanted to get the inner `T` value out of the `Some` case when using `Option<T>`; we can also handle `Option<T>` using `match`, as we did with the `Coin` enum! Instead of comparing coins, we’ll compare the variants of `Option<T>`, but the way the `match` expression works remains the same.
es: En la sección anterior, queríamos obtener el valor `T` interno del caso `Some` al usar `Option<T`; también podemos manejar `Option<T` usando `match`, ¡como hicimos con el enum `Coin`! En lugar de comparar monedas, compararemos las variantes de `Option<T`, pero la forma en que funciona la expresión `match` sigue siendo la misma.
fr: Dans la section précédente, nous voulions obtenir la valeur `T` intérieure de l`affaire `Some` en utilisant `Option<T>`; nous pouvons également gérer `Option<T>` en utilisant `match`, comme nous l`avons fait avec l`enum `Coin`! Au lieu de comparer les pièces, nous comparerons les variantes de `Option<T>`, mais la façon dont l`expression `match` fonctionne reste la même.
id: Di bagian sebelumnya, kami juga ingin mendapatkan nilai dari bagian dalam dari kasus tersebut. Daripada membandingkan koin, kami akan membandingkan varian dari <T>, tapi cara ekspresi yang cocok tetap sama.
tr: Önceki bölümde, OptionT> kullanırken Some durumundan iç T değerini almak istedik; Coin enum ile yaptığımız gibi OptionT> kullanarak da işleyebiliriz! Paraları karşılaştırmak yerine, OptionT> ifadesinin varyantlarını karşılaştıracağız, ancak match ifadesinin çalışma şekli aynı kalır.
zh_cn: 在上一节中,我们希望在使用`可选'时,从`某些`案例'中取出`内值';我们也可以像我们在`可选'中所做的那样,用`匹配'处理`可选'T';我们不用比较硬币,而是比较`可选'T'的变体,但`可选'表达方式仍然一样。

source: Let’s say we want to write a function that takes an `Option<u8>` and, if there’s a value inside, adds `1` to that value. If there is no value inside, the function should return the `None` value and not attempt to perform any operations.
es: Digamos que queremos escribir una función que toma una `opción < u8â y, si hay un valor dentro, añade `1` a ese valor. Si no hay valor dentro, la función debe devolver el valor `Ninguno` y no intentar realizar ninguna operación.
fr: On dit que nous voulons écrire une fonction qui prend une `Option<u8>` et, s'il y a une valeur à l'intérieur, ajoute `1` à cette valeur. S'il n'y a pas de valeur à l'intérieur, la fonction doit renvoyer la valeur `Aucune` et ne pas essayer d'effectuer des opérations.
id: Katakanlah kita ingin menulis sebuah fungsi yang mengambil sebuah opsi<u8> dan, jika ada suatu nilai di dalamnya, menambahkannya pada nilai tersebut. jika tidak ada nilai di dalamnya, fungsinya harus mengembalikan nilai tersebut dan tidak mencoba melakukan operasi apapun.
tr: Bir Optionu8> alan bir fonksiyon yazmak istediğimizi varsayalım ve içinde bir değer varsa, bu değere 1 ekler. İçinde bir değer yoksa, fonksiyon None değerini iade etmeli ve herhangi bir işlem gerçekleştirmeye çalışmamalıdır.
zh_cn: 让我们假设我们想要写入一个函数, 该函数需要` 选项< u8 ', 如果内部有值, 则该值增加` 1'。 如果内部没有值, 该函数应该返回“ 无” 值, 而不是试图执行任何操作 。

source: This function is very easy to write, thanks to `match`, and will look like Listing 6-3.
es: Esta función es muy fácil de escribir, gracias a `match`, y se verá como el listado 6-3.
fr: Cette fonction est très facile à écrire, grâce à `match`, et ressemblera à Listing 6-3.
id: Fungsi ini sangat mudah untuk ditulis, berkat ketidakcocokan, dan akan terlihat seperti Listing 6-3.
tr: Bu fonksiyonun match sayesinde yazılması çok kolaydır ve Listeleme 6-3'e benzeyecektir.
zh_cn: 3⁄4 ̄ ̧漯B

source: <span class="caption">Listing 6-3: A function that uses a `match` expression on an `Option<u8>`</span>
es: <span class="caption">Lista 6-3: Una función que utiliza una expresión `match` en una `Opción<u8/span>
fr: <span class="caption">Liste 6-3: Une fonction qui utilise une expression `match` sur une `Option<u8>`</span>
id: <span class="caption">Listing 6-3: Sebuah fungsi yang menggunakan ekspresi Ématché pada sebuah <u8></span>
tr: span class="caption">Listing 6-3: Bir Optionu8> üzerinde match ifadesini kullanan bir fonksiyon/span>
zh_cn: <span类=“caption” >Listing 6-3:在“option<u8>_/span>上使用“match”表达式的函数

source: Let’s examine the first execution of `plus_one` in more detail. When we call `plus_one(five)`, the variable `x` in the body of `plus_one` will have the value `Some(5)`. We then compare that against each `match` arm:
es: Examinemos la primera ejecución de `plus_one` con más detalle. Cuando llamamos `plus_one(cinco)`, la variable `x` en el cuerpo de `plus_one` tendrá el valor `Some(5)`. A continuación, comparamos eso con cada brazo `match`:
fr: Lorsque nous appelons `plus_un(cinq)`, la variable `x` dans le corps de `plus_un` aura la valeur `Some(5)`. Nous comparons ensuite cela avec chaque bras `match`:
id: Mari kita periksa eksekusi pertama dari ·plus_one dalam detail yang lebih lanjut. ketika kita sebut ·plus_one Allah lima), variabel di dalam tubuh ·plus_one.
tr: plus_one'un ilk icrasını daha ayrıntılı olarak inceleyelim. plus_one(5) dediğimizde, plus_one'un gövdesindeki x değişkeni Some(5) değerine sahip olacaktır. Bunu her match koluyla karşılaştırırız:
zh_cn: 让我们更详细地检查`plus_one'的第一次执行。当我们称之为`plus_1(5)'时,`plus_1'体中的变量`x'将具有`some(5)'的值。然后,我们将该值与每个`match'臂作比较:

source: Does `Option::Some(5)` value match the pattern `Option::Some(val)`? It does! We have the same variant. The `val` binds to the value contained in `Option::Some`, so `val` takes the value `5`. The code in the `match` arm is then executed, so we add `1` to the value of `val` and create a new `Option::Some` value with our total `6` inside. Because the first arm matched, no other arms are compared.
es: `Opción::El valor de `val` coincide con el patrón `Opción::Some(val)`? Lo hace! Tenemos la misma variante. El `val` se une al valor contenido en `opción::Some`, por lo que `val` toma el valor `5`. El código en el brazo `match` se ejecuta entonces, por lo que agregamos `1` al valor de `val` y creamos una nueva `opción::Some` valor con nuestro total `6` dentro. Debido a que el primer brazo coincide, no se comparan otros brazos.
fr: La valeur `Option::Some(5)` correspond-elle au motif `Option::Some(val)`? Nous avons la même variante. La `val` se lie à la valeur contenue dans `Option::Some`, donc `val` prend la valeur `5`. Le code dans le bras `match` est alors exécuté, nous ajoutons `1` à la valeur `val` et créons une nouvelle `Option::Some` valeur avec notre `6` total à l'intérieur. Parce que le premier bras correspond, aucun autre bras n'est comparé.
id: Apakah ada varian yang sama.
tr: Option::Some(5) değeri Option::Some(val) kalıbına uyuyor mu? Aynı varyanta sahibiz. Option:Some içinde bulunan değere bağlanır, bu yüzden val değeri 5 alır. Çünkü match kolundaki kod daha sonra çalıştırılır, bu nedenle 1 değerini ile yeni bir değer oluştururuz.
zh_cn: `可选:某些(5)`值是否与`可选:某些(val)` 值匹配?它确实如此?我们有相同的变式。`val'与`可选:某些`,因此`val'值与`可选:某些`5'值挂钩。然后执行`相匹配'臂中的代码,因此我们在`val'值中添加`1'值,并创建一个新的`可选:某些`值与我们的`6'内总值相匹配。因为第一个手臂匹配,没有其他手臂被比较。

source: Now let’s consider the second call of `plus_one` in our main function, where `x` is `Option::None`. We enter the `match` and compare to the first arm:
es: Ahora consideremos la segunda llamada de `plus_one` en nuestra función principal, donde `x` es `Opción::Ninguna`. Entramos en el `match` y comparamos con el primer brazo:
fr: Maintenant, considérons le deuxième appel de `plus_one` dans notre fonction principale, où `x` est `Option::None`. Nous entrons dans le `match` et nous nous comparons au premier bras:
id: Sekarang mari kita mempertimbangkan panggilan kedua dari ·plus_one dalam fungsi utama kita, di mana åxá adalah Option:::: tidak ada. kita masuk ke åmatché dan membandingkan dengan lengan pertama:
tr: Şimdi x'nin Option::None olduğu ana fonksiyonumuzda plus_one'un ikinci çağrısını ele alalım. match'ye giriyoruz ve ilk kolla karşılaştırıyoruz:
zh_cn: 现在让我们来考虑一下我们主要功能中的第二通`加一 ',其中`x'是`可选:无'。

source: The `Option::Some(val)` value doesn’t match the pattern `Option::None`, so we continue to the next arm:
es: La `Opción::Some(val)` valor no coincide con el patrón `Opción::Ninguna`, por lo que continuamos al siguiente brazo:
fr: La valeur `Option::Some(val)` ne correspond pas au motif `Option::None`, donc nous continuons vers le bras suivant:
id: Pilihan: Nilai beberapa orang tidak sesuai dengan pola:
tr: Option::Some(val) değeri Option::None kalıbına uymuyor, bu yüzden bir sonraki kola devam ediyoruz:
zh_cn: `可选:某种(val)`价值与`可选:无'模式不符,因此我们继续下一臂:

source: It matches! There’s no value to add to, so the matching construct ends and returns the `Option::None` value on the right side of `=>`.
es: ¡Coincide! No hay valor que añadir, por lo que el constructo coincidente termina y devuelve el valor `Opción::Ninguno` en el lado derecho de `=.
fr: Il correspond! Il n'y a aucune valeur à ajouter, de sorte que la construction correspondante se termine et renvoie la valeur `Option::Aucun` sur le côté droit de `=>`.
id: Cocok! Tidak ada nilai yang bisa ditambahkan, sehingga konstruksi yang cocok berakhir dan kembali pada pilihan:: Tidak ada nilai di sisi kanan dari <>.
tr: Eşleşiyor! Eklenecek bir değer yok, bu yüzden eşleşen yapı sona eriyor ve Option::None değerini =>'nin sağ tarafında döndürüyor.
zh_cn: 匹配! 没有附加值, 因此匹配的构造结尾和返回“ 选项: 没有” 的值, 在 {} 的右侧 。

source: Combining `match` and enums is useful in many situations. You’ll see this pattern a lot in Cairo code: `match` against an enum, bind a variable to the data inside, and then execute code based on it. It’s a bit tricky at first, but once you get used to it, you’ll wish you had it in all languages. It’s consistently a user favorite.
es: Combinar `match` y enums es útil en muchas situaciones. Verás este patrón mucho en el código de El Cairo: `match` contra un enum, une una variable a los datos dentro, y luego ejecutar código basado en él. Es un poco difícil al principio, pero una vez que te acostumbras a él, desearás tenerlo en todos los idiomas. Es consistentemente un favorito del usuario.
fr: Combiner `match` et enums est utile dans de nombreuses situations. Vous allez voir ce modèle beaucoup dans le code du Caire: `match` contre un enum, lier une variable à l'intérieur des données, puis exécuter le code basé sur elle. Il est un peu difficile au début, mais une fois que vous vous habituez à elle, vous souhaitez que vous l'ayez dans toutes les langues. Il est toujours un favori de l'utilisateur.
id: Mengkombinasikan dan enums sangat berguna dalam banyak situasi Anda akan melihat pola ini banyak dalam kode Kairo: Anda akan berharap Anda memilikinya dalam semua bahasa.
tr: match ve enums'u birleştirmek birçok durumda yararlıdır. Bu şablonu Kahire kodunda çok göreceksiniz: match bir enum'a karşı, bir değişkeni içerideki verilere bağlayın ve ardından buna göre kod çalıştırın. İlk başta biraz zor, ancak bir kez alıştıktan sonra, tüm dillerde olmasını dilersiniz. Sürekli olarak bir kullanıcı favorisi.
zh_cn: 将“ 匹配” 和 “ enum ” 组合在一起在许多情况下是有用的。 您将在开罗代码中看到很多这样的模式 : “ 匹配” 与 enum 匹配, 将变量绑在内部数据中, 然后根据它执行代码。 一开始有点棘手, 但是一旦习惯了, 你就会希望你拥有所有语言的这种模式。 它始终是用户最喜爱的 。

source: Matches Are Exhaustive
es: Las coincidencias son exhaustivas
fr: Les matches sont exhaustifs
id: Kecocokan Itu Melelahkan
tr: Maçlar Tükeniyor
zh_cn: 火柴已耗尽

source: There’s one other aspect of `match` we need to discuss: the arms’ patterns must cover all possibilities. Consider this version of our `plus_one` function, which has a bug and won’t compile:
es: Hay otro aspecto de `match` que tenemos que discutir: los patrones de brazos deben cubrir todas las posibilidades. Considere esta versión de nuestra función `plus_one`, que tiene un error y no compilar:
fr: Il y a un autre aspect de `match` que nous devons discuter: les modèles arms= doivent couvrir toutes les possibilités. Considérez cette version de notre fonction `plus_one`, qui a un bug et won=t compiler:
id: Ada satu aspek lain yang perlu kita bahas: pola lengan harus menutupi semua kemungkinan.
tr: match'nin tartışmamız gereken bir başka yönü daha var: kolların kalıpları tüm olasılıkları kapsamalıdır. plus_one fonksiyonumuzun bir hataya sahip olan ve derlemeyecek olan bu sürümünü düşünün:
zh_cn: 我们需要讨论“匹配”的另一个方面:武器模式必须涵盖所有可能性。 想想我们的“ 附加一” 功能的这一版本,它有一个错误,不会编译:

source: We didn’t handle the `None` case, so this code will cause a bug. Luckily, it’s a bug Cairo knows how to catch. If we try to compile this code, we’ll get this error:
es: No manejamos el caso `Ninguno`, por lo que este código causará un error. Por suerte, es un error El Cairo sabe cómo atrapar. Si tratamos de compilar este código, vamos a obtener este error:
fr: Nous n'avons pas géré l'affaire `Aucune`, donc ce code va causer un bug. Heureusement, il est un bug Le Caire sait comment attraper. Si nous essayons de compiler ce code, nous allons obtenir cette erreur:
id: Kami tidak menangani kasus ini, jadi kode ini akan menyebabkan bug.
tr: None davasını ele almadık, bu yüzden bu kod bir hataya neden olacak. Neyse ki, Kahire'nin nasıl yakalayacağını bildiği bir hata. Bu kodu derlemeye çalışırsak, şu hatayı alacağız:
zh_cn: 我们没有处理`无'案,所以这个代码会造成错误。 幸运的是,它是一个虫子开罗知道如何捕捉。 如果我们试图编集这个代码,我们会得到这个错误:

source: Cairo knows that we didn’t cover every possible case, and even knows which pattern we forgot! Matches in Cairo are exhaustive: we must exhaust every last possibility in order for the code to be valid. Especially in the case of `Option<T>`, when Cairo prevents us from forgetting to explicitly handle the `None` case, it protects us from assuming that we have a value when we might have null, thus making the [billion-dollar mistake](https://en.wikipedia.org/wiki/Null_pointer#History) discussed earlier impossible.
es: El Cairo sabe que no cubrimos todos los casos posibles, e incluso sabe qué patrón olvidamos! Los partidos en El Cairo son exhaustivos: debemos agotar todas las últimas posibilidades para que el código sea válido. Especialmente en el caso de `Option<T®, cuando El Cairo nos impide olvidarnos de manejar explícitamente el caso `Ninguno`, nos protege de asumir que tenemos un valor cuando podríamos tener nulo, haciendo así imposible el [error de miles de millones de dólares] (https://en.wikipedia.org/wiki/Null_pointer#History) discutido anteriormente.
fr: Le Caire sait que nous n'avons pas couvert tous les cas possibles, et sait même quel modèle nous avons oublié! Les correspondances au Caire sont exhaustives: nous devons épuiser toutes les dernières possibilités pour que le code soit valide. Surtout dans le cas de `Option<T>`, lorsque le Caire nous empêche d'oublier de gérer explicitement le cas `Aucun`, il nous protège de supposer que nous avons une valeur quand nous pourrions avoir nul, rendant ainsi impossible la [milliard-dollar erreur] (https://en.wikipedia.org/wiki/Null_pointer#History) discutée précédemment.
id: Kairo tahu bahwa kita tidak menutup setiap kasus yang mungkin, dan bahkan tahu pola mana yang kita lupakan! Matches di Kairo adalah knalpot: kita harus membuang setiap kemungkinan terakhir agar kode tersebut valid. terutama dalam kasus Option<T>, ketika Kairo mencegah kita untuk lupa untuk eksplisit menangani kasus åNneíatic, itu melindungi kita dari asumsi bahwa kita mungkin memiliki nilai ketika kita gagal, sehingga membuat [miliar-domen] kesalahan://T.wikipedia.org/Nwiwi/Nultler#cerita sebelumnya tidak mungkin dibahas.)
tr: Kahire, mümkün olan her davayı kapsamadığımızı biliyor ve hatta hangi kalıbı unuttuğumuzu bile biliyor! Kahire'deki maçlar kapsamlıdır: kodun geçerli olması için her türlü olasılığı tüketmeliyiz. Özellikle OptionT> durumunda, Kahire None davasını açıkça ele almayı unutmamızı engellediğinde, bizi daha önce null olduğunda bir değere sahip olduğumuzu varsaymaktan korur, böylece [milyar dolarlık hata].
zh_cn: 开罗知道我们没有覆盖所有可能的案例, 甚至知道我们忘记了哪些模式! 开罗的火柴是详尽无遗的: 我们必须用尽所有最后的可能性才能使代码有效。 特别是“ Option<T ” 的情况, 开罗阻止我们忘记明确处理`无'案件,它保护我们不认为我们有价值当我们可能无效时,从而使得先前讨论的[十亿美元错误](https://en.wikipedia.org/wiki/Null_pointer#History)变得不可能。

source: Catch-all with the `_` Placeholder
es: Capturar todo con el marcador de posición `_`
fr: Catch-all avec le porte-place `_`
id: Tangkap semua dengan pemegang tempat.
tr: _ Yer tutucusu ile her şeyi yakala
zh_cn: 与占居者

source: Using enums, we can also take special actions for a few particular values, but for all other values take one default action. `_` is a special pattern that matches any value and does not bind to that value. You can use it by simply adding a new arm with `_` as the pattern for the last arm of the `match` expression.
es: Usando enums, también podemos tomar acciones especiales para algunos valores particulares, pero para todos los demás valores tomar una acción predeterminada. `_` es un patrón especial que coincide con cualquier valor y no se une a ese valor. Puede usarlo simplemente añadiendo un nuevo brazo con `_` como el patrón para el último brazo de la expresión `match`.
fr: En utilisant des enums, nous pouvons également prendre des actions spéciales pour quelques valeurs particulières, mais pour toutes les autres valeurs prendre une action par défaut. `_` est un motif spécial qui correspond à n'importe quelle valeur et ne se lie pas à cette valeur. Vous pouvez l'utiliser en ajoutant simplement un nouveau bras avec `_` comme motif pour le dernier bras de l'expression `match`.
id: Menggunakan enums, kita juga dapat mengambil tindakan khusus untuk beberapa nilai tertentu, tetapi untuk semua nilai lain mengambil satu tindakan baku.
tr: Enumları kullanarak, birkaç belirli değer için de özel eylemler yapabiliriz, ancak diğer tüm değerler için bir varsayılan eylemde bulunuruz. _, herhangi bir değerle eşleşen ve bu değere bağlanmayan özel bir kalıptır. match ifadesinin son kolu için kalıp olarak _ ile yeni bir kol ekleyerek kullanabilirsiniz.
zh_cn: 使用 enums, 我们也可以对几个特定值采取特殊行动, 但对于所有其他值则采取一个默认动作 。\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Imagine we have a vending machine that only accepts Dime coins. We want to have a function that processes inserted coins and returns `true` only if the coin is accepted.
es: Imaginemos que tenemos una máquina expendedora que sólo acepta monedas de Dime. Queremos tener una función que procesa monedas insertadas y devuelve `true` sólo si la moneda es aceptada.
fr: Imaginez que nous avons un distributeur automatique qui n'accepte que les pièces Dime. Nous voulons avoir une fonction qui traite les pièces insérées et retourne `true` seulement si la pièce est acceptée.
id: Bayangkan kita memiliki mesin penjual otomatis yang hanya menerima koin Dime. kita ingin memiliki fungsi yang proses dimasukkan koin dan kembali hanya jika koin itu diterima.
tr: Sadece Dime paralarını kabul eden bir otomatımız olduğunu hayal edin. Takılan paraları işleyen ve sadece para kabul edilirse true döndüren bir fonksiyona sahip olmak istiyoruz.
zh_cn: 想象一下我们有一个只接受 Dime 硬币的自动售货机。 我们希望有一个功能, 只有当硬币被接受时, 才能处理插入硬币和返回“ 真实” 。

source: Here's a `vending_machine_accept` function that implements this logic:
es: Aquí está una función `vending_machine_acept` que implementa esta lógica:
fr: Voici une fonction `vending_machine_accept` qui implémente cette logique :
id: Ini adalah fungsi mesin-mesin yang menerapkan logika ini:
tr: İşte bu mantığı uygulayan bir otomat_makine_kabul fonksiyonu:
zh_cn: 以下是一个执行这一逻辑的`前置_机器_接受'功能:

source: This example also meets the exhaustiveness requirement because we’re explicitly ignoring all other values in the last arm; we haven’t forgotten anything.
es: Este ejemplo también cumple con el requisito de exhaustividad porque estamos ignorando explícitamente todos los demás valores en el último brazo; no hemos olvidado nada.
fr: Cet exemple répond également à l'exigence d'exhaustivité parce que nous sommes explicitement ignorants de toutes les autres valeurs dans le dernier bras; nous n'avons rien oublié.
id: Contoh ini juga memenuhi kebutuhan yang melelahkan karena kita secara eksplisit mengabaikan semua nilai lain di lengan terakhir; kita belum melupakan apa pun.
tr: Bu örnek aynı zamanda kapsamlılık gereksinimini de karşılar, çünkü son koldaki diğer tüm değerleri açıkça görmezden geliyoruz; hiçbir şeyi unutmadık.
zh_cn: 这个例子也符合详尽无遗的要求, 因为我们显然忽略了最后一只手臂的所有其他价值;

source: There's no catch-all pattern in Cairo that allows you to use the value of the pattern.
es: No hay ningún patrón en El Cairo que te permita usar el valor del patrón.
fr: Il n'y a pas de motif de capture au Caire qui vous permet d'utiliser la valeur du motif.
id: Tidak ada pola menangkap semua di Kairo yang memungkinkan Anda untuk menggunakan nilai pola.
tr: Kahire'de desenin değerini kullanmanıza izin veren her şeyi yakalayan bir model yok.
zh_cn: 开罗没有一刀切的模式 让你可以使用这个模式的价值

source: Multiple Patterns with the `|` Operator
es: Múltiples patrones con el operador
fr: Patterns multiples avec l`opérateur `="
id: Beberapa Pola dengan Operator.
tr: Operatörü ile Çoklu Desenler
zh_cn: 使用 {} 运算符的多重模式
