Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: This definition implies that a package might contain other packages, with a corresponding _Scarb.toml_ file for each package.
es: Esta definición implica que un paquete puede contener otros paquetes, con un archivo _Scarb.toml_ correspondiente para cada paquete.
fr: Cette définition implique qu'un paquet peut contenir d'autres paquets, avec un fichier _Scarb.toml_ correspondant pour chaque paquet.
id: Definisi ini menyiratkan bahwa paket mungkin berisi paket lain, dengan berkas _Scarb.toml_ yang sesuai untuk setiap paket.
tr: Bu tanım, bir paketin her paket için karşılık gelen bir _Scarb.toml_ dosyası içeren başka paketler içerebileceğini ima eder.
zh_cn: 这一定义意味着包件可能包含其他包件,每个包件都有相应的_Scarb.toml_文件。

source: Creating a Package with Scarb
es: Crear un paquete con Scarb
fr: Création d'un paquet avec Scarb
id: Membuat Paket dengan Scarb
tr: Scarb ile Paket Oluşturma
zh_cn: 创建带有疤疤的软件包

source: You can create a new Cairo package using the Scarb command-line tool. To create a new package, run the following command:
es: Puede crear un nuevo paquete El Cairo usando la herramienta de línea de comandos Scarb. Para crear un nuevo paquete, ejecute el siguiente comando:
fr: Vous pouvez créer un nouveau paquet Cairo à l'aide de la ligne de commande Scarb. Pour créer un nouveau paquet, lancez la commande suivante :
id: Anda dapat membuat paket baru Kairo menggunakan alat baris perintah Scarb. Untuk membuat paket baru, jalankan perintah berikut:
tr: Scarb komut satırı aracını kullanarak yeni bir Kahire paketi oluşturabilirsiniz. Yeni bir paket oluşturmak için aşağıdaki komutu çalıştırın:
zh_cn: 您可以使用 Scarb 命令行工具创建一个新的开罗软件包。要创建新软件包,请运行以下命令:

source: This command will generate a new package directory named _my_package_ with the following structure:
es: Este comando generará un nuevo directorio de paquetes llamado _my_package_ con la siguiente estructura:
fr: Cette commande générera un nouveau répertoire de paquets nommé _my_package_ avec la structure suivante :
id: Perintah ini akan membuat direktori paket baru bernama _my_package_ dengan struktur berikut:
tr: Bu komut, aşağıdaki yapıya sahip _my_package_ adında yeni bir paket dizini oluşturacaktır:
zh_cn: 此命令将产生名为_my_ package_的新软件包目录, 其结构如下:

source: _src/_ is the main directory where all the Cairo source files for the package will be stored.
es: _src/_ es el directorio principal donde se almacenarán todos los archivos de origen de El Cairo para el paquete.
fr: _src/_ est le répertoire principal où tous les fichiers source du Caire pour le paquet seront stockés.
id: _src/_ adalah direktori utama di mana semua berkas sumber Kairo untuk paket tersebut akan disimpan.
tr: _src/_, paket için tüm Kahire kaynak dosyalarının saklanacağı ana dizindir.
zh_cn: _src/_是存储软件包所有开罗源文件的主目录。

source: _lib.cairo_ is the default root module of the crate, which is also the main entry point of the package.
es: _lib.cairo_ es el módulo raíz predeterminado de la caja, que es también el punto de entrada principal del paquete.
fr: _lib.cairo_ est le module racine par défaut de la caisse, qui est également le point d'entrée principal du paquet.
id: _lib.cairo_ adalah modul root baku dari peti, yang juga merupakan titik masuk utama dari paket.
tr: _lib.cairo_, aynı zamanda paketin ana giriş noktası olan sandığın varsayılan kök modülüdür.
zh_cn: _lib.cairo_是箱子的默认根模块,也是软件包的主要切入点。

source: _Scarb.toml_ is the package manifest file, which contains metadata and configuration options for the package, such as dependencies, package name, version, and authors. You can find documentation about it on the [Scarb reference](https://docs.swmansion.com/scarb/docs/reference/manifest.html).
es: _Scarb.toml_ es el archivo manifiesto del paquete, que contiene metadatos y opciones de configuración para el paquete, como dependencias, nombre del paquete, versión y autores. Puede encontrar documentación al respecto en la [referencia de Scarb](https://docs.swmansion.com/scarb/docs/reference/manifest.html).
fr: _Scarb.toml_ est le fichier de manifeste de paquets, qui contient des métadonnées et des options de configuration pour le paquet, comme les dépendances, le nom du paquet, la version et les auteurs. Vous pouvez trouver la documentation à ce sujet sur le [Scarb reference](https://docs.swmansion.com/scarb/docs/reference/manifest.html).
id: _Scarb.toml_ adalah berkas manifes paket, yang berisi pilihan metadata dan konfigurasi untuk paket, seperti dependensi, nama paket, versi, dan penulis. Anda dapat menemukan dokumentasi tentang hal itu di [Scarb acuan]bah://docs.swmansion.com/scarb/docts/referensi/manast.html).
tr: _Scarb.toml_, paket için bağımlılıklar, paket adı, sürüm ve yazarlar gibi metadata ve yapılandırma seçenekleri içeren paket manifesto dosyasıdır. [Scarb referansı] (https://docs.swmansion.com/scarb/docs/reference/manifest.html) üzerinde bu konuda belge bulabilirsiniz.
zh_cn: _Scarb.toml_是包件清单文件,其中载有包件的元数据和配置选项,例如依赖关系、包件名称、版本和作者。 您可以在[Scarb 参考文献(https://docs.swmansion.com/scarb/docs/ reference/manifest.html)上找到关于它的文件。

source: ```toml [package] name = "my_package" version = "0.1.0" edition = "2023_11" [dependencies] # foo = { path = "vendor/foo" } ```
es: * Nombre del paquete = "my_package" versión = "0.1.0" edición = "2023_11" [dependencias] # foo = { path = "vendor/foo" }
fr: ```toml [package] name = "my_package" version = "0.1.0" édition = "2023_11" [dependances] # foo = { chemin = "vendor/foo" } ``
id: "My_package" versi = "0.1.0" edisi = "2023_11" [ketergantungan] # foo = { path = "vendor/foo" }
tr: toml [package] name = "my_package" version = "0.1.0" edition = "2023_11" [bağımlılar] # foo = path = "vendor/foo"
zh_cn: @toml [包] 名称 = " my_package" 版本 = "0.1.0" 版本 = "2023_11" [依赖性] #foo = {路径 = "供应商/foo" } * * * = "2023_11" 版本 = "2023_11" [依赖性] # foo = { 路径 = "供应商/foo" = * * *

source: As you develop your package, you may want to organize your code into multiple Cairo source files. You can do this by creating additional _.cairo_ files within the _src_ directory or its subdirectories.
es: A medida que desarrolle su paquete, es posible que desee organizar su código en varios archivos de origen de El Cairo. Puede hacerlo creando archivos _.cairo_ adicionales dentro del directorio _src_ o sus subdirectorios.
fr: Au fur et à mesure que vous développez votre paquetage, vous pouvez organiser votre code en plusieurs fichiers sources du Caire. Vous pouvez le faire en créant des fichiers supplémentaires _.cairo_ dans le répertoire _src_ ou ses sous-répertoires.
id: Ketika Anda mengembangkan paket Anda, Anda mungkin ingin mengatur kode Anda ke dalam beberapa berkas sumber Kairo. Anda dapat melakukan ini dengan membuat _.cairo_ berkas tambahan dalam direktori _src_ atau subdirektorinya.
tr: Paketinizi geliştirirken, kodunuzu birden fazla Kahire kaynak dosyasına düzenlemek isteyebilirsiniz. Bunu _src_ dizini veya alt dizinleri içinde ek _.cairo_ dosyaları oluşturarak yapabilirsiniz.
zh_cn: 开发您的软件包时, 您可能想要将您的代码组织成多个开罗源文件。 您可以在 _ src_ 目录或其子目录中创建额外的 _. cairo_ 文件, 从而做到这一点 。

source: {{#quiz ../quizzes/ch07-01-packages-crates.toml}}
es: quiz../quizzes/ch07-01-paquetes-crates.toml
fr: {{#quiz../quizes/ch07-01-packages-crates.toml}}
zh_cn: / quizzes/ch07-01-packages-crates.toml

source: In this section, we’ll talk about modules and other parts of the module system, namely _paths_ that allow you to name items and the `use` keyword that brings a path into scope.
es: En esta sección, vamos a hablar de módulos y otras partes del sistema de módulos, a saber _paths_ que le permiten nombrar elementos y la palabra clave `use` que trae una ruta en el alcance.
fr: Dans cette section, nous allons parler de modules et d'autres parties du système de modules, à savoir _paths_ qui vous permettent de nommer des éléments et le mot-clé `use` qui apporte un chemin dans la portée.
id: Di bagian ini, kita akan berbicara tentang modul dan bagian lain dari sistem modul, yaitu _paths_ yang memungkinkan Anda untuk menamai item dan kata kunci yang membawa jalur ke ruang lingkup.
tr: Bu bölümde, modüller ve modül sisteminin diğer parçaları hakkında, öğeleri adlandırmanıza izin veren _paths_ ve kapsam içine bir yol getiren use anahtar kelimesi hakkında konuşacağız.
zh_cn: 在本节中,我们将讨论模块和模块系统的其他部分,即_paths_,使您能够命名项目和“使用”关键字,从而将路径带入范围。

source: First, we’re going to start with a list of rules for easy reference when you’re organizing your code in the future. Then we’ll explain each of the rules in detail.
es: En primer lugar, vamos a empezar con una lista de reglas para una fácil referencia cuando usted está organizando su código en el futuro. A continuación, vamos a explicar cada una de las reglas en detalle.
fr: Tout d'abord, nous allons commencer par une liste de règles pour une référence facile lorsque vous organiserez votre code à l'avenir. Ensuite, nous allons expliquer chacune des règles en détail.
id: Pertama, kita akan mulai dengan daftar aturan untuk referensi mudah ketika Anda menyusun kode Anda di masa depan.
tr: İlk olarak, gelecekte kodunuzu düzenlerken kolay referans için bir kurallar listesi ile başlayacağız. Daha sonra kuralların her birini ayrıntılı olarak açıklayacağız.
zh_cn: 首先,我们将从一个规则清单开始,以方便参考。 当你组织未来的代码时。 然后我们将详细解释其中的每一项规则。

source: Modules Cheat Sheet
es: Módulos Hoja de engaño
fr: Modules Feuille de chaleur
id: Modul Menyontek Lembaran
tr: Modüller Hile Sayfası
zh_cn: 模块热制表

source: Here we provide a quick reference on how modules, paths and the `use` keyword work in the compiler, and how most developers organize their code. We’ll be going through examples of each of these rules throughout this chapter, but this is a great place to refer to as a reminder of how modules work. You can create a new Scarb project with `scarb new backyard` to follow along.
es: Aquí proporcionamos una referencia rápida sobre cómo funcionan los módulos, rutas y la palabra clave `use` en el compilador, y cómo la mayoría de los desarrolladores organizan su código. Vamos a ir a través de ejemplos de cada una de estas reglas a lo largo de este capítulo, pero este es un gran lugar para referirse como un recordatorio de cómo funcionan los módulos.
fr: Ici, nous fournissons une référence rapide sur la façon dont les modules, les chemins et le mot-clé `use` fonctionnent dans le compilateur, et comment la plupart des développeurs organisent leur code. Nous allons passer par des exemples de chacune de ces règles tout au long de ce chapitre, mais c'est un endroit idéal pour désigner comme un rappel du fonctionnement des modules. Vous pouvez créer un nouveau projet Scarb avec `scarb new backyard` à suivre.
id: Di sini kita memberikan referensi singkat tentang bagaimana modul, jalur, dan kata kunci yang digunakan dalam kompiler, dan bagaimana kebanyakan pengembang mengatur kode mereka. kita akan melalui contoh-contoh dari setiap aturan ini di seluruh bab ini, tapi ini adalah tempat yang bagus untuk mengacu sebagai pengingat bagaimana modul bekerja. Anda dapat membuat proyek Scarb baru dengan halaman belakang OCARB baru untuk diikuti.
tr: Burada modüllerin, yolların ve use anahtar kelimesinin derleyicide nasıl çalıştığına ve çoğu geliştiricinin kodlarını nasıl düzenlediğine dair hızlı bir referans sunuyoruz. Bu bölüm boyunca bu kuralların her birinin örneklerinden geçiyor olacağız, ancak burası modüllerin nasıl çalıştığının bir hatırlatıcısı olarak başvurmak için harika bir yerdir. Takip etmek için scarb yeni arka bahçe ile yeni bir Scarb projesi oluşturabilirsiniz.
zh_cn: 在此, 我们快速引用模块、 路径和“ 使用” 关键字在汇编器中是如何工作的, 以及大多数开发者是如何组织代码的。 我们将在本章整个章节中尝试其中每一条规则的例子, 但这是一个很好的地方, 可以用来提醒模块是如何运作的。 您可以创建一个新的“ 剪切新后院” 的疤痕项目 。

source: **Start from the crate root**: When compiling a crate, the compiler first looks in the crate root file (_src/lib.cairo_) for code to compile.
es: **Comience desde la raíz de caja**: Al compilar una caja, el compilador busca por primera vez en el archivo raíz de caja (_src/lib.cairo_) el código a compilar.
fr: **Démarrer à partir de la racine de caisse**: Lors de la compilation d'une caisse, le compilateur regarde d'abord dans le fichier racine de caisse (_src/lib.cairo_) pour que le code compile.
id: ** Mulai dari root** peti: Ketika menyusun peti, kompiler pertama kali terlihat dalam berkas root peti (_src/lib.cairo_) untuk mengkompilasi kode.
tr: ** Sandık kökünden başla **: Bir sandık derlerken derleyici önce kodun derlenmesi için sandık kök dosyasına (_src/lib.cairo_) bakar.
zh_cn: ** 从箱根开始**:在编集箱时,编译者首先查看箱根文件(_src/lib.cairo_),以编译代码。

source: **Declaring modules**: In the crate root file, you can declare new modules; say, you declare a “garden” module with `mod garden;`. The compiler will look for the module’s code in these places:
es: **Modulos de declaración**: En el archivo raíz de caja, puede declarar nuevos módulos; por ejemplo, se declara un módulo “jardín” con `mod garden;`. El compilador buscará el código del módulo en estos lugares:
fr: **Modèles de déclaration**: Dans le fichier racine de caisse, vous pouvez déclarer de nouveaux modules; par exemple, vous déclarez un module "Jardin de mode" avec `mod book;`. Le compilateur cherchera le code du module dans ces endroits:
id: ** Menurunkan moduls**: Dalam berkas root peti, anda dapat menyatakan modul baru; katakanlah, anda menyatakan modul ·gartená dengan åmod garden;ltu kompiler akan mencari kode modul (mod) di tempat-tempat ini:
tr: **Declaring modes**: Sandık kök dosyasında yeni modüller beyan edebilirsiniz; örneğin, mod garden; ile bir "bahçe" modülü beyan edersiniz. Derleyici modülün kodunu şu yerlerde arayacaktır:
zh_cn: ** 宣告模块**:在箱根文件中,您可以宣布新的模块;比如,您可以宣布一个“花园”模块,配有“花园模式”;`。汇编者将在这些地方查找模块代码:

source: Inline, within curly brackets that replace the semicolon following `mod garden`.
es: En línea, entre corchetes rizados que sustituyen al punto y coma después de `mod garden`.
fr: En ligne, à l'intérieur des crochets qui remplacent le point-virgule après le mot «mode jardin».
id: Inline, dalam tanda kurung keriting yang menggantikan semikolon berikut taman åmod.
tr: Inline, mod garden'i takip eden virgülün yerini alan kıvırcık parantez içinde.
zh_cn: 内括号内,以 " 模式花园 " 之后的分号取代分号。

source: // crate root file (src/lib.cairo)
es: // registrar archivo raíz (src/lib.cairo)
fr: // fichier racine de caisse (src/lib.cairo)
id: //frat root file (src/lib.cairo)
tr: // kasa kök dosyası (src/lib.cairo)
zh_cn: / 箱根文件 (src/lib.cairo)

source: // code defining the garden module goes here
es: // código que define el módulo de jardín va aquí
fr: // code définissant le module jardin va ici
id: //kode mendefinisikan modul kebun di sini
tr: // bahçe modülünü tanımlayan kod buraya gider
zh_cn: 定义花园模块的代码在这里

source: In the file _src/garden.cairo_.
es: En el archivo _src/garden.cairo_.
fr: Dans le fichier _src/garden.cairo_.
id: Dalam file _src/garden.cairo_.
tr: _src/garden.cairo_ dosyasında.
zh_cn: 在文件_src/garden.cairo_中。

source: **Declaring submodules**: In any file other than the crate root, you can declare submodules. For example, you might declare `mod vegetables;` in _src/garden.cairo_. The compiler will look for the submodule’s code within the directory named for the parent module in these places:
es: **Declarando submódulos**: En cualquier archivo que no sea la raíz de caja, puede declarar submódulos. Por ejemplo, puede declarar `mod verduras;` en _src/garden.cairo_. El compilador buscará el código del submódulo dentro del directorio nombrado para el módulo padre en estos lugares:
fr: **Déclarer les sous-modules**: Dans n'importe quel fichier autre que la racine de caisse, vous pouvez déclarer les sous-modules. Par exemple, vous pouvez déclarer `mod légumes;` dans _src/garden.cairo_. Le compilateur cherchera le code des sous-modules dans le répertoire nommé pour le module parent dans ces endroits:
id: **Declaring submodules**: Dalam berkas apapun selain akar peti, Anda dapat mendeklarasikan submodules. Sebagai contoh, Anda dapat mendeklarasikan sayur-sayuran ▪ di _src/garden.cairo_. compiler akan mencari kode submoduel dalam direktori yang bernama untuk modul induk di tempat-tempat ini:
tr: ** Alt modüller **: Sandık kökünden başka herhangi bir dosyada alt modüller beyan edebilirsiniz. Örneğin, mod sebzeleri; _src/garden.cairo_ içinde beyan edebilirsiniz. Derleyici, alt modülün kodunu bu yerlerde ana modül için adlandırılmış dizin içinde arayacaktır:
zh_cn: ** 定义子模块**:在除箱根以外的任何文件中,您都可以申报子模块。例如,您可以在 _src/garden.cairo_中声明“现代蔬菜 ” 。汇编器将在这些地方指定父模块的目录中查找子模块的代码 :

source: Inline, directly following `mod vegetables`, within curly brackets instead of the semicolon.
es: En línea, siguiendo directamente las `verduras de moho`, entre corchetes rizados en lugar del punto y coma.
fr: En ligne, en suivant directement `mod légumes`, entre crochets à la place du point-virgule.
id: Inline, langsung mengikuti sayuran ltumod, dalam kurung keriting bukan semikolon.
tr: Sıralı, doğrudan takip eden mod sebzeler, virgül yerine kıvırcık parantez içinde.
zh_cn: 内括号内,直接附在`现代蔬菜'之后,放在卷括号内,而不是分号内。

source: // src/garden.cairo file
fr: // src/garden.cairo fichier
tr: // src/garden.cairo dosyası
zh_cn: / scrc/garden.cairo文件

source: // code defining the vegetables submodule goes here
es: // código que define el submódulo de verduras va aquí
fr: // code définissant le sous-module des légumes va ici
id: //kode mendefinisikan submodul sayuran di sini
tr: // sebze alt modülünü tanımlayan kod buraya gider
zh_cn: 给蔬菜子模块下定义的代码就在这里

source: In the file _src/garden/vegetables.cairo_.
es: En el archivo _src/garden/vegetables.cairo_.
fr: Dans le fichier _src/garden/vegetables.cairo_.
id: Dalam file _src/garden/vegetables.cairo_.
tr: _src/garden/vegetables.cairo_ dosyasında.
zh_cn: 文件_src/garden/vegetables.cairo_。

source: **Paths to code in modules**: Once a module is part of your crate, you can refer to code in that module from anywhere else in that same crate, using the path to the code. For example, an `Asparagus` type in the `vegetables` submodule would be found at `backyard::garden::vegetables::Asparagus`.
es: ** Rutas para codificar en módulos**: Una vez que un módulo es parte de su caja, puede referirse al código de ese módulo desde cualquier otro lugar de la misma caja, utilizando la ruta al código. Por ejemplo, un tipo `Asparagus` en el submódulo `Vegetables` se encuentra en `patio trasero::garden::vegetables::Asparagus`.
fr: **Paths to code in modules**: Une fois qu'un module fait partie de votre caisse, vous pouvez vous référer au code dans ce module à partir de n'importe où dans la même caisse, en utilisant le chemin vers le code. Par exemple, un type `Asparagus` dans le sous-module `vegetables` serait trouvé à `backyard::garden::vegetables::Asparagus`.
id: **Paths to code in modules**: Sekali sebuah modul adalah bagian dari peti Anda, Anda dapat mengacu pada kode dalam modul tersebut dari mana saja dalam peti yang sama, menggunakan jalur ke kode. Sebagai contoh, sebuah tipe ▪Asparagus dalam submodule ▪ akan ditemukan di ▪backyard:garden::veables: Asparagus.
tr: ** Modüllerde kodlanacak yollar**: Bir modül sandığınızın bir parçası olduğunda, koda giden yolu kullanarak, o modüldeki kodu aynı sandıktaki herhangi bir yerden belirtebilirsiniz. Örneğin, gettables alt modülündeki bir Asparagus tipi backyard:: garden:::gettables:Asparagus adresinde bulunur.
zh_cn: ** 模块中的代码**:一旦模块是您箱中的一部分,您可以使用代码路径从同一箱中其他任何地方引用该模块中的代码。例如,在“蔬菜”子模块中的“Asparagus”类型将在“后院:园艺:蔬菜:Asparagus”中找到。

source: **Private vs public**: Code within a module is private from its parent modules by default. This means that it may only be accessed by the current module and its descendants. To make a module public, declare it with `pub mod` instead of `mod`. To make items within a public module public as well, use `pub` before their declarations. Cairo also provides the `pub(crate)` keyword, allowing an item or module to be only visible within the crate in which the definition is included.
es: **Privado vs público**: El código dentro de un módulo es privado de sus módulos matrices por defecto, lo que significa que sólo puede ser accedido por el módulo actual y sus descendientes. Para hacer público un módulo, declarándolo con `pub mod` en lugar de `mod`. Para hacer público también los elementos dentro de un módulo público, utilice `pub` antes de sus declaraciones. El Cairo también proporciona la palabra clave `pub(crate)`, permitiendo que un artículo o módulo sea sólo visible dentro de la caja en la que se incluye la definición.
fr: **Private vs public**: Le code dans un module est privé à partir de ses modules parent par défaut, ce qui signifie qu'il ne peut être consulté que par le module actuel et ses descendants. Pour rendre un module public, déclarez-le avec `pub mod` au lieu de `mod`. Pour rendre les éléments d'un module public aussi bien, utilisez `pub` avant leurs déclarations. Le Caire fournit également le mot-clé `pub(crate)`, permettant qu'un élément ou un module ne soit visible que dans la caisse dans laquelle la définition est incluse.
id: *Private vs public**: Kode dalam sebuah modul adalah privat dari modul induk secara baku. Ini berarti bahwa ia hanya dapat diakses oleh modul saat ini dan keturunannya. Untuk membuat modul publik, menyatakannya dengan modul modul modul Épub modåmod. Untuk membuat barang-barang dalam modul publik juga, gunakan åpubå sebelum deklarasi mereka. Kairo juga menyediakan kata kunci Ápubauxrate), mengijinkan sebuah item atau modul hanya terlihat dalam definisi tersebut.
tr: ** Kamuya karşı özel**: Bir modül içindeki kod varsayılan olarak ana modüllerinden özeldir. Bu, yalnızca mevcut modül ve onun soyundan gelenler tarafından erişilebileceği anlamına gelir. Bir modülü kamuya açık hale getirmek için, mod yerine pub mod ile ilan edin. Kamuya açık bir modül içindeki öğeleri kamuya açık hale getirmek için, beyanlarından önce pub kullanın. Kahire ayrıca, yalnızca sandık içinde bir öğe veya modüle izin veren pub(krate) anahtar kelimesini de sağlar.
zh_cn: ** 私人对公共**:一个模块内的代码默认是其母模块的私有代码,这意味着只有当前模块及其后代才能访问该模块。要公开模块,以`pub mod'而不是`mod'宣布该模块。要公开公共模块内的项目,在发布之前也使用`pub'。开罗还提供了“pub(crate)”关键词,允许某个项目或模块仅在包含定义的箱子内可见。
