Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Using `start_cheat_caller_address`, we call the `change_owner` function first as the owner, and then as a different address. We assert that the operation fails when the caller is not the owner, and that the owner is updated when the caller is the owner.
es: Utilizando `start_cheat_caller_address`, llamamos a la función `change_owner` primero como el propietario, y luego como una dirección diferente. Afirmamos que la operación falla cuando el llamante no es el propietario, y que el propietario se actualiza cuando el llamante es el propietario.
fr: En utilisant `start_cheat_caller_address`, nous appelons la fonction `change_owner` d'abord comme propriétaire, puis comme adresse différente. Nous affirmons que l'opération échoue lorsque l'appelant n'est pas le propriétaire, et que le propriétaire est mis à jour lorsque l'appelant est le propriétaire.
id: Pertama-tama kami menggunakan fungsi 'change' sebagai pemilik, lalu sebagai alamat yang berbeda. kami menegaskan bahwa operasi gagal ketika penelepon bukanlah pemiliknya, dan pemiliknya diperbarui ketika si penelepon adalah pemiliknya.
tr: start_cheat_caller_address kullanarak, change_owner fonksiyonunu önce sahip olarak, daha sonra da farklı bir adres olarak adlandırıyoruz. Arayan kişi sahip olmadığında işlemin başarısız olduğunu ve arayanın sahip olduğunda sahibinin güncellendiğini iddia ediyoruz.
zh_cn: 使用“start_chead_caller_address”,我们首先将“change_所有者”的功能称为拥有者,然后将它称为不同的地址。我们声称,如果调用者不是拥有者,操作就会失败,如果调用者是拥有者,则会更新所有者。

source: Capturing Events with `spy_events`
es: Capturar eventos con `spy_events`
fr: Capturer des événements avec `spy_events`
id: Menangkap Events dengan åspy_events
tr: spy_events ile Olayları Yakalamak
zh_cn: 以`spy_events' 拍摄事件

source: When a pizza is created, the contract emits an event. To test this, we can use the `spy_events` function to capture the emitted events and assert that the event was emitted with the expected parameters. Naturally, we can also assert that the pizza count was incremented, and that only the owner can make a pizza.
es: Cuando se crea una pizza, el contrato emite un evento. Para probar esto, podemos usar la función `spy_events` para capturar los eventos emitidos y afirmar que el evento fue emitido con los parámetros esperados. Naturalmente, también podemos afirmar que el conteo de pizzas fue incrementado, y que sólo el propietario puede hacer una pizza.
fr: Quand une pizza est créée, le contrat émet un événement. Pour tester cela, nous pouvons utiliser la fonction `spy_events` pour capturer les événements émis et affirmer que l'événement a été émis avec les paramètres attendus. Naturellement, nous pouvons également affirmer que le nombre de pizzas a été incrémenté, et que seul le propriétaire peut faire une pizza.
id: Ketika pizza dibuat, kontrak memancarkan sebuah kejadian. untuk menguji hal ini, kita dapat menggunakan fungsi Áspy_events_eventsá untuk menangkap emited events dan menegaskan bahwa peristiwa itu dipancarkan dengan parameter yang diharapkan. tentu saja, kita juga dapat menegaskan bahwa jumlah pizza meningkat, dan bahwa hanya pemilik dapat membuat pizza.
tr: Bir pizza oluşturulduğunda, sözleşme bir etkinlik yayar. Bunu test etmek için, yayılan olayları yakalamak ve olayın beklenen parametrelerle yayıldığını iddia etmek için spy_events işlevini kullanabiliriz. Doğal olarak, pizza sayısının arttığını ve sadece sahibinin pizza yapabileceğini de iddia edebiliriz.
zh_cn: 创建比萨饼时, 合同会发出事件。 为了测试这一点, 我们可以使用“ spy_ events” 功能来捕捉排放的事件, 并声明事件是用预期参数排放的。 当然, 我们还可以断言比萨饼的计数是增加的, 只有拥有者才能做比萨饼 。

source: <span class="caption">Listing 17-5: Testing the events emitted when a pizza is created</span>
es: <span class="caption">Lista 17-5: Probando los eventos emitidos cuando se crea una pizza</span>
fr: <span class="caption">Liste 17-5: Test des événements émis lors de la création d'une pizza</span>
id: <span class="caption">Listing 17-5: Menguji kejadian yang dipancarkan ketika pizza dibuat</span>
tr: span class="caption">Liste 17-5: Bir pizza oluşturulduğunda yayılan olayları test etmek/span>
zh_cn: <span class="caption" > listing 17-5: 测试披萨创建时所排放的事件 </span>

source: Accessing Internal Functions with `contract_state_for_testing`
es: Acceso a funciones internas con `contract_state_for_testing`
fr: Accès aux fonctions internes avec `contract_state_for_testing`
id: Mengakses Internal functions with æcontract_state_for_testing
tr: contract_state_for_testing ile İç Fonksiyonlara Erişim
zh_cn: 使用`contract_state_ for_测试' 访问内部函数

source: All the tests we have seen so far have been using a workflow that involves deploying the contract and interacting with the contract's entrypoints. However, sometimes we may want to test the internals of the contract directly, without deploying the contract. How could this be done, if we were reasoning in purely Cairo terms?
es: Todas las pruebas que hemos visto hasta ahora han estado utilizando un flujo de trabajo que implica desplegar el contrato e interactuar con los puntos de entrada del contrato. Sin embargo, a veces podemos querer probar los internos del contrato directamente, sin desplegar el contrato. ¿Cómo se podría hacer esto, si estábamos razonando en términos puramente de El Cairo?
fr: Tous les tests que nous avons vus jusqu'à présent ont été l'utilisation d'un workflow qui implique le déploiement du contrat et interagir avec les points d'entrée du contrat. Cependant, parfois, nous pouvons vouloir tester les internes du contrat directement, sans déployer le contrat.
id: Semua tes yang telah kita lihat sejauh ini telah menggunakan alur kerja yang melibatkan penyebaran kontrak dan berinteraksi dengan titik-titik masuk kontrak. namun, kadang-kadang kita mungkin ingin menguji internal kontrak secara langsung, tanpa menyebarkan kontrak.
tr: Şimdiye kadar gördüğümüz tüm testler, sözleşmeyi dağıtmayı ve sözleşmenin giriş noktalarıyla etkileşime girmeyi içeren bir iş akışı kullanıyor. Ancak, bazen sözleşmenin iç kısımlarını doğrudan, sözleşmeyi dağıtmadan test etmek isteyebiliriz. Bu, tamamen Kahire terimleriyle akıl yürütmemiz durumunda nasıl yapılabilirdi?
zh_cn: 迄今为止,我们所看到的所有测试都使用了一个工作流程,涉及部署合同和与合同的切入点互动。 但是,有时我们可能想直接测试合同的内部,而不必部署合同。 如果我们纯粹是开罗条款的推理,我们如何做到这一点呢?

source: Recall the struct `ContractState`, which is used as a parameter to all the entrypoints of a contract. To make it short, this struct contains zero-sized fields, corresponding to the storage variables of the contract. The only purpose of these fields is to allow the Cairo compiler to generate the correct code for accessing the storage variables. If we could create an instance of this struct, we could access these storage variables directly, without deploying the contract...
es: Recuerde la estructura `Contract State`, que se utiliza como parámetro para todos los puntos de entrada de un contrato. Para abreviar, esta estructura contiene campos de tamaño cero, correspondientes a las variables de almacenamiento del contrato. El único propósito de estos campos es permitir que el compilador de El Cairo genere el código correcto para acceder a las variables de almacenamiento. Si pudiéramos crear una instancia de esta estructura, podríamos acceder a estas variables de almacenamiento directamente, sin desplegar el contrato...
fr: Rappelons le struct `ContractState`, qui est utilisé comme paramètre pour tous les points d'entrée d'un contrat. Pour le rendre court, cette struct contient des champs de taille zéro, correspondant aux variables de stockage du contrat. Le seul but de ces champs est de permettre au compilateur du Caire de générer le code correct pour accéder aux variables de stockage. Si nous pouvions créer une instance de cette struct, nous pourrions accéder à ces variables de stockage directement, sans déployer le contrat...
id: Ingat struct ·ContractState, yang digunakan sebagai parameter untuk semua titik masuk sebuah kontrak. Untuk membuatnya pendek, struktur ini berisi daerah berukuran nol, sesuai dengan variabel penyimpanan dari kontrak. Satu-satunya tujuan dari bidang ini adalah untuk memungkinkan kompiler Kairo untuk menghasilkan kode yang benar untuk mengakses variabel penyimpanan. Jika kita bisa membuat contoh dari struktur ini, kita bisa mengakses variabel penyimpanan ini secara langsung, tanpa menyebarkan kontrak...
tr: Bir sözleşmenin tüm giriş noktalarına parametre olarak kullanılan ContractState yapısını hatırlayın. Kısa yapmak için, bu yapı, sözleşmenin depolama değişkenlerine karşılık gelen sıfır boyutlu alanlar içerir. Bu alanların tek amacı, Kahire derleyicisinin depolama değişkenlerine erişmek için doğru kodu oluşturmasına izin vermektir. Bu yapı örneğini oluşturabilirsek, bu depolama değişkenlerine doğrudan dağıtım yapmadan erişebiliriz...
zh_cn: 回顾作为合同所有切入点参数的“合同国”结构。为了缩短这一结构,它包含与合同储存变量相对应的零尺寸字段。这些区域的唯一目的是让开罗编译器生成正确的代码来访问存储变量。如果我们能够创建这种结构实例,我们可以直接访问这些存储变量,而不必部署合同...

source: ...and this is exactly what the `contract_state_for_testing` function does! It creates an instance of the `ContractState` struct, allowing us to call any function that takes as parameter a `ContractState` struct, without deploying the contract. To interact with the storage variables properly, we need to manually import the traits that define access to the storage variables.
es: ...y esto es exactamente lo que hace la función `contract_state_for_testing`! Crea una instancia de la estructura `ContractState`, permitiéndonos llamar a cualquier función que tome como parámetro una estructura `ContractState`, sin desplegar el contrato. Para interactuar correctamente con las variables de almacenamiento, necesitamos importar manualmente los rasgos que definen el acceso a las variables de almacenamiento.
fr: ...et c'est exactement ce que fait la fonction `contract_state_for_testing`! Elle crée une instance de la structure `ContractState`, nous permettant d'appeler n'importe quelle fonction qui prend comme paramètre une structure `ContractState`, sans déployer le contrat. Pour interagir correctement avec les variables de stockage, nous devons importer manuellement les caractères qui définissent l'accès aux variables de stockage.
id: ...dan ini persis seperti apa yang dilakukan kontract_state_for_test! Ini menciptakan sebuah contoh dari struktur kontractate, memungkinkan kita untuk memanggil setiap fungsi yang diperlukan sebagai parameter sebuah struktur contractstate, tanpa menyebarkan kontrak. Untuk berinteraksi dengan variabel penyimpanan secara benar, kita perlu mengimpor sifat-sifat yang mendefinisikan akses ke variabel penyimpanan.
tr: ... ve bu tam olarak contract_state_for_testing fonksiyonunun yaptığı şey! ContractState yapısının bir örneğini oluşturarak, sözleşmeyi dağıtmadan, parametre olarak a ContractState yapısını alan herhangi bir işlevi çağırmamızı sağlar. Depolama değişkenleriyle düzgün bir şekilde etkileşim kurmak için, depolama değişkenlerine erişimi tanımlayan özellikleri manuel olarak içe aktarmamız gerekir.
zh_cn: ......这正是` Contract_state_for_test' 函数的作用!它创造了一个`缔约国'结构的例子,允许我们在不部署合同的情况下,将任何功能称为`缔约国'结构的参数,为了与储存变量进行适当互动,我们需要手动输入确定存贮变量访问权限的特性。

source: <span class="caption">Listing 17-6: Unit testing our contract without deployment</span>
es: <span class="caption">Lista 17-6: Unidad probando nuestro contrato sin despliegue</span>
fr: <span class="caption">Liste 17-6: Unité testant notre contrat sans déploiement</span>
id: <span class="caption">Listing 17-6: Unit pengujian kontrak kita tanpa penyebaran</span>
tr: span class="caption">Liste 17-6: Sözleşmemizi konuşlandırmadan test eden birim/span>
zh_cn: <span class="caption" > listing 17-6:在不部署情况下测试我们合同的单位 </span>

source: These imports give us access to our internal functions (notably, `set_owner`), as well as the read/write access to the `owner` storage variable. Once we have these, we can interact with the contract directly, changing the address of the owner by calling the `set_owner` method, accessible through `InternalTrait`, and reading the `owner` storage variable.
es: Estas importaciones nos dan acceso a nuestras funciones internas (en particular, `set_owner`), así como al acceso de lectura/escritura a la variable de almacenamiento `owner`. Una vez que las tenemos, podemos interactuar directamente con el contrato, cambiando la dirección del propietario llamando al método `set_owner`, accesible a través de `InternalTrait`, y leyendo la variable de almacenamiento `owner`.
fr: Ces importations nous donnent accès à nos fonctions internes (notamment `set_owner`), ainsi qu`à l`accès lecture/écriture à la variable de stockage `owner`. Une fois que nous les avons, nous pouvons interagir directement avec le contrat, changer l`adresse du propriétaire en appelant la méthode `set_owner`, accessible par `InternalTrait`, et en lisant la variable de stockage `owner`.
id: Impor ini memberi kita akses ke fungsi internal kita (terutama, setting_owner), serta akses baca/tulis ke variabel penyimpanan ▪ Pemiliknya.
tr: Bu ithalat bize dahili fonksiyonlarımıza (özellikle set_owner) ve owner depolama değişkenine okuma/yazma erişimine erişim sağlar. Bunlara sahip olduktan sonra, set_owner metodunu arayarak, InternalTrait aracılığıyla erişilebilen ve owner depolama değişkenini okuyarak, doğrudan sözleşme ile etkileşime geçebiliriz.
zh_cn: 这些进口使我们有机会使用我们的内部功能(特别是`set_所有人'),以及读/写查阅`所有者'储存变量,一旦有了这些变量,我们可以直接与合同互动,改变所有者地址,称为`set_所有人'方法,可通过`InternalTrait'进入,并阅读`所有者'储存变量。

source: Note: Both approaches cannot be used at the same time. If you decide to deploy the contract, you interact with it using the dispatcher. If you decide to test the internal functions, you interact with the `ContractState` object directly.
es: Nota: Ambos enfoques no se pueden usar al mismo tiempo. Si decide implementar el contrato, interactúa con él usando el despachador. Si decide probar las funciones internas, interactúa directamente con el objeto `Contract State`.
fr: Remarque: Les deux approches ne peuvent pas être utilisées en même temps. Si vous décidez de déployer le contrat, vous interagissez avec lui en utilisant le répartiteur. Si vous décidez de tester les fonctions internes, vous interagissez directement avec l'objet `ContractState`.
id: Catatan: Kedua pendekatan tidak dapat digunakan pada saat yang sama. Jika Anda memutuskan untuk menyebarkan kontrak, Anda berinteraksi dengannya dengan menggunakan operator. jika Anda memutuskan untuk menguji fungsi internal, Anda berinteraksi dengan objek Contractate secara langsung.
tr: Not: Her iki yaklaşım da aynı anda kullanılamaz. Sözleşmeyi dağıtmaya karar verirseniz, göndericiyi kullanarak onunla etkileşimde bulunursunuz. İç fonksiyonları test etmeye karar verirseniz, doğrudan ContractState nesnesi ile etkileşimde bulunursunuz.
zh_cn: 注:两种方法不能同时使用。如果决定部署合同,使用调度员与合同互动。如果决定测试内部功能,直接与`缔约国'对象互动。

source: The output of the tests shows that all the tests passed successfully, along with an estimation of the gas consumed by each test.
es: La salida de las pruebas muestra que todas las pruebas pasaron con éxito, junto con una estimación del gas consumido por cada prueba.
fr: La sortie des essais montre que tous les essais ont été réussis, ainsi qu'une estimation du gaz consommé par chaque essai.
id: Hasil tes menunjukkan bahwa semua tes berhasil, bersama dengan estimasi gas yang dikonsumsi oleh setiap tes.
tr: Testlerin çıktısı, tüm testlerin, her test tarafından tüketilen gazın bir tahmini ile birlikte başarıyla geçtiğini göstermektedir.
zh_cn: 测试结果显示,所有测试都成功通过,同时对每次测试所消耗的气体进行了估计。

source: In this chapter, we learned how to test smart contracts using Starknet Foundry. We demonstrated how to deploy a contract and interact with it using the dispatcher. We also showed how to test the contract's behavior by mocking the caller address and capturing events. Finally, we demonstrated how to test the internal functions of the contract directly, without deploying the contract.
es: En este capítulo, aprendimos a probar contratos inteligentes usando Starknet Foundry. Demostramos cómo implementar un contrato e interactuar con él usando el despachador. También demostramos cómo probar el comportamiento del contrato burlándonos de la dirección del llamante y capturando eventos. Finalmente, demostramos cómo probar las funciones internas del contrato directamente, sin implementar el contrato.
fr: Dans ce chapitre, nous avons appris à tester les contrats intelligents en utilisant Starknet Foundry. Nous avons démontré comment déployer un contrat et interagir avec lui en utilisant le répartiteur. Nous avons également montré comment tester le comportement du contrat en se moquant de l'adresse de l'appelant et en capturant les événements. Enfin, nous avons démontré comment tester les fonctions internes du contrat directement, sans déployer le contrat.
id: kami belajar bagaimana menguji kontrak cerdas menggunakan Starknet Foundry kami menunjukkan bagaimana menyebarkan kontrak dan berinteraksi dengannya menggunakan operator kami juga menunjukkan bagaimana menguji perilaku kontrak dengan mengejek alamat pemanggil dan menangkap kejadian akhirnya, kami menunjukkan bagaimana menguji fungsi internal kontrak secara langsung, tanpa menyebarkan kontrak.
tr: Bu bölümde Starknet Foundry kullanarak akıllı sözleşmelerin nasıl test edileceğini öğrendik. Bir sözleşmenin nasıl dağıtılacağını ve göndericiyi kullanarak nasıl etkileşimde bulunacağını gösterdik. Ayrıca, arayan adresiyle alay ederek ve olayları yakalayarak sözleşmenin davranışını nasıl test edeceğimizi gösterdik. Son olarak, sözleşmeyi dağıtmadan sözleşmenin iç işlevlerini doğrudan nasıl test edeceğimizi gösterdik.
zh_cn: 在本章中,我们学会了如何使用斯塔克内特基金会测试智能合同。我们演示了如何部署合同,并利用调度员与合同互动。我们还演示了如何通过嘲笑电话地址和捕捉事件来测试合同行为。最后,我们演示了如何直接测试合同的内部功能,而没有部署合同。

source: To learn more about Starknet Foundry, refer to the [Starknet Foundry documentation](https://foundry-rs.github.io/starknet-foundry/index.html).
es: Para obtener más información sobre Starknet Foundry, consulte la [Documentación de Starknet Foundry] (https://foundry-rs.github.io/starknet-foundry/index.html).
fr: Pour en savoir plus sur Starknet Foundry, consultez la [document Starknet Foundry] (https://foundry-rs.github.io/starknet-Foundry/index.html).
id: Untuk mengetahui lebih banyak tentang Starknet Foundry, merujuk ke [Refoundry Starknet][Index.https://foundry-rs.github.io/starknet-foundry/index.html).
tr: Starknet Foundry hakkında daha fazla bilgi edinmek için [Starknet Foundry documentation](https://foundry-rs.github.io/starknet-foundry/index.html) adresine bakın.
zh_cn: 欲了解关于斯塔克内特基金会的更多情况,请查阅[斯塔克内特基金会的文件](https://foundry-rs.github.io/starknet-foundry/index.html)。

source: Static analysis refers to the process of examining code without its execution, focusing on its structure, syntax, and properties. It involves analyzing the source code to identify potential issues, vulnerabilities, or violations of specified rules.
es: El análisis estático se refiere al proceso de examinar el código sin su ejecución, centrándose en su estructura, sintaxis y propiedades. Implica analizar el código fuente para identificar posibles problemas, vulnerabilidades o violaciones de reglas especificadas.
fr: L'analyse statique se réfère au processus d'examen du code sans son exécution, en se concentrant sur sa structure, sa syntaxe et ses propriétés. Il s'agit d'analyser le code source pour identifier les problèmes potentiels, les vulnérabilités ou les violations de règles spécifiées.
id: Analisis statik mengacu pada proses pemeriksaan kode tanpa eksekusinya, berfokus pada struktur, sintaks, dan propertinya. Hal ini mencakup menganalisis kode sumber untuk mengidentifikasi masalah potensial, kerentanan, atau pelanggaran aturan tertentu.
tr: Statik analiz, kodun çalıştırılmadan incelenmesi, yapısına, sözdizimine ve özelliklerine odaklanma sürecini ifade eder. Potansiyel sorunları, güvenlik açıklarını veya belirtilen kuralların ihlallerini tanımlamak için kaynak kodu analiz etmeyi içerir.
zh_cn: 静态分析是指在不执行守则的情况下审查守则的过程,重点是守则的结构、语法和财产,包括分析源代码,以查明潜在的问题、弱点或违反特定规则的情况。

source: By defining rules, such as coding conventions or security guidelines, developers can utilize static analysis tools to automatically check the code against these standards.
es: Al definir reglas, tales como convenciones de codificación o directrices de seguridad, los desarrolladores pueden utilizar herramientas de análisis estático para comprobar automáticamente el código contra estos estándares.
fr: En définissant des règles, telles que des conventions de codage ou des lignes directrices de sécurité, les développeurs peuvent utiliser des outils d'analyse statique pour vérifier automatiquement le code par rapport à ces normes.
id: Dengan mendefinisikan aturan, seperti konvensi koding atau pedoman keamanan, para pengembang dapat menggunakan alat analisis statis untuk secara otomatis memeriksa kode terhadap standar - standar ini.
tr: Kodlama sözleşmeleri veya güvenlik yönergeleri gibi kuralları tanımlayarak, geliştiriciler kodu bu standartlara göre otomatik olarak kontrol etmek için statik analiz araçlarını kullanabilirler.
zh_cn: 通过界定规则,例如编码公约或安全准则,开发者可以利用静态分析工具,自动对照这些标准检查编码。

source: Reference:
es: Referencia:
fr: Référence:
id: Referensi:
tr: Kaynakça:
zh_cn: 参考:

source: [Semgrep Cairo 1.0 support](https://semgrep.dev/blog/2023/semgrep-now-supports-cairo-1-0)
id: [Sembrep Kairo 1.0 dukungan]://semgrep.dev/blog/2023/semgrep-now-supports-cairo-1-0)
tr: [Semgrep Cairo 1.0 desteği](https://semgrep.dev/blog/2023/semgrep-now-supports-cairo-1-0)
zh_cn: [开罗1.0支持标准](http://semgrep.dev/blog/2023/semgrep-now-supports-cairo-1-0)

source: [Caracal, a Starknet static analyzer](https://github.com/crytic/caracal)
es: [Caracal, un analizador estático Starknet] (https://github.com/crytic/caracal)
fr: [Caracal, un analyseur statique Starknet] (https://github.com/crytic/caracal)
id: [Caracal, seorang ahli analisis statis Starknet] [Hhttps://github.com/crytic/caracal)
tr: [Caracal, bir Starknet statik analizörü](https://github.com/crytic/caracal)
zh_cn: [Caracal,斯塔克内特静态分析机] (https://github.com/crytic/caracal)

source: The following sections contain reference material you may find useful in your Starknet journey.
es: Las siguientes secciones contienen material de referencia que usted puede encontrar útil en su viaje Starknet.
fr: Les sections suivantes contiennent du matériel de référence que vous pouvez trouver utile dans votre voyage Starknet.
id: Bagian-bagian berikut berisi bahan referensi Anda mungkin menemukan berguna dalam perjalanan Starknet Anda.
tr: Aşağıdaki bölümler, Starknet seyahatinizde yararlı bulabileceğiniz referans materyalleri içerir.
zh_cn: 以下各节载有您在史塔克内特旅途中可能认为有用的参考材料。

source: Appendix A - System Calls
es: Apéndice A - Llamadas al sistema
fr: Annexe A - Appels système
id: Lampiran Sebuah - Sistem Memanggil
tr: Ek A - Sistem Çağrıları
zh_cn: 附录A - 系统呼叫

source: This chapter is based on the StarkNet documentation available at [StarkNet Docs](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/).
es: Este capítulo se basa en la documentación de StarkNet disponible en [StarkNet Docs](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/).
fr: Ce chapitre est basé sur la documentation de StarkNet disponible à [StarkNet Docs] (https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/).
id: Bab ini didasarkan pada dokumentasi StarkNet yang tersedia di [StarkNet Docs][Hhttps://docs.starknet.io/dokumentasi/archicture_and_concepts/Smart_Contracts/system-calls-cairo1/).
tr: Bu bölüm [StarkNet Docs] adresinde bulunan StarkNet belgelerine dayanmaktadır(https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/).
zh_cn: 本章以可在[StarkNet Docs] (https://docs.starknet.io/documentation/architecture_and_confits/Smart_contracts/system-calls-cairo1)上查阅的斯塔克网络文件为基础。
