Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Empty tuple (aka unit), both literal and type
es: Tupla vacía (alias unidad), tanto literal como tipo
fr: Empty tuple (aka unit), à la fois littérale et de type
id: Tuple kosong (satuanaka), baik literal maupun tipe
tr: Boş tuple (aka birim), hem gerçek hem de tip
zh_cn: 空图普(aa 单位), 字面和类型

source: `(expr)`
zh_cn: `((燃料)`)`

source: Parenthesized expression
es: Expresión entre paréntesis
fr: Expression parenthésique
id: Ekspresi kurung
tr: Parenthesized ifadesi
zh_cn: 括号表达式

source: `(expr,)`
id: (Ekspr)
zh_cn: `((Exter,))`

source: Single-element tuple expression
es: Expresión de tupla de un solo elemento
fr: Expression des tuples à élément unique
id: Ekspresi tuplemen-tunggal
tr: Tek-elementli tümle ifadesi
zh_cn: 单元素图普表达式

source: `(type,)`
es: `(tipo,)'
id: Aku tidak tahu apa-apa tentang hal ini.
tr: (tip,)
zh_cn: `(类型,)`

source: Single-element tuple type
es: Tipo de tupla de un solo elemento
fr: Type de tuple à élément unique
id: Tipe tuplemen-tunggal
tr: Tek elemanlı tuple tipi
zh_cn: 单元素图普型

source: `(expr, ...)`
zh_cn: `((Exter,...))`

source: Tuple expression
es: Expresión de tuplas
fr: Expression tuple
id: Ekspresi umum
tr: Tuple ifadesi
zh_cn: 图图表达式

source: `(type, ...)`
es: `(tipo,...)`
id: Seperti,...)
tr: (tip,...)
zh_cn: `(类型,.) '

source: Tuple type
es: Tipo de tupla
fr: Type de tuple
id: Tipe Tuple
tr: Tuple tipi
zh_cn: 图示类型类型

source: `expr(expr, ...)`
id: Exprłexpr,...)
zh_cn: `Exter( Exter,...) '

source: Function call expression; also used to initialize tuple `struct`s and tuple `enum` variants
es: Expresión de llamada de función; también se utiliza para inicializar variantes de tuple `struct`s y tuple `enum`
fr: Expression de l'appel de fonction; également utilisé pour initialiser les variantes de tuple `struct`s et tuple `enum`
id: Panggilan ekspresi fungsi; juga digunakan untuk menginisialisasi tuple åstructs dan tuple (varian tuple)
tr: Fonksiyon çağrı ifadesi; ayrıca tuple structs ve tuple enum varyantlarını başlatmak için kullanılır
zh_cn: 函数调用表达式; 也用于初始化 tuple `struct' 和 tuple `enum' 变量

source: <span class="caption">Table B-8: Tuples</span>
es: <span class="caption">Tabla B-8: Tuples</span>
fr: <span class="caption">Tableau B-8: Tuples</span>
id: <span class="caption">Tabel B-8: Tuples</span>
tr: span class="caption">Tablo B-8: Tuples/span>
zh_cn: <span类=“Caption” >表B-8:图例 </span>

source: Table B-9 shows the contexts in which curly braces are used.
es: En la Tabla B-9 se muestran los contextos en los que se utilizan las abrazaderas rizadas.
fr: Le tableau B-9 montre les contextes dans lesquels les appareils bouclés sont utilisés.
id: Tabel B-9 menunjukkan konteks di mana kawat gigi keriting digunakan.
tr: Tablo B-9, kıvırcık diş tellerinin kullanıldığı bağlamları gösterir.
zh_cn: 表B-9显示了使用卷轴牙套的背景。

source: Context
es: Contexto
fr: Contexte
id: Konteks
tr: Bağlam
zh_cn: 背景背景背景背景

source: Block expression
es: Expresión de bloque
fr: Expression du bloc
id: Ekspresi blok
tr: Blok ifadesi
zh_cn: 块块表达式

source: `Type {...}`
es: Tipo {...
zh_cn: 类型 {...} {...} {...}

source: `struct` literal
fr: "struction" littérale
id: Rangkaian literal
tr: struct gerçek anlamda
zh_cn: `建筑'字面

source: <span class="caption">Table B-9: Curly Braces</span>
es: <span class="caption">Tabla B-9: Rizos </span>
fr: <span class="caption">Tableau B-9: Braces bouclés</span>
id: <span class="caption">Tabel B-9: Curly Braces</span>
tr: span class="caption">Tablo B-9: Kıvırcık Braces/span>
zh_cn: <span类=“Caption” >表B-9:圆括号 </span>

source: Appendix C - Derivable Traits
es: Apéndice C - Rasgos derivados
fr: Annexe C - Traits dérivés
id: Lampiran C - Sifat yang Dapat Diturunkan
tr: Ek C - Türevlenebilir Özellikleri
zh_cn: 附录C - 可衍生轨迹

source: In various places in the book, we’ve discussed the `derive` attribute, which you can apply to a struct or enum definition. The `derive` attribute generates code to implement a default trait on the type you’ve annotated with the `derive` syntax.
es: En varios lugares del libro, hemos discutido el atributo `derive`, que se puede aplicar a una definición struct o enum. El atributo `derive` genera código para implementar un rasgo predeterminado en el tipo que has anotado con la sintaxis `derive`.
fr: Dans divers endroits du livre, nous avons discuté de l'attribut `derive`, que vous pouvez appliquer à une définition de struct ou d'enum. L'attribut `derive` génère du code pour implémenter un caractère par défaut sur le type que vous avez annoté avec la syntaxe `derive`.
id: Di berbagai tempat dalam buku ini, kita telah membahas atribut éderive, yang dapat Anda terapkan pada definisi struct atau enum.
tr: Kitaptaki çeşitli yerlerde, bir yapısal veya enum tanımına uygulayabileceğiniz derive özniteliğini tartıştık. derive özniteliği, derive sözdizimi ile not ettiğiniz tür üzerinde varsayılan bir özellik uygulamak için kod oluşturur.
zh_cn: 在书中的各个地方,我们讨论了`衍生'属性,你可以将其应用于构造或元素定义,`衍生'属性产生代码,以便在你用`衍生'语法注释的那类词上执行默认特性。

source: In this appendix, we provide a comprehensive reference detailing all the traits in the standard library compatible with the `derive` attribute.
es: En este apéndice, proporcionamos una referencia completa en la que se detallan todos los rasgos de la biblioteca estándar compatibles con el atributo `derive`.
fr: Dans cet appendice, nous fournissons une référence complète détaillant tous les traits de la bibliothèque standard compatible avec l'attribut "derive".
id: Dalam apendiks ini, kami menyediakan referensi komprehensif yang merinci semua sifat di perpustakaan standar yang sesuai dengan atribut åderiveé.
tr: Bu ekte, standart kütüphanedeki derive özniteliği ile uyumlu tüm özellikleri detaylandıran kapsamlı bir referans sunuyoruz.
zh_cn: 在本附录中,我们提供一个全面参考,详细说明标准图书馆中与`衍生'属性相符的所有特征。

source: These traits listed here are the only ones defined by the core library that can be implemented on your types using `derive`. Other traits defined in the standard library don’t have sensible default behavior, so it’s up to you to implement them in a way that makes sense for what you’re trying to accomplish.
es: Estos rasgos enumerados aquí son los únicos definidos por la biblioteca principal que se pueden implementar en sus tipos usando `derive`. Otros rasgos definidos en la biblioteca estándar no tienen un comportamiento predeterminado sensato, por lo que depende de usted para implementarlos de una manera que tenga sentido para lo que está tratando de lograr.
fr: Ces traits listés ici sont les seuls définis par la bibliothèque de base qui peut être implémenté sur vos types en utilisant `derive`. D'autres traits définis dans la bibliothèque standard n'ont pas de comportement par défaut sensé, donc il est à vous de les implémenter d'une manière qui a un sens pour ce que vous essayez d'accomplir.
id: Sifat-sifat ini dicantumkan di sini adalah satu-satunya yang didefinisikan oleh perpustakaan inti yang dapat diterapkan pada tipe Anda dengan menggunakan sifat-sifat lain yang didefinisikan di perpustakaan standar tidak memiliki perilaku baku yang masuk akal, sehingga terserah Anda untuk menerapkannya dengan cara yang masuk akal untuk apa yang Anda coba capai.
tr: Burada listelenen bu özellikler, derive kullanarak çekirdek kitaplığı tarafından tanımlanabilecek özelliklerdir. Standart kütüphanede tanımlanan diğer özelliklerin mantıklı varsayılan davranışları yoktur, bu nedenle bunları başarmaya çalıştığınız şey için mantıklı bir şekilde uygulamak size kalmıştır.
zh_cn: 此处列出的这些特征是核心图书馆定义的唯一一种特征,它们可以用“衍生”方式在你们类型上实施。 标准图书馆中定义的其他特征没有合理的默认行为,因此,要由你们来实施它们,才能对你们试图实现的目标产生意义。

source: Drop and Destruct
es: Caída y destrucción
fr: Détruire et laisser tomber
tr: Düşme ve Yıkım
zh_cn: 下降和破坏

source: When moving out of scope, variables need to be moved first. This is where the `Drop` trait intervenes. You can find more details about its usage [here](ch04-01-what-is-ownership.md#no-op-destruction-the-drop-trait).
es: Al salir del alcance, las variables deben ser movidas primero. Aquí es donde interviene el rasgo `Drop`. Puede encontrar más detalles sobre su uso [aquí](ch04-01-what-is-ownership.md#no-op-destruction-the-drop-trait).
fr: Lorsque vous quittez le champ d'application, les variables doivent d'abord être déplacées. C'est là que le caractère `Drop` intervient. Vous pouvez trouver plus de détails sur son utilisation [ici](ch04-01- what-is-ownership.md#no-op-destruction-the-drop-trait).
id: Ketika bergerak keluar dari ruang lingkup, variabel perlu dipindahkan terlebih dahulu. Ini adalah di mana sifat yang turun tangan. Anda dapat menemukan lebih banyak rincian tentang penggunaan [di sini][di sini]bah04-01-apa-adalah-pemilik.md#no-op-destruction-the-drop-trait).
tr: Kapsam dışına taşınırken, değişkenlerin önce taşınması gerekir. Drop özelliğinin müdahale ettiği yer burasıdır. Kullanımı hakkında daha fazla ayrıntı bulabilirsiniz [burada] (ch04-01-what-is-ownership.md#no-op-destruction-the-drop-trait).
zh_cn: 当移出范围时, 变量需要先移动。 这是“ 拖放” 特性介入的地方 。 您可以在此找到更多关于它使用情况的细节 。 (ch04-01- which - is - 拥有. md# no- op- destroy- the drop- trait) 。

source: Moreover, Dictionaries need to be squashed before going out of scope. Calling the `squash` method on each of them manually can quickly become redundant. `Destruct` trait allows Dictionaries to be automatically squashed when they get out of scope. You can also find more information about `Destruct` [here](ch04-01-what-is-ownership.md#destruction-with-a-side-effect-the-destruct-trait).
es: Además, los diccionarios deben ser aplastados antes de salir del alcance. Llamar al método `squash` en cada uno de ellos manualmente puede convertirse rápidamente en redundante. El rasgo `Destruct` permite a los diccionarios ser aplastados automáticamente cuando se salen del alcance. También puede encontrar más información sobre `Destruct` [aquí](ch04-01-what-is-ownership.md#destruction-with-a-side-effect-the-destruction-trait).
fr: En outre, les dictionnaires doivent être écrasés avant de sortir de la portée. Appeler la méthode `squash` sur chacun d'eux manuellement peut rapidement devenir redondant. `Destruct` trait permet aux Dictionnaires d'être automatiquement écrasés quand ils sortent de la portée. Vous pouvez également trouver plus d'informations sur `Destruct` [ici](ch04-01- what-is-ownership.md#destruction-with-a-side-effect-the-destruct-trait).
id: Selain itu, Dictionary perlu dihancurkan sebelum keluar dari jangkauan. memanggil metode ·squash-- pada masing-masing dari mereka secara manual dapat segera menjadi berlebihan.
tr: Ayrıca, Dictionary'lerin kapsam dışına çıkmadan önce ezilmesi gerekir. Her biri üzerindeki squash yöntemini manuel olarak çağırmak hızla gereksiz hale gelebilir. Destruct özelliği, Dictionary'lerin kapsam dışına çıktıklarında otomatik olarak ezilmesine izin verir. Destruct [burada] (ch04-01-what-is-storkship.md#destruction-with-the-side-de) hakkında daha fazla bilgi bulabilirsiniz.
zh_cn: 此外,在超出范围之前,词典需要被压碎。 将每个词典上“ quash” 的方法人工调用会很快变得多余。 “ 破坏” 特性允许词典在超出范围时自动被压碎。 您还可以找到更多关于“ 破坏” (这里) (ch04-01-what- what- is- own. md# deview - with - deside - effect- the- used-trait) 的信息 。

source: `Clone` and `Copy` for Duplicating Values
es: `Clone` y `Copy` para duplicar valores
fr: `Clone` et `Copier` pour la duplication des valeurs
id: SERBA - SERBI DAN TUBUH UNTUK Gandakan Nilai - Nilai
tr: Değerleri Çoğaltmak için Clone ve Copy
zh_cn: " Clone " 和 " Copy " 用于复制价值

source: The `Clone` trait provides the functionality to explicitly create a deep copy of a value.
es: El rasgo " Clone " proporciona la funcionalidad para crear explícitamente una copia profunda de un valor.
fr: Le caractère `Clone` fournit la fonctionnalité pour créer explicitement une copie profonde d'une valeur.
id: Sifat Cloneé memberikan fungsionalitas untuk secara eksplisit membuat salinan mendalam nilai.
tr: Clone özelliği, bir değerin derin bir kopyasını açıkça oluşturmak için işlevsellik sağlar.
zh_cn: `Clone'特性提供了明确创建深重价值副本的功能。

source: Deriving `Clone` implements the `clone` method, which, in turn, calls clone on each of the type's components. This means all the fields or values in the type must also implement `Clone` to derive `Clone`.
es: Derivado `Clone` se aplica el método `clone`, que, a su vez, llama clon en cada uno de los componentes del tipo. Esto significa que todos los campos o valores del tipo también deben implementar `Clone` para derivar `Clone`.
fr: Dériver `Clone` implémente la méthode `clone` qui, à son tour, appelle clone sur chacun des composants du type. Cela signifie que tous les champs ou valeurs du type doivent également implémenter `Clone` pour dériver `Clone`.
id: Yang kemudian disebut klon pada setiap komponen tipe. ini berarti semua bidang atau nilai-nilai dalam tipe harus juga mengimplementasikan Clone.
tr: Clone'un çıkarılması, clone yöntemini uygular; bu da, türün bileşenlerinin her birine klon adını verir. Bu, türdeki tüm alanların veya değerlerin Clone'yi türetmek için Clone'yi de uygulaması gerektiği anlamına gelir.
zh_cn: 产生“单”的方法是“单”方法,而“单”方法又将克隆称为“单”方法,这意味着该类型的所有字段或数值也必须执行“单”以得出“单”。

source: Here is a simple example:
es: He aquí un ejemplo sencillo:
fr: Voici un exemple simple:
id: Ini adalah contoh sederhana:
tr: İşte basit bir örnek:
zh_cn: 以下是一个简单的例子:

source: "Not equal"
es: "No es igual"
fr: "Pas égal"
id: "Tidak sama"
tr: "Eşit değil"
zh_cn: "不平等"

source: The `Copy` trait allows for the duplication of values. You can derive `Copy` on any type whose parts all implement `Copy`.
es: El rasgo `Copy` permite la duplicación de valores. Usted puede derivar `Copy` en cualquier tipo cuyas partes todas implementan `Copy`.
fr: Le caractère `Copy` permet la duplication des valeurs. Vous pouvez dériver `Copy` sur tout type dont les parties implémentent `Copy`.
id: Sifat yang memungkinkan untuk duplikasi nilai-nilai Anda dapat diperoleh pada jenis apa pun yang semua bagiannya mengimplementasikan.
tr: Copy özelliği, değerlerin çoğaltılmasını sağlar. Parçalarının tümü Copy'yi uygulayan herhangi bir türde Copy'yi türetebilirsiniz.
zh_cn: `复制'特性允许重复价值,任何部件都执行`复制'的种类,都可以获得`复制'特性。

source: // Copy Trait prevents first_struct from moving into second_struct
es: // Copiar rasgo impide que first_struct se mueva a second_struct
fr: // Copy Trait empêche la première_struct de se déplacer dans la seconde_struct
id: //Salin Trait mencegah m_struct pertama dari pindah ke m_struct kedua
tr: // Kopyalama Trait, first_struct'un second_struct'a geçmesini engeller
zh_cn: / 复制 trat 防止第一个_ struct 移动到第二个_ struct

source: "Not Equal"
es: "No es igual"
fr: "Pas égal"
id: "Tidak Sama"
tr: "Eşit Değil"
zh_cn: "不平等"

source: `Debug` for Printing and Debugging
es: `Depuración` para impresión y depuración
fr: `Debug` pour l`impression et le débogage
id: "Debug" untuk Pencetakan dan Pengawakutuan
tr: Baskı ve Hata Ayıklama için Debug
zh_cn: 打印和调试“调试”的“调试”

source: The `Debug` trait enables debug formatting in format strings, which you indicate by adding `:?` within `{}` placeholders.
es: El rasgo `Debug` permite el formato de depuración en cadenas de formato, que indica añadiendo `:?` dentro de los marcadores de posición.
fr: Le caractère `Debug` permet le formatage debug dans les chaînes de format, que vous indiquez en ajoutant `:?` dans `{}` placeholders.
id: Sifat debug memungkinkan pemformatan debug dalam format string, yang Anda indikasikan dengan menambahkan:?
tr: Hata ayıklama özelliği, yer tutucular içinde :? ekleyerek belirttiğiniz biçim dizelerinde hata ayıklama biçimlendirmesini sağlar.
zh_cn: 在“占位符”内添加“?”表示`调试'特性能够以格式字符串格式进行调试格式。

source: It allows you to print instances of a type for debugging purposes, so you and other programmers using this type can inspect an instance at a particular point in a program’s execution.
es: Le permite imprimir instancias de un tipo para propósitos de depuración, por lo que usted y otros programadores que usan este tipo pueden inspeccionar una instancia en un punto particular en la ejecución de un programa.
fr: Il vous permet d'imprimer des instances d'un type à des fins de débogage, de sorte que vous et d'autres programmeurs utilisant ce type pouvez inspecter une instance à un point particulier dans une exécution de programme.
id: Hal ini memungkinkan Anda untuk mencetak contoh jenis untuk tujuan debug, sehingga Anda dan programmer lain menggunakan jenis ini dapat memeriksa suatu contoh pada titik tertentu dalam program eksekusi.
tr: Hata ayıklama amacıyla bir türün örneklerini yazdırmanıza izin verir, böylece siz ve bu türü kullanan diğer programcılar bir programın yürütülmesindeki belirli bir noktada bir örneği inceleyebilir.
zh_cn: 它允许您为调试目的打印一种类型的实例, 这样您和其他使用这种类型的程序员就可以在程序执行的特定点检查一个实例 。

source: For example, if you want to print the value of a variable of type `Point`, you can do it as follows:
es: Por ejemplo, si desea imprimir el valor de una variable de tipo `Punto`, puede hacerlo de la siguiente manera:
fr: Par exemple, si vous voulez imprimer la valeur d'une variable de type `Point`, vous pouvez le faire comme suit :
id: Misalnya, jika Anda ingin mencetak nilai dari variabel tipe årecté, Anda dapat melakukannya sebagai berikut:
tr: Örneğin, Point tipinde bir değişkenin değerini yazdırmak istiyorsanız, aşağıdaki gibi yapabilirsiniz:
zh_cn: 例如,如果想要打印类型“点”的变量的值,可以按以下方式进行:

source: The `Debug` trait is required, for example, when using the `assert_xx!` macros in tests. Theses macros print the values of instances given as arguments if the equality or comparison assertion fails so programmers can see why the two instances weren’t equal.
es: El rasgo `Debug` se requiere, por ejemplo, cuando se utilizan las macros `assert_xx!` en las pruebas. Las macros de tesis imprimen los valores de las instancias dadas como argumentos si la afirmación de igualdad o comparación falla así que los programadores pueden ver por qué las dos instancias no eran iguales.
fr: Le caractère `Debug` est requis, par exemple, lors de l'utilisation des macros `assert_xx!` dans les tests. Ces macros impriment les valeurs des instances données comme arguments si l'affirmation d'égalité ou de comparaison échoue de sorte que les programmeurs puissent voir pourquoi les deux instances n'étaient pas égales.
id: Sebagai contoh, sifat ini diperlukan ketika menggunakan macros dalam tes. Ini makro mencetak nilai dari contoh yang diberikan sebagai argumen jika pernyataan kesetaraan atau perbandingan gagal sehingga programer dapat melihat mengapa kedua contoh tersebut tidak sama.
tr: Debug özelliği, örneğin, testlerde assert_xx! makrolarını kullanırken gereklidir. Bu makrolar, eşitlik veya karşılaştırma iddiası başarısız olursa, argüman olarak verilen örneklerin değerlerini yazdırır, böylece programcılar iki örneğin neden eşit olmadığını görebilir.
zh_cn: 例如,在测试中使用`Assert_xx!' 宏时,需要“调试”特性。如果平等或比较主张失败,程序员可以理解为什么这两个例子不相等,则这些宏打印了作为论据的事例的数值。

source: `Default` for Default Values
es: `Default` para valores por defecto
fr: `Par défaut` pour les valeurs par défaut
id: Standar untuk Nilai Baku
tr: Varsayılan Değerler için Default
zh_cn: 默认值“ Default” 的“ 默认值”

source: The `Default` trait allows creation of a default value of a type. The most common default value is zero. All primitive types in the standard library implement `Default`.
es: El rasgo `Default` permite crear un valor predeterminado de un tipo. El valor predeterminado más común es cero. Todos los tipos primitivos de la biblioteca estándar implementan `Default`.
fr: Le caractère `Default` permet la création d'une valeur par défaut d'un type. La valeur par défaut la plus courante est zéro. Tous les types primitifs de la bibliothèque standard implémentent `Default`.
id: Sifat 'Default' memungkinkan terciptanya nilai baku dari sebuah tipe. Nilai baku yang paling umum adalah nol. Semua tipe primitif di perpustakaan standar mengimplementasikan 'Default.
tr: Default özelliği, bir türün varsayılan değerinin oluşturulmasına izin verir. En yaygın varsayılan değer sıfırdır. Standart kütüphanedeki tüm ilkel türler Default uygular.
zh_cn: `默认'特性允许创建一种类型的默认值。最常见的默认值为零。标准库中的所有原始类型都执行`默认'。

source: If you want to derive `Default` on a composite type, each of its elements must already implement `Default`. If you have an [`enum`](ch06-01-enums.md) type, you must declare its default value by using the `#[default]` attribute on one of its variants.
es: Si desea derivar `Default` en un tipo compuesto, cada uno de sus elementos debe implementar `Default`. Si tiene un tipo [`enum`](ch06-01-enums.md) debe declarar su valor predeterminado utilizando el atributo `[default]` en una de sus variantes.
fr: Si vous voulez dériver `Default` sur un type composite, chacun de ses éléments doit déjà implémenter `Default`. Si vous avez un type [`enum`](ch06-01-enums.md), vous devez déclarer sa valeur par défaut en utilisant l`attribut `#[default]` sur l`une de ses variantes.
id: Jika Anda ingin memperolehnya pada tipe majemuk, masing-masing elemennya harus mengimplementasikannya dengan menggunakan atribut default (baku). Jika Anda memiliki atribut [enum][enum] Allahk06-01-enums.md), Anda harus menyatakan nilai bakunya dengan menggunakan atributnya pada salah satu variannya.
tr: Default'u kompozit bir tipte türetmek istiyorsanız, elemanlarının her biri Default'yu zaten uygulamalıdır. [enum] (ch06-01-enums.md) tipiniz varsa, varyantlarından birinde #[varsayılan] özniteliğini kullanarak varsayılan değerini beyan etmelisiniz.
zh_cn: 如果您想要在复合类型上得出`违约', 其每个元素必须已经执行`违约' 。 如果您有[`enum' (ch06-01-enums.md) 类型, 您必须使用`[ 默认] 属性来声明其默认值 。

source: An example:
es: Un ejemplo:
fr: Un exemple:
id: Contoh:
tr: Bir örnek:
zh_cn: 例如:

source: "item1 mismatch"
es: Desajuste del tema 1
fr: "inadéquation de l'article 1"
id: "item1 tidak cocok"
tr: "1. madde uyuşmazlığı"
zh_cn: “项目1不匹配”

source: "item2 mismatch"
es: Desajuste del tema 2
fr: "inadéquation de l'article 2"
id: "item2 tidak cocok"
tr: "Item2 uyuşmazlığı"
zh_cn: “项目2不匹配”

source: "case mismatch"
es: "Desajuste de casos"
fr: "cas d'inadéquation"
id: "Kasus tidak cocok"
tr: "Dava uyuşmazlığı"
zh_cn: "情况不匹配"

source: `PartialEq` for Equality Comparisons
es: `PartialEq` para comparaciones de igualdad
fr: < < PartialEq > > pour les comparaisons en matière d'égalité
id: ▪PartialEqå untuk Perbandingan Kesetaraan
tr: Eşitlik Karşılaştırmaları için PartialEq
zh_cn: 平等比较的`Part PartialEq'

source: The `PartialEq` trait allows for comparison between instances of a type for equality, thereby enabling the `==` and `!=` operators.
es: El rasgo `PartialEq` permite la comparación entre instancias de un tipo para la igualdad, permitiendo así a los operadores `== y `!=`.
fr: Le caractère `PartialEq` permet une comparaison entre les instances d'un type d'égalité, permettant ainsi les opérateurs `==` et `!=`.
id: Sifat "PartialEq" memungkinkan perbandingan antara contoh dari tipe kesetaraan, yang memungkinkan terjadinya operator.
tr: PartialEq özelliği eşitlik için bir türün örnekleri arasında karşılaştırma yapılmasına izin verir, böylece == ve!= operatörleri etkinleştirilir.
zh_cn: `partialEq'特性使得可以比较一种平等的情况,从而使该类人和该类经营者能够进行比较。
