Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Specifically, you'll learn about ABIs, contract interfaces, the contract and library dispatchers and their low-level system call equivalents!
es: ¡Específicamente, aprenderás sobre ABIs, interfaces de contrato, los despachadores de contratos y bibliotecas y sus equivalentes de llamadas de sistema de bajo nivel!
fr: Plus précisément, vous en apprendrez davantage sur les ABI, les interfaces contractuelles, les répartiteurs de contrats et de bibliothèques et leurs équivalents d'appels système de bas niveau!
id: Secara khusus, Anda akan belajar tentang ABI, antarmuka kontrak, kontrak dan perpustakaan operator dan sistem tingkat rendah mereka panggilan setara!
tr: Özellikle, ABI'ler, sözleşme arayüzleri, sözleşme ve kütüphane göndericileri ve düşük seviyeli sistem çağrı eşdeğerleri hakkında bilgi edineceksiniz!
zh_cn: 具体地说,你会了解ABIs,合同界面, 合同和图书馆调度员 以及他们的低级系统呼叫等同!

source: Cross-contract interactions between smart contracts on a blockchain is a common practice which enables us to build flexible contracts that can speak with each other.
es: La interacción entre contratos entre contratos inteligentes en una cadena de bloques es una práctica común que nos permite construir contratos flexibles que puedan hablar entre sí.
fr: Les interactions entre contrats intelligents sur une blockchain sont une pratique courante qui nous permet de construire des contrats flexibles qui peuvent parler les uns avec les autres.
id: Interaksi silang antara kontrak cerdas pada rantai blok adalah praktek umum yang memungkinkan kita untuk membangun kontrak fleksibel yang dapat berbicara satu sama lain.
tr: Bir blok zincirindeki akıllı sözleşmeler arasındaki çapraz sözleşme etkileşimleri, birbirleriyle konuşabilecek esnek sözleşmeler inşa etmemizi sağlayan yaygın bir uygulamadır.
zh_cn: 链条上智能合同之间的相互合同互动是一种常见做法,使我们能够建立能够相互交谈的灵活合同。

source: Achieving this on Starknet requires something we call an interface.
es: Lograr esto en Starknet requiere algo que llamamos una interfaz.
fr: Atteindre cela sur Starknet nécessite quelque chose que nous appelons une interface.
id: Mencapai ini di Starknet membutuhkan sesuatu yang kita sebut antarmuka.
tr: Starknet'te bunu başarmak için ara yüz dediğimiz bir şey gerekiyor.
zh_cn: 在史塔克网上实现这一点 需要我们称之为接口的东西

source: ABI - Application Binary Interface
es: ABI - Interfaz binaria de aplicaciones
fr: ABI - Interface binaire d'application
id: ABI - Aplikasi Antarmuka Biner
tr: ABI - Uygulama İkili Arayüzü
zh_cn: ABI - 应用程序二进制界面

source: On Starknet, the ABI of a contract is a JSON representation of the contract's functions and structures, giving anyone (or any other contract) the ability to form encoded calls to it. It is a blueprint that instructs how functions should be called, what input parameters they expect, and in what format.
es: En Starknet, la ABI de un contrato es una representación JSON de las funciones y estructuras del contrato, dando a cualquier persona (o cualquier otro contrato) la capacidad de formar llamadas codificadas a él. Es un plan que instruye cómo las funciones deben ser llamadas, qué parámetros de entrada esperan, y en qué formato.
fr: Sur Starknet, l'ABI d'un contrat est une représentation JSON des fonctions et structures du contrat, donnant à n'importe qui (ou à tout autre contrat) la possibilité de former des appels codés. C'est un plan qui indique comment les fonctions doivent être appelées, quels paramètres d'entrée ils attendent, et dans quel format.
id: Di Starknet, ABI dari sebuah kontrak adalah representasi JSON dari fungsi dan struktur kontrak, memberikan siapa pun (atau kontrak lain) kemampuan untuk membentuk panggilan terkode untuk itu. Ini adalah cetak biru yang memerintahkan bagaimana fungsi harus disebut, parameter masukan apa yang mereka harapkan, dan dalam bentuk apa.
tr: Starknet'te, bir sözleşmenin ABI'si, sözleşmenin işlevlerinin ve yapılarının JSON temsilidir, herhangi birine (veya başka bir sözleşmeye) kodlanmış çağrılar oluşturma yeteneği verir. Fonksiyonların nasıl adlandırılması gerektiğini, hangi girdi parametrelerini beklediklerini ve hangi formatta olduğunu öğreten bir taslaktır.
zh_cn: 在斯塔克内特,合同的ABI是JSON对合同功能和结构的表述,使任何人(或其他任何合同)能够组成编码电话。 这是一个指导如何称呼功能、他们期望哪些输入参数以及以何种格式的蓝图。

source: While we write our smart contract logics in high-level Cairo, they are stored on the VM as executable bytecodes which are in binary formats. Since this bytecode is not human readable, it requires interpretation to be understood. This is where ABIs come into play, defining specific methods which can be called to a smart contract for execution. Without an ABI, it becomes practically impossible for external actors to understand how to interact with a contract.
es: Mientras escribimos nuestras lógicas de contrato inteligentes en El Cairo de alto nivel, se almacenan en la VM como bytecodes ejecutables que están en formatos binarios. Dado que este bytecode no es legible por el ser humano, requiere interpretación para ser entendido. Aquí es donde entran en juego los ABIs, definiendo métodos específicos que pueden ser llamados a un contrato inteligente para la ejecución. Sin un ABI, es prácticamente imposible para los actores externos entender cómo interactuar con un contrato.
fr: Pendant que nous écrivons nos logiques de contrat intelligentes au Caire de haut niveau, elles sont stockées sur le VM sous forme d'octécodes exécutables qui sont en format binaire. Comme ce octécode n'est pas lisible par l'homme, il faut l'interpréter. C'est là que les ABI entrent en jeu, définissant des méthodes spécifiques qui peuvent être appelées à un contrat intelligent pour l'exécution. Sans ABI, il devient pratiquement impossible pour les acteurs externes de comprendre comment interagir avec un contrat.
id: Sementara kita menulis logika kontrak cerdas kita di Kairo tingkat tinggi, mereka disimpan di VM sebagai bytecode executable yang dalam format biner. karena bytecode ini bukan manusia yang dapat dibaca, itu membutuhkan interpretasi untuk dipahami. Ini adalah di mana ABI datang ke bermain, mendefinisikan metode spesifik yang dapat dipanggil ke kontrak cerdas untuk eksekusi. tanpa ABI, itu menjadi praktis mustahil bagi aktor eksternal untuk memahami bagaimana berinteraksi dengan kontrak.
tr: Akıllı sözleşme mantıklarımızı üst düzey Kahire'de yazarken, VM'de ikili formatlarda çalıştırılabilir bytecodes olarak depolanırlar. Bu bytecode insan okunabilir olmadığından, yorumlanmasını gerektirir. Bu, ABI'lerin devreye girdiği, yürütme için akıllı bir sözleşmeye çağrılabilecek belirli yöntemleri tanımladığı yerdir. Bir ABI olmadan, dış aktörlerin bir sözleşmeyle nasıl etkileşime gireceğini anlamaları pratik olarak imkansız hale gelir.
zh_cn: 当我们在高层次开罗撰写智能合同逻辑时,它们作为可执行的字节代码存储在VM上,以二元格式保存。由于该字节代码不是人类可读的,因此需要理解解释。 这就是ABIs发挥作用的地方,它界定了可以称为智能合同的具体执行方法。没有ABI,外部行为者实际上不可能理解如何与合同互动。

source: ABIs are typically used in dApps frontends, allowing it to format data correctly, making it understandable by the smart contract and vice versa. When you interact with a smart contract through a block explorer like [Voyager](https://voyager.online/) or [Starkscan](https://starkscan.co/), they use the contract's ABI to format the data you send to the contract and the data it returns.
es: Los ABIs se utilizan normalmente en dApps frontends, permitiéndole formatear los datos correctamente, haciéndolos comprensibles por el contrato inteligente y viceversa. Cuando interactúas con un contrato inteligente a través de un explorador de bloques como [Voyager](https://voyager.online/) o [Starkscan](https://starkscan.co/), utilizan el ABI del contrato para formatear los datos que envías al contrato y los datos que devuelve.
fr: Lorsque vous interagissez avec un contrat intelligent par l'intermédiaire d'un explorateur de blocs comme [Voyager](https://voyager.online/) ou [Starkscan](https://starkscan.co/), ils utilisent l'ABI du contrat pour formater les données que vous envoyez au contrat et les données qu'il retourne.
id: ABI biasanya digunakan di frontends dApp, memungkinkannya untuk memformat data dengan benar, membuatnya dimengerti oleh kontrak cerdas dan sebaliknya. Ketika Anda berinteraksi dengan kontrak cerdas melalui penjelajah blok seperti [Voyager] Tyronehttps://voyager.online/) atau [Starkscan]://httpsscan.co/), mereka menggunakan kontrak ABI untuk format data yang Anda kirim ke kontrak dan datanya kembali.
tr: ABI'ler tipik olarak dApps ön uçlarında kullanılır, verileri doğru biçimlendirmesine izin verir, akıllı sözleşme ile anlaşılabilir hale getirir ve tam tersi olur. [Voyager] (https://voyager.online/) veya [Starkscan] (https://starkscan.co/) gibi bir blok gezgini aracılığıyla akıllı bir sözleşme ile etkileşime girdiğinizde, sözleşmeye gönderdiğiniz verileri biçimlendirmek için sözleşmenin ABI'sini kullanırlar ve verileri döndürür.
zh_cn: ABIs通常用于 dApps 前端, 允许它正确格式化数据, 让智能合同能够理解数据, 反之亦然。 当您通过像 [Voyager] ( https://voyager. online/) 或 [ Starkkscan] (https:// starkscan.co/) 这样的块式探险家与智能合同互动时, 它们使用合同的 ABI 来格式化您发送到合同的数据及其返回的数据 。

source: Interface
es: Interfaz
id: Antarmuka
tr: Arayüz
zh_cn: 界面界面

source: The interface of a contract is a list of the functions it exposes publicly. It specifies the function signatures (name, parameters, visibility and return value) contained in a smart contract without including the function body.
es: La interfaz de un contrato es una lista de las funciones que expone públicamente. Especifica las firmas de funciones (nombre, parámetros, visibilidad y valor de retorno) contenidas en un contrato inteligente sin incluir el cuerpo de funciones.
fr: L'interface d'un contrat est une liste des fonctions qu'il expose publiquement. Elle spécifie les signatures de fonction (nom, paramètres, visibilité et valeur de retour) contenues dans un contrat intelligent sans inclure le corps de fonction.
id: Antar muka sebuah kontrak adalah daftar fungsi yang dieksposkan secara terbuka. Ini menspesifikasikan tanda tangan fungsi (nama, parameter, visibilitas, nilai kembali) yang terkandung dalam kontrak cerdas tanpa termasuk tubuh fungsi.
tr: Bir sözleşmenin arayüzü, herkese açık olarak ortaya çıkardığı işlevlerin bir listesidir. İşlev gövdesini içermeyen akıllı bir sözleşmede yer alan işlev imzalarını (isim, parametreler, görünürlük ve dönüş değeri) belirtir.
zh_cn: 合同的接口是一份它公开披露的功能清单。 它指定智能合同中包含的功能签名( 名称、 参数、 可见度 和 返回值 ), 但不包括功能体 。

source: Contract interfaces in Cairo are traits annotated with the `#[starknet::interface]` attribute. If you are new to traits, check out the dedicated chapter on [traits](./ch08-02-traits-in-cairo.md).
es: Las interfaces de contrato en El Cairo son rasgos anotados con el atributo "[starknet::interface]`. Si usted es nuevo en los rasgos, consulte el capítulo dedicado en [traits](./ch08-02-traits-in-cairo.md).
fr: Les interfaces contractuelles au Caire sont des caractères annotés avec l'attribut `#[starknet::interface]`. Si vous êtes nouveau dans les caractères, consultez le chapitre consacré à [trats](./ch08-02-trats-in-cairo.md).
id: Antarmuka kontrak di Kairo dihafalkan dengan atribut:: interface]. Jika Anda baru dengan sifat-sifat, periksa bab yang didedikasikan pada [traits][/ch08-02-traits-in-cairo.md).
tr: Kahire'deki sözleşme arayüzleri, #[starknet::interface] özniteliği ile belirtilen özelliklerdir. Eğer özelliklerde yeniyseniz, [traits](./ch08-02-traits-in-cairo.md) üzerindeki özel bölüme göz atın.
zh_cn: 开罗的合同界面是附加说明的属性。 如果您是新特性, 请查看关于[ traits] (./ch08-02- traits- in- cairo. md) 的专章 。

source: One important specification is that this trait must be generic over the `TContractState` type. This is required for functions to access the contract's storage, so that they can read and write to it.
es: Una especificación importante es que este rasgo debe ser genérico sobre el tipo `TcontractState`, que es necesario para que las funciones tengan acceso al almacenamiento del contrato, de modo que puedan leerlo y escribirlo.
fr: Une spécification importante est que ce caractère doit être générique par rapport au type "TContractState", ce qui est nécessaire pour que les fonctions puissent accéder au stockage du contrat, afin qu'elles puissent y lire et y écrire.
id: Salah satu spesifikasi penting adalah bahwa sifat ini harus umum di atas jenis åTContractState. Ini diperlukan untuk fungsi untuk mengakses penyimpanan kontrak, sehingga mereka dapat membaca dan menulis untuk itu.
tr: Önemli bir özellik, bu özelliğin TContractState tipi üzerinde jenerik olması gerektiğidir. Bu, işlevlerin sözleşmenin deposuna erişmesi için gereklidir, böylece okuma ve yazma yapabilirler.
zh_cn: 一个重要的具体要求是,这种特性必须通用于`缔约国'类型,这是获取合同储存功能所必需的,以便它们能够读和写。

source: Note: The contract constructor is not part of the interface. Nor are internal functions part of the interface.
es: Nota: El constructor de contratos no forma parte de la interfaz, ni las funciones internas forman parte de la interfaz.
fr: Note : Le constructeur du contrat ne fait pas partie de l'interface. Les fonctions internes ne font pas non plus partie de l'interface.
id: Catatan: Konstruktor kontrak bukan bagian dari antarmuka. Begitu juga fungsi internal bagian dari antar muka.
tr: Not: Sözleşme oluşturucu arayüzün bir parçası değildir. İç fonksiyonlar da arayüzün bir parçası değildir.
zh_cn: 注:合同建造者不是接口的一部分,内部职能也不是接口的一部分。

source: Here's a sample interface for an ERC20 token contract. As you can see, it's a generic trait over the `TContractState` type. `view` functions have a self parameter of type `@TContractState`, while `external` functions have a self parameter of type passed by reference `ref self: TContractState`.
es: Como puede ver, es un rasgo genérico sobre el tipo `TContractState`. Las funciones `view` tienen un parámetro propio del tipo `TContractState`, mientras que las funciones `externas` tienen un parámetro propio del tipo pasado por la referencia `ref self: TContractState`.
fr: Voici un exemple d'interface pour un contrat de jeton ERC20. Comme vous pouvez le voir, il s'agit d'un trait générique sur le type `TContractState`. Les fonctions `view` ont un paramètre d'autotype `@TContractState`, tandis que les fonctions `externes` ont un paramètre d'autotype passé par référence `ref self: TContractState`.
id: Ini contoh antarmuka untuk kontrak kontok ERC20. seperti yang Anda lihat, ini adalah sifat umum atas tipe åTContractate.
tr: İşte bir ERC20 token sözleşmesi için örnek bir arayüz. Gördüğünüz gibi, TContractState tipi üzerinde genel bir özelliktir. view fonksiyonları TContractState tipinin öz parametresine sahipken, external fonksiyonları referans ref self:TContractState tarafından aktarılan öz parametresine sahiptir.
zh_cn: 这是ESC20象征性合同的样本界面。如你所见,这是“缔约国”类型上的通用特征。`观察'功能具有“缔约国”类型的自参数,而`外部'功能具有以`缔约国'为参照的`缔约国'通过类型的自定义参数。

source: <span class="caption">Listing 15-1: A simple ERC20 Interface.</span>
es: <span class="caption">Lista 15-1: Una interfaz ERC20 simple.</span>
fr: <span class="caption">Liste 15-1: Une interface ERC20 simple.</span>
tr: span class="caption">Listeleme 15-1: Basit bir ERC20 Arayüzü./span>
zh_cn: <span类=“ caption” > listing 15-1: 一个简单的 ERC20 接口。 </span>

source: In the next chapter, we will see how we can call contracts from other smart contracts using _dispatchers_ and _syscalls_ .
es: En el siguiente capítulo, veremos cómo podemos llamar a contratos de otros contratos inteligentes usando _dispatchers_ y _syscalls_.
fr: Dans le prochain chapitre, nous verrons comment nous pouvons appeler les contrats d'autres contrats intelligents en utilisant _dispatchers_ et _syscalls_.
id: Dalam bab berikutnya, kita akan melihat bagaimana kita dapat memanggil kontrak dari kontrak cerdas lainnya menggunakan _dispatchers_ dan _syscalls_.
tr: Bir sonraki bölümde, _dispatchers_ ve _syscalls_ kullanarak diğer akıllı sözleşmelerden sözleşmeleri nasıl çağırabileceğimizi göreceğiz.
zh_cn: 在下一章,我们将看到如何使用_dispatchers_和_syscalls_将其他智能合同的合同称为合同。

source: Each time a contract interface is defined, two dispatchers are automatically created and exported by the compiler. Let's consider an interface that we named IERC20, these would be:
es: Cada vez que se define una interfaz de contrato, dos despachadores son creados y exportados automáticamente por el compilador. Consideremos una interfaz que llamamos IERC20, estos serían:
fr: Chaque fois qu'une interface de contrat est définie, deux répartiteurs sont automatiquement créés et exportés par le compilateur. Considérons une interface que nous avons nommée IERC20, celle-ci serait :
id: Setiap kali antarmuka kontrak didefinisikan, dua dispatcher secara otomatis dibuat dan diekspor oleh kompiler. Mari kita pertimbangkan antarmuka yang kita namai IERC20, ini akan menjadi:
tr: Bir sözleşme arayüzü tanımlandığında, iki gönderici otomatik olarak oluşturulur ve derleyici tarafından dışa aktarılır. IERC20 adını verdiğimiz bir arayüz düşünelim, bunlar:
zh_cn: 每次确定合同界面, 编辑器自动创建和导出两个调度器。 让我们考虑一个我们命名为 IERC20 的界面, 它们是:

source: The Contract Dispatcher `IERC20Dispatcher`
es: El despachador de contratos `IERC20Dispatcher '
fr: Le régulateur de contrat `IERC20Dispatcher`
id: Dispatcher Kontrak ÉIERC20 Dispatcher
tr: Sözleşme Dispatcher IERC20Dispatcher
zh_cn: `IERC20Dispatcher'合同调度员

source: The Library Dispatcher `IERC20LibraryDispatcher`
es: El despachador de la biblioteca `IERC20LibraryDispatcher`
fr: Le régulateur de bibliothèque `IERC20BibliothèqueDispatcher`
id: The Library Dispatcher ÉIERC20Library Dispatcher
tr: Kütüphane Dispatcher IERC20LibraryDispatcher
zh_cn: 图书馆调度员`IECRC20Library Dispatcher'

source: The compiler also generates a trait `IERC20DispatcherTrait`, allowing us to call the functions defined in the interface on the dispatcher struct.
es: El compilador también genera un rasgo `IERC20DispatcherTrait`, lo que nos permite llamar a las funciones definidas en la interfaz en la estructura del despachador.
fr: Le compilateur génère également un caractère "IERC20DispatcherTrait", nous permettant d'appeler les fonctions définies dans l'interface sur la structure du répartiteur.
id: Komiler juga menghasilkan sebuah sifat ÉIERC20 DispatcherTrait, memungkinkan kita untuk memanggil fungsi yang didefinisikan dalam antarmuka pada dispatcher struct.
tr: Derleyici ayrıca bir özellik IERC20DispatcherTrait üretir, bu da gönderici yapısındaki arayüzde tanımlanan işlevleri çağırmamızı sağlar.
zh_cn: 编译器还产生一个特质“IERC20DispatcherTrait”,使我们能够调用调度器支架上的界面中所定义的功能。

source: In this chapter, we are going to discuss what these are, how they work and how to use them.
es: En este capítulo, vamos a discutir cuáles son, cómo funcionan y cómo usarlos.
fr: Dans ce chapitre, nous allons discuter de ce qu'ils sont, comment ils fonctionnent et comment les utiliser.
id: Dalam bab ini, kita akan membahas apa ini, bagaimana mereka bekerja dan bagaimana menggunakannya.
tr: Bu bölümde bunların ne olduğunu, nasıl çalıştıklarını ve nasıl kullanılacağını tartışacağız.
zh_cn: 在本章中,我们将讨论它们是什么,它们如何运作以及如何使用它们。

source: To effectively break down the concepts in this chapter, we are going to be using the IERC20 interface from the previous chapter (refer to Listing 15-1).
es: Para desglosar eficazmente los conceptos de este capítulo, vamos a utilizar la interfaz IERC20 del capítulo anterior (consultar la lista 15-1).
fr: Pour bien ventiler les concepts de ce chapitre, nous allons utiliser l'interface IERC20 du chapitre précédent (voir l'inscription 15-1).
id: Untuk memecahkan konsep secara efektif dalam bab ini, kita akan menggunakan antarmuka IERC20 dari bab sebelumnya (refer ke Listing 15-1).
tr: Bu bölümdeki kavramları etkili bir şekilde parçalamak için, önceki bölümden IERC20 arayüzünü kullanacağız (Listeleme 151'e bakınız).
zh_cn: 为了有效地分解本章中的概念,我们将使用上一章中的IERC20接口(参见清单15-1)。

source: Contract Dispatcher
es: Expedidor de contratos
fr: Expéditeur de contrats
id: Dispatcher Kontrak
tr: Sözleşme Dispatcher
zh_cn: 合同调度员

source: As mentioned previously, traits annotated with the `#[starknet::interface]` attribute automatically generate a dispatcher and a trait on compilation. Our `IERC20` interface is expanded into something like this:
es: Como se ha mencionado anteriormente, los rasgos anotados con el atributo "[starknet::interface]` generan automáticamente un despachador y un rasgo en la compilación. Nuestra interfaz `IERC20` se expande en algo como esto:
fr: Comme mentionné précédemment, les caractères annotés avec l'attribut `#[starknet::interface]` génèrent automatiquement un répartiteur et un trait sur la compilation. Notre interface `IERC20` est étendue à quelque chose comme ceci:
id: Seperti yang telah disebutkan sebelumnya, sifat-sifat yang dinotasi dengan interface::: interface] atribut secara otomatis menghasilkan sebuah operator dan sifat pada kompilasi. Antar muka kita diperluas menjadi sesuatu seperti ini:
tr: Daha önce de belirtildiği gibi, #[starknet::interface] özniteliği ile belirtilen özellikler otomatik olarak bir gönderici ve derleme üzerinde bir özellik oluşturur. IERC20 arayüzümüz şu şekilde genişletilir:
zh_cn: 如前所述,带有“[星网:界面]”属性附加说明的特性自动生成一个调度器和汇编上的特性。我们的“IER20”接口扩展为类似内容:

source: **Note:** The expanded code for our IERC20 interface is a lot longer, but to keep this chapter concise and straight to the point, we focused on one view function `name`, and one external function `transfer`.
es: **Nota:** El código ampliado para nuestra interfaz IERC20 es mucho más largo, pero para mantener este capítulo conciso y directo al punto, nos centramos en una función de vista `nombre`, y una función externa `transferencia`.
fr: **Note:** Le code élargi pour notre interface IERC20 est beaucoup plus long, mais pour garder ce chapitre concis et direct au point, nous nous sommes concentrés sur une fonction de vue `name`, et une fonction externe `transfer`.
id: **Note:** Kode diperluas untuk antarmuka IERC20 kami jauh lebih panjang, tetapi untuk menjaga bab ini ringkas dan langsung ke titik, kami berfokus pada satu fungsi ånameá, dan satu fungsi eksternal.
tr: ** Not: ** IERC20 arayüzümüz için genişletilmiş kod çok daha uzundur, ancak bu bölümü özlü ve düz bir noktaya getirmek için, bir görünüm fonksiyonu name ve bir dış fonksiyon transfer üzerine odaklandık.
zh_cn: ** 注:** 我们的IERC20接口的扩大代号要长得多,但为了保持本章的简明和直截了当,我们把重点放在一个视图函数`名称'和一个外部函数`转让'上。

source: // starknet::call_contract_syscall is called in here
es: // Starknet::call_contract_syscall se llama aquí
fr: // starknet::call_contract_syscall est appelé ici
id: // starnet::call_contract_syscall dipanggil kesini
tr: // starknet::call_contract_syscall buraya çağrılır
zh_cn: / 尖尖: 呼叫 - 合同 - 声音呼叫在这里

source: <span class="caption">Listing 15-2: An expanded form of the IERC20Dispatcher trait.</span>
es: <span class="caption">Lista 15-2: Una forma expandida del rasgo IERC20Dispatcher.</span>
fr: <span class="caption">Liste 15-2: Une forme élargie du caractère IERC20Dispatcher.</span>
id: <span class="caption">Listing 15-2: Bentuk terekspansi dari sifat IERC20 Dispatcher.</span>
tr: span class="caption">Liste 15-2: IERC20Dispatcher özelliğinin genişletilmiş bir formu./span>
zh_cn: <span class="caption" > listing 15-2:IERC20 Dispatcher 特性的扩大形式。 </span>
