Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The ability to run some code depending on whether a condition is true and to run some code repeatedly while a condition is true are basic building blocks in most programming languages. The most common constructs that let you control the flow of execution of Cairo code are if expressions and loops.
es: La capacidad de ejecutar algún código dependiendo de si una condición es verdadera y ejecutar algún código repetidamente mientras que una condición es verdadera son bloques básicos de construcción en la mayoría de los lenguajes de programación. Los constructos más comunes que le permiten controlar el flujo de ejecución de código de El Cairo son si expresiones y bucles.
fr: La possibilité d'exécuter un certain code selon qu'une condition est vraie et d'exécuter un certain code à plusieurs reprises alors qu'une condition est vraie sont des éléments de base dans la plupart des langages de programmation. Les constructions les plus courantes qui vous permettent de contrôler le flux d'exécution du code du Caire sont si les expressions et les boucles.
id: Kemampuan untuk menjalankan beberapa kode tergantung pada apakah sebuah kondisi benar dan untuk menjalankan beberapa kode berulang-ulang sementara kondisi benar adalah blok bangunan dasar dalam bahasa pemrograman. konstruk yang paling umum yang memungkinkan Anda mengendalikan aliran kode eksekusi Kairo adalah jika ekspresi dan loop.
tr: Bir koşulun doğru olup olmadığına bağlı olarak bazı kodları çalıştırma ve bir koşul doğru iken bazı kodları tekrar tekrar çalıştırma yeteneği, çoğu programlama dilinde temel yapı taşlarıdır. Kahire kodunun yürütme akışını kontrol etmenizi sağlayan en yaygın yapılar ifadeler ve döngülerdir.
zh_cn: 运行某些代码的能力取决于一个条件是否真实,在条件为真实时反复运行某些代码的能力是大多数编程语言的基本构件。 最普通的构件是表达和循环(如果表达和循环),它能控制开罗代码执行过程的流程。

source: `if` Expressions
es: `if` Expresiones
fr: "si" Expressions
id: Jika pernyataan itu memang benar.
tr: if İfadeler
zh_cn: `如果'表示式

source: An if expression allows you to branch your code depending on conditions. You provide a condition and then state, “If this condition is met, run this block of code. If the condition is not met, do not run this block of code.”
es: Una expresión if le permite ramificar su código dependiendo de las condiciones. Usted proporciona una condición y luego indica: “Si esta condición se cumple, ejecute este bloque de código. Si la condición no se cumple, no ejecute este bloque de código.”
fr: Une expression if vous permet de brancher votre code en fonction des conditions. Vous fournissez une condition et puis indiquez, Si cette condition est remplie, lancez ce bloc de code. Si la condition n'est pas remplie, ne lancez pas ce bloc de code.
id: Jika ekspresi memungkinkan anda untuk mencabangkan kode anda tergantung pada kondisi. anda memberikan kondisi dan kemudian keadaan, jika kondisi ini dipenuhi, jalankan blok kode ini. Jika kondisi tidak dipenuhi, jangan jalankan blok kode ini.
tr: Bir ifade, kodunuzu koşullara bağlı olarak dallandırmanıza izin veriyorsa. Bir koşul sağlarsınız ve sonra, "Bu koşul sağlanıyorsa, bu kod bloğunu çalıştırın. Durum sağlanmıyorsa, bu kod bloğunu çalıştırmayın."
zh_cn: 如果表达式允许您根据条件分割您的代码。 您提供一个条件, 然后声明, “ 如果满足此条件, 请运行此条代码块 。 如果不符合此条件, 请不要运行此代码块 。 ”

source: Create a new project called _branches_ in your _cairo_projects_ directory to explore the `if` expression. In the _src/lib.cairo_ file, input the following:
es: Cree un nuevo proyecto llamado _branches_ en su directorio _cairo_projects_ para explorar la expresión `if`. En el archivo _src/lib.cairo_, introduzca lo siguiente:
fr: Créez un nouveau projet appelé _branches_ dans votre répertoire _cairo_projects_ pour explorer l'expression `if`. Dans le fichier _src/lib.cairo_, entrez ce qui suit :
id: Buat projek baru yang disebut _branches_ dalam direktori _cairo_projects_ anda untuk mengeksplorasi ekspresi ▪iftó. Dalam berkas _src/lib.cairo_, masukan berikut:
tr: if ifadesini keşfetmek için _cairo_projects_ dizininde _branches_ adlı yeni bir proje oluşturun. _src/lib.cairo_ dosyasında, aşağıdakileri girin:
zh_cn: 在您的 _cairo_ project_ 目录中创建一个名为 _branches_的新工程,以探索“if” 表达式。在 _src/lib.cairo_文件中,输入以下内容:

source: "condition was true and number = {}"
es: "la condición era verdadera y el número = "
fr: "la condition était vraie et le nombre = {}"
id: "kondisi benar dan nomor = {}"
tr: "koşul doğruydu ve sayı = "
zh_cn: "条件是真实的,数字="

source: "condition was false and number = {}"
es: "la condición era falsa y el número = "
fr: "la condition était fausse et le nombre = {}"
id: "kondisi adalah salah dan nomor = {}"
tr: "koşul yanlıştı ve numara = "
zh_cn: "条件是虚假的 号码是= "

source: All `if` expressions start with the keyword `if`, followed by a condition. In this case, the condition checks whether or not the variable `number` has a value equal to 5. We place the block of code to execute if the condition is `true` immediately after the condition inside curly brackets.
es: Todas las expresiones `if` comienzan con la palabra clave `if`, seguida de una condición. En este caso, la condición comprueba si la variable `number` tiene o no un valor igual a 5. Colocamos el bloque de código para ejecutar si la condición es `true` inmediatamente después de la condición dentro de corchetes rizados.
fr: Toutes les expressions `si` commencent par le mot clé `si`, suivi d'une condition. Dans ce cas, la condition vérifie si la variable `number` a ou non une valeur égale à 5. Nous plaçons le bloc de code à exécuter si la condition est `true` immédiatement après la condition à l'intérieur des crochets bouclés.
id: Semua ekspresi dimulai dengan kata kunci jika diikuti dengan sebuah kondisi. dalam hal ini, kondisi memeriksa apakah variabelnya memiliki nilai sama dengan 5. kita menempatkan blok kode untuk mengeksekusi jika kondisi ini benar-benar benar segera setelah kondisi dalam kurung keriting.
tr: Tüm if ifadeleri if anahtar kelimesiyle başlar, ardından bir koşul gelir. Bu durumda, durum, number değişkeninin 5'e eşit bir değere sahip olup olmadığını kontrol eder. Eğer koşul true ise, koşul kıvırcık parantez içinde hemen sonra çalıştırılacak kod bloğunu yerleştiririz.
zh_cn: 所有`如果'表达式都以关键词`如果'开头,然后有一个条件,在这种情况下,条件检查变量`数字'是否有等于5的值。如果条件是`真正的',则在条件在圆括号内后立即将执行的代码块放入。

source: Optionally, we can also include an `else` expression, which we chose to do here, to give the program an alternative block of code to execute should the condition evaluate to `false`. If you don’t provide an `else` expression and the condition is `false`, the program will just skip the `if` block and move on to the next bit of code.
es: Opcionalmente, también podemos incluir una expresión `else`, que elegimos hacer aquí, para dar al programa un bloque alternativo de código para ejecutar si la condición evalúa a `falso`. Si no proporcionas una expresión `else` y la condición es `falso`, el programa simplemente saltará el bloque `if` y pasará al siguiente bit de código.
fr: En option, nous pouvons également inclure une expression "else`, que nous avons choisi de faire ici, pour donner au programme un bloc alternatif de code à exécuter si la condition évalue à `false`. Si vous ne fournissez pas une expression "else` et la condition est `false`, le programme va juste sauter le bloc `if` et passer au prochain bit de code.
id: Sebaliknya, kita juga dapat menyertakan sebuah ekspresi æelse, yang kita pilih untuk melakukan di sini, untuk memberikan program blok alternatif kode untuk mengeksekusi kondisi yang akan dievaluasi ke Áfalse.
tr: İsteğe bağlı olarak, burada yapmayı seçtiğimiz bir else ifadesi de ekleyebiliriz, koşul false olarak değerlendirildiğinde programa çalıştırmak için alternatif bir kod bloğu verebiliriz. Bir else ifadesi sağlamazsanız ve durum false ise, program sadece if bloğunu atlar ve bir sonraki kod bitine geçer.
zh_cn: 我们也可以选用“else”表达式,我们选择在这里这样做,以便在条件评估为“false”时,给程序一个可执行的替代代号块。如果你不提供“else”表达式,条件为“false”,则程序将跳过`if'块,跳过下一个代号。

source: Try running this code; you should see the following output:
es: Intente ejecutar este código; debería ver la siguiente salida:
fr: Essayez d'exécuter ce code ; vous devriez voir la sortie suivante :
id: Coba jalankan kode ini; Anda harus melihat keluaran berikut:
tr: Bu kodu çalıştırmayı deneyin; aşağıdaki çıktıyı görmelisiniz:
zh_cn: 尝试运行此代码; 您应该看到以下输出 :

source: Let’s try changing the value of `number` to a value that makes the condition `true` to see what happens:
es: Vamos a tratar de cambiar el valor de `número` a un valor que hace que la condición `verdadero` para ver lo que sucede:
fr: Laissez-nous essayer de changer la valeur de `nombre` en une valeur qui rend la condition `vraie` pour voir ce qui se passe:
id: Mari kita coba mengubah nilai angka menjadi nilai yang membuat kondisi menjadi benar untuk melihat apa yang terjadi:
tr: number değerini, ne olduğunu görmek için true koşulunu yapan bir değere değiştirelim:
zh_cn: 让我们尝试将`数字'的值改变为使条件`真实'的值,以观察会发生什么:

source: It’s also worth noting that the condition in this code must be a `bool`. If the condition isn’t a `bool`, we’ll get an error. For example, try running the following code:
es: También vale la pena señalar que la condición en este código debe ser un `bool`. Si la condición no es un `bool`, vamos a obtener un error. Por ejemplo, intente ejecutar el siguiente código:
fr: Il est également intéressant de noter que la condition dans ce code doit être un «bool». Si la condition n'est pas un «bool», nous allons obtenir une erreur. Par exemple, essayez d'exécuter le code suivant:
id: Ini juga layak dicatat bahwa kondisi dalam kode ini harus menjadi sebuah °bool.
tr: Ayrıca, bu koddaki durumun bir bool olması gerektiğini de belirtmek gerekir. Durum bir bool değilse, bir hata alırız. Örneğin, aşağıdaki kodu çalıştırmayı deneyin:
zh_cn: 值得指出的是,该代码中的条件必须是`bool'。如果条件不是`bool ',我们会有错误。例如,尝试运行以下代码:

source: "number was three"
es: "El número era tres"
fr: "le nombre était trois"
id: "Nomornya tiga"
tr: "Üç numaraydı"
zh_cn: "数字是三个"

source: The `if` condition evaluates to a value of 3 this time, and Cairo throws an error:
es: La condición `if` evalúa a un valor de 3 esta vez, y El Cairo lanza un error:
fr: La condition `si` évalue à une valeur de 3 cette fois, et le Caire lance une erreur:
id: Kondisi evaluasi pada nilai 3 kali ini, dan Kairo melakukan kesalahan:
tr: if durumu bu kez 3 değerini değerlendirir ve Kahire bir hata atar:
zh_cn: `如果'条件这次评价值为3, 开罗出错 :

source: The error indicates that Cairo inferred the type of `number` to be a `bool` based on its later use as a condition of the `if` statement. It tries to create a `bool` from the value `3`, but Cairo doesn't support instantiating a `bool` from a numeric literal anyway - you can only use `true` or `false` to create a `bool`. Unlike languages such as Ruby and JavaScript, Cairo will not automatically try to convert non-Boolean types to a Boolean. If we want the `if` code block to run only when a number is not equal to 0, for example, we can change the if expression to the following:
es: El error indica que El Cairo indujo el tipo de `número` a ser un `bool` basado en su uso posterior como condición de la declaración `if`. Intenta crear un `bool` a partir del valor `3`, pero El Cairo no soporta la instancia de un `bool` de un literal numérico de todos modos - sólo se puede utilizar `true` o `false` para crear un `bool`. A diferencia de idiomas como Ruby y JavaScript, El Cairo no intentará automáticamente convertir tipos no booleanos a un booleano. Si queremos que el bloque de código `if` se ejecute sólo cuando un número no es igual a 0, por ejemplo, podemos cambiar la expresión si es la siguiente:
fr: L'erreur indique que le Caire a déduit le type de `nombre` comme étant un `bool` en fonction de son utilisation ultérieure comme condition de l'instruction `si`. Il essaie de créer un `bool` à partir de la valeur `3`, mais le Caire ne supporte pas d'actualiser un `bool` à partir d'une littérale numérique de toute façon - vous ne pouvez utiliser `true` ou `false` pour créer un `bool`. Contrairement à des langages tels que Ruby et JavaScript, le Caire n'essaiera pas automatiquement de convertir des types non booléens en booléen. Si nous voulons que le bloc de code `if` ne s'exécute que lorsqu'un nombre n'est pas égal à 0, par exemple, nous pouvons modifier l'expression si elle est la suivante:
id: Kesalahan tersebut menunjukkan bahwa Kairo inferred tipe nomor ·bool) yang merupakan tipe dari nilai tersebut, namun Kairo tidak mendukung pengkonversian dari sebuah numerik literal pula - Anda hanya dapat menggunakan kode yang benar atau salah untuk membuat sebuah foil. Tidak seperti bahasa seperti Ruby dan JavaScript, Kairo tidak akan secara otomatis mencoba untuk mengubah tipe bukan Boole ke Booan. Jika kita hanya ingin menggunakan blok kode yang benar atau tidak benar, jika kita dapat mengubah sebuah ekspresi sebagai contoh 0, jika kita dapat mengubah kata tersebut:
tr: Hata, Kahire'nin, if ifadesinin bir koşulu olarak daha sonra kullanılmasına dayanarak bool tipini sayısı olarak tanımladığını gösterir. 3 değerinden bir bool bloğu oluşturmaya çalışır, ancak Kahire, bool harfini sayısal olmayan bir sözcükten çevirmek için bir bool'u otomatik olarak çalıştırmazsa - sadece true veya fal'ı kullanabilirsiniz.
zh_cn: 错误表明,开罗根据后来作为`如果'语句的一个条件使用`数字'来推断`数字'是`bool'的类型,它试图从`3'值中创建`bool',但开罗不支持从数字字句中即时使用`bool'——你只能使用`treal'或`false'来创建`bool'。与Ruby和JavaScript等语言不同,开罗不会自动尝试将非Boolean类型转换为Boolean。如果我们想要“if'代码块仅在数字不等于0时运行,例如,我们可以将表达方式改为:

source: "number was something other than zero"
es: "El número era algo más que cero"
fr: "Le nombre était autre chose que zéro"
id: "Nomor adalah sesuatu yang lain dari nol"
tr: "Sayı sıfırdan başka bir şeydi"
zh_cn: "数字不是零"

source: Running this code will print `number was something other than zero`.
es: Ejecutar este código imprimirá `número era algo más que cero`.
fr: Exécuter ce code va imprimer `numéro était quelque chose d'autre que zéro`.
id: Menjalankan kode ini akan mencetak nomor adalah sesuatu yang lain dari nol.
tr: Bu kodun çalıştırılması number'ı sıfır'dan başka bir şey olarak yazdıracaktır.
zh_cn: 运行此代码时将打印“ 数字不是零” 。

source: Handling Multiple Conditions with `else if`
es: Manejo de múltiples condiciones con `else if`
fr: Manipulation de plusieurs conditions avec `else if`
id: Menangani Beragam Kondisi dengan sel jika
tr: Birden fazla koşulu else if ile işlemek
zh_cn: 使用“else if ” 处理多个条件

source: You can use multiple conditions by combining `if` and `else` in an `else if` expression. For example:
es: Puede utilizar múltiples condiciones combinando `if` y `else` en una expresión `else if`. Por ejemplo:
fr: Vous pouvez utiliser plusieurs conditions en combinant `if` et `else` dans une expression `else if`. Par exemple:
id: Anda dapat menggunakan beberapa kondisi dengan menggabungkannya.
tr: if ve else'yi else if ifadesinde birleştirerek birden fazla koşul kullanabilirsiniz. Örneğin:
zh_cn: 您可以使用多个条件,将“如果”和“else”结合到“else if”表达式中。例如:

source: "number is 12"
es: "El número es 12"
fr: "le nombre est 12"
id: "Nomornya 12"
tr: "Numara 12"
zh_cn: "数字是12"

source: "number is 3"
es: "número es 3"
fr: "le nombre est 3"
id: "Nomor adalah 3"
tr: "Numara 3"
zh_cn: "数字是3"

source: "number minus 2 is 1"
es: "número menos 2 es 1"
fr: "le nombre moins 2 est 1"
id: "Nomor minus 2 adalah 1"
tr: "sayı eksi 2 eşittir 1"
zh_cn: "数字减2是1"

source: "number not found"
es: "número no encontrado"
fr: "nombre non trouvé"
id: "Nomor tidak ditemukan"
tr: "sayı bulunamadı"
zh_cn: "数量未找到"

source: This program has four possible paths it can take. After running it, you should see the following output:
es: Este programa tiene cuatro rutas posibles que puede tomar. Después de ejecutarlo, debe ver la siguiente salida:
fr: Ce programme a quatre chemins possibles qu'il peut prendre. Après l'avoir exécuté, vous devriez voir la sortie suivante:
id: Program ini memiliki empat kemungkinan jalan yang dapat diambil. Setelah menjalankannya, Anda harus melihat keluaran berikut:
tr: Bu programın alabileceği dört olası yolu vardır. Çalıştırdıktan sonra aşağıdaki çıktıyı görmelisiniz:
zh_cn: 此程序有四种可能的路径。 运行后, 您应该看到以下输出 :

source: When this program executes, it checks each `if` expression in turn and executes the first body for which the condition evaluates to `true`. Note that even though `number - 2 == 1` is `true`, we don’t see the output `number minus 2 is 1` nor do we see the `number not found` text from the `else` block. That’s because Cairo only executes the block for the first true condition, and once it finds one, it doesn’t even check the rest. Using too many `else if` expressions can clutter your code, so if you have more than one, you might want to refactor your code. [Chapter 6](./ch06-02-the-match-control-flow-construct.md) describes a powerful Cairo branching construct called `match` for these cases.
es: Cuando este programa se ejecuta, comprueba cada expresión `if` a su vez y ejecuta el primer cuerpo para el cual la condición se evalúa a `verdadero`. Tenga en cuenta que aunque `número - 2 == 1` es `verdadero`, no vemos la salida `número menos 2 es 1` ni vemos el texto `número no encontrado` del bloque `else`. Eso es porque El Cairo sólo ejecuta el bloque para la primera condición verdadera, y una vez que encuentra uno, ni siquiera comprueba el resto. Usando demasiados `else ` si'expresiones pueden desordenar su código, así que si usted tiene más de uno, es posible que desee refactorizar su código. [Capítulo 6](./ch06-02-the-match-control-flow-construct.md) describe una poderosa construcción ramificada de El Cairo llamada `match` para estos casos.
fr: Lorsque ce programme s'exécute, il vérifie chaque expression `if` à son tour et exécute le premier corps pour lequel la condition évalue à `true`. Notez que même si `number - 2 == 1` est `true`, nous ne voyons pas la sortie `number moins 2 est 1` ni le `number not found` text du bloc `else`. Cela parce que le Caire n'exécute que le bloc pour la première condition vraie, et une fois qu'il en trouve un, il ne vérifie même pas le reste. En utilisant trop d'expressions `else if` peut encombrer votre code, donc si vous en avez plus d'un, vous pourriez vouloir refactorer votre code. [Chapitre 6](./ch06-02-the-match-control-flow-construct.md) décrit une puissante construction de branchement du Caire appelée `match` pour ces cas.
id: Ketika program ini dijalankan, ia memeriksa setiap ekspresi di gilirannya dan mengeksekusi tubuh pertama yang dievaluasi ke blok ·else. Perlu dicatat bahwa meskipun nomor tersebut - 2 - 1 (1) benar-benar benar-benar adalah 1), kita tidak melihat keluaran -2 adalah 1) juga tidak melihat jumlah teks yang tidak ditemukan dalam blok ·else. Itu karena Kairo hanya menjalankan blok untuk kondisi yang benar, dan sekali ia menemukan satu, ia bahkan tidak memeriksa sisanya. menggunakan terlalu banyak ekspresi jika Anda tidak menemukan kode, sehingga Anda mungkin memiliki kode yang lebih dari satu, atau mungkin Anda ingin kode.
tr: Bu program çalıştırdığında, sırayla her if ifadesini kontrol eder ve koşulun true olarak değerlendirdiği ilk gövdeyi çalıştırır. number - 2 == 1 bir true olsa bile, number eksi 2 is 1 çıktısını görmeyiz ve else bloğundan gelen number bulunamadı metnini de görmeyiz. Bunun nedeni, Kahire'nin sadece ilk bloğu çalıştırıyor olmasıdır.
zh_cn: 当此程序执行时, 它会检查每个` 如果'的表达式, 并执行条件评估为` true'的第一个体。 请注意, 即使` 数字 - 2 = 1'是` true ', 我们看不到输出'数 - 2 = 1 ', 我们看不到` 数字 - 2 = 1 ', 也没有看到`else'区块的` 未找到'文字。 这是因为开罗仅在第一个真实状态下执行区块, 一旦找到区块, 它甚至不会检查其余部分。 使用太多的` ele 表示式, 如果` 表达式可以将您的代码打乱, 所以如果您有不止一个, 您可能想要重写您的代码 。 [ 第 6章] (./ ch06-02- the- match- control- construct. md) 描述这些情况下一个强大的开罗分支结构, 称为` match'。

source: Using `if` in a `let` Statement
es: Uso de `si` en una declaración `let`
fr: Utilisation de `si` dans une déclaration `let`
id: Menggunakan kata 'if' dalam sebuah 'erjanjian'.
tr: Bir let Bildiriminde if kullanımı
zh_cn: 在`let'语句中使用`if'

source: Because `if` is an expression, we can use it on the right side of a `let` statement to assign the outcome to a variable.
es: Dado que `if` es una expresión, podemos utilizarla en el lado derecho de una instrucción `let` para asignar el resultado a una variable.
fr: Parce que `si` est une expression, nous pouvons l'utiliser sur le côté droit d'une instruction `let` pour attribuer le résultat à une variable.
id: Karena jika itu ungkapan, kita bisa menggunakannya di sisi kanan dari pernyataan untuk menetapkan hasilnya pada variabel.
tr: if bir ifade olduğundan, sonucu bir değişkene atamak için let ifadesinin sağ tarafında kullanabiliriz.
zh_cn: 因为`如果'是一种表达方式,我们可以在`let'语句右侧使用它来将结果分配给变量。

source: "condition was true and number is {}"
es: "la condición era verdadera y el número es "
fr: "la condition était vraie et le nombre est {}"
id: "kondisi itu benar dan nomor adalah {}"
tr: "koşul doğruydu ve numara "
zh_cn: "条件是真实的,数字是..."

source: The `number` variable will be bound to a value based on the outcome of the `if` expression, which will be 5 here.
es: La variable " número " se vinculará a un valor basado en el resultado de la expresión " si ", que será 5 aquí.
fr: La variable `nombre` sera liée à une valeur basée sur le résultat de l'expression `si`, qui sera 5 ici.
id: Variabel bernomor akan terikat pada nilai berdasarkan hasil dari ekspresi irfa, yang akan menjadi 5 di sini.
tr: sayı değişkeni, burada 5 olacak olan if ifadesinin sonucuna göre bir değere bağlanacaktır.
zh_cn: `数字'变量将受基于`如果'表达式结果的数值的约束,此处为5。

source: Repetition with Loops
es: Repetición con Loops
fr: Répétition avec boucles
id: Pengulangan dengan Loops
tr: Loops ile tekrarlama
zh_cn: 与循环重复

source: It’s often useful to execute a block of code more than once. For this task, Cairo provides a simple loop syntax, which will run through the code inside the loop body to the end and then start immediately back at the beginning. To experiment with loops, let’s create a new project called _loops_.
es: A menudo es útil ejecutar un bloque de código más de una vez. Para esta tarea, El Cairo proporciona una sintaxis de bucle simple, que se ejecutará a través del código dentro del cuerpo de bucle hasta el final y luego empezar inmediatamente de nuevo al principio. Para experimentar con bucles, vamos a crear un nuevo proyecto llamado _loops_.
fr: Il est souvent utile d'exécuter un bloc de code plus d'une fois. Pour cette tâche, Le Caire fournit une syntaxe de boucle simple, qui va passer à travers le code à l'intérieur du corps de la boucle jusqu'à la fin et puis commencer immédiatement à revenir au début.
id: Untuk tugas ini, Kairo menyediakan sintaks loop sederhana, yang akan berjalan melalui kode dalam tubuh loop ke akhir dan kemudian mulai segera kembali di awal. Untuk bereksperimen dengan loop, biarkan mereka membuat proyek baru yang disebut _loops_.
tr: Bir kod bloğunu birden fazla kez çalıştırmak genellikle yararlıdır. Bu görev için Kahire, döngü gövdesinin içindeki koddan sonuna kadar çalışacak ve daha sonra hemen baştan başlayacak basit bir döngü sözdizimi sağlar. Döngüleri denemek için, _loops_ adlı yeni bir proje oluşturalım.
zh_cn: 多次执行一组代码往往有用。 对于这项任务,开罗提供了一个简单的循环语法, 它将在循环体内部运行到最后, 然后从头开始运行。 要尝试循环, 让我们创建一个名为 _loops_ 的新项目 。

source: Cairo has two kinds of loops: `loop` and `while`.
es: El Cairo tiene dos tipos de bucles: `loop` y `while`.
fr: Le Caire dispose de deux types de boucles : la boucle et le temps.
id: Kairo memiliki dua jenis loop: vulopé dan sementara itu.
tr: Kahire'nin iki tür döngüsü vardır: loop ve while.
zh_cn: 开罗有两种循环:`循环'和`同时'。

source: Repeating Code with `loop`
es: Código de repetición con `loop`
fr: Répéter le code avec `loop`
id: Kode Pengulangan dengan ortexloop
tr: Kod loop ile tekrarlanıyor
zh_cn: 使用 `loop' 重复代码
