Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The programming language used to write smart contracts varies depending on the blockchain. For example, on Ethereum and the [EVM-compatible ecosystem](https://ethereum.org/en/developers/docs/evm/), the most commonly used language is Solidity, while on Starknet, it is Cairo. The way the code is compiled also differs based on the blockchain. On Ethereum, Solidity is compiled into bytecode. On Starknet, Cairo is compiled into Sierra and then into Cairo Assembly (CASM).
es: El lenguaje de programación utilizado para escribir contratos inteligentes varía dependiendo de la cadena de bloques. Por ejemplo, en Ethereum y el [ecosistema compatible con EVM](https://ethereum.org/en/developers/docs/evm/), el lenguaje más utilizado es Solidity, mientras que en Starknet, es El Cairo. La forma en que se compila el código también difiere según la cadena de bloques. En Ethereum, Solidity se compila en bytecode. En Starknet, El Cairo se compila en Sierra y luego en El Cairo Assembly (CASM).
fr: Le langage de programmation utilisé pour écrire des contrats intelligents varie en fonction de la blockchain. Par exemple, sur Ethereum et l'écosystème compatible avec l'EVM (https://ethereum.org/fr/developers/docs/evm/), le langage le plus couramment utilisé est Solidity, tandis que sur Starknet, c'est le Caire. La façon dont le code est compilé diffère également sur la base de la blockchain. Sur Ethereum, Solidity est compilé en bytecode. Sur Starknet, Le Caire est compilé en Sierra, puis dans Cairo Assembly (CASM).
id: Bahasa pemrograman yang digunakan untuk menulis kontrak cerdas bervariasi tergantung pada rantai blok. Sebagai contoh, pada Ethereum dan [EVM-kosistem yang saling kompatibel] Nicohttps://etherum.org/en/develpers/docs/evm/), bahasa yang paling umum digunakan adalah Soliditas, sedangkan di Starknet, itu Kairo. Cara kode dikompilasi juga berbeda berdasarkan pada rantai blok. Pada Etherum, Solidity dikompilasi ke dalam bytecode. On Starknet, Cairo disusun ke Sierra dan kemudian ke dalam rangkaian Kairo (CAS).
tr: Akıllı sözleşmeler yazmak için kullanılan programlama dili, blok zincirine bağlı olarak değişir. Örneğin, Ethereum ve [EVM uyumlu ekosistem] (https://ethereum.org/en/developers/docs/evm/), en yaygın kullanılan dil Solidity, Starknet'te ise Kahire'dir. Kodun derlenme şekli de blok zincirine göre değişir. Ethereum'da Solidity bytecode'a derlenir ve Kahire'ye derlenir.
zh_cn: 用于撰写智能合同的编程语言因链条而异。例如,在Etherem和[EVM-兼容生态系统](https://etherum.org/en/developmenters/docs/evm/)上,最常用的语言是Solidity,而在Starknet上,则是Casknet,是开罗。代码的编纂方式也因链条而异。在Ethereum上,Solidiity被编成字码。在Starknet上,开罗被编成Sierra,然后被编成开罗大会(CASM)。

source: Smart contracts possess several unique characteristics. They are **permissionless**, meaning anyone can deploy a smart contract on the network (within the context of a decentralized blockchain, of course). Smart contracts are also **transparent**; the data stored by the smart contract is accessible to anyone. The code that composes the contract can also be transparent, enabling **composability**. This allows developers to write smart contracts that use other smart contracts. Smart contracts can only access and interact with data from the blockchain they are deployed on. They require third-party software (called _oracles_) to access external data (the price of a token for instance).
es: Los contratos inteligentes poseen varias características únicas. Son **permissionless**, lo que significa que cualquier persona puede implementar un contrato inteligente en la red (en el contexto de una cadena de bloques descentralizada, por supuesto). Los contratos inteligentes también son **transparentes**; los datos almacenados por el contrato inteligente son accesibles para cualquier persona. El código que compone el contrato también puede ser transparente, permitiendo **composability**. Esto permite a los desarrolladores escribir contratos inteligentes que utilizan otros contratos inteligentes. Los contratos inteligentes sólo pueden acceder e interactuar con los datos de la cadena de bloques en que se despliegan. Requieren software de terceros (llamado _oráculos_) para acceder a datos externos (el precio de un símbolo, por ejemplo).
fr: Les contrats intelligents possèdent plusieurs caractéristiques uniques : **permissionless**, c'est-à-dire que chacun peut déployer un contrat intelligent sur le réseau (dans le cadre d'une blockchain décentralisée, bien sûr). Les contrats intelligents sont également **transparents**; les données stockées par le contrat intelligent sont accessibles à n'importe qui. Le code qui compose le contrat peut également être transparent, permettant **composabilité**. Cela permet aux développeurs d'écrire des contrats intelligents qui utilisent d'autres contrats intelligents. Les contrats intelligents ne peuvent accéder et interagir avec les données de la blockchain sur laquelle ils sont déployés. Ils nécessitent un logiciel tiers (appelé _oracles_) pour accéder à des données externes (le prix d'un jeton par exemple).
id: Kontrak cerdas memiliki beberapa karakteristik unik. Kontrak cerdas juga **transparan**; data yang disimpan oleh kontrak cerdas dapat diakses oleh siapapun. Kode yang menyusun kontrak dapat juga transparan, mengaktifkan **komposabilitas**. Hal ini memungkinkan pengembang untuk menulis kontrak cerdas yang menggunakan kontrak cerdas. Kontrak cerdas hanya dapat diakses dan berinteraksi dengan jaringan data yang dijalankan. Mereka memerlukan perangkat lunak ketiga (yang disebut _ortal_s) akses ke eksternal.
tr: Akıllı sözleşmeler birkaç benzersiz özelliğe sahiptir. ** izinsiz **, yani herkes ağ üzerinde akıllı bir sözleşme yapabilir (merkezsiz bir blok zinciri bağlamında, tabii ki). Akıllı sözleşmeler de ** şeffaf **; Akıllı sözleşme tarafından depolanan veriler herkes tarafından erişilebilir. Sözleşmeyi oluşturan kod ayrıca şeffaf olabilir, üçüncü bir yazılıma olanak tanır. Bu, geliştiricilerin diğer akıllı sözleşmeleri kullanan akıllı sözleşmeler yazmalarına izin verir. Akıllı sözleşmeler yalnızca blok zincirine erişebilir ve etkileşime girebilir.
zh_cn: 智能合同具有几个独特的特点。 它们具有** 不可允许**, 意思是任何人都可以在网络上部署智能合同(当然是指在分散的链条范围内)。 智能合同也是** 透明** ; 智能合同所储存的数据可供任何人查阅。 构成合同的代码也可以是透明的, 使得** 兼容性** 。 这使得开发商能够撰写使用其他智能合同的智能合同。 智能合同只能访问和与所部署的链条的数据互动, 需要第三方软件( 称为 oracless_ ) 才能访问外部数据( 例如象征性价格 ) 。

source: For developers to build smart contracts that can interact with each other, it is required to know what the other contracts look like. Hence, Ethereum developers started to build standards for smart contract development, the `ERCxx`. The two most used and famous standards are the `ERC20`, used to build tokens like `USDC`, `DAI` or `STARK`, and the `ERC721`, for NFTs (Non-Fungible Tokens) like `CryptoPunks` or `Everai`.
es: Para que los desarrolladores creen contratos inteligentes que puedan interactuar entre sí, es necesario saber cómo son los demás contratos. Por consiguiente, los desarrolladores de Ethereum comenzaron a elaborar normas para el desarrollo de contratos inteligentes, el `ERCxx`. Las dos normas más utilizadas y famosas son las `ERC20`, que se utilizan para construir fichas como `USDC`, `DAI` o `STARK`, y el `ERC721`, para las NFT (Tokens no fungibles) como `CryptoPunks` o `Everai`.
fr: Pour les développeurs de construire des contrats intelligents qui peuvent interagir entre eux, il est nécessaire de savoir à quoi ressemblent les autres contrats. Par conséquent, les développeurs Ethereum ont commencé à construire des normes pour le développement de contrats intelligents, le `ERCxx`. Les deux normes les plus utilisées et célèbres sont le `ERC20`, utilisé pour construire des jetons comme `USDC`, `DAI` ou `STARK`, et le `ERC721`, pour les jetons NFT (non fongibles) comme `CryptoPunks` ou `Everai`.
id: Untuk pengembang membangun kontrak cerdas yang dapat berinteraksi satu sama lain, dibutuhkan untuk mengetahui seperti apa kontrak lainnya. Oleh karena itu, para pengembang Etherem mulai membangun standar untuk pengembangan kontrak cerdas, yang ÁERCxx--. Dua standar yang paling sering digunakan dan terkenal adalah yang digunakan dan terkenal adalah yang digunakan untuk membangun token seperti ÁUSDCER, ÁDAI atau ÁRK (C721, untuk NFT) seperti NFT (No-Fungible Toungble Token) atau Erai.
tr: Geliştiricilerin birbirleriyle etkileşime girebilecek akıllı sözleşmeler oluşturmaları için, diğer sözleşmelerin neye benzediğini bilmeleri gerekir. Bu nedenle, Ethereum geliştiricileri akıllı sözleşme geliştirme için standartlar oluşturmaya başladı, ERCxx. En çok kullanılan ve ünlü iki standart, USDC, DAI veya STARK gibi belirteçleri oluşturmak için kullanılan ERC20'dir.
zh_cn: 开发商要建立能够相互互动的智能合同,就必须了解其他合同的长相,因此,Etheroum开发商开始为智能合同的开发制定标准,即`ERCxx ',最常用和最著名的两个标准是`ERC20 ',用于制造“USCC”、“DAI”或`STARK'等标牌,以及“ERC721”,用于NFTs(非可爆 Tokens),如`CryptoPunks'或`Everai'。

source: Use Cases
es: Casos de uso
fr: Cas d'utilisation
id: Gunakan Kasus
tr: Vakaları Kullan
zh_cn: 使用案例

source: There are many possible use cases for smart contracts. The only limits are the technical constraints of the blockchain and the creativity of developers.
es: Hay muchos casos de uso posible para los contratos inteligentes. Los únicos límites son las limitaciones técnicas de la cadena de bloques y la creatividad de los desarrolladores.
fr: Il existe de nombreux cas d'utilisation possibles pour les contrats intelligents. Les seules limites sont les contraintes techniques de la blockchain et la créativité des développeurs.
id: Ada banyak kasus yang mungkin digunakan untuk kontrak cerdas. hanya batasan teknis dari rantai blok dan kreativitas pengembang.
tr: Akıllı sözleşmeler için birçok olası kullanım durumu vardır. Tek sınırlar, blok zincirinin teknik kısıtlamaları ve geliştiricilerin yaratıcılığıdır.
zh_cn: 智能合同有许多可能的使用案例,唯一的限制是链条的技术限制和开发商的创造力。

source: DeFi
fr: Défi
zh_cn: DeFi DeFi 开发

source: For now, the principal use case for smart contracts is similar to that of Ethereum or Bitcoin, which is essentially handling money. In the context of the alternative payment system promised by Bitcoin, smart contracts on Ethereum enable the creation of decentralized financial applications that no longer rely on traditional financial intermediaries. This is what we call DeFi (decentralized finance). DeFi consists of various projects such as lending/borrowing applications, decentralized exchanges (DEX), on-chain derivatives, stablecoins, decentralized hedge funds, insurance, and many more.
es: Por el momento, el principal caso de uso de los contratos inteligentes es similar al de Ethereum o Bitcoin, que esencialmente está manejando dinero. En el contexto del sistema de pago alternativo prometido por Bitcoin, los contratos inteligentes de Ethereum permiten la creación de aplicaciones financieras descentralizadas que ya no dependen de intermediarios financieros tradicionales. Esto es lo que llamamos DeFi (financiación descentralizada). DeFi consiste en varios proyectos tales como solicitudes de préstamos/préstamos, bolsas descentralizadas (DEX), derivados en cadena, monedas estables, fondos de cobertura descentralizados, seguros, y muchos más.
fr: Pour l'instant, le principal cas d'utilisation pour les contrats intelligents est similaire à celui d'Ethereum ou Bitcoin, qui est essentiellement la gestion de l'argent. Dans le contexte du système de paiement alternatif promis par Bitcoin, les contrats intelligents sur Ethereum permettent la création d'applications financières décentralisées qui ne dépendent plus des intermédiaires financiers traditionnels. C'est ce que nous appelons DeFi (finance décentralisée).
id: Untuk saat ini, kasus dasar untuk kontrak cerdas sama dengan kontrak Ethereum atau Bitcoin, yang pada dasarnya menangani uang. dalam konteks sistem pembayaran alternatif yang dijanjikan oleh Bitcoin, kontrak cerdas di Etherum memungkinkan pembuatan aplikasi keuangan terdesentralisasi yang tidak lagi bergantung pada perantara keuangan tradisional. Inilah yang kita sebut DeFi (konsentrasi keuangan terderalisasi). DeFi terdiri dari berbagai proyek seperti pinjaman/borrowing aplikasi, destrolisasi (DEX), pada turunan turunan, stabilitas stabil, penetapan yang layak, dana asuransi, dan lebih banyak lagi.
tr: Şimdilik, akıllı sözleşmeler için ana kullanım durumu, esasen parayı ele alan Ethereum veya Bitcoin'inkine benzer. Bitcoin tarafından vaat edilen alternatif ödeme sistemi bağlamında, Ethereum'daki akıllı sözleşmeler, artık geleneksel finansal aracılara dayanmayan merkezi olmayan finansal uygulamaların oluşturulmasını sağlar. DeFi (merkezsizleştirilmiş finans) dediğimiz şey budur. DeFi, borç verme / borç verme uygulamaları, merkezi olmayan borsalar (DEX), zincirli türevler, sabit paralar gibi çeşitli projelerden oluşur.
zh_cn: 目前,智能合同的主要用途与Etheum或Bitcoin相似,后者主要处理资金问题,在Bitcoin承诺的替代支付制度下,Eceenum的智能合同使分散的金融应用程序得以创建,不再依赖传统的金融中介机构。 这就是我们所谓的DEFi(分散化金融 ) 。 DeFi(分散化金融 ), 包括各种项目,如贷款/借款应用程序、分散化交易所(DEX ) 、 链上衍生物、 稳定库、 分散化对冲基金、 保险等等。

source: Tokenization
es: Tokenización
fr: Tokenisation
id: Tokenisasi
tr: Tokenizasyon
zh_cn: 当当当化

source: Smart contracts can facilitate the tokenization of real-world assets, such as real estate, art, or precious metals. Tokenization divides an asset into digital tokens, which can be easily traded and managed on blockchain platforms. This can increase liquidity, enable fractional ownership, and simplify the buying and selling process.
es: Los contratos inteligentes pueden facilitar la tokenización de activos del mundo real, como bienes raíces, arte o metales preciosos. La tokenización divide un activo en fichas digitales, que se pueden negociar y gestionar fácilmente en plataformas de blockchain. Esto puede aumentar la liquidez, permitir la propiedad fraccionada y simplificar el proceso de compra y venta.
fr: Les contrats intelligents peuvent faciliter la tokenisation des actifs du monde réel, tels que l'immobilier, l'art ou les métaux précieux. La tokenisation divise un actif en jetons numériques, qui peuvent être facilement échangés et gérés sur des plateformes blockchain. Cela peut augmenter la liquidité, permettre la propriété fractionnelle, et simplifier le processus d'achat et de vente.
id: Kontrak cerdas dapat memfasilitasi tokenisasi aset dunia nyata, seperti real estate, seni, atau logam berharga.
tr: Akıllı sözleşmeler, gayrimenkul, sanat veya değerli metaller gibi gerçek dünya varlıklarının tokenizasyonunu kolaylaştırabilir. Tokenizasyon, bir varlığı blok zinciri platformlarında kolayca takas edilebilen ve yönetilebilen dijital tokenlere böler. Bu, likiditeyi artırabilir, kesirli mülkiyeti etkinleştirebilir ve satın alma ve satma sürecini basitleştirebilir.
zh_cn: 智能合同可以促进房地产、艺术品或贵金属等真实世界资产象征性化。 化石化将资产分成数字标牌,在铁链平台上交易和管理容易。 这可以增加流动性,实现分数所有权,并简化买卖过程。

source: Voting
es: Votación
fr: Vote
tr: Oylama
zh_cn: 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决 表决表决 表决表决表决表决 表决 表决表决表决表决表决 表决表决表决表决表决 表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决表决

source: Smart contracts can be used to create secure and transparent voting systems. Votes can be recorded on the blockchain, ensuring immutability and transparency. The smart contract can then automatically tally the votes and declare the results, minimizing the potential for fraud or manipulation.
es: Los contratos inteligentes se pueden utilizar para crear sistemas de votación seguros y transparentes. Los votos se pueden registrar en la cadena de bloques, garantizando la inmutabilidad y la transparencia. El contrato inteligente puede entonces contar automáticamente los votos y declarar los resultados, minimizando el potencial de fraude o manipulación.
fr: Les contrats intelligents peuvent être utilisés pour créer des systèmes de vote sécurisés et transparents. Les votes peuvent être enregistrés sur la blockchain, assurant l'immutabilité et la transparence. Le contrat intelligent peut ensuite automatiquement compter les votes et déclarer les résultats, minimisant ainsi le potentiel de fraude ou de manipulation.
id: Kontrak cerdas dapat digunakan untuk menciptakan sistem suara yang aman dan transparan. pilihan dapat direkam pada rantai blok, memastikan immutability dan transparansi. kontrak cerdas kemudian secara otomatis dapat menghitung suara dan menyatakan hasil, meminimalkan potensi untuk penipuan atau manipulasi.
tr: Akıllı sözleşmeler güvenli ve şeffaf oylama sistemleri oluşturmak için kullanılabilir. Oylar blok zincirine kaydedilebilir, değişmezlik ve şeffaflık sağlanabilir. Akıllı sözleşme daha sonra oyları otomatik olarak sıralayabilir ve sonuçları ilan edebilir, dolandırıcılık veya manipülasyon potansiyelini en aza indirebilir.
zh_cn: 智能合同可以用来创建安全和透明的投票系统。 选票可以记录在块链上,确保不可改变性和透明度。 智能合同可以自动计票并宣布结果,最大限度地降低欺诈或操纵的可能性。

source: Royalties
es: Derechos de autor
fr: Redevances
id: Royalti
zh_cn: 版费

source: Smart contracts can automate royalty payments for artists, musicians, and other content creators. When a piece of content is consumed or sold, the smart contract can automatically calculate and distribute the royalties to the rightful owners, ensuring fair compensation and reducing the need for intermediaries.
es: Los contratos inteligentes pueden automatizar los pagos de regalías para artistas, músicos y otros creadores de contenido. Cuando un contenido se consume o vende, el contrato inteligente puede calcular y distribuir automáticamente las regalías a los propietarios legítimos, garantizando una compensación justa y reduciendo la necesidad de intermediarios.
fr: Les contrats intelligents peuvent automatiser les paiements de redevances pour les artistes, musiciens et autres créateurs de contenu. Lorsqu'un contenu est consommé ou vendu, le contrat intelligent peut calculer et distribuer automatiquement les redevances aux propriétaires légitimes, en assurant une compensation équitable et en réduisant le besoin d'intermédiaires.
id: Kontrak cerdas dapat mengatur pembayaran royalti untuk seniman, musisi, dan pembuat konten lainnya. ketika sebuah konten dikonsumsi atau dijual, kontrak cerdas dapat secara otomatis menghitung dan mendistribusikan royalti kepada pemilik yang sah, memastikan kompensasi yang adil dan mengurangi kebutuhan perantara.
tr: Akıllı sözleşmeler sanatçılar, müzisyenler ve diğer içerik oluşturucular için telif ödemelerini otomatikleştirebilir. Bir içerik parçası tüketildiğinde veya satıldığında, akıllı sözleşme telif haklarını otomatik olarak doğru sahiplerine hesaplayabilir ve dağıtabilir, adil bir tazminat sağlar ve aracılara olan ihtiyacı azaltır.
zh_cn: 智能合同可以自动为艺术家、音乐家和其他内容创作者支付使用费。 当某部分内容被消费或出售时,智能合同可以自动计算并向合法所有者分配使用费,确保公平补偿并减少对中介的需求。

source: Decentralized Identities DIDs
es: IDENTIDADES DESCENTRALIZADAS
fr: DID sur les identités décentralisées
id: Identitas yang decentralisasi
tr: Merkezi Olmayan Kimlikler DID'ler
zh_cn: D. 分散的公有实体

source: Smart contracts can be used to create and manage digital identities, allowing individuals to control their personal information and share it with third parties securely. The smart contract could verify the authenticity of a user's identity and automatically grant or revoke access to specific services based on the user's credentials.
es: Los contratos inteligentes se pueden utilizar para crear y gestionar identidades digitales, permitiendo a las personas controlar su información personal y compartirla con terceros de forma segura.El contrato inteligente podría verificar la autenticidad de la identidad de un usuario y conceder o revocar automáticamente el acceso a servicios específicos basados en las credenciales del usuario.
fr: Les contrats intelligents peuvent être utilisés pour créer et gérer des identités numériques, permettant aux personnes de contrôler leurs informations personnelles et de les partager en toute sécurité avec des tiers. Le contrat intelligent pourrait vérifier l'authenticité de l'identité d'un utilisateur et accorder ou révoquer automatiquement l'accès à des services spécifiques en fonction des références de l'utilisateur.
id: Kontrak cerdas dapat digunakan untuk menciptakan dan mengelola identitas digital, memungkinkan individu untuk mengontrol informasi pribadi mereka dan berbagi dengan pihak ketiga dengan aman. Kontrak cerdas dapat memverifikasi keaslian identitas pengguna dan secara otomatis memberikan atau mencabut akses ke layanan spesifik berdasarkan kredensial pengguna.
tr: Akıllı sözleşmeler, dijital kimlikleri oluşturmak ve yönetmek için kullanılabilir ve bireylerin kişisel bilgilerini kontrol etmelerine ve üçüncü taraflarla güvenli bir şekilde paylaşmalarına olanak tanır. Akıllı sözleşme, bir kullanıcının kimliğinin doğruluğunu doğrulayabilir ve kullanıcının kimlik bilgilerine dayanarak belirli hizmetlere otomatik olarak erişim sağlayabilir veya iptal edebilir.
zh_cn: 智能合同可用于创建和管理数字身份,使个人能够控制个人信息并安全地与第三方共享信息,智能合同可以核实用户身份的真实性,并根据用户的资质自动给予或取消获取特定服务的机会。

source: The Rise of Starknet and Cairo
es: El ascenso de Starknet y El Cairo
fr: La montée de Starknet et du Caire
id: Naiknya Starknet dan Kairo
tr: Starknet ve Kahire'nin Yükselişi
zh_cn: 斯塔克内特和开罗的崛起
