Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Though we didn’t call them as such at the time, we’ve already encountered a few smart pointers in this book, including `Felt252Dict<T>` and `Array<T>` in Chapter 3. Both these types count as smart pointers because they own a memory segment and allow you to manipulate it. They also have metadata and extra capabilities or guarantees. Arrays keep track of their current length to ensure that existing elements are not overwritten, and that new elements are only appended to the end.
es: Aunque no los llamábamos como tales en ese momento, ya nos hemos encontrado con algunos punteros inteligentes en este libro, incluyendo `Felt252Dict<T® y `Array<T® en el capítulo 3. Ambos tipos cuentan como punteros inteligentes porque poseen un segmento de memoria y le permiten manipularlo. También tienen metadatos y capacidades adicionales o garantías. Las matrices mantienen un registro de su longitud actual para asegurarse de que los elementos existentes no están sobrescritos, y que los nuevos elementos sólo se adjuntan al final.
fr: Bien que nous ne les ayons pas appelés comme tels à l'époque, nous avons déjà rencontré quelques pointeurs intelligents dans ce livre, y compris `Felt252Dict<T>` et `Array<T>` dans le chapitre 3. Ces deux types comptent comme pointeurs intelligents parce qu'ils possèdent un segment de mémoire et vous permettent de le manipuler. Ils ont également des métadonnées et des capacités ou des garanties supplémentaires.
id: Meskipun kami tidak memanggil mereka seperti pada saat itu, kami telah menemukan beberapa pointer cerdas dalam buku ini, termasuk ▪Felt252Dict<T> dan ÉArray<T> dalam Bab 3. Kedua tipe ini sudah ditemukan sebagai penunjuk cerdas karena mereka memiliki segmen memori dan memungkinkan Anda untuk memanipulasinya. Mereka juga memiliki metadata dan kemampuan ekstra atau jaminan. Array menyimpan panjang mereka saat ini untuk memastikan bahwa elemen yang ada tidak overwrittented, dan bahwa elemen baru hanya appendedededed sampai akhir.
tr: Her ne kadar o zamanlar onları böyle çağırmamış olsak da, bu kitapta Felt252DictT> ve ArrayT> 3. Bölümde de dahil olmak üzere birkaç akıllı işaretçiyle karşılaştık. Her iki tip de bir bellek segmentine sahip oldukları için akıllı işaretçiler olarak sayılır ve bunu manipüle etmenize izin verir. Ayrıca meta veriler ve ekstra yetenekler veya garantiler de vardır. Diziler, mevcut öğelerin üzerinde yazılmamasını sağlamak için mevcut uzunluklarını takip eder.
zh_cn: 虽然我们当时没有这样称呼它们,但我们在这本书中已经遇到过几个聪明的指针,包括第3章中的“Felt252Dict<T”和“Array<T”。 这两种类型都算作智能指针,因为它们拥有一个内存部分并允许你操纵它。它们也有元数据和额外能力或保证。 阵列跟踪它们的当前长度,以确保现有元素不被覆盖,新元素仅附在结尾处。

source: The Cairo VM memory is composed by multiple segments that can store data, each identified by a unique index. When you create an array, you allocate a new segment in the memory to store the future elements. The array itself is just a pointer to that segment where the elements are stored.
es: La memoria VM de El Cairo está compuesta por varios segmentos que pueden almacenar datos, cada uno identificado por un índice único. Cuando crea una matriz, asigna un segmento nuevo en la memoria para almacenar los elementos futuros. La matriz en sí es sólo un puntero a ese segmento donde se almacenan los elementos.
fr: La mémoire Cairo VM est composée de plusieurs segments qui peuvent stocker des données, chacune identifiée par un index unique. Lorsque vous créez un tableau, vous attribuez un nouveau segment dans la mémoire pour stocker les éléments futurs. Le tableau lui-même n'est qu'un pointeur vers ce segment où les éléments sont stockés.
id: Memori VM Kairo disusun oleh beberapa segmen yang dapat menyimpan data, masing-masing diidentifikasi oleh indeks unik. Ketika Anda membuat sebuah array, Anda mengalokasikan segmen baru dalam memori untuk menyimpan elemen di masa depan. Array itu sendiri hanya sebuah penunjuk ke segmen di mana elemen disimpan.
tr: Kahire VM belleği, her biri benzersiz bir endeksle tanımlanan verileri depolayabilen birden fazla segmentten oluşur. Bir dizi oluşturduğunuzda, gelecekteki öğeleri saklamak için bellekte yeni bir segment tahsis edersiniz. Dizinin kendisi, öğelerin depolandığı o segmente sadece bir işaretçidir.
zh_cn: 开罗 VM 内存由多个区块组成,这些区块可以存储数据,每个区块由独特的索引识别。当您创建一个数组时,在内存中分配一个新的区块以存储未来元素。数组本身只是存储元素的该区块的指针。

source: The `Box<T>` Type to Manipulate Pointers
es: El `Box<T® Tipo para manipular punteros
fr: Le type `Box<T>` pour manipuler les pointeurs
id: Tipe Pengunjuk Manipulasi Kotak<T>
tr: BoxT> İşaretçileri Manipüle Etme Türü
zh_cn: 调控指针的“ ox< T} 类型”

source: The principal smart pointer type in Cairo is a _box_, denoted as `Box<T>`. Manually defining boxes allow you to store data in a specific memory segment of the Cairo VM called the _boxed segment_. This segment is dedicated to store all boxed values, and what remains in the execution segment is only a pointer to the boxed segment. Whenever you instantiate a new pointer variable of type `Box<T>`, you append the data of type `T` to the boxed segment.
es: El tipo de puntero inteligente principal en El Cairo es un _box_, denotado como `Box<T®. Los cuadros que definen manualmente le permiten almacenar datos en un segmento de memoria específico de la VM de El Cairo llamado el segmento _boxed_. Este segmento se dedica a almacenar todos los valores en caja, y lo que queda en el segmento de ejecución es sólo un puntero al segmento en caja. Siempre que se instale una nueva variable de puntero de tipo `Box<T®, se agregan los datos del tipo `T` al segmento en caja.
fr: Le principal type de pointeur intelligent au Caire est un _box_, désigné comme `Box<T>`. La définition manuelle des boîtes vous permet de stocker des données dans un segment de mémoire spécifique de la VM du Caire appelé le segment _boxed_. Ce segment est dédié à stocker toutes les valeurs boxed, et ce qui reste dans le segment d'exécution n'est qu'un pointeur vers le segment boxed. Chaque fois que vous mettez en place une nouvelle variable de pointeur de type `Box<T>`, vous ajoutez les données de type `T` au segment boxed.
id: Tipe penunjuk cerdas utama di Kairo adalah sebuah _boxed segmen_. Segmen ini didedikasikan untuk menyimpan semua nilai kotak<T>. Secara manual mendefinisikan kotak-kotak untuk menyimpan data dalam segmen memori spesifik dari Kairo VM yang disebut segmen _boxed_. segmen ini didedikasikan untuk menyimpan semua nilai kotak, dan apa yang tersisa dalam segmen eksekusi hanya pointer ke segmen boxed. Ketika Anda instantiate sebuah variabel poiner tipe baru --Box<T>, Anda menambahkan data tipe °T ke segmen box.
tr: Kahire'deki ana akıllı işaretçi türü, BoxT> olarak gösterilen bir _box_'dir. Manuel olarak tanımlayan kutular, verileri Kahire VM'nin _boxed segmenti_ olarak adlandırılan belirli bir bellek segmentinde saklamanıza izin verir. Bu segment, tüm kutulu değerleri depolamaya adanmıştır ve yürütme segmentinde kalan şey, kutulu segmente yalnızca bir işaretçidir. Ne zaman BoxT tipinde yeni bir işaretçik değişkeni hazırlasanız, BoxT>
zh_cn: 开罗的主要智能指针类型为 _box_, 称为“ Box< T ” 。 手定义框允许您将数据存储于开罗 VM 中名为 _boxed 段的特定内存部分中。 此部分专门用于存储所有框中值, 执行部分中保留的数据仅是框中段的指针。 每当您将“ Box< T ” 类型中的新指针变量立即添加到框中段中, 您就会将“ T” 类型中的数据附加到框中段中 。

source: Boxes have very little performance overhead, other than writing their inner values to the boxed segment. But they don’t have many extra capabilities either. You’ll use them most often in these situations:
es: Las cajas tienen muy poco rendimiento por encima, aparte de escribir sus valores internos en el segmento de cajas. Pero tampoco tienen muchas capacidades adicionales. Las usarás con más frecuencia en estas situaciones:
fr: Les boîtes ont très peu de frais généraux de performance, autres que d'écrire leurs valeurs intérieures au segment encadré. Mais elles n'ont pas beaucoup de capacités supplémentaires non plus. Vous les utiliserez le plus souvent dans ces situations:
id: Kotak memiliki kinerja yang sangat sedikit di atas kepala, selain menulis nilai-nilai batin mereka ke segmen kotak. tapi mereka tidak memiliki banyak kemampuan ekstra baik. kamu akan menggunakannya paling sering dalam situasi ini:
tr: Kutular, iç değerlerini kutulu segmente yazmaktan başka çok az performans yüküne sahiptir. Ancak çok fazla ekstra kapasiteye de sahip değiller. Bunları en sık bu durumlarda kullanacaksınız:
zh_cn: 框中除了将内值写到框框段外,没有多少性能管理。 但是它们也没有很多额外能力。 在这样的情况下,你会最经常地使用它们:

source: When you have a type whose size can’t be known at compile time and you want to use a value of that type in a context that requires an exact size
es: Cuando usted tiene un tipo cuyo tamaño no puede ser conocido en tiempo de compilación y desea utilizar un valor de ese tipo en un contexto que requiere un tamaño exacto
fr: Lorsque vous avez un type dont la taille ne peut pas être connue au moment de la compilation et que vous voulez utiliser une valeur de ce type dans un contexte qui nécessite une taille exacte
id: Bila Anda memiliki tipe yang ukurannya tidak dapat diketahui pada waktu kompilasi dan Anda ingin menggunakan nilai dari jenis itu dalam konteks yang memerlukan ukuran yang tepat
tr: Derleme zamanında boyutu bilinemeyen bir türe sahip olduğunuzda ve bu tür bir değeri tam bir boyut gerektiren bir bağlamda kullanmak istediğinizde
zh_cn: 当您拥有一种类型, 其大小无法在编译时间得知时, 您想要在需要精确大小的上下文中使用该类型的值时

source: When you have a large amount of data and you want to transfer ownership but ensure the data won’t be copied when you do so
es: Cuando usted tiene una gran cantidad de datos y desea transferir la propiedad, pero asegúrese de que los datos no serán copiados cuando lo haga
fr: Lorsque vous avez une grande quantité de données et que vous voulez transférer la propriété, mais assurez-vous que les données ne seront pas copiées lorsque vous le faites
id: Bila Anda memiliki sejumlah besar data dan Anda ingin mentransfer kepemilikan tapi pastikan data tersebut tidak akan disalin ketika Anda melakukannya
tr: Büyük miktarda veriniz olduğunda ve sahipliği aktarmak istediğinizde, ancak bunu yaptığınızda verilerin kopyalanmayacağından emin olun.
zh_cn: 当您拥有大量数据并且想要转让所有权,但当您想要转移所有权时,您要确保当数据被复制时数据不会被复制

source: We’ll demonstrate the first situation in the [“Enabling Recursive Types with Boxes”](./ch11-02-smart-pointers.md#enabling-recursive-types-with-nullable-boxes) section. In the second case, transferring ownership of a large amount of data can take a long time because the data is copied around in memory. To improve performance in this situation, we can store the large amount of data in the boxed segment using a box type. Then, only the small amount of pointer data is copied around in memory, while the data it references stays in one place on the boxed segment.
es: Demostraremos la primera situación en la sección [“Enabling Recursive Types with Boxes”](./ch11-02-smart-pointers.md#enabling-recursive-types-with-nullable-boxes). En el segundo caso, transferir la propiedad de una gran cantidad de datos puede tomar mucho tiempo porque los datos se copian en memoria. Para mejorar el rendimiento en esta situación, podemos almacenar la gran cantidad de datos en el segmento en caja utilizando un tipo de caja. Entonces, sólo la pequeña cantidad de datos de puntero se copia en memoria, mientras que los datos que hace referencia permanecen en un lugar en el segmento en caja.
fr: Dans le second cas, le transfert de la propriété d'une grande quantité de données peut prendre beaucoup de temps parce que les données sont copiées autour de la mémoire. Pour améliorer les performances dans cette situation, nous pouvons stocker la grande quantité de données dans le segment encadré à l'aide d'un type de boîte. Ensuite, seule la petite quantité de données de pointeur est copiée autour de la mémoire, tandis que les données qu'il renvoie restent en un seul endroit sur le segment encadré.
id: Kami akan mendemonstrasikan situasi pertama dalam bagian "Recursive Types" dengan Boxes]--ch11-02-smart-pointers.md#nabling-recursive-types-with-nullable-boxes). Dalam kasus kedua, mentransfer kepemilikan sejumlah besar data dapat memakan waktu lama karena data disalin di sekitar memori. Untuk memperbaiki kinerja dalam situasi ini, kita dapat menyimpan banyak data dalam kotak menggunakan tipe kotak. Kemudian, hanya jumlah kecil poin data yang disalin di sekitar memori, sementara data tetap di satu tempat di kotak.
tr: ["Kutularla Özyinelemeli Tipleri Etkinleştirmek"] bölümündeki ilk durumu göstereceğiz.(./ch11-02-smart-pointers.md#enabling-recursive-types-with-nullable-boxes] bölümünde. İkinci durumda, büyük miktarda verinin mülkiyeti bellek etrafında kopyalandığı için, büyük veri miktarını saklayabiliriz.
zh_cn: 我们将展示第一种情形,即[“用盒子帮助递归类型 ” (./ch11-02-智能点 。 md#ed#enbling-recurive-type- with-nellable-boxes) 部分。在第二种情况下,大量数据的所有权转移需要很长时间,因为数据在记忆中被复制。在这种情形下,为了改进性能,我们可以使用盒式类型将大量数据存储在框式部分中。然后,只有少量的指针数据被复制到记忆中,而它提到的数据则留在框式部分的一个地方。

source: Using a `Box<T>` to Store Data in the Boxed Segment
es: Usar un `Box<T® para almacenar datos en el segmento de caja
fr: Utiliser une `Box<T>` pour stocker des données dans le segment encadré
id: Menggunakan <T> Kotak ke Simpan Data dalam Segmen Berkotak
tr: BoxT> Veriyi Kutulu Segmentte Saklamak için
zh_cn: 使用 `Box<T} 将数据存储在框框片段

source: Before we discuss the boxed segment storage use cases for `Box<T>`, we’ll cover the syntax and how to interact with values stored within a `Box<T>`.
es: Antes de hablar de los casos de almacenamiento de segmentos en cajas para `Box<TÃ3, cubriremos la sintaxis y la forma de interactuar con los valores almacenados en un `Box<TÃ3.
fr: Avant de discuter des cas d'utilisation de stockage de segment encadré pour `Box<T>`, nous allons couvrir la syntaxe et comment interagir avec les valeurs stockées dans une `Box<T>`.
id: Sebelum kita membahas kotak penyimpanan menggunakan kasus-kasus untuk menggunakan kotak untuk kotak<T>, kita akan menutupi sintaks dan bagaimana berinteraksi dengan nilai-nilai yang tersimpan dalam sebuah kotak<T>.
tr: BoxT> için kutulu segment depolama kullanım durumlarını tartışmadan önce, sözdizimini ve bir BoxT> içinde depolanan değerlerle nasıl etkileşim kuracağımızı ele alacağız.
zh_cn: 在讨论“Box<T”的框框段储存使用案例之前, 我们将先讨论语法以及如何与“Box<T”中储存的值互动。

source: Listing 11-1 shows how to use a box to store a value in the boxed segment:
es: La lista 11-1 muestra cómo usar una caja para almacenar un valor en el segmento en caja:
fr: Listing 11-1 montre comment utiliser une boîte pour stocker une valeur dans le segment encadré :
id: Daftar 11-1 menunjukkan bagaimana menggunakan kotak untuk menyimpan nilai dalam segmen kotak:
tr: Listeleme 11-1 kutulu segmentte bir değeri saklamak için bir kutunun nasıl kullanılacağını gösterir:
zh_cn: 列表 11-1 显示如何使用框框在框框段中存储值 :

source: <span class="caption">Listing 11-1: Storing a `u128` value in the boxed segment using a box</span>
es: <span class="caption">Lista 11-1: Almacenar un valor `u128` en el segmento de caja usando una caja</span>
fr: <span class="caption">Liste 11-1: Stocker une valeur `u128` dans le segment encadré à l'aide d'une case</span>
id: <span class="caption">Listing 11-1: Menyimpan sebuah nilai ▪u128) dalam segmen boxed menggunakan kotak</span>
tr: span class="caption">Liste 11-1: Kutulu segmentte u128 değerini bir kutu kullanarak saklamak/span>
zh_cn: <span类=“Caption” > listing 11-1: 使用框 </span> 在框框段中存储“u128”值

source: We define the variable `b` to have the value of a `Box` that points to the value `5`, which is stored in the boxed segment. This program will print `b = 5`; in this case, we can access the data in the box similar to how we would if this data was simply in the execution memory. Putting a single value in a box isn’t very useful, so you won’t use boxes by themselves in this way very often. Having values like a single `u128` in the execution memory, where they’re stored by default, is more appropriate in the majority of situations. Let’s look at a case where boxes allow us to define types that we wouldn’t be allowed to if we didn’t have boxes.
es: Definimos la variable `b` para tener el valor de una `Box` que apunta al valor `5`, que se almacena en el segmento en caja. Este programa imprimirá `b = 5`; en este caso, podemos acceder a los datos en la caja similar a cómo lo haríamos si estos datos estuvieran simplemente en la memoria de ejecución. Poner un solo valor en una caja no es muy útil, por lo que no usará cajas por sí mismas de esta manera muy a menudo. Tener valores como un solo `u128` en la memoria de ejecución, donde están almacenados por defecto, es más apropiado en la mayoría de situaciones. Veamos un caso en el que las cajas nos permiten definir tipos que no se nos permitirían si no tuviéramos cajas.
fr: Nous définissons la variable `b` pour avoir la valeur d'une `Box` qui pointe vers la valeur `5`, qui est stockée dans le segment encadré. Ce programme va imprimer `b = 5`; dans ce cas, nous pouvons accéder aux données dans la case comme si nous le ferions si ces données étaient simplement dans la mémoire d'exécution. Mettre une seule valeur dans une boîte n'est pas très utile, donc vous n'avez pas gagné d'utiliser des boîtes par vous-même de cette façon très souvent. Avoir des valeurs comme un seul `u128` dans la mémoire d'exécution, où elles sont stockées par défaut, est plus approprié dans la majorité des situations.
id: Kami mendefinisikan variabel ini untuk memiliki nilai dari sebuah kotak yang menunjuk pada nilai yang tersimpan dalam segmen kotak. program ini akan mencetaknya dengan cara ini, kita dapat mengakses data di dalam kotak yang mirip dengan bagaimana kita akan jika data ini hanya ada dalam memori eksekusi.
tr: b değişkenini, 5 değerine işaret eden ve kutulu segmentte saklanan bir Box değerine sahip olarak tanımlıyoruz. Bu program b = 5 yazdıracaktır; bu durumda, bu verinin sadece yürütme belleğinde olmasına izin vermediğimiz durumlarda, kutudaki verilere nasıl izin vereceğimize benzer şekilde erişebiliriz. Bir kutuya tek bir değer koymak çok yararlı değildir, bu nedenle kutuları kendi başlarına kullanmayacaksınız.
zh_cn: 我们定义了变量`b', 以便拥有“Box”的价值, 它指向储存在框框中部分的`5' 值, 这个程序将打印“b = 5 ” ; 在这种情况下, 我们可以访问框中的数据, 类似于如果数据只是执行记忆中的数据, 我们如何访问框中的数据。 在框中放一个单值并不十分有用, 所以您不会经常以这种方式使用框子。 在大多数情况下, 执行内存中的数值像一个“ u128 ” 一样, 在默认存储时更合适。 让我们看看一个箱子允许我们定义类型, 如果我们没有框的话, 我们就不会被允许使用。

source: Enabling Recursive Types with Nullable Boxes
es: Habilitando tipos recursivos con cajas fijas
fr: Activer les types récursifs avec des boîtes nullables
id: Mengaktifkan Tipe Rekursif dengan Kotak Nullable
tr: Nullable Boxes ile Özyinelemeli Türlerin Etkinleştirilmesi
zh_cn: 启用带有无符号框的递递递性类型

source: Using Boxes to Improve Performance
es: Uso de cajas para mejorar el rendimiento
fr: Utiliser des boîtes pour améliorer les performances
id: Menggunakan Kotak untuk Meningkatkan Kinerja
tr: Performansı artırmak için kutuların kullanılması
zh_cn: 使用方框改进业绩

source: Passing pointers between functions allows you to reference data without copying the data itself. Using boxes can improve performance as it allows you to pass a pointer to some data from one function to another, without the need to copy the entire data in memory before performing the function call. Instead of having to write `n` values into memory before calling a function, only a single value is written, corresponding to the pointer to the data. If the data stored in the box is very large, the performance improvement can be significant, as you would save `n-1` memory operations before each function call.
es: El paso de punteros entre funciones le permite hacer referencia a los datos sin copiar los datos en sí. El uso de cajas puede mejorar el rendimiento ya que le permite pasar un puntero a algunos datos de una función a otra, sin la necesidad de copiar todos los datos en memoria antes de realizar la llamada a la función. En lugar de tener que escribir `n` valores en la memoria antes de llamar a una función, sólo se escribe un valor único, correspondiente al puntero a los datos. Si los datos almacenados en la caja es muy grande, la mejora de rendimiento puede ser significativa, ya que guardaría `n-1` operaciones de memoria antes de cada llamada a la función.
fr: Passer des pointeurs entre les fonctions vous permet de référencer les données sans copier les données elles-mêmes. L'utilisation de boîtes peut améliorer les performances car elle vous permet de passer un pointeur à certaines données d'une fonction à une autre, sans avoir à copier l'ensemble des données en mémoire avant d'effectuer l'appel de fonction. Au lieu d'avoir à écrire des valeurs `n` dans la mémoire avant d'appeler une fonction, seule une valeur unique est écrite, correspondant au pointeur des données. Si les données stockées dans la boîte sont très importantes, l'amélioration des performances peut être significative, car vous enregistrerez des opérations de mémoire `n-1` avant chaque appel de fonction.
id: Melewati penunjuk antar fungsi memungkinkan Anda untuk mereferensikan data tanpa menyalin data itu sendiri. Menggunakan kotak dapat meningkatkan kinerja sebagaimana hal itu memungkinkan Anda untuk melewatkan suatu penunjuk ke beberapa data dari satu fungsi ke fungsi lain, tanpa perlu menyalin seluruh data dalam memori sebelum melakukan panggilan fungsi. Daripada harus menulis nilai ▪n ▪ nilai ke dalam memori sebelum memanggil sebuah fungsi, hanya satu nilai ditulis, sesuai dengan penunjuk ke data. Jika data yang tersimpan dalam kotak sangat besar, peningkatan kinerja dapat signifikan, karena Anda akan menyimpan operasi memori sebelum setiap panggilan.
tr: Fonksiyonlar arasındaki işaretçileri geçmek, verilerin kendisini kopyalamadan veriye referans vermenizi sağlar. Kutuları kullanmak, bir işaretçiyi bir işlevden diğerine, işlev çağrısını gerçekleştirmeden önce tüm verileri bellekte kopyalamanıza gerek kalmadan, bazı verilere aktarmanıza izin verdiği için performansı artırabilir. Bir işlevi çağırmadan önce n değerlerini hafızaya yazmak zorunda kalmak yerine, her bir işleve karşılık gelen tek bir değer yazılır. Kutu-1'de depolanan veriler çok büyükse, performans çok büyük olur.
zh_cn: 函数之间的传递指针允许您在不复制数据本身的情况下引用数据。 使用框可以提高性能, 因为它允许您将一个指针从一个函数传送到另一个函数, 无需在运行函数调用前将全部数据复制到记忆中, 而不必在调用函数前将“n” 值写入内存, 而不是在调用一个函数前将“n” 值写入内存, 而是写成一个单一的值, 与数据指针相对应。 如果存储在框中的数据非常大, 性能改进可以显著, 因为您可以在每次调用前保存“ n-1” 内存操作 。

source: Let's take a look at the code in Listing 11-2, which shows two ways of passing data to a function: by value and by pointer.
es: Echemos un vistazo al código en Listado 11-2, que muestra dos maneras de pasar datos a una función: por valor y por puntero.
fr: Examinons le code dans Listing 11-2, qui montre deux façons de transmettre les données à une fonction : par valeur et par pointeur.
id: Mari kita lihat kode di Listing 11-2, yang menunjukkan dua cara mengirim data ke sebuah fungsi: dengan nilai dan penunjuk.
tr: Bir fonksiyona veri aktarmanın iki yolunu gösteren Listeleme 11-2'deki koda bir göz atalım: değere göre ve işaretçiye göre.
zh_cn: 让我们看看11-2列表中的代码, 它显示了将数据传输到函数的两种方式: 数值和指针。

source: "{} is shopping today and bought {} items"
es: "Está de compras hoy y compró productos"
fr: "{} est shopping aujourd'hui et a acheté {} produits"
id: "{} adalah belanja hari ini dan membeli {} item"
tr: " bugün alışveriş yapıyor ve eşya satın alıyor"
zh_cn: "今天买东西买东西"

source: "Eli"
zh_cn: "伊丽"

source: "Uri"
zh_cn: "乌里"

source: <span class="caption">Listing 11-2: Storing large amounts of data in a box for performance.</span>
es: <span class="caption">Lista 11-2: Almacenar grandes cantidades de datos en una caja para el rendimiento.</span>
fr: <span class="caption">Liste 11-2: Stocker de grandes quantités de données dans une boîte pour la performance.</span>
id: <span class="caption">Listing 11-2: Menyimpan sejumlah besar data dalam sebuah kotak untuk kinerja.</span>
tr: span class="caption">Liste 11-2: Performans için büyük miktarda veriyi bir kutuya saklama./span>
zh_cn: <span类=“caption” > listing 11-2: 在用于性能的框中存储大量数据 。 </span>
