Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: ```toml [package] name = "hello_world" version = "0.1.0" edition = "2023_11" # See more keys and their definitions at https://docs.swmansion.com/scarb/docs/reference/manifest [dependencies] # foo = { path = "vendor/foo" } ```
es: * Nombre del paquete = "hello_world" versión = "0.1.0" edición = "2023_11" # Ver más claves y sus definiciones en https://docs.swmansion.com/scarb/docs/reference/manifest [dependencias] # foo = { path = "vendor/foo" }
fr: ```toml [package] name = "hello_world" version = "0.1.0" édition = "2023_11" # Voir plus de clés et leurs définitions à https://docs.swmansion.com/scarb/docs/reference/manifest [dependences] # foo = { chemin = "vendor/foo" } ``
id: Diterjemahkan oleh mumetndase. Lihat lebih banyak kunci dan definisi mereka di https://docs.swmansion.com/scarb/docs/referensi/manifest [ketergantungan] # foo = path = "vendor/foo"}
tr: toml [package] name = "hello_world" version = "0.1.0" edition = "2023_11" # https://docs.swmansion.com/scarb/docs/reference/manifest [bağımlılar] # foo = path = "vendor/foo"
zh_cn: *Toml [包 名称 = "Hello_world" 版本 = "0.1.0" 版本 = "2023_11" # 更多钥匙及其定义见 https://docs.swmansion.com/scarb/docs/ reference/manifest [dependies] # foo = {路径 = "vendor/foo" } *

source: <span class="caption">Listing 1-1: Contents of _Scarb.toml_ generated by `scarb new`</span>
es: <span class="caption">Lista 1-1: Contenido de _Scarb.toml_ generado por `scarb new/span>
fr: <span class="caption">Liste 1-1: Contenu de _Scarb.toml_ généré par `scarb new`</span>
id: <span class="caption">Listing 1-1: Isi dari _Scarb.toml_ dihasilkan oleh </scarb baru
tr: span class="caption="Listing 1-1: Contents of _Scarb.toml_ scarb new/span> tarafından oluşturulan içerikler
zh_cn: <span类=“ caption” > listing 1-1:`scarb new_/span>生成的_Scarb.toml_的内容

source: This file is in the [TOML](https://toml.io/) (Tom’s Obvious, Minimal Language) format, which is Scarb’s configuration format.
es: Este archivo está en el formato [TOML](https://toml.io/) (Tom Obvious, Minimal Language), que es el formato de configuración de Scarb.
fr: Ce fichier est au format [TOML](https://toml.io/) (Tom=s Obvious, Minimal Language), qui est le format de configuration Scarb=s.
id: Berkas ini ada dalam format [TOML]--https://toml.io/) (Tomous, Minmal Language), yang merupakan format konfigurasi Scarb--s.
tr: Bu dosya [TOML](https://toml.io/) (Tom'un Açık, Minimal Dili) biçimindedir, bu da Scarb'ın yapılandırma biçimidir.
zh_cn: 此文件采用[ TOML] (https://toml.io/) (Tom的显性、 最小语言) 格式, 即刀疤的配置格式 。

source: The first line, `[package]`, is a section heading that indicates that the following statements are configuring a package. As we add more information to this file, we’ll add other sections.
es: La primera línea, `[paquete]`, es un encabezado de sección que indica que las siguientes instrucciones están configurando un paquete. A medida que añadamos más información a este archivo, añadiremos otras secciones.
fr: La première ligne, `[package]`, est un titre de section qui indique que les instructions suivantes sont en train de configurer un paquet. Comme nous ajoutons plus d'informations à ce fichier, nous ajouterons d'autres sections.
id: Baris pertama, [paket], adalah judul bagian yang menunjukkan bahwa pernyataan-pernyataan berikut sedang mengkonfigurasi sebuah paket.
tr: İlk satır, [package], aşağıdaki ifadelerin bir paketi yapılandırdığını gösteren bir bölüm başlığıdır. Bu dosyaya daha fazla bilgi ekledikçe, diğer bölümleri de ekleyeceğiz.
zh_cn: 第一行,`[包 `,是一节标题,显示以下语句正在配置一个软件包,随着我们增加更多信息,我们将增加其他部分。

source: The next three lines set the configuration information Scarb needs to compile your program: the name of the package and the version of Scarb to use, and the edition of the prelude to use. The prelude is the collection of the most commonly used items that are automatically imported into every Cairo program. You can learn more about the prelude in [Appendix D](./appendix-04-cairo-prelude.md).
es: Las siguientes tres líneas establecen la información de configuración que Scarb necesita para compilar su programa: el nombre del paquete y la versión de Scarb a usar, y la edición del preludio a usar. El preludio es la colección de los elementos más comúnmente utilizados que se importan automáticamente en cada programa de El Cairo. Puede aprender más sobre el preludio en [Apéndice D](./apéndice-04-cairo-prelude.md).
fr: Les trois lignes suivantes définissent les informations de configuration Scarb doit compiler votre programme: le nom du paquet et la version de Scarb à utiliser, et l'édition du prélude à utiliser. Le prélude est la collection des articles les plus couramment utilisés qui sont automatiquement importés dans chaque programme du Caire. Vous pouvez en savoir plus sur le prélude dans [Annexe D](./appendix-04-cairo-prelude.md).
id: Tiga baris berikutnya mengatur informasi konfigurasi Scarb perlu menyusun program Anda: nama paket dan versi Scarb untuk digunakan, dan edisi prelude untuk digunakan. Pralude adalah koleksi dari item yang paling umum digunakan yang secara otomatis diimpor ke setiap program Kairo. Anda dapat belajar lebih lanjut tentang prelude [Appendix D]./appendix-04cairo-prelude.m).
tr: Sonraki üç satır, Scarb'ın programınızı derlemesi gereken yapılandırma bilgilerini ayarlar: paketin adı ve kullanılacak Scarb sürümü ve kullanılacak prelüd sürümü. Prelüd, her Kahire programına otomatik olarak ithal edilen en yaygın kullanılan öğelerin koleksiyonudur. [Ek D] (./appendix-04-cairo-prelude.md) 'deki prelüd hakkında daha fazla bilgi edinebilirsiniz.
zh_cn: 接下来的三行设置了配置信息 Scarb 需要来编译您的程序: 软件包的名称和要使用的 Scarb 版本, 以及要使用的序曲版本。 前导是收集每个开罗程序自动导入的最常用的物品。 您可以在 [ 附录D] (./ appendix- 04- cairo- prelude. md) 中了解更多前奏 。

source: The last line, `[dependencies]`, is the start of a section for you to list any of your project’s dependencies. In Cairo, packages of code are referred to as crates. We won’t need any other crates for this project.
es: La última línea, `[dependencias]', es el inicio de una sección para que usted pueda enumerar cualquiera de las dependencias de su proyecto. En El Cairo, paquetes de código se denominan cajas. No necesitaremos ninguna otra caja para este proyecto.
fr: La dernière ligne, `[dependences]`, est le début d'une section pour vous de lister les dépendances de votre projet. Au Caire, les paquets de code sont appelés caisses. Nous n'avons pas besoin d'autres caisses pour ce projet.
id: Baris terakhir, [ketergantungan] adalah bagian awal bagi Anda untuk daftar salah satu ketergantungan proyek Anda di Kairo, paket-paket kode yang disebut peti.
tr: Son satır, [bağımlılar], projenizin bağımlılıklarından herhangi birini listelemeniz için bir bölümün başlangıcıdır. Kahire'de, kod paketleri sandık olarak adlandırılır. Bu proje için başka sandıklara ihtiyacımız olmayacak.
zh_cn: 最后一行“[依附 ”是您列出您项目任何属地的一节的起始部分。 在开罗, 代码包被称为箱子。 我们不需要其它任何用于这个项目的箱子 。

source: Note: If you're building contracts for Starknet, you will need to add the `starknet` dependency as mentioned in the [Scarb documentation](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html).
es: Nota: Si está construyendo contratos para Starknet, tendrá que añadir la dependencia `starknet` como se menciona en la [Documentación de Scarb](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html).
fr: Remarque: Si vous construisez des contrats pour Starknet, vous devrez ajouter la dépendance `starknet` mentionnée dans la [documentation Scarb](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html).
id: Catatan: Jika Anda membangun kontrak untuk Starknet, Anda perlu menambahkan ketergantungan åstarknet seperti yang disebutkan dalam [Scarb dokumentasi].https://docs.swmansion.com/scarb/docs/extensis/starknet/starknet-package.html).
tr: Not: Starknet için sözleşmeler yapıyorsanız, [Scarb dokümantasyonunda] belirtildiği gibi starknet bağımlılığını eklemeniz gerekir(https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html).
zh_cn: 注:如果您正在为Starknet订立合同,您需要添加[Scarb文件](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html)中提及的`starknet'依赖性。

source: The other file created by Scarb is _src/lib.cairo_, let's delete all the content and put in the following content, we will explain the reason later.
es: El otro archivo creado por Scarb es _src/lib.cairo_, vamos a eliminar todo el contenido y poner en el siguiente contenido, vamos a explicar la razón más adelante.
fr: L'autre fichier créé par Scarb est _src/lib.cairo_, supprimons tout le contenu et mettons dans le contenu suivant, nous expliquerons la raison plus tard.
id: Berkas lain yang dibuat oleh Scarb adalah _src/lib.cairo_, mari kita hapus semua isi dan masukkan ke dalam konten berikut, kita akan menjelaskan alasannya nanti.
tr: Scarb tarafından oluşturulan diğer dosya _src/lib.cairo_, tüm içeriği silelim ve aşağıdaki içeriğe koyalım, nedenini daha sonra açıklayacağız.
zh_cn: Scarb 创建的另一个文件是 _src/lib.cairo_,让我们删除所有内容并加入以下内容,我们稍后解释原因。

source: Then create a new file called _src/hello_world.cairo_ and put the following code in it:
es: A continuación, crear un nuevo archivo llamado _src/hello_world.cairo_ y poner el siguiente código en él:
fr: Puis créez un nouveau fichier appelé _src/hello_world.cairo_ et mettez le code suivant :
id: Lalu buat berkas baru yang disebut _src/hello_world.cairo_ dan taruh kode berikut di dalamnya:
tr: Daha sonra _src/hello_world.cairo_ adında yeni bir dosya oluşturun ve aşağıdaki kodu içine koyun:
zh_cn: 然后创建一个名为 _src/hello_world.cairo_的新文件,并在其中输入以下代码:

source: <span class="filename">Filename: src/hello_world.cairo</span>
fr: <span class="filename">Nom du fichier: src/hello_world.cairo</span>
id: <nama berkas="pan"> Nama berkas: src/hello_world.cairo</span>
tr: span class="filename">Dosya adı: src/hello_world.cairo/span>
zh_cn: <span类="filename" >Filename: src/hello_world.cairo </span>

source: "Hello, World!"
es: "¡Hola, Mundo!"
fr: "Bonjour, Monde!"
id: "Halo, World!"
tr: "Merhaba Dünya!"
zh_cn: "你好,世界!"

source: We have just created a file called _lib.cairo_, which contains a module declaration referencing another module named `hello_world`, as well as the file _hello_world.cairo_, containing the implementation details of the `hello_world` module.
es: Acabamos de crear un archivo llamado _lib.cairo_, que contiene una declaración de módulo que hace referencia a otro módulo llamado `hello_world`, así como el archivo _hello_world.cairo_, que contiene los detalles de implementación del módulo `hello_world`.
fr: Nous venons de créer un fichier appelé _lib.cairo_, qui contient une déclaration de module faisant référence à un autre module nommé `hello_world`, ainsi que le fichier _hello_world.cairo_, qui contient les détails d'implémentation du module `hello_world`.
id: Kami baru saja membuat file yang disebut _lib.cairo_, yang berisi sebuah deklarasi modul modul lain yang bernama ôhello_world, serta file "hello_world.cairo_, berisi rincian implementasi dari modul-moduliment dari dunia.
tr: hello_world adlı başka bir modüle atıfta bulunan bir modül deklarasyonu ve hello_world.cairo_ dosyasını içeren _lib.cairo_ adlı bir dosya oluşturduk.
zh_cn: 我们刚刚创建了一个名为_lib.cairo_的文件,其中载有一个模块声明,其中引用了另一个名为`Hello_world'的模块,以及载有`Hello_world'模块实施细节的文件_Hello_world.cairo_。

source: Scarb requires your source files to be located within the _src_ directory.
es: Scarb requiere que sus archivos de origen se encuentren dentro del directorio _src_.
fr: Scarb exige que vos fichiers sources soient situés dans le répertoire _src_.
id: Scarb membutuhkan berkas sumber Anda untuk ditempatkan dalam direktori _sc_.
tr: Scarb kaynak dosyalarınızın _src_ dizini içinde bulunmasını gerektirir.
zh_cn: Scarb 要求您的源文件位于 _src_目录内。

source: The top-level project directory is reserved for README files, license information, configuration files, and any other non-code-related content. Scarb ensures a designated location for all project components, maintaining a structured organization.
es: El directorio de proyectos de nivel superior está reservado para archivos README, información sobre licencias, archivos de configuración y cualquier otro contenido no relacionado con códigos. Scarb garantiza una ubicación designada para todos los componentes del proyecto, manteniendo una organización estructurada.
fr: Le répertoire de projet de haut niveau est réservé aux fichiers README, aux informations de licence, aux fichiers de configuration et à tout autre contenu non lié au code. Scarb assure un emplacement désigné pour tous les composants du projet, en maintenant une organisation structurée.
id: Direktori projek tingkat atas disediakan bagi berkas README, informasi lisensi, berkas konfigurasi, dan konten lainnya yang tidak berhubungan dengan kode. Scarb memastikan lokasi yang ditentukan bagi semua komponen projek, mempertahankan organisasi terstruktur.
tr: Üst düzey proje dizini README dosyaları, lisans bilgileri, yapılandırma dosyaları ve kodla ilgili olmayan diğer içerikler için ayrılmıştır. Scarb, yapılandırılmış bir organizasyonu koruyarak tüm proje bileşenleri için belirlenmiş bir konum sağlar.
zh_cn: 顶级项目目录保留给 README 文件、 许可证信息、 配置文件和任何其他非代码相关内容。 刀疤确保为所有项目组成部分指定一个位置, 并维持一个结构化的组织 。

source: If you started a project that doesn’t use Scarb, you can convert it to a project that does use Scarb. Move the project code into the _src_ directory and create an appropriate _Scarb.toml_ file. You can also use `scarb init` command to generate the _src_ folder and the _Scarb.toml_ it contains.
es: Si ha iniciado un proyecto que no utilice Scarb, puede convertirlo a un proyecto que utilice Scarb. Mueva el código del proyecto al directorio _src_ y cree un archivo _Scarb.toml_ apropiado. También puede utilizar el comando `scarb init` para generar la carpeta _src_ y el _Scarb.toml_ que contiene.
fr: Si vous avez démarré un projet qui n'utilise pas Scarb, vous pouvez le convertir en un projet qui utilise Scarb. Déplacez le code de projet dans le répertoire _src_ et créez un fichier _Scarb.toml_ approprié. Vous pouvez également utiliser la commande `scarb init` pour générer le dossier _src_ et le _Scarb.toml_ qu'il contient.
id: Jika Anda memulai sebuah proyek yang tidak menggunakan Scarb, Anda dapat mengubahnya menjadi proyek yang menggunakan Scarb. Pindahkan kode projek ke direktori _src_ dan buat berkas _Scarb.toml_ yang sesuai. Anda juga dapat menggunakan perintah iniit ▪scarb untuk membuat folder _src_ dan _scarb.toml_ yang ada.
tr: Scarb kullanmayan bir proje başlattıysanız, Scarb kullanan bir projeye dönüştürebilirsiniz. Proje kodunu _src_ dizinine taşıyın ve uygun bir _Scarb.toml_ dosyası oluşturun. Ayrıca, içerdiği _src_ klasörünü ve _scarb.toml_ komutunu oluşturmak için scarb init komutunu kullanabilirsiniz.
zh_cn: 如果您启动一个不使用 scrab 的工程, 您可以将其转换为使用 scrab 的工程。 将工程代码移动到 _ src_ 目录中, 并创建合适的 _ Scarb.toml_ 文件。 您也可以使用 sccarb init 命令生成 _ src_ 文件夹及其包含的 _ Scarb.toml_ 。

source: <span class="caption"> A sample Scarb project structure</span>
es: <span class="caption"> Una muestra de la estructura del proyecto Scarb</span>
fr: <span class="caption"> Un échantillon Structure du projet Scarb</span>
id: <span class="caption"> Sebuah contoh struktur proyek Scarb</span>
tr: span class="caption"> Örnek bir Scarb proje yapısı/span>
zh_cn: <span类=“caption” > > 一个刀疤项目结构样本 </span>

source: Building a Scarb Project
es: Construcción de un proyecto de escarcha
fr: Construction d'un projet d'écharpe
id: Membangun Proyek Scarb
tr: Bir Scarb Projesi Oluşturmak
zh_cn: 建造刀疤项目

source: From your _hello_world_ directory, build your project by entering the following command:
es: Desde tu directorio _hello_world_, construye tu proyecto introduciendo el siguiente comando:
fr: À partir de votre répertoire _hello_world_, construisez votre projet en entrant la commande suivante :
id: Dari direktori _hello_world_ Anda, bangun projek Anda dengan memasukkan perintah berikut:
tr: _hello_world_ dizininden aşağıdaki komutu girerek projenizi oluşturun:
zh_cn: 从您的 _Hello_world_目录中输入以下命令来构建您的工程 :

source: This command creates a `sierra` file in _target/dev_, let's ignore the `sierra` file for now.
es: Este comando crea un archivo `sierra` en _target/dev_, vamos a ignorar el archivo `sierra` por ahora.
fr: Cette commande crée un fichier `sierra` dans _target/dev_, oublions le fichier `sierra` pour le moment.
id: Perintah ini menciptakan file æsierra di _target/dev_, mari kita abaikan berkas æsierra saat ini.
tr: Bu komut _target/dev_ içinde bir sierra dosyası oluşturur, şimdilik sierra dosyasını görmezden gelelim.
zh_cn: 此命令在 _ target/ dev_ 创建一个“ sierra” 文件, 让我们暂时忽略“ sierra” 文件 。

source: If you have installed Cairo correctly, you should be able to run the `main` function of your program with the `scarb cairo-run` command and see the following output:
es: Si ha instalado El Cairo correctamente, debe ser capaz de ejecutar la función `main` de su programa con el comando `scarb cairo-run` y ver la siguiente salida:
fr: Si vous avez installé le Caire correctement, vous devriez être en mesure d'exécuter la fonction `main` de votre programme avec la commande `scarb cairo-run` et voir la sortie suivante:
id: Jika Anda telah memasang Kairo dengan benar, Anda seharusnya dapat menjalankan fungsi dari program Anda dengan perintah cairo-run dan melihat keluaran berikut:
tr: Kahire'yi doğru bir şekilde yüklediyseniz, programınızın scarb cairo-run komutuyla main işlevini çalıştırabilir ve aşağıdaki çıktıyı görebilirsiniz:
zh_cn: 如果您正确安装了开罗, 您应该能够使用“ scarb cairo- run” 命令运行您的程序的“ main” 函数, 并查看以下输出 :

source: Regardless of your operating system, the string `Hello, world!` should be printed to the terminal.
es: Independientemente de su sistema operativo, la cadena `Hola, mundo!` debe imprimirse en la terminal.
fr: Quel que soit votre système d'exploitation, la chaîne `Bonjour, monde!` devrait être imprimée sur le terminal.
id: Terlepas dari sistem operasi Anda, string yang halo, dunia! harus dicetak ke terminal.
tr: İşletim sisteminizden bağımsız olarak, Merhaba dünya! dizgisi terminale basılmalıdır.
zh_cn: 不论操作系统如何,字符串`你好,世界!'应印在终端上。

source: If `Hello, world!` did print, congratulations! You’ve officially written a Cairo program. That makes you a Cairo programmer — welcome!
es: Si `¡Hola, mundo!` hizo imprimir, felicitaciones! Usted ha escrito oficialmente un programa de El Cairo. Eso le hace un programador de El Cairo — bienvenido!
fr: Si `Bonjour, monde!` a imprimé, félicitations! Vous avez officiellement écrit un programme du Caire. Cela fait de vous un programmeur du Caire — bienvenue!
id: Kau resmi menulis program Kairo./ Itu membuatmu diterima oleh programmer Kairo!
tr: Eğer Merhaba, dünya! baskı yaptıysa, tebrikler! Resmi olarak bir Kahire programı yazdınız. Bu sizi bir Kahire programcısı yapar - hoş geldiniz!
zh_cn: 如果“你好,世界!”你印了字,恭喜你!你已经正式写了开罗方案,使你成为开罗程序员——欢迎!

source: Anatomy of a Cairo Program
es: Anatomía de un programa de El Cairo
fr: Anatomie d'un programme du Caire
id: Anatomi Program Kairo
tr: Bir Kahire Programının Anatomisi
zh_cn: 开罗方案解剖

source: Let’s review this “Hello, world!” program in detail. Here’s the first piece of the puzzle:
es: Repasemos este programa “Hola, mundo!” en detalle. Aquí está la primera pieza del rompecabezas:
fr: Laissez-nous passer en revue ce programme en détail. Voici le premier morceau du puzzle:
id: Mari kita tinjau kembali program ini secara rinci!
tr: Bu "Merhaba dünya!" programını ayrıntılı olarak inceleyelim. İşte bulmacanın ilk parçası:
zh_cn: 让我们详细审查这个“哈罗,世界! ” 的程序。 这是拼图的第一块:

source: These lines define a function named `main`. The `main` function is special: it is always the first code that runs in every executable Cairo program. Here, the first line declares a function named `main` that has no parameters and returns nothing. If there were parameters, they would go inside the parentheses `()`.
es: Estas líneas definen una función llamada `main`. La función `main` es especial: siempre es el primer código que se ejecuta en cada programa ejecutable de El Cairo. Aquí, la primera línea declara una función llamada `main` que no tiene parámetros y no devuelve nada. Si hubiera parámetros, entrarían dentro de los paréntesis `()`.
fr: Ces lignes définissent une fonction nommée `main`. La fonction `main` est spéciale: c'est toujours le premier code qui fonctionne dans chaque programme exécutable du Caire. Ici, la première ligne déclare une fonction nommée `main` qui n'a aucun paramètre et ne renvoie rien. S'il y avait des paramètres, ils iraient à l'intérieur des parenthèses `()`.
id: Garis-garis ini mendefinisikan sebuah fungsi bernama åmain. Fungsinya sangat spesial: selalu merupakan kode pertama yang dijalankan dalam setiap program yang dapat dieksekusi Kairo.
tr: Bu satırlar main adlı bir fonksiyon tanımlar. main işlevi özeldir: her çalıştırılabilir Kahire programında çalışan ilk koddur. Burada, ilk satır main adında parametresi olmayan ve hiçbir şey döndürmeyen bir fonksiyon bildirir. Parametreler olsaydı, parantezlerin içine girerlerdi ().
zh_cn: 这些线条定义了名为`main' 的函数。 `main' 函数是特殊的: 每个可执行的开罗程序总是第一个运行的代码。 这里, 第一行宣布一个名为`main'的函数, 它没有参数, 没有返回任何函数。 如果有参数, 它们会进入括号` ()' 。

source: The function body is wrapped in `{}`. Cairo requires curly brackets around all function bodies. It’s good style to place the opening curly bracket on the same line as the function declaration, adding one space in between.
es: El cuerpo de la función está envuelto en. El Cairo requiere soportes rizados alrededor de todos los cuerpos de la función. Es buen estilo para colocar el soporte rizado de apertura en la misma línea que la declaración de la función, añadiendo un espacio en el medio.
fr: Le corps de la fonction est enveloppé dans `{}`. Le Caire nécessite des crochets bouclés autour de tous les corps de la fonction. Il est bon de placer le crochet d'ouverture bouclé sur la même ligne que la déclaration de la fonction, en ajoutant un espace entre les deux.
id: Tubuh fungsi dibungkus dalam {}. Kairo membutuhkan braket keriting di sekitar semua tubuh fungsi. Ini gaya yang baik untuk menempatkan braket keriting membuka pada baris yang sama seperti deklarasi fungsi, menambahkan satu ruang di antaranya.
tr: Fonksiyon gövdesi 'ye sarılır. Kahire, tüm fonksiyon organları etrafında kıvırcık parantez gerektirir. Açılış kıvırcık parantezini fonksiyon deklarasyonuyla aynı çizgiye yerleştirmek ve aralara bir boşluk eklemek iyi bir stildir.
zh_cn: 函数正文在 {} 中包装 。 开罗需要将所有函数机构括号括号括在括号上。 将打开的圆括号放在与函数声明相同的行上, 并在中间添加一个空格, 很有风格 。
