Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The `5` in `five` is the function’s return value, which is why the return type is `u32`. Let’s examine this in more detail. There are two important bits: first, the line `let x = five();` shows that we’re using the return value of a function to initialize a variable. Because the function `five` returns a `5`, that line is the same as the following:
es: El `5` en `cinco` es el valor de retorno de la función, por lo que el tipo de retorno es `u32`. Examinemos esto con más detalle. Hay dos bits importantes: primero, la línea `let x = cinco();` muestra que estamos utilizando el valor de retorno de una función para inicializar una variable. Debido a que la función `cinco` devuelve un `5`, esa línea es la misma que la siguiente:
fr: La valeur `5` dans `5` est la valeur de retour de la fonction, c'est pourquoi le type de retour est `u32`. Laissez-nous examiner plus en détail. Il y a deux bits importants: d'abord, la ligne `let x = 5();` montre que nous utilisons la valeur de retour d'une fonction pour initialiser une variable. Parce que la fonction `5` retourne une `5`, cette ligne est la même que la suivante:
id: Ada dua bagian penting: pertama, garis x = 5); yang menunjukkan bahwa kita menggunakan nilai kembali dari fungsi untuk menginisialisasi variabel. karena fungsinya menghasilkan 5, garis itu sama dengan berikut:
tr: 5 in 5 fonksiyonun dönüş değeridir, bu yüzden dönüş tipi u32'dir. Bunu daha ayrıntılı inceleyelim. İki önemli bit vardır: ilk olarak, let x = beş(); bir fonksiyonun dönüş değerini bir değişkeni başlatmak için kullandığımızı gösterir. Çünkü 5 fonksiyonu bir 5 döndürür, bu satır aşağıdakiyle aynıdır:
zh_cn: `5'中的`5'是函数的返回值,正因为如此,返回类型是`u32'。让我们更详细地研究这一点。有两个重要部分:第一,`let x = 5 ();`显示我们正在使用函数的返回值来初始化变量。由于函数`5'返回`5 ',该行与以下各行相同:

source: Second, the `five` function has no parameters and defines the type of the return value, but the body of the function is a lonely `5` with no semicolon because it’s an expression whose value we want to return. Let’s look at another example:
es: En segundo lugar, la función `cinco` no tiene parámetros y define el tipo de valor de retorno, pero el cuerpo de la función es un solitario `5` sin punto y coma porque es una expresión cuyo valor queremos devolver. Veamos otro ejemplo:
fr: Deuxièmement, la fonction `5` n'a pas de paramètres et définit le type de la valeur de retour, mais le corps de la fonction est un `5` solitaire sans point-virgule parce que c'est une expression dont nous voulons revenir la valeur.
id: Kedua, fungsinya tidak memiliki parameter dan mendefinisikan jenis nilai kembali, tetapi tubuh fungsinya adalah kesepian dengan tanpa semikolon karena itu adalah ekspresi yang nilainya ingin kita kembalikan.
tr: İkincisi, beş işlevinin parametresi yoktur ve dönüş değerinin türünü tanımlar, ancak fonksiyonun gövdesi virgülsüz yalnız bir 5'dir, çünkü değeri dönmek istediğimiz bir ifadedir. Başka bir örneğe bakalım:
zh_cn: 第二,`五'函数没有参数,也没有定义返回值的类型,但函数的体是一个孤单的`五 ',没有分号,因为它是我们希望返回的价值的表达式。

source: Running this code will print `x = 6`. But if we place a semicolon at the end of the line containing `x + 1`, changing it from an expression to a statement, we’ll get an error:
es: Ejecutando este código se imprimirá `x = 6`. Pero si colocamos un punto y coma al final de la línea que contiene `x + 1`, cambiándolo de una expresión a una instrucción, obtendremos un error:
fr: Exécuter ce code va imprimer `x = 6`. Mais si nous plaçons un point-virgule à la fin de la ligne contenant `x + 1`, le changeant d'une expression à une instruction, nous obtiendrons une erreur:
id: Menjalankan kode ini akan mencetak 6x = 6. tetapi jika kita menempatkan titik koma di akhir baris yang mengandung ıx + 1), mengubahnya dari ekspresi ke pernyataan, kita akan mendapatkan kesalahan:
tr: Bu kodu çalıştırmak x = 6 yazdıracaktır. Ancak x + 1 içeren satırın sonuna bir noktalı virgül yerleştirirsek, bir ifadeden bir ifadeye değiştirirsek, bir hata alırız:
zh_cn: 运行此代码时将打印“ x = 6 ” 。 但是,如果我们在含有“ x + 1” 的线条结尾处放置分号,将其从表达式改为语句,我们会发现错误 :

source: ```shell $ scarb cairo-run Compiling no_listing_22_function_return_invalid v0.1.0 (listings/ch02-common-programming-concepts/no_listing_24_function_return_invalid/Scarb.toml) error: Unexpected return type. Expected: "core::integer::u32", found: "()". --> listings/ch02-common-programming-concepts/no_listing_24_function_return_invalid/src/lib.cairo:9:28 fn plus_one(x: u32) -> u32 { ^ error: could not compile `no_listing_22_function_return_invalid` due to previous error error: `scarb metadata` exited with error ```
es: Error al compilar no_listing_22_function_return_invalid v0.1.0 (listas/ch02-common-programming-concepts/no_listing_24_function_return_invalid/Scarb.toml): Tipo de retorno inesperado. Se esperaba: "core::integer::u32", encontrado: "()". --> listings/ch02-common-programming-concepts/no_listing_24_function_return_invalid/src/lib.cairo:9:28 fn plus_one(x: u32) -> u32 { ^ error: no se pudo compilar `no_listing_22_function_invalid` debido a error previo: `metadatos de escarb` salidos con error
fr: ``shell $ scarb cairo-run Compiling no_listing_22_function_return_invalid v0.1.0 (listings/ch02-common-programming-concepts/no_listing_24_function_invalid/Scarb.toml) erreur : Type de retour inattendu. Prévu : "core::integer::u32", trouvé : "()". --> lists/ch02-common-programming-concepts/no_listing_24_function_invalid/src/lib.cairo:9:28 fn plus_one(x: u32) -> u32 { ^ erreur : n'a pas pu compiler `no_listing_22_function_invalid` en raison d'une erreur précédente : `scarb metadas` est sorti avec erreur ````
id: Scarb cairo-run Compiling no_listing_22_function_return_invalid v0.1.0 (listings/ch02-comgrammming-conses/no_listing_24_function_returnd_nvalid/Scarb.toml) error: tipe kembali yang tidak diharapkan. Diduga: "core:integer:32," ditemukan: "no_listing/ch02_com-com-com-comgrampt/concepts/no_listing_turning_turned_rection/icricricricning/clert:9:9:32" -> daftar _no_conturned error:+_n_noturning:proturning: -no_proturning:provenction
tr: shell $ scarb cairo-run Compiling no_listing_22_function_return_invalid v0.1.0 (listings/ch02-common-programming-concepts/no_listing_24_function_return_invalid/Scarb.toml) hatası: Beklenmedik dönüş tipi. Beklenen: "core:integer:u32" bulundu.
zh_cn: @shell $ scarb cairo-run 拼写 no_ list_22_form_ return_invalid v0.1.0 ( lists/ch02-common- programming- confits/no_late_24_form_form_regin_invalid/Scarb.tol) 错误: 意外返回类型。 期待 : “ 核心 : integer: u32 ” 找到 : " () - > lists/ch02- common- programing- conclutions/no_ list_24_ conflate_ src/src/sc. cairo: 9: 28 fn+_ one(x: u32) - 错误 {{{% 错误: 无法编译`no lot_ 22_forpresent_ return_invalid ', 原因是错误: “ `scrab 元数据因以前的错误退出 退出 退出 =_____

source: The main error message, `Unexpected return type`, reveals the core issue with this code. The definition of the function `plus_one` says that it will return an `u32`, but statements don’t evaluate to a value, which is expressed by `()`, the unit type. Therefore, nothing is returned, which contradicts the function definition and results in an error.
es: El mensaje de error principal, `Tipo de retorno inesperado`, revela el problema principal con este código. La definición de la función `plus_one` dice que devolverá un `u32`, pero las declaraciones no evalúan a un valor, que se expresa por `()`, el tipo de unidad. Por lo tanto, no se devuelve nada, lo que contradice la definición de la función y resulta en un error.
fr: Le message d'erreur principal, `Type de retour inattendu`, révèle le problème de base avec ce code. La définition de la fonction `plus_one` indique qu'elle retournera un `u32`, mais les instructions n'évaluent pas à une valeur, qui est exprimée par `()`, le type d'unité. Par conséquent, rien n'est retourné, ce qui contredit la définition de la fonction et entraîne une erreur.
id: Pesan galat utama, tipe balasan yang tidak terduga, mengungkapkan masalah inti dengan kode ini. Definisi dari fungsi ·plus_one; mengatakan bahwa ia akan mengembalikan sebuah ·u32--, tetapi pernyataan tidak mengevaluasi ke suatu nilai, yang dinyatakan oleh Á), tipe satuan. Oleh karena itu, tidak ada yang dikembalikan, yang bertentangan dengan definisi fungsi dan hasil kesalahan.
tr: Ana hata iletisi, Beklenmeyen geri dönüş tipi, bu kodla temel sorunu ortaya çıkarır. plus_one işlevinin tanımı, u32 döndüreceğini söyler, ancak ifadeler, birim türü olan () ile ifade edilen bir değere değerlendirmez. Bu nedenle, fonksiyon tanımıyla çelişen ve bir hatayla sonuçlanan hiçbir şey iade edilmez.
zh_cn: 主错误信息“意外返回类型”显示此代码的核心问题。函数“+_one”的定义表示返回“u32”,但声明不评价单位类型`()'表示的价值。因此,不返回任何内容,这与函数定义相矛盾,导致错误。

source: {{#quiz ../quizzes/ch02-03-functions.toml}}
fr: {{#quiz../quizes/ch02-03-fonctions.toml}}
id: {{#quiz../quizzes/ch02-03-functionions.toml}}}
zh_cn: Quiz./quizzes/ch02-03-功用.toml_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________

source: All programmers strive to make their code easy to understand, but sometimes extra explanation is warranted. In these cases, programmers leave comments in their source code that the compiler will ignore but people reading the source code may find useful.
es: Todos los programadores se esfuerzan por hacer su código fácil de entender, pero a veces se justifica una explicación adicional. En estos casos, los programadores dejan comentarios en su código fuente que el compilador ignorará, pero las personas que leen el código fuente pueden encontrar útil.
fr: Tous les programmeurs s'efforcent de rendre leur code facile à comprendre, mais parfois une explication supplémentaire est justifiée. Dans ces cas, les programmeurs laissent des commentaires dans leur code source que le compilateur ignorera, mais les personnes lisant le code source peuvent trouver utile.
id: Semua programmer berusaha untuk membuat kode mereka mudah dimengerti, tetapi kadang-kadang penjelasan tambahan dijamin. Dalam kasus ini, programmer meninggalkan komentar dalam kode sumber mereka bahwa kompiler akan mengabaikan tetapi orang-orang membaca kode sumber mungkin menemukan berguna.
tr: Tüm programcılar kodlarını anlaşılması kolay hale getirmek için çaba gösterirler, ancak bazen ekstra açıklama garanti edilir. Bu durumlarda, programcılar kaynak kodlarında derleyicinin görmezden geleceği ancak kaynak kodu okuyan kişilerin yararlı bulabileceği yorumları bırakırlar.
zh_cn: 所有程序设计员都努力使其代码易于理解,但有时需要额外解释。 在这些情况下,程序设计员在源代码中留下编辑者会忽略的评论,但阅读源代码的人可能会发现有用。

source: Here’s a simple comment:
es: He aquí un simple comentario:
fr: Voici un commentaire simple:
id: Berikut adalah komentar sederhana:
tr: İşte basit bir yorum:
zh_cn: 简而言之,

source: // hello, world
es: // hola, mundo
fr: // Bonjour, monde
tr: // Merhaba, dünya
zh_cn: (你好,世界)

source: In Cairo, the idiomatic comment style starts a comment with two slashes, and the comment continues until the end of the line. For comments that extend beyond a single line, you’ll need to include `//` on each line, like this:
es: En El Cairo, el estilo de comentario idiomático comienza un comentario con dos cortes, y el comentario continúa hasta el final de la línea. Para comentarios que se extienden más allá de una sola línea, tendrá que incluir `//` en cada línea, así:
fr: Au Caire, le style de commentaire idiomatique commence un commentaire avec deux slashes, et le commentaire continue jusqu'à la fin de la ligne. Pour les commentaires qui s'étendent au-delà d'une seule ligne, vous devrez inclure `//` sur chaque ligne, comme ceci:
id: Di Kairo, gaya komentar idimatis dimulai dengan dua slash, dan komentar berlanjut sampai akhir baris. Untuk komentar yang melampaui satu baris saja, Anda harus memasukkan ▪// (slash) pada setiap baris, seperti ini:
tr: Kahire'de, deyimsel yorum stili iki slash ile bir yorum başlatır ve yorum satırın sonuna kadar devam eder. Tek bir satırın ötesine uzanan yorumlar için, her satıra /'yi dahil etmeniz gerekir, örneğin:
zh_cn: 在开罗,单词评论风格以两条斜线开始评论,该评论持续到行尾。 对于超过单行的评论,您需要在每个行都包括`// ',例如:

source: // So we’re doing something complicated here, long enough that we need // multiple lines of comments to do it! Whew! Hopefully, this comment will // explain what’s going on.
es: // Así que estamos haciendo algo complicado aquí, el tiempo suficiente que necesitamos // múltiples líneas de comentarios para hacerlo! Whew! Con suerte, este comentario // explicar lo que está pasando.
fr: // Donc nous faisons quelque chose de compliqué ici, assez longtemps que nous avons besoin // plusieurs lignes de commentaires pour le faire! Whew! Espérons que ce commentaire va // expliquer ce qui se passe.
id: Jadi kita melakukan sesuatu yang rumit di sini, cukup lama bahwa kita perlu beberapa baris komentar untuk melakukannya! Mudah-mudahan, komentar ini akan / / / / menjelaskan apa yang terjadi.
tr: // Burada karmaşık bir şey yapıyoruz, bunu yapmak için // çok sayıda yorum satırına ihtiyacımız var! Whew! Umarım, bu yorum // neler olduğunu açıklayacaktır.
zh_cn: / 所以,我们正在做一些复杂的事情, 足够长的时间,我们需要//多行的评论来做!!Whew! 希望这个评论能解释到底发生了什么。 //

source: Comments can also be placed at the end of lines containing code:
es: Los comentarios también se pueden colocar al final de las líneas que contienen código:
fr: Les commentaires peuvent également être placés à la fin des lignes contenant du code:
id: Komentar juga dapat ditempatkan di akhir baris yang berisi kode:
tr: Yorumlar, kod içeren satırların sonuna da yerleştirilebilir:
zh_cn: 也可在含有代码的行尾列出评论意见:

source: // return the sum of 1 and 4
es: // devolver la suma de 1 y 4
fr: // retourner la somme de 1 et 4
tr: // 1 ve 4'ün toplamını döndürür
zh_cn: / 返回 1 和 4 之和

source: But you’ll more often see them used in this format, with the comment on a separate line above the code it’s annotating:
es: Pero usted verá más a menudo que se utilizan en este formato, con el comentario en una línea separada por encima del código que está anotando:
fr: Mais vous allez plus souvent les voir utilisés dans ce format, avec le commentaire sur une ligne séparée au-dessus du code il est annotant:
id: Tapi Anda akan lebih sering melihat mereka digunakan dalam format ini, dengan komentar pada baris yang terpisah di atas kode itu menganotasi:
tr: Ancak daha sık bu formatta kullanıldıklarını göreceksiniz, kodun üstünde ayrı bir satırdaki yorumla şu şekilde ifade ediyor:
zh_cn: 但您会更经常地看到它们用在这种格式上,

source: // this function performs a simple addition
es: // esta función realiza una simple adición
fr: // cette fonction effectue un ajout simple
id: //fungsi ini melakukan penambahan sederhana
tr: // bu fonksiyon basit bir ekleme gerçekleştirir
zh_cn: / 此函数执行一个简单的添加

source: Item-level Documentation
es: Documentación a nivel de tema
fr: Documentation au niveau des points
id: Dokumentasi Tingkat Butir
tr: Öge-seviyesi Dokümantasyon
zh_cn: 项目级别文件

source: Item-level documentation comments refer to specific items such as functions, implementations, traits, etc. They are prefixed with three slashes (`///`). These comments provide a detailed description of the item, examples of usage, and any conditions that might cause a panic. In case of functions, the comments may also include separate sections for parameter and return value descriptions.
es: Los comentarios de documentación a nivel de ítem se refieren a ítems específicos tales como funciones, implementaciones, rasgos, etc. Están prefijados con tres cortes (`///`). Estos comentarios proporcionan una descripción detallada del ítem, ejemplos de uso, y cualquier condición que pueda causar pánico. En caso de funciones, los comentarios también pueden incluir secciones separadas para descripciones de parámetros y valores de retorno.
fr: Les commentaires relatifs à la documentation au niveau des éléments se rapportent à des éléments spécifiques tels que les fonctions, les implémentations, les traits, etc. Ils sont préfixés par trois slashs (`///`). Ces commentaires fournissent une description détaillée de l'élément, des exemples d'utilisation, et toutes les conditions qui pourraient causer une panique.
id: Komentar dokumentasi tingkat- ltem mengacu ke item spesifik seperti fungsi, implementasi, sifat, dll. Mereka diprefiks dengan tiga garis miring. Komentar ini memberikan deskripsi rinci dari item, contoh penggunaan, dan kondisi apapun yang mungkin menyebabkan panik. Dalam kasus fungsi, komentar mungkin juga termasuk bagian terpisah untuk parameter dan deskripsi nilai kembali.
tr: Öğe düzeyinde dokümantasyon yorumları, fonksiyonlar, uygulamalar, özellikler vb. gibi belirli öğelere atıfta bulunur. Bunlar üç slash (///) ile öne çıkar. Bu yorumlar, öğenin ayrıntılı bir açıklamasını, kullanım örneklerini ve paniğe neden olabilecek herhangi bir durumu sağlar. Fonksiyonlar söz konusu olduğunda, yorumlar parametre ve iade değeri açıklamaları için ayrı bölümler de içerebilir.
zh_cn: 项目级文件评论是指具体项目,如功能、执行、特性等。它们以三条斜线(`///')为前缀,详细描述项目、使用实例和可能引起恐慌的任何条件。如果是功能,评论还可包括参数和返回值说明的单独部分。

source: /// Returns the sum of `arg1` and `arg2`. /// `arg1` cannot be zero. /// /// # Panics /// /// This function will panic if `arg1` is `0`. /// /// # Examples /// /// ``` /// let a: felt252 = 2; /// let b: felt252 = 3; /// let c: felt252 = add(a, b); /// assert(c == a + b, "Should equal a + b"); /// ```
es: /// Devuelve la suma de `arg1` y `arg2`. //// `arg1` no puede ser cero. /// //// # Pánicos // ///// Esta función entrará en pánico si `arg1` es `0`. /// /// # Ejemplos // /// // // let a: feeled252 = 2; /// let b: feeled252 = 3; // let c: feeled252 = add(a, b); // asser(c) == a + b, "Debería igualar a + b"); /// •
fr: /// Renvoie la somme de `arg1` et `arg2`. /// `arg1` ne peut pas être zéro. /// //// # Panics /// //// Cette fonction paniquera si `arg1` est `0`. /// //// # Exemples /// /// ``` /// let a: feel252 = 2; /// let b: feel252 = 3; /// let c: feel252 = add(a, b); /// affert(c) == a + b, "Should egal a + b"); /// ````
id: ///Kembalikan jumlah ·arg1) dan ·arg2. //// ·arg1) tidak dapat berupa nol. ///////////// # Paniks ////////// Ini fungsi akan panik jika Árg1. ///////////# Contoh/////// ///////// / biarkan satu:25 = 2; //bi/bi/biarkan felt2 = 3; /////biarkan c: 25 = 25 = 2 = b); // / / / / //ccc disc == a alc == a - alsoc + / b / / / / o)
tr: /// arg1 ve arg2 toplamını döndürür. /// arg1 sıfır olamaz. // // // /// # Panics // // // /// arg1 0 ise bu fonksiyon panikleyecektir. // // // // // // // // // // // // // / let a: felt252 = 2; /// let b: felt252 = 3;
zh_cn: // 返回`arg1'和`arg2'的和。 // //`arg1'不能为零。 // ///##恐慌 /// /////// /此函数将恐慌,如果`arg1'是`0'。 ////////#示例 /// /// / ////让 a: fel252=3;///让c: feel252=3;// 允许c: fel252=加(a,b);/ 主张(c) a+b,“应该等于a+b”);/ / / / / /

source: Module Documentation
es: Documentación del módulo
fr: Documentation du module
id: Dokumentasi Modul
tr: Modül Dokümantasyonu
zh_cn: 模块文件文件

source: Module documentation comments provide an overview of the entire module, including its purpose and examples of use. These comments are meant to be placed above the module they're describing and are prefixed with `//!`. This type of documentation gives a broad understanding of what the module does and how it can be used.
es: Los comentarios de la documentación del módulo proporcionan una visión general de todo el módulo, incluyendo su propósito y ejemplos de uso. Estos comentarios están destinados a colocarse por encima del módulo que están describiendo y están prefijados con `//!`. Este tipo de documentación da una amplia comprensión de lo que el módulo hace y cómo se puede utilizar.
fr: Les commentaires sur la documentation du module donnent un aperçu de l'ensemble du module, y compris son but et des exemples d'utilisation. Ces commentaires sont censés être placés au-dessus du module qu'ils décrivent et sont préfixés avec `//!`. Ce type de documentation permet de bien comprendre ce que le module fait et comment il peut être utilisé.
id: Komentar dokumentasi modul menyediakan tinjauan seluruh modul, termasuk tujuan dan contoh penggunaannya. Komentar-komentar ini dimaksudkan untuk ditempatkan di atas modul yang mereka gambarkan dan diprefiks dengan ▪//!! Tipe dokumentasi ini memberikan pemahaman luas tentang apa yang modul lakukan dan bagaimana ia dapat digunakan.
tr: Modül dokümantasyon yorumları, amacı ve kullanım örnekleri de dahil olmak üzere tüm modüle genel bir bakış sağlar. Bu yorumlar, tanımladıkları modülün üzerine yerleştirilmek üzere tasarlanmıştır ve /! ile öne çıkmaktadır. Bu dokümantasyon türü, modülün ne yaptığını ve nasıl kullanılabileceğini geniş bir şekilde anlamayı sağlar.
zh_cn: 模块文档评论概括了整个模块,包括其目的和使用实例。这些评论应置于模块之上,以`/!'作为前缀。这类文件广泛了解模块的工作和如何使用。

source: //! # my_module and implementation //! //! This is an example description of my_module and some of its features. //! //! # Examples //! //! ``` //! mod my_other_module { //! use path::to::my_module; //! //! fn foo() { //! my_module.bar(); //! } //! } //! ```
es: //! # my_module and implementation //! //! Esta es una descripción de ejemplo de my_module y algunas de sus características. //! //! # Ejemplos //! //! //! mod my_other_module { //! use path:::to::my_module; //! //! fn foo() { //! my_module.bar(); //! } //! } //!
fr: //! # my_module et implémentation //! //! Voici un exemple de description de my_module et de certaines de ses caractéristiques. //! //! # Exemples //! //! `` //! mod my_other_module { //! utilisez le chemin::to::my_module; //! //! fn foo() { //! my_module.bar(); //! } //! } //! ```
id: //! # my_module and implementation //! This is an example deskripsi dari my_module and some of mys featurs. /! /! # Excess // //! /! /! Module.bar); /!
tr: //! # my_module ve uygulama //! //! Bu, my_module ve bazı özelliklerinin örnek bir açıklamasıdır. //! //! # Örnekler //! //! // mod my_other_module //! kullanım yolu::::: my_module; //! fn foo() //! my_module.bar(); //! //!
zh_cn: / /!! # 我的模块和执行 / / /! 这是对我模块及其某些特征的示例描述 。 / / / / / # 示例 / / / / / / / / /!!! 使用路径 : to: : my_ 模块 ; / / / /! fn foo () {/! my_ 模块.bar (); / / / } / / / / / / / /! / / / / / /!

source: // rest of implementation...
es: // resto de la aplicación...
fr: // reste de la mise en œuvre...
id: #/ rest of implementasi...
tr: // Uygulamanın geri kalanı...
zh_cn: / 执行的其余部分.

source: {{#quiz ../quizzes/ch02-04-comments.toml}}
es: quiz../quizzes/ch02-04-coments.toml
fr: {{#quiz../quizes/ch02-04-comments.toml}}
zh_cn: ./quizzes/ch02-04-comments.toml
