Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Let's consider the following contract for the whole chapter. It might not be easy to understand it all at once, but we will go through it step by step:
es: Consideremos el siguiente contrato para todo el capítulo. Puede que no sea fácil entenderlo todo de una vez, pero lo pasaremos paso a paso:
fr: Considérons le contrat suivant pour l'ensemble du chapitre. Il n'est peut-être pas facile de le comprendre tous à la fois, mais nous allons passer par lui étape par étape:
id: Mari kita pertimbangkan kontrak berikut untuk seluruh bab. mungkin tidak mudah untuk memahami semuanya sekaligus, tapi kita akan pergi melalui itu langkah demi langkah:
tr: Tüm bölüm için aşağıdaki sözleşmeyi düşünelim. Hepsini bir kerede anlamak kolay olmayabilir, ancak bunu adım adım gözden geçireceğiz:
zh_cn: 我们来考虑一下整个章节的以下合同。也许不易一一理解,但我们将一步一步地通过:

source: <span class="caption">Listing 13-1: A simple storage contract</span>
es: <span class="caption">Lista 13-1: Un simple contrato de almacenamiento</span>
fr: <span class="caption">Liste 13-1: Un simple contrat de stockage</span>
id: <span class="caption">Listing 13-1: Sebuah kontrak penyimpanan sederhana</span>
tr: span class="caption">Liste 13-1: Basit bir depolama sözleşmesi/span>
zh_cn: <span类=“caption” > listing 13-1: 简单的储存合同 </span>

source: What Is this Contract?
es: ¿Qué es este Contrato?
fr: C'est quoi ce contrat?
id: Apa Kontrak ini?
tr: Bu Sözleşme Nedir?
zh_cn: 这是什么合同?

source: Contracts are defined by encapsulating state and logic within a module annotated with the `#[starknet::contract]` attribute.
es: Los contratos se definen encapsulando el estado y la lógica dentro de un módulo anotado con el atributo "[starknet::contract]`.
fr: Les contrats sont définis par encapsulation de l'état et de la logique dans un module annoté avec l'attribut `#[starknet::contract]`.
id: Kontrak didefinisikan dengan merangkumkan keadaan dan logika dalam sebuah modul yang dianotasi dengan atribut aktivita ▪#[starknet::contract].
tr: Sözleşmeler, #[starknet::contract] özniteliği ile belirtilen bir modül içindeki durum ve mantığın kapsüllenmesiyle tanımlanır.
zh_cn: 合同的定义是,将状态和逻辑包含在一个配有`[星网:合 属性的单元中。

source: The state is defined within the `Storage` struct, and is always initialized empty. Here, our struct contains a single a field called `stored_data` of type `u128` (unsigned integer of 128 bits), indicating that our contract can store any number between 0 and \\( {2^{128}} - 1 \\).
es: El estado se define dentro de la estructura `Almacenamiento`, y siempre se inicializa vacío. Aquí, nuestra estructura contiene un solo campo llamado `stored_data` de tipo `u128` (un número entero sin firmar de 128 bits), lo que indica que nuestro contrato puede almacenar cualquier número entre 0 y
fr: L'état est défini dans la structure `Storage`, et est toujours initialisé vide. Ici, notre structure contient un seul champ appelé `stored_data` de type `u128` (entier non signé de 128 bits), indiquant que notre contrat peut stocker n'importe quel nombre entre 0 et \\( {2^{128}} - 1 \\).
id: Di sini, struktur kami berisi satu bidang yang disebut Ástorage_data tipe ·u128 (tidak tertandai integer 128 bits), menunjukkan bahwa kontrak kami dapat menyimpan nomor apapun antara 0 dan \\ (2{128)} - 1\\).
tr: Durum, Storage yapısı içinde tanımlanır ve her zaman boş olarak başlatılır. Burada, u128 tipinde stored_data adlı tek bir alan bulunur (128 bitlik imzasız tam sayı), bu da sözleşmemizin 0 ile (2128 - 1) arasındaki herhangi bir sayıyı depolayabileceğini gösterir.
zh_cn: 状态定义在“ 标准” 结构内, 并且总是初始化为空 。 在这里, 我们的结构包含一个名为 u128 类型“ 储存数据” 的字段( 未签名的整数为 128 位), 表明我们的合同可以在 0 到\\\ ( {2\\\\ 128\\ - 1\\) 之间存储任何数字 。

source: The logic is defined by functions that interact with the state. Here, our contract defines and publicly exposes the functions `set` and `get` that can be used to modify or retrieve the value of the stored variable. You can think of it as a single slot in a database that you can query and modify by calling functions of the code that manages the database.
es: La lógica está definida por funciones que interactúan con el estado. Aquí, nuestro contrato define y expone públicamente las funciones `set` y `get` que se pueden utilizar para modificar o recuperar el valor de la variable almacenada. Puede pensar en ello como una única ranura en una base de datos que puede consultar y modificar llamando a las funciones del código que administra la base de datos.
fr: La logique est définie par des fonctions qui interagissent avec l'état. Ici, notre contrat définit et expose publiquement les fonctions `set` et `get` qui peuvent être utilisées pour modifier ou récupérer la valeur de la variable stockée. Vous pouvez le considérer comme un seul emplacement dans une base de données que vous pouvez interroger et modifier en appelant les fonctions du code qui gère la base de données.
id: Logika didefinisikan oleh fungsi yang berinteraksi dengan negara. di sini, kontrak kami mendefinisikan dan mengekspos secara terbuka fungsi-fungsi tersebut dan dapat digunakan untuk memodifikasi atau mengambil nilai dari variabel yang tersimpan. Anda dapat menganggapnya sebagai slot tunggal dalam database yang dapat Anda periksa dan modifikasi dengan memanggil fungsi kode yang mengatur database.
tr: Mantık, devletle etkileşime giren işlevlerle tanımlanır. Burada, sözleşmemiz, depolanan değişkenin değerini değiştirmek veya almak için kullanılabilecek set ve get işlevlerini tanımlar ve halka açıklar. Veritabanını yöneten kodun işlevlerini arayarak sorgulayabileceğiniz ve değiştirebileceğiniz bir veritabanındaki tek bir yuva olarak düşünebilirsiniz.
zh_cn: 逻辑由与国家互动的函数来定义。 在这里, 我们的合同定义并公开披露“ 设置” 和“ 获取” 功能, 用于修改或检索存储变量的价值。 您可以把它视为数据库中的一个单行位, 您可以调用管理数据库的代码的函数来查询和修改 。

source: The Interface: the Contract's Blueprint
es: La interfaz: el plan del contrato
fr: L'interface : le plan directeur du contrat
tr: Arayüz: Sözleşmenin Mavi Baskısı
zh_cn: 接口:合同的蓝图

source: <span class="caption">Listing 13-2: A basic contract interface</span>
es: <span class="caption">Lista 13-2: Una interfaz de contrato básica</span>
fr: <span class="caption">Liste 13-2: Une interface de contrat de base</span>
id: <span class="caption">Listing 13-2: Sebuah antar muka kontrak dasar</span>
tr: span class="caption">Liste 13-2: Temel bir sözleşme arayüzü/span>
zh_cn: <span类=“caption” >Listing 13-2:基本合同界面 </span>

source: Interfaces represent the blueprint of the contract. They define the functions that the contract exposes to the outside world. In Cairo, they're defined by annotating a trait with the `#[starknet::interface]` attribute. All functions of the trait are considered public functions of any contract that implements this trait, and are callable from the outside world.
es: Las interfaces representan el plano del contrato. Define las funciones que el contrato expone al mundo exterior. En El Cairo, se definen anotando un rasgo con el atributo •[starknet::interface]`. Todas las funciones del rasgo se consideran funciones públicas de cualquier contrato que implementa este rasgo, y son susceptibles de ser invocadas desde el mundo exterior.
fr: Les interfaces représentent le plan du contrat. Elles définissent les fonctions que le contrat expose au monde extérieur. Au Caire, elles sont définies par annotation d'un trait avec l'attribut `#[starknet::interface]`. Toutes les fonctions du trait sont considérées comme des fonctions publiques de tout contrat qui implémente ce trait, et sont appelables du monde extérieur.
id: Antar muka mewakili cetak biru kontrak. Mereka mendefinisikan fungsi yang dieksposkan kontrak ke dunia luar. Di Kairo, mereka didefinisikan dengan mengnotasi sebuah sifat dengan atribut antar-muka:. Semua fungsi sifat dianggap fungsi publik dari setiap kontrak yang menerapkan sifat ini, dan dapat dipanggil dari dunia luar.
tr: Arayüzler, sözleşmenin planını temsil eder. Sözleşmenin dış dünyaya ifşa ettiği işlevleri tanımlarlar. Kahire'de, #[starknet::interface] özniteliği ile bir özellik belirterek tanımlanırlar. Özelliğin tüm işlevleri, bu özelliği uygulayan ve dış dünyadan çağrılabilen herhangi bir sözleşmenin kamu işlevleri olarak kabul edilir.
zh_cn: 界面代表合同的蓝图。 它们定义了合同对外部世界所暴露的功能。 在开罗, 它们的定义是用“ 星网: 界面” 属性来说明特性。 特性的所有功能都被视为任何执行该特性的合同的公共功能, 并且可以被外部世界所呼唤 。

source: All contract interfaces use a generic type for the `self` parameter, representing the contract state. We chose to name this generic parameter `TContractState` in our interface, but this is not enforced and any name can be chosen.
es: Todas las interfaces de contrato utilizan un tipo genérico para el parámetro `self`, que representa el estado del contrato. Elegimos nombrar este parámetro genérico `TContractState` en nuestra interfaz, pero esto no se hace cumplir y se puede elegir cualquier nombre.
fr: Toutes les interfaces contractuelles utilisent un type générique pour le paramètre `self`, représentant l'état du contrat. Nous avons choisi de nommer ce paramètre générique `TContractState` dans notre interface, mais cela n'est pas appliqué et n'importe quel nom peut être choisi.
id: Semua antarmuka kontrak menggunakan sebuah tipe generik untuk parameter sendiri, mewakili kondisi kontrak. Kami memilih untuk menamai parameter generik ini TContractState di antarmuka kami, tapi ini tidak berlaku dan nama apapun yang dapat dipilih.
tr: Tüm sözleşme arayüzleri, sözleşme durumunu temsil eden self parametresi için genel bir tür kullanır. Arayüzümüzde bu genel parametreyi TContractState olarak adlandırmayı seçtik, ancak bu zorunlu değildir ve herhangi bir isim seçilebilir.
zh_cn: 所有合同界面都使用通用类型,用于“自我”参数,代表合同状态。我们选择在界面中命名该通用参数“缔约方”,但这不是强制的,可以选择任何名称。

source: In our interface, note the generic type `TContractState` of the `self` argument which is passed by reference to the `set` function. Seeing the `self` argument passed in a contract function tells us that this function can access the state of the contract. The `ref` modifier implies that `self` may be modified, meaning that the storage variables of the contract may be modified inside the `set` function.
es: En nuestra interfaz, tenga en cuenta el tipo genérico `TContractState` del argumento `auto' que se pasa por referencia a la función `set`. Al ver el argumento `auto` aprobado en una función contractual, nos indica que esta función puede acceder al estado del contrato. El `ref` modificador implica que `auto` puede modificarse, lo que significa que las variables de almacenamiento del contrato pueden modificarse dentro de la función `set`.
fr: Dans notre interface, notez le type générique `TContractState` de l'argument `self` qui est passé par référence à la fonction `set`. En voyant l'argument `self` passé dans une fonction contractuelle nous indique que cette fonction peut accéder à l'état du contrat. Le modificateur `ref` implique que `self` peut être modifié, ce qui signifie que les variables de stockage du contrat peuvent être modifiées à l'intérieur de la fonction `set`.
id: Dalam interface kami, perhatikan tipe umum dari argumen umum TContractstate dari diri sendiri yang dilewatkan sebagai referensi ke fungsi ·set. Melihat argumen diri sendiri lewat dalam sebuah fungsi kontrak memberitahu kita bahwa fungsi ini dapat mengakses keadaan dari kontrak. Pemodifikasi yang menyatakan bahwa sendiri dapat dimodifikasi, berarti bahwa variabel penyimpanan dari kontrak dapat diubah di dalam fungsi thoseset.
tr: Arayüzümüzde, set fonksiyonuna atıfla geçen self argümanının tContractState jenerik tipine dikkat edin. self argümanının bir sözleşme işlevinde geçtiğini görmek, bu fonksiyonun sözleşmenin durumuna erişebileceğini söyler. ref değiştiricisi, self'in değiştirilebileceği anlamına gelir, yani sözleşmenin depolama değişkenleri setset fonksiyonu içinde değiştirilebilir.
zh_cn: 在我们的界面中,请注意“自我”论点的通用类型`合同国',该论点通过提及`赛特'功能而通过。看到合同函数中通过的`自我'论点告诉我们,这一功能可以进入合同状态。`检索`修改者意味着`自我'可以修改,这意味着合同的储存变量可以在`赛特'功能中修改。

source: On the other hand, the `get` function takes a snapshot of `TContractState`, which immediately tells us that it does not modify the state (and indeed, the compiler will complain if we try to modify storage inside the `get` function).
es: Por otra parte, la función `get` toma una instantánea de `TContractState`, que inmediatamente nos dice que no modifica el estado (y de hecho, el compilador se quejará si tratamos de modificar el almacenamiento dentro de la función `get`).
fr: D'autre part, la fonction `get` prend un instantané de `TContractState`, qui nous dit immédiatement qu'il ne modifie pas l'état (et en effet, le compilateur se plaindra si nous essayons de modifier le stockage à l'intérieur de la fonction `get`).
id: Di sisi lain, fungsinya mengambil foto dari Contractstate, yang langsung memberi tahu kita bahwa fungsinya tidak memodifikasi negara (dan memang, kompiler akan mengeluh jika kita mencoba memodifikasi penyimpanan di dalam fungsi thoseget).
tr: Öte yandan, get işlevi TContractState'in bir anlık görüntüsünü alır, bu da bize hemen durumu değiştirmediğini söyler (ve gerçekten de, derleyici get işlevinin içindeki depolamayı değiştirmeye çalışırsak şikayet edecektir).
zh_cn: 另一方面,`获取'功能对`缔约国'进行截图,立即告诉我们,它不会改变状态(事实上,汇编者会抱怨,如果我们试图修改`获取'功能内的储存)。

source: By leveraging the [traits & impls](./ch08-02-traits-in-cairo.md) mechanism from Cairo, we can make sure that the actual implementation of the contract matches its interface. In fact, you will get a compilation error if your contract doesn’t conform with the declared interface. For example, Listing 13-3 shows a wrong implementation of the `ISimpleStorage` interface, containing a slightly different `set` function that doesn't have the same signature.
es: Al aprovechar el mecanismo [traits & impls](./ch08-02-traits-in-cairo.md) de El Cairo, podemos asegurarnos de que la aplicación real del contrato coincide con su interfaz. De hecho, obtendrá un error de compilación si su contrato no se ajusta a la interfaz declarada. Por ejemplo, el listado 13-3 muestra una implementación incorrecta de la interfaz `IsimpleStorage`, que contiene una función `set` ligeramente diferente que no tiene la misma firma.
fr: En tirant parti du mécanisme [trats & impls](./ch08-02-trats-in-cairo.md) du Caire, nous pouvons nous assurer que l'implémentation réelle du contrat correspond à son interface. En fait, vous obtiendrez une erreur de compilation si votre contrat ne se conforme pas à l'interface déclarée. Par exemple, Listing 13-3 montre une mauvaise implémentation de l'interface `ISimpleStorage`, contenant une fonction `set` légèrement différente qui n'a pas la même signature.
id: Dengan memanfaatkan mekanisme [traits & impls][ch08-02-traits-in-cairo.med) dari Kairo, kita dapat memastikan bahwa implementasi kontrak yang sebenarnya cocok dengan antarmukanya. Pada kenyataannya, Anda akan mendapatkan kesalahan kompilasi jika kontrak Anda tidak sesuai dengan antarmuka yang dideklarasikan. Sebagai contoh, Daftar 13-3 menunjukkan implementasi yang salah dari antarmuka RIAISIMPLEage CD, berisi fungsi yang sedikit berbeda yang tidak memiliki tanda tangan yang sama.
tr: Kahire'den [traits & impls](./ch08-02-traits-in-cairo.md) mekanizmasından yararlanarak, sözleşmenin gerçek uygulamasının arayüzüyle eşleştiğinden emin olabiliriz. Aslında, sözleşmeniz ilan edilen arayüze uymuyorsa bir derleme hatası alırsınız. Örneğin, Listeleme 13-3, aynı imzaya sahip olmayan ISampleStorage arayüzünün yanlış bir uygulamasını gösterir.
zh_cn: 通过利用开罗的[traits & Impls] (./ch08-02-traits- in-cairo.md) 机制,我们可以确保合同的实际执行与其界面相符。 事实上, 如果您的合同与所申报的界面不相符, 您将会收到一个编译错误。 例如, 列出 13-3 显示“ 简单标准” 界面的错误执行, 包含略微不同的“ 设置” 功能, 且该功能没有相同的签名 。

source: <span class="caption">Listing 13-3: A wrong implementation of the interface of the contract. This does not compile, as the signature of `set` doesn't match the trait's.</span>
es: <span class="caption">Lista 13-3: Una implementación incorrecta de la interfaz del contrato. Esto no se compila, ya que la firma de `set` no coincide con la de los rasgos.</span>
fr: <span class="caption">Liste 13-3: Une mauvaise implémentation de l'interface du contrat. Cela ne compile pas, car la signature de `set` ne correspond pas au caractère.</span>
id: <span class="caption">Listing 13-3: Sebuah implementasi yang salah dari antar muka kontrak. Ini tidak mengkompilasi, sebagai tanda tangan dari set tidak cocok dengan sifat.</span>
tr: span class="caption">Liste 13-3: Sözleşmenin arayüzünün yanlış bir şekilde uygulanması. set imzası özelliğinkiyle eşleşmediği için bu derleme yapmaz./span>
zh_cn: <span类=“caption” > listing 13-3: 合同接口执行错误。 由于` set' 的签名与特性不符, 此签名无法编译 。 </span>

source: Trying to compile a contract using this implementation will result in the following error:
es: Intentar compilar un contrato usando esta implementación resultará en el siguiente error:
fr: Essayer de compiler un contrat en utilisant cette implémentation entraînera l'erreur suivante:
id: Mencoba mengkompilasi kontrak menggunakan implementasi ini akan mengakibatkan galat berikut:
tr: Bu uygulamayı kullanarak bir sözleşme derlemeye çalışmak aşağıdaki hataya neden olacaktır:
zh_cn: 试图使用此项执行来汇编合同将导致以下错误:

source: Public Functions Defined in an Implementation Block
es: Funciones públicas definidas en un bloque de implementación
fr: Fonctions publiques définies dans un bloc de mise en œuvre
id: Fungsi Publik Didefinisikan dalam Blok Implementasi
tr: Bir Uygulama Blokunda Tanımlanan Kamu İşlevleri
zh_cn: 执行区块中定义的公共功能

source: Before we explore things further down, let's define some terminology.
es: Antes de explorar las cosas más abajo, definamos algo de terminología.
fr: Avant d'explorer les choses plus loin, définissons une terminologie.
id: Sebelum kita menjelajahi hal-hal lebih lanjut ke bawah, mari kita definisikan beberapa terminologi.
tr: Olayları daha aşağıda incelemeden önce, biraz terminoloji tanımlayalım.
zh_cn: 在我们进一步探索之前, 让我们来定义一些术语。

source: In the context of Starknet, a _public function_ is a function that is exposed to the outside world. A public function can be called by anyone, either from outside the contract or from within the contract itself. In the example above, `set` and `get` are public functions.
es: En el contexto de Starknet, una función pública es una función que está expuesta al mundo exterior. Una función pública puede ser llamada por cualquier persona, ya sea desde fuera del contrato o desde dentro del propio contrato. En el ejemplo anterior, `set` y `get` son funciones públicas.
fr: Dans le contexte de Starknet, une fonction publique est une fonction exposée au monde extérieur. Une fonction publique peut être appelée par n'importe qui, soit de l'extérieur du contrat, soit de l'intérieur du contrat lui-même. Dans l'exemple ci-dessus, `set` et `get` sont des fonctions publiques.
id: Dalam konteks Starknet, fungsi _publik adalah fungsi yang terpapar dunia luar. Fungsi publik dapat dipanggil oleh siapa saja, baik dari luar kontrak atau dari dalam kontrak itu sendiri.
tr: Starknet bağlamında, bir _public function_ dış dünyaya maruz kalan bir fonksiyondur. Bir kamu işlevi, sözleşmenin dışından veya sözleşmenin kendisinden herkes tarafından çağrılabilir. Yukarıdaki örnekte, set ve get kamu fonksiyonlarıdır.
zh_cn: 在史塔克内特背景下,`公共职能'是一种与外部世界接触的功能,任何人,无论是从合同之外还是从合同本身之内,都可以要求公共职能,在上文的例子中,`set'和`get'是公共职能。

source: What we call an _external_ function is a public function that can be directly invoked through a Starknet transaction and that can mutate the state of the contract. `set` is an external function.
es: Lo que llamamos una función _external_ es una función pública que puede ser invocada directamente a través de una transacción Starknet y que puede mutar el estado del contrato. `set` es una función externa.
fr: Ce que nous appelons une fonction _externe_ est une fonction publique qui peut être directement invoquée par le biais d'une transaction Starknet et qui peut muter l'état du contrat. `set` est une fonction externe.
id: Apa yang kita sebut fungsi _external adalah fungsi publik yang dapat secara langsung dipanggil melalui transaksi Starknet dan yang dapat mengubah keadaan kontrak.
tr: Bir _external_ fonksiyonu dediğimiz şey, bir Starknet işlemiyle doğrudan çağrılabilen ve sözleşmenin durumunu değiştirebilen bir kamu işlevidir. set harici bir işlevdir.
zh_cn: 我们称之为`外部'功能的是一种公共功能,可以通过斯塔克内交易直接援引,并能够改变合同状态。 " 赛特 " 是一种外部功能。

source: A _view_ function is a public function that is typically read-only and cannot mutate the state of the contract. However, this limitation is only enforced by the compiler, and not by Starknet itself. We will discuss the implications of this in a later section. `get` is a view function.
es: Una función _view_ es una función pública que es típicamente de sólo lectura y no puede mutar el estado del contrato. Sin embargo, esta limitación sólo es aplicada por el compilador, y no por Starknet mismo. Vamos a discutir las implicaciones de esto en una sección posterior. `get` es una función de vista.
fr: Une fonction _view_ est une fonction publique qui est typiquement en lecture seule et ne peut pas muter l'état du contrat. Cependant, cette limitation n'est appliquée que par le compilateur, et non par Starknet lui-même. Nous allons discuter des implications de cela dans une section ultérieure. `get` est une fonction de vue.
id: Fungsi _view_ adalah fungsi publik yang biasanya hanya dibaca dan tidak dapat mengubah keadaan kontrak. Namun, pembatasan ini hanya ditegakkan oleh kompiler, dan bukan oleh Starknet sendiri. Kita akan membahas implikasi dari ini dalam bagian selanjutnya.
tr: Bir _view_ işlevi, genellikle salt okunur olan ve sözleşmenin durumunu değiştiremeyen bir kamu işlevidir. Bununla birlikte, bu sınırlama yalnızca derleyici tarafından uygulanır, Starknet'in kendisi tarafından değil. Bunun sonuçlarını daha sonraki bir bölümde tartışacağız. get bir görünüm işlevidir.
zh_cn: _view_ 函数是一种公共功能,通常只读,不能改变合同状态。然而,这一限制只由编译者执行,而不是由Starknet本身执行。我们将在后面的一节中讨论这一点的影响。`get'是一个视图函数。

source: <span class="caption">Listing 13-4: `SimpleStorage` implementation</span>
es: <span class="caption">Lista 13-4: `SimpleStorage` implementation</span>
fr: <span class="caption">Liste 13-4: `SimpleStorage` implémentation</span>
id: <span class="caption">Listing 13-4:.impleStorage) implementasi</span>
tr: span class="caption">Liste 13-4: BasitDepolama uygulaması/span>
zh_cn: <span类=“caption” > listing 13-4:`简单'执行 </span>

source: Since the contract interface is defined as the `ISimpleStorage` trait, in order to match the interface, the public functions of the contract must be defined in an implementation of this trait — which allows us to make sure that the implementation of the contract matches its interface.
es: Dado que la interfaz del contrato se define como el rasgo `IsimpleStorage`, para que coincida con la interfaz, las funciones públicas del contrato deben definirse en una aplicación de este rasgo, lo que nos permite asegurarnos de que la ejecución del contrato coincide con su interfaz.
fr: Étant donné que l'interface contractuelle est définie comme le caractère «ISimpleStorage», afin de correspondre à l'interface, les fonctions publiques du contrat doivent être définies dans une mise en œuvre de ce caractère, ce qui nous permet de nous assurer que la mise en œuvre du contrat correspond à son interface.
id: Karena antarmuka kontrak didefinisikan sebagai sifat æisimpleStorage, untuk mencocokkan antarmuka, fungsi publik dari kontrak harus didefinisikan dalam implementasi sifat ini yang memungkinkan kita untuk memastikan bahwa implementasi kontrak cocok dengan antarmukanya.
tr: Sözleşme arayüzü IsimpleStorage özelliği olarak tanımlandığından, arayüzle eşleşmek için, sözleşmenin kamu işlevleri bu özelliğin uygulanmasında tanımlanmalıdır - bu da sözleşmenin uygulanmasının arayüzüyle eşleştiğinden emin olmamızı sağlar.
zh_cn: 由于合同接口被界定为`简单'特性,为了与接口相匹配,合同的公共职能必须在执行这一特性时加以界定——这使我们能够确保合同的执行与其接口相匹配。
