Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Throughout this chapter, we will be using as an example the `PizzaFactory` contract in Listing 17-1 to demonstrate how to write tests with Starknet Foundry.
es: A lo largo de este capítulo, utilizaremos como ejemplo el contrato `PizzaFactory` en la Lista 17-1 para demostrar cómo escribir pruebas con Starknet Foundry.
fr: Tout au long de ce chapitre, nous utiliserons comme exemple le contrat `PizzaFactory` dans Listing 17-1 pour démontrer comment écrire des tests avec Starknet Foundry.
id: Di seluruh bab ini, kami akan menggunakan sebagai contoh kontrak PizzaFactory dalam daftar 17-1 untuk menunjukkan bagaimana menulis tes dengan Starknet Foundry.
tr: Bu bölüm boyunca, Starknet Foundry ile testlerin nasıl yazılacağını göstermek için Listeleme 17-1'deki PizzaFactory sözleşmesini örnek olarak kullanacağız.
zh_cn: 在整个本章中,我们将以17-1清单中的`Pizza Factory'合同为例,示范如何与Starknet Foundry进行测试。

source: "Amount cannot be 0"
es: "La cantidad no puede ser 0"
fr: "Le montant ne peut pas être 0"
tr: "Dağ 0 olamaz"
zh_cn: "数量不能为 0"

source: "Not enough pepperoni"
es: "No hay suficiente pepperoni"
fr: "Pas assez de pepperoni"
id: "Tidak cukup pepperoni"
tr: "Yeterince pepperoni yok"
zh_cn: "香肠不够"

source: "Not enough pineapple"
es: "No hay suficiente piña"
fr: "Pas assez d'ananas"
id: "Tidak cukup nanas"
tr: "Yeterince ananas yok"
zh_cn: "菠萝不够"

source: "Only the owner can make pizza"
es: "Sólo el dueño puede hacer pizza"
fr: "Seul le propriétaire peut faire de la pizza"
id: "Hanya pemilik yang bisa membuat pizza"
tr: "Sadece sahibi pizza yapabilir"
zh_cn: "只有店主才能做披萨"

source: "Only the owner can set ownership"
es: "Sólo el propietario puede establecer la propiedad"
fr: "Seul le propriétaire peut définir la propriété"
id: "Hanya pemilik yang dapat menetapkan kepemilikan"
tr: "Sahipliği sadece sahibi belirleyebilir"
zh_cn: "只有所有者才能确定所有权"

source: <span class="caption">Listing 17-1: A pizza factory that needs to be tested</span>
es: <span class="caption">Lista 17-1: Una fábrica de pizzas que necesita ser probada</span>
fr: <span class="caption">Liste 17-1: Une usine de pizza qui doit être testée</span>
id: <span class="caption">Listing 17-1: Sebuah pabrik pizza yang perlu diuji</span>
tr: span class="caption">Liste 17-1: Test edilmesi gereken bir pizza fabrikası/span>
zh_cn: <span class="caption" > listing 17-1:需要测试的披萨工厂 </span>

source: Configuring your Scarb project with Starknet Foundry
es: Configurando tu proyecto Scarb con Starknet Foundry
fr: Configuration de votre projet Scarb avec Starknet Foundry
id: Menata proyek Scarb Anda dengan Starknet Foundry
tr: Starknet Foundry ile Scarb projenizi yapılandırma
zh_cn: 与 Starknet 铸造公司一起配置您的刀疤项目

source: The settings of your Scarb project can be configured in the `Scarb.toml` file. To use Starknet Foundry as your testing tool, you will need to add it as a dev dependency in your `Scarb.toml` file. At the time of writing, the latest version of Starknet Foundry is `v0.22.0` - but you should use the latest version.
es: Los ajustes de su proyecto Scarb se pueden configurar en el archivo `Scarb.toml`. Para utilizar Starknet Foundry como su herramienta de prueba, tendrá que añadirlo como una dependencia dev en su archivo `Scarb.toml`. En el momento de escribir, la última versión de Starknet Foundry es `v0.22.0` - pero debe utilizar la última versión.
fr: Les paramètres de votre projet Scarb peuvent être configurés dans le fichier `Scarb.toml`. Pour utiliser Starknet Foundry comme outil de test, vous devrez l`ajouter comme dépendance dev dans votre fichier `Scarb.toml`. Au moment de l`écriture, la dernière version de Starknet Foundry est `v0.22.0` - mais vous devriez utiliser la dernière version.
id: Pengaturan dari proyek Scarb Anda dapat dikonfigurasi dalam berkas ▪Scarb.toml.toml. Untuk menggunakan Starknet Foundry sebagai alat pengujian Anda, Anda perlu menambahkannya sebagai dependensi dalam berkas ÁScarb.toml. Pada saat menulis, versi terbaru dari Starknet Foundry adalah <0.0.0.02 - tetapi Anda harus menggunakan versi terbaru.
tr: Scarb projenizin ayarları Scarb.toml dosyasında yapılandırılabilir. Starknet Foundry'i test aracınız olarak kullanmak için Scarb.toml dosyanızda bir dev bağımlılığı olarak eklemeniz gerekir. Yazma sırasında, Starknet Foundry'nin en son sürümü v0.22.0 - ancak en son sürümü kullanmanız gerekir.
zh_cn: 您的刀疤工程的设置可以配置在 `Scarb.toml' 文件中。 要使用 Starknet Foundry 作为测试工具, 您需要在您的“ Scarb. toml” 文件中添加此设置作为 dev 依赖性。 在撰写本文件时, Starknet Foundry 的最新版本是`v0. 22.0' - 但你应该使用最新版本 。

source: ```toml,noplayground [dev-dependencies] snforge_std = { git = "https://github.com/foundry-rs/starknet-foundry.git", tag = "v0.22.0" } [scripts] test = "snforge test" ```
es: «toml,noplayground [dev-dependencias] snforge_std = { git = "https://github.com/foundry-rs/starknet-foundry.git", tag = "v0.22.0" } [scripts] test = "snforge test"
fr: ```toml,noplayground [dev-dependences] snforge_std = { git = "https://github.com/foundry-rs/starknet-foundry.git", tag = "v0.22" } [scripts] test = "snforge test" ``
id: Snforge_std = { git = "https://github.com/foundry-rs/starknet-foundry.git" tag = "v0.22.0"} [scripts] test = "snosforge test"
tr: toml,noplayground [dev-dependencys] snforge_std = git = "https://github.com/foundry-rs/starknet-foundry.git", tag = "v0.22.0" [scripts] test = "snforge test"
zh_cn: @toml, noplayfloor [dev-dependies] snforge_std = {git = "https://gitub.com/foundry-rs/foundry-rs/starknet-foundry.git",标签= "v0.22.0" }[脚本] 测试= " snforge test" = screts

source: The `scarb test` command is configured to execute `scarb cairo-test` by default. In our settings, we have configured it to execute `snforge test` instead. This will allow us to run our tests using Starknet Foundry when we run the `scarb test` command.
es: El comando `scarb test` está configurado para ejecutar `scarb cairo-test` por defecto. En nuestra configuración, lo hemos configurado para ejecutar `snforge test` en su lugar. Esto nos permitirá ejecutar nuestras pruebas usando Starknet Foundry cuando ejecutemos el comando `scarb test`.
fr: La commande `scarb test` est configurée pour exécuter `scarb cairo-test` par défaut. Dans nos paramètres, nous l'avons configuré pour exécuter `snforge test` à la place. Cela nous permettra d'exécuter nos tests en utilisant Starknet Foundry lors de l'exécution de la commande `scarb test`.
id: Perintah ini dikonfigurasi untuk melaksanakannya secara baku. ini akan memungkinkan kita untuk menjalankan tes kita menggunakan Starknet Foundry ketika kita menjalankan tes karbob.
tr: scarb test komutu varsayılan olarak scarb cairo-test çalıştırılacak şekilde yapılandırılmıştır. Ayarlarımızda, bunun yerine snforge test çalıştıracak şekilde yapılandırdık. Bu, scarb test komutunu çalıştırdığımızda Starknet Foundry kullanarak testlerimizi çalıştırmamızı sağlayacaktır.
zh_cn: `碳试验' 命令被配置为默认地执行`碳试验'。在我们设置中,我们已经配置了它来执行`鼻孔试验',这将使我们能够在运行`碎片试验'命令时使用Starknet Foundry进行测试。

source: Once your project is configured, you will need to install Starknet Foundry by following the installation guide from the [Starknet Foundry Documentation](https://foundry-rs.github.io/starknet-foundry/getting-started/installation.html). As usual, we recommend to use `asdf` to manage versions of your development tools.
es: Una vez que su proyecto esté configurado, tendrá que instalar Starknet Foundry siguiendo la guía de instalación de [Starknet Foundry Documentation](https://foundry-rs.github.io/starknet-foundry/getting-started/installation.html). Como de costumbre, recomendamos utilizar `asdf` para administrar versiones de sus herramientas de desarrollo.
fr: Une fois votre projet configuré, vous devrez installer Starknet Foundry en suivant le guide d'installation du [Starknet Foundry Documentation] (https://foundry-rs.github.io/starknet-Foundry/getting-started/installation.html). Comme d'habitude, nous vous recommandons d'utiliser `asdf` pour gérer les versions de vos outils de développement.
id: Setelah proyek Anda dikonfigurasi, Anda perlu memasang Starknet Foundry dengan mengikuti panduan instalasi dari [Penyitaan Pendirian Starknet]
tr: Projeniz yapılandırıldıktan sonra, [Starknet Dökümantasyonu] [https://foundry-rs.github.io/starknet-foundry/getting-started/installation.html] kurulum kılavuzunu izleyerek Starknet Dökümanını yüklemeniz gerekecektir. Her zamanki gibi, geliştirme araçlarınızın sürümlerini yönetmek için asdf kullanmanızı öneririz.
zh_cn: 一旦您的工程配置完毕, 您将需要安装 Starknet Foundry, 并遵循[ Starknet Foundry Documents] (https://foundry- rs.github.io/starknet- foundry/getting- started/stallation. html) 的安装指南。 和往常一样, 我们建议使用“ asdf” 来管理您的开发工具的版本 。

source: Testing Smart Contracts with Starknet Foundry
es: Prueba de contratos inteligentes con la fundición Starknet
fr: Tester des contrats intelligents avec Starknet Foundry
id: Menguji Kontrak Cerdas dengan Pendirian Starknet
tr: Starknet Foundry ile Akıllı Sözleşmeleri Test Etmek
zh_cn: 与斯塔克内特铸造公司测试智能合同

source: The usual command to run your tests using Starknet Foundry is `snforge test`. However, when we configured our projects, we defined that the `scarb test` command will run the `snforge test` command. Therefore, during the rest of this chapter, consider that the `scarb test` command will be using `snforge test` under the hood.
es: El comando habitual para ejecutar sus pruebas usando Starknet Foundry es `snforge test`. Sin embargo, cuando configuramos nuestros proyectos, definimos que el comando `scarb test` ejecutará el comando `snforge test`. Por lo tanto, durante el resto de este capítulo, considere que el comando `scarb test` usará `snforge test` bajo el capó.
fr: La commande habituelle pour exécuter vos tests en utilisant Starknet Foundry est `snforge test`. Cependant, lorsque nous avons configuré nos projets, nous avons défini que la commande `scarb test` exécutera la commande `snforge test`. Par conséquent, pendant le reste de ce chapitre, considérez que la commande `scarb test` utilisera `snforge test` sous le capot.
id: Perintah biasa untuk menjalankan tes menggunakan Starknet Foundry adalah tes ·snforge. namun, ketika kami mengatur proyek-proyek kami, kami menyatakan bahwa perintah tes karab akan menjalankan tes ·snforge.
tr: Starknet Foundry kullanarak testlerinizi yürütmek için olağan komut snforge test'dir. Ancak, projelerimizi yapılandırdığımızda, scarb test komutunun snforge test komutunu çalıştıracağını tanımladık. Bu nedenle, bu bölümün geri kalanında, scarb test komutunun başlık altında snforge test kullanacağını düşünün.
zh_cn: 使用 Starknet Foundry 进行测试的通常命令是`鼻孔试验 ',然而,当我们配置项目时,我们确定`刀疤试验'命令将运行`鼻孔试验'命令,因此,在本章其余部分,考虑`刀疤试验'命令将使用头罩下的`鼻孔试验'。

source: The usual testing flow of a contract is as follows:
es: El flujo de ensayo habitual de un contrato es el siguiente:
fr: Le flux d'essai habituel d'un contrat est le suivant:
id: Tes yang biasa mengalir dari kontrak adalah sebagai berikut:
tr: Bir sözleşmenin olağan test akışı aşağıdaki gibidir:
zh_cn: 合同通常的测试流程如下:

source: Declare the class of the contract to test, identified by its name
es: Declarar la clase del contrato a probar, identificada por su nombre
fr: Déclarer la classe du contrat à tester, identifiée par son nom
id: Menyatakan kelas kontrak untuk menguji, diidentifikasi dengan namanya
tr: Test etmek için sözleşmenin sınıfını ilan et, adı ile tanımlanan
zh_cn: 宣布以其名称标明的检验合同类别

source: Serialize the constructor calldata into an array
es: Serializar los datos de llamada del constructor en un array
fr: Sérialiser les calldata du constructeur dans un tableau
id: Serialisasi konstruktor calldata ke dalam sebuah array
tr: Constructor CallData'yı bir dizi halinde serileştirin
zh_cn: 将构建器调用数据序列化为数组

source: Deploy the contract and retrieve its address
es: Implementar el contrato y recuperar su dirección
fr: Déployer le contrat et récupérer son adresse
id: Sebarkan kontrak dan mengambil alamat
tr: Sözleşmeyi dağıtın ve adresini alın
zh_cn: 部署合同并检索其地址

source: Interact with the contract's entrypoint to test various scenarios
es: Interactúa con el punto de entrada del contrato para probar varios escenarios
fr: Interagir avec le point d'entrée du contrat pour tester divers scénarios
id: Berinteraksi dengan titik masuk kontrak untuk menguji berbagai skenario
tr: Çeşitli senaryoları test etmek için sözleşmenin giriş noktasıyla etkileşime geçin
zh_cn: 与合同的切入点进行互动,以测试各种设想情况

source: Deploying the Contract to Test
es: Implementación del contrato de prueba
fr: Déploiement du contrat d'essai
id: Menyebarkan Kontrak untuk Diuji
tr: Sözleşmenin Test Edilmesi
zh_cn: 部署测试合同

source: In Listing 17-2, we wrote a function that deploys the `PizzaFactory` contract and sets up the dispatcher for interactions.
es: En la Lista 17-2, escribimos una función que despliega el contrato `PizzaFactory` y establece el despachador para las interacciones.
fr: Dans Listing 17-2, nous avons écrit une fonction qui déploie le contrat `PizzaFactory` et met en place le régulateur pour les interactions.
id: Di Listing 17-2, kami menulis sebuah fungsi yang menyebarkan kontrak åPizzaFactory dan mengatur operator untuk interaksi.
tr: Listeleme 17-2'de, PizzaFactory sözleşmesini dağıtan ve etkileşimler için göndericiyi ayarlayan bir işlev yazdık.
zh_cn: 在名单17-2中,我们写了一个功能,即部署`Pizza Factory'合同,并设立互动调度员。

source: "PizzaFactory"
zh_cn: "披萨脚步"

source: "pepperoni"
zh_cn: "帕波罗尼"

source: "pineapple"
es: "Piña"
id: Nanas.
zh_cn: "菠萝"

source: // Setup
es: // Configuración
fr: // Configuration
tr: // Kurulum
zh_cn: / 设置

source: // When
es: // Cuando
fr: // Quand
id: /Kapan
tr: // Ne zaman
zh_cn: / 何时

source: // Then
es: // Entonces
fr: // Ensuite
tr: // Sonra
zh_cn: 礛

source: <span class="caption">Listing 17-2 Deploying the contract to test</span>
es: <span class="caption">Lista 17-2 Implementación del contrato para probar</span>
fr: <span class="caption">Liste 17-2 Déployer le contrat pour tester</span>
id: <span class="caption">Listing 17-2 Menyebarkan kontrak untuk menguji</span>
tr: span class="caption">Yönetmelik 17-2 Sözleşmeyi test etmek için dağıtma/span>
zh_cn: <span类=“caption” > listing 17-2 部署合同以测试 </span>

source: Testing our Contract
es: Probando nuestro contrato
fr: Tester notre contrat
id: Menguji Kontrak Kita
tr: Sözleşmemizi Test Etmek
zh_cn: 测试我们的合同

source: Determining the behavior that your contract should respect is the first step in writing tests. In the `PizzaFactory` contract, we determined that the contract should have the following behavior:
es: Determinar el comportamiento que debe respetar su contrato es el primer paso en la redacción de pruebas. En el contrato `PizzaFactory`, determinamos que el contrato debe tener el siguiente comportamiento:
fr: Déterminer le comportement que votre contrat devrait respecter est la première étape dans les tests écrits. Dans le contrat `PizzaFactory`, nous avons déterminé que le contrat devrait avoir le comportement suivant:
id: Menentukan perilaku yang harus dihormati kontrak Anda adalah langkah pertama dalam tes menulis.
tr: Sözleşmenizin saygı göstermesi gereken davranışı belirlemek, yazılı testlerin ilk adımıdır. PizzaFactory sözleşmesinde, sözleşmenin aşağıdaki davranışa sahip olması gerektiğini belirledik:
zh_cn: 在`Pizza Factory'合同中,我们确定合同应具有以下行为:

source: Upon deployment, the contract owner should be set to the address provided in the constructor, and the factory should have 10 units of pepperoni and pineapple, and no pizzas created.
es: Tras el despliegue, el propietario del contrato debe ser fijado a la dirección proporcionada en el constructor, y la fábrica debe tener 10 unidades de pepperoni y piña, y no se crean pizzas.
fr: Au moment du déploiement, le propriétaire du contrat devrait être fixé à l'adresse indiquée dans le constructeur, et l'usine devrait avoir 10 unités de pepperoni et d'ananas, et pas de pizzas créées.
id: Setelah penyebaran, pemilik kontrak harus ditetapkan ke alamat yang disediakan di konstruktor, dan pabrik harus memiliki 10 unit pepperoni dan nanas, dan tidak ada pizza dibuat.
tr: Kurulduktan sonra, sözleşme sahibi constructor'da verilen adrese ayarlanmalıdır ve fabrikada 10 adet pepperoni ve ananas bulunmalıdır ve pizza oluşturulmamalıdır.
zh_cn: 在部署时,合同所有人应定在建筑商提供的地址,工厂应拥有10个单位的辣椒和菠萝,不得制造披萨。

source: If someone tries to make a pizza and they are not the owner, the operation should fail. Otherwise, the pizza count should be incremented, and an event should be emitted.
es: Si alguien trata de hacer una pizza y no es el propietario, la operación debe fallar. De lo contrario, el conteo de pizza debe ser incrementado, y un evento debe ser emitido.
fr: Si quelqu'un essaie de faire une pizza et qu'ils ne sont pas le propriétaire, l'opération devrait échouer. Sinon, le nombre de pizzas devrait être augmenté, et un événement devrait être émis.
id: Jika seseorang mencoba untuk membuat pizza dan mereka bukan pemilik, operasi harus gagal. jika tidak, jumlah pizza harus meningkat, dan sebuah peristiwa harus dipancarkan.
tr: Birisi pizza yapmaya çalışırsa ve sahibi değilse, operasyon başarısız olmalıdır. Aksi takdirde, pizza sayısı artırılmalı ve bir etkinlik yayılmalıdır.
zh_cn: 如果有人试图做披萨,而他们不是披萨的主人,手术就应该失败。 否则,披萨的计数应该增加,事件应该被排放出来。

source: If someone tries to take ownership of the contract and they are not the owner, the operation should fail. Otherwise, the owner should be updated.
es: Si alguien trata de tomar la propiedad del contrato y no es el propietario, la operación debe fallar. De lo contrario, el propietario debe ser actualizado.
fr: Si quelqu'un tente de s'approprier le contrat et qu'il n'est pas le propriétaire, l'opération doit échouer. Sinon, le propriétaire doit être mis à jour.
id: Jika seseorang mencoba untuk mengambil kepemilikan kontrak dan mereka bukan pemilik, operasi harus gagal. Jika tidak, pemilik harus diperbarui.
tr: Birisi sözleşmenin mülkiyetini almaya çalışırsa ve sahibi değilse, işlem başarısız olmalıdır. Aksi takdirde, sahibi güncellenmelidir.
zh_cn: 如果有人试图取得合同的所有权,而他们不是合同的所有人,经营就应该失败,否则,所有者应当更新。

source: Accessing Storage Variables with `load`
es: Acceso a las variables de almacenamiento con `carga`
fr: Accès aux variables de stockage avec `load`
id: Mengakses Variabel Penyimpanan dengan åloadé
tr: load ile Depolama Değişkenlerine Erişim
zh_cn: 使用带有“装载”的存储变量

source: <span class="caption">Listing 17-3: Testing the initial state by loading storage variables </span>
es: <span class="caption">Lista 17-3: Probando el estado inicial cargando variables de almacenamiento </span>
fr: <span class="caption">Liste 17-3: Test de l'état initial en chargeant les variables de stockage </span>
id: <span class="caption">Listing 17-3: Menguji keadaan awal dengan memuat variabel penyimpanan </span>
tr: span class="caption">Liste 17-3: Depolama değişkenlerini yükleyerek ilk durumu test etmek /span>
zh_cn: <span类=“caption” >Listing 17-3:通过装入存储变量 </span>测试初始状态

source: Once our contract is deployed, we want to assert that the initial values are set as expected. If our contract has an entrypoint that returns the value of a storage variable, we can call this entrypoint. Otherwise, we can use the `load` function from `snforge` to load the value of a storage variable inside our contract, even if not exposed by an entrypoint.
es: Una vez desplegado nuestro contrato, queremos afirmar que los valores iniciales se establecen como se esperaba. Si nuestro contrato tiene un punto de entrada que devuelve el valor de una variable de almacenamiento, podemos llamar a este punto de entrada. De lo contrario, podemos utilizar la función `load` de `snforge` para cargar el valor de una variable de almacenamiento dentro de nuestro contrato, incluso si no está expuesto por un punto de entrada.
fr: Une fois notre contrat déployé, nous voulons affirmer que les valeurs initiales sont définies comme prévu. Si notre contrat a un point d'entrée qui renvoie la valeur d'une variable de stockage, nous pouvons appeler ce point d'entrée. Sinon, nous pouvons utiliser la fonction `load` de `snforge` pour charger la valeur d'une variable de stockage dans notre contrat, même si elle n'est pas exposée par un point d'entrée.
id: Jika kontrak kami memiliki titik masuk yang mengembalikan nilai dari variabel penyimpanan, kami bisa menghubungi titik masuk ini.
tr: Sözleşmemiz konuşlandırıldıktan sonra, başlangıç değerlerinin beklendiği gibi ayarlandığını iddia etmek istiyoruz. Sözleşmemiz bir depolama değişkeninin değerini döndüren bir giriş noktasına sahipse, bu giriş noktasını arayabiliriz. Aksi takdirde, bir giriş noktası tarafından maruz bırakılmasa bile, sözleşmemizin içindeki bir depolama değişkeninin değerini yüklemek için snforge fonksiyonunu kullanabiliriz.
zh_cn: 一旦我们的合同部署完毕,我们想断言初始价值是按预期确定的,如果我们的合同有一个返回存储变量价值的切入点,我们可以调用这个切入点,否则,我们可以使用`鼻孔'中的`装载'功能来装载我们合同中的存储变量价值,即使未通过一个切入点暴露。

source: Mocking the Caller Address with `start_cheat_caller_address`
es: Ocultando la dirección del llamante con `start_cheat_caller_adress`
fr: Cacher l'adresse de l'appelant avec `start_cheat_caller_address`
id: Mocking the Caller Address with æstart_cheat_caller_address_address)
tr: Arayan Adresini start_cheat_caller_address ile Alay Etmek
zh_cn: 以“ start_chead_caller_address” 模拟调用器地址

source: The security of our factory relies on the owner being the only one able to make pizzas and transfer ownership. To test this, we can use the `start_cheat_caller_address` function to mock the caller address and assert that the contract behaves as expected.
es: La seguridad de nuestra fábrica depende de que el propietario sea el único capaz de hacer pizzas y transferir la propiedad. Para probar esto, podemos utilizar la función `start_cheat_caller_address` para burlarse de la dirección de la persona que llama y afirmar que el contrato se comporta como se esperaba.
fr: La sécurité de notre usine repose sur le propriétaire étant le seul capable de faire des pizzas et de transférer la propriété. Pour tester cela, nous pouvons utiliser la fonction `start_cheat_caller_address` pour se moquer de l'adresse de l'appelant et affirmer que le contrat se comporte comme prévu.
id: Keamanan pabrik kami bergantung pada pemilik menjadi satu-satunya mampu untuk membuat pizza dan kepemilikan transfer untuk menguji ini, kita dapat menggunakan fungsi pemanggil dan alamat pemanggil dan menegaskan bahwa kontrak berperilaku seperti yang diharapkan.
tr: Fabrikamızın güvenliği, pizza yapıp sahipliğini aktarabilen tek kişinin sahibine bağlıdır. Bunu test etmek için, arayan adresiyle alay etmek ve sözleşmenin beklendiği gibi davrandığını iddia etmek için start_cheat_caller_address işlevini kullanabiliriz.
zh_cn: 我们工厂的安全依赖于所有者是唯一能够做披萨和转让所有权的人,为了测试这一点,我们可以使用`开机机'功能来嘲笑电话地址,并声称合同行为符合预期。

source: <span class="caption">Listing 17-4: Testing ownership of the contract by mocking the caller address </span>
es: <span class="caption">Lista 17-4: Probando la propiedad del contrato burlándose de la dirección de llamada </span>
fr: <span class="caption">Liste 17-4: Test de la propriété du contrat en se moquant de l'adresse de l'appelant </span>
id: <span class="caption">Listing 17-4: Menguji kepemilikan kontrak dengan mengejek alamat pemanggil </span>
tr: span class="caption">Liste 17-4: Arayan adresle alay ederek sözleşmenin sahipliğini test etmek /span>
zh_cn: <span类=“Caption” >Listing 17-4:模拟调用地址 </span>测试合同所有权
