Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: // Change this value to see different results, what would happen if the index doesn't exist?
es: // Cambiar este valor para ver diferentes resultados, ¿qué pasaría si el índice no existe?
fr: // Modifier cette valeur pour voir différents résultats, que se passerait-il si l'index n'existait pas?
id: //Ubah nilai ini untuk melihat hasil yang berbeda, apa yang akan terjadi jika indeks tidak ada?
tr: // Farklı sonuçlar görmek için bu değeri değiştirin, indeks yoksa ne olur?
zh_cn: 改变这个值以看到不同的结果, 如果指数不存在, 会发生什么?

source: // Don't worry about * for now, if you are curious see Chapter 4.2 #desnap operator // It basically means "transform what get(idx) returned into a real value"
es: // No se preocupe por * por ahora, si tiene curiosidad vea Capítulo 4.2 #desnap operador // Básicamente significa "transformar lo que get(idx) devuelto a un valor real"
fr: // Ne vous inquiétez pas * pour l'instant, si vous êtes curieux voir le chapitre 4.2 #desnap opérateur // Cela signifie fondamentalement "transformer ce que get(idx) retourné dans une valeur réelle"
id: //Jangan khawatir tentang * untuk saat ini, jika anda penasaran lihat Bab 4.2 #desnap operator / / Ini pada dasarnya berarti "transform apa yang mendapatkan algoidx) dikembalikan ke nilai riil"
tr: // Şimdilik * için endişelenmeyin, eğer merak ediyorsanız Bölüm 4.2 #desnap operatörü // Temel olarak "ne al(idx) gerçek bir değere döndü" anlamına gelir.
zh_cn: / 不要担心 * 目前, 如果你想知道看 第4.2章#desnap 操作员/ / 它基本上意指"转换什么得到( idx) 返回到一个真实值"。

source: "out of bounds"
es: "fuera de límites"
fr: "hors limites"
id: "di luar batas"
tr: "Sınırların dışında"
zh_cn: "不受约束"

source: `at()` Method
es: Método `at()`
fr: `at()` Méthode
id: (Metode) Metode
tr: at() Yöntem
zh_cn: `at()`方法 '

source: The `at` function, on the other hand, directly returns a snapshot to the element at the specified index using the `unbox()` operator to extract the value stored in a box. If the index is out of bounds, a panic error occurs. You should only use `at` when you want the program to panic if the provided index is out of the array's bounds, which can prevent unexpected behavior.
es: La función `at`, por otro lado, devuelve directamente una instantánea al elemento en el índice especificado usando el operador `unbox()` para extraer el valor almacenado en una caja. Si el índice está fuera de límites, se produce un error de pánico. Sólo debe usar `at` cuando desee que el programa entre en pánico si el índice proporcionado está fuera de los límites de la matriz, lo que puede evitar un comportamiento inesperado.
fr: Par contre, la fonction `at` renvoie directement un instantané à l'élément de l'index spécifié en utilisant l'opérateur `unbox()` pour extraire la valeur stockée dans une boîte. Si l'index est hors limites, une erreur de panique se produit. Vous ne devriez utiliser `at` que lorsque vous voulez que le programme panique si l'index fourni est hors limites du tableau, ce qui peut empêcher un comportement inattendu.
id: Di sisi lain, fungsi åunbox) digunakan untuk mengekstrak nilai yang tersimpan di dalam kotak. Jika indeks berada di luar batas, kesalahan panik terjadi. Anda seharusnya hanya menggunakan indeks yang dispesifikasikan pada saat Anda ingin program tersebut panik jika indeks yang diberikan berada di luar batas, yang dapat mencegah perilaku yang tidak terduga.
tr: Öte yandan at işlevi, bir kutuda depolanan değeri çıkarmak için unbox() operatörünü kullanarak belirtilen indeksteki elemana doğrudan bir anlık görüntü döndürür. Endeks sınırların dışındaysa, bir panik hatası oluşur. Sağlanan dizin dizi sınırlarının dışındaysa, programın paniklemesini istediğinizde yalnızca at kullanılmalıdır, bu da beklenmedik davranışları önleyebilir.
zh_cn: `at'函数,另一方面,直接返回指定索引中元素的速记,使用`unbox()`运算符'提取存储在框中的值。如果索引超出界限,就会发生恐慌错误。如果提供的索引超出数组的界限,则只有在程序需要恐慌时才使用`at'程序,这样可以防止出乎意料的行为。

source: Here is an example with the `at()` method:
es: He aquí un ejemplo con el método `at()`:
fr: Voici un exemple avec la méthode `at()`:
id: Berikut ini adalah contoh dari metode tersebut:
tr: İşte at() yöntemi ile bir örnek:
zh_cn: 以下是`at()'方法的例子:

source: In this example, the variable named `first` will get the value `0` because that is the value at index `0` in the array. The variable named `second` will get the value `1` from index `1` in the array.
es: En este ejemplo, la variable llamada `primero` obtendrá el valor `0` porque ese es el valor en el índice `0` del array. La variable llamada `segundo` obtendrá el valor `1` del índice `1` del array.
fr: Dans cet exemple, la variable nommée `first` obtiendra la valeur `0` parce que c'est la valeur de l'index `0` dans le tableau. La variable nommée `second` obtiendra la valeur `1` de l'index `1` dans le tableau.
id: Dalam contoh ini, variabel yang disebut pertama akan mendapatkan nilai karena itu adalah nilai dari indeks dalam susunan.
tr: Bu örnekte, first adlı değişken 0 değerini alacaktır, çünkü bu dizideki 0 dizinindeki değerdir. second adlı değişken dizideki 1 dizininden 1 değerini alacaktır.
zh_cn: 在此示例中,名为“第一个”的变量将获得数组中“0”值,因为这就是在`0'指数值。“第二个”变量将从数组中的“1”指数值中获取“1”值。

source: If you want to use the subscripting operator `arr[index]`, you will need to explicitly define the type of the elements of the array, otherwise it will not compile. For example:
es: Si desea utilizar el operador de subscripting `arr[index]`, tendrá que definir explícitamente el tipo de los elementos de la matriz, de lo contrario no se compilará. Por ejemplo:
fr: Si vous souhaitez utiliser l'opérateur d'abonnement `arr[index]`, vous devrez définir explicitement le type d'éléments du tableau, sinon il ne sera pas compilé. Par exemple:
id: Jika Anda ingin menggunakan operator subscripting åarr[index], Anda perlu secara eksplisit mendefinisikan tipe elemen dari array, jika tidak, ini tidak akan dikompilasi. Sebagai contoh:
tr: Alt yazı operatörü arr[index] kullanmak istiyorsanız, dizinin elemanlarının türünü açıkça tanımlamanız gerekir, aksi takdirde derlemez. Örneğin:
zh_cn: 如果您想要使用下标运算符`arr[index] ', 您需要明确定义数组元素的类型, 否则它不会编译 。 例如 :

source: In summary, use `at` when you want to panic on out-of-bounds access attempts, and use `get` when you prefer to handle such cases gracefully without panicking.
es: En resumen, use `at` cuando quiera entrar en pánico en los intentos de acceso fuera de los límites, y use `get` cuando prefiera manejar estos casos con gracia sin entrar en pánico.
fr: En résumé, utilisez `at` quand vous voulez paniquer sur les tentatives d'accès hors de la frontière, et utilisez `get` quand vous préférez gérer ces cas gracieusement sans paniquer.
id: Ringkasnya, gunakan åatété ketika Anda ingin panik pada percobaan akses keluar, dan gunakan ågeté ketika Anda lebih memilih untuk menangani kasus-kasus seperti itu dengan anggun tanpa panik.
tr: Özetle, at'yi sınırların dışında erişim girişimlerinde panik yapmak istediğinizde kullanın ve bu tür durumları paniklemeden zarif bir şekilde ele almayı tercih ettiğinizde get'yi kullanın.
zh_cn: 简言之,当你想对出入境的企图感到恐慌时,使用`at ',如果你想顺利处理此类案件而不必惊慌,则使用`get'。

source: Size-related Methods
es: Métodos relacionados con el tamaño
fr: Méthodes liées à la taille
id: Metode Berkaitan Ukuran
tr: Boyutla ilgili yöntemler
zh_cn: 与规模有关的方法

source: To determine the number of elements in an array, use the `len()` method. The return value is of type `usize`.
es: Para determinar el número de elementos de un array, utilice el método `len()`. El valor de retorno es de tipo `usize`.
fr: Pour déterminer le nombre d'éléments dans un tableau, utilisez la méthode `len()`. La valeur de retour est de type `usize`.
id: Untuk menentukan jumlah elemen dalam suatu array, gunakan metode ålenó). Nilai pengembaliannya adalah tipe åusize.
tr: Bir dizideki eleman sayısını belirlemek için len() yöntemini kullanın. Dönüş değeri usize tipidir.
zh_cn: 为确定数组中元素的数量,请使用“ len()” 方法。返回值为“usize” 类型。

source: If you want to check if an array is empty or not, you can use the `is_empty()` method, which returns `true` if the array is empty and `false` otherwise.
es: Si desea comprobar si un array está vacío o no, puede utilizar el método `is_empty()`, que devuelve `true` si el array está vacío y `falso` de lo contrario.
fr: Si vous voulez vérifier si un tableau est vide ou non, vous pouvez utiliser la méthode `is_vide()`, qui retourne `true` si le tableau est vide et `false` autrement.
id: Jika Anda ingin memeriksa apakah sebuah array kosong atau tidak, Anda dapat menggunakan metode ·is_empty), yang akan kembali jika susunannya kosong dan false.
tr: Bir dizinin boş olup olmadığını kontrol etmek istiyorsanız, is_empty() metodunu kullanabilirsiniz, bu yöntem true değerini gönderir, eğer dizi boşsa ve false aksi takdirde.
zh_cn: 如果您想要检查一个数组是否为空, 您可以使用“ 是空( ) ” 方法, 如果数组为空或“ 假”, 该方法返回“ 真正的 ” 。

source: `array!` Macro
id: Macro
tr: array! Makro
zh_cn: `阵列!'宏观

source: Sometimes, we need to create arrays with values that are already known at compile time. The basic way of doing that is redundant. You would first declare the array and then append each value one by one. `array!` is a simpler way of doing this task by combining the two steps. At compile-time, the compiler will expand the macro to generate the code that appends the items sequentially.
es: A veces, necesitamos crear arrays con valores que ya se conocen en el momento de compilar. La forma básica de hacerlo es redundante. Primero declararía el array y luego añadiría cada valor uno por uno. `array!` es una forma más sencilla de hacer esta tarea combinando los dos pasos. En el tiempo de compilar, el compilador expandirá la macro para generar el código que añade los elementos secuencialmente.
fr: Parfois, nous avons besoin de créer des tableaux avec des valeurs qui sont déjà connues au moment de la compilation. La manière de base de faire cela est redondant. Vous déclareriez d'abord le tableau et ensuite ajouteriez chaque valeur un par un. `array!` est une façon plus simple de faire cette tâche en combinant les deux étapes. Au moment de la compilation, le compilateur va élargir la macro pour générer le code qui append les éléments séquentiellement.
id: Kadang-kadang, kita perlu membuat array dengan nilai-nilai yang sudah dikenal pada waktu kompilasi. Cara dasar untuk melakukannya adalah berlebihan. Anda pertama-tama akan mendeklarasikan array dan kemudian menambahkan setiap nilai satu per satu. ▪array! adalah cara yang lebih sederhana untuk melakukan tugas ini dengan menggabungkan dua langkah. Pada waktu kompilasi, kompiler akan memperluas makro untuk menghasilkan kode yang appends items sequentilly.
tr: Bazen, derleme zamanında zaten bilinen değerlere sahip diziler oluşturmamız gerekir. Bunu yapmanın temel yolu gereksizdir. Önce diziyi ilan eder ve ardından her bir değeri birer birer eklersiniz. array!, iki adımı birleştirerek bu görevi yapmanın daha basit bir yoludur. Derleyici zamanında, derleyici, öğeleri ardışık olarak ekleyen kodu oluşturmak için makroyu genişletecektir.
zh_cn: 有时,我们需要创建在编译时已经知道的值的阵列。 这样做的基本方式是多余的。 您首先声明数组, 然后逐个附加每个值 。 “ 数组! ” 是一个简单的方法, 通过将两个步骤合并来完成这项任务 。 在编译时, 编译者将扩大宏, 以生成依次附加项目的代码 。

source: Without `array!`:
es: Sin `array!`:
fr: Sans 'array! ':
id: Tanpa sinar matahari!
tr: array olmadan!:
zh_cn: 没有`数组!':

source: With `array!`:
es: Con `array!`:
fr: Avec "array!":
id: Dengan Ãarray!
tr: array ile!:
zh_cn: 使用`数组!':

source: Storing Multiple Types with Enums
es: Almacenamiento de múltiples tipos con enums
fr: Stockage de types multiples avec des enums
id: Menyimpan Berbagai Jenis dengan Enum
tr: Enums ile birden fazla türün saklanması
zh_cn: 与 Enums 一起存储多种类型

source: If you want to store elements of different types in an array, you can use an `Enum` to define a custom data type that can hold multiple types. Enums will be explained in more detail in the ["Enums and Pattern Matching"](./ch06-00-enums-and-pattern-matching.md) chapter.
es: Si desea almacenar elementos de diferentes tipos en un array, puede utilizar un `Enum` para definir un tipo de datos personalizado que puede contener varios tipos. Los enums se explicarán con más detalle en el capítulo ["Enums and Pattern Matching"](./ch06-00-enums-and-pattern-matching.md).
fr: Si vous souhaitez stocker des éléments de différents types dans un tableau, vous pouvez utiliser un `Enum` pour définir un type de données personnalisé qui peut contenir plusieurs types. Les enums seront expliqués plus en détail dans le chapitre ["Enums and Pattern Matching"](./ch06-00-enums-and-pattern-matching.md).
id: Jika Anda ingin menyimpan elemen-elemen berbagai jenis dalam sebuah array, Anda dapat menggunakan sebuah \\enum} untuk mendefinisikan tipe data gubahan yang dapat menyimpan berbagai tipe. Enums akan dijelaskan secara lebih detail dalam bab ["Enum dan Pola Yang Cocok"]./ch06-00-enums-and-patinter-matching.md).
tr: Bir dizide farklı türde öğeleri saklamak istiyorsanız, birden fazla türü tutabilen özel bir veri türünü tanımlamak için bir Enum kullanabilirsiniz. Enumlar ["Enums and Pattern Matching"] (./ch06-00-enums-and-pattern-md) bölümünde daha ayrıntılı olarak açıklanacaktır.
zh_cn: 如果您想要将不同类型元素存储在一个数组中, 您可以使用“ Enum” 来定义一个可以持有多种类型的自定义数据类型。 在 [“ Enums and Stands 匹配” (./ch06- 00- enums- and- batern- 匹配. md) 章中, 将会更详细地解释 Enums 。

source: Span
fr: Épanouissement
zh_cn: 平平面

source: `Span` is a struct that represents a snapshot of an `Array`. It is designed to provide safe and controlled access to the elements of an array without modifying the original array. Span is particularly useful for ensuring data integrity and avoiding borrowing issues when passing arrays between functions or when performing read-only operations, as introduced in ["References and Snapshots"](./ch04-02-references-and-snapshots.md).
es: `Span` es una estructura que representa una instantánea de un `Array`. Está diseñado para proporcionar acceso seguro y controlado a los elementos de un array sin modificar el array original. Span es particularmente útil para garantizar la integridad de los datos y evitar problemas de préstamo al pasar matrices entre funciones o al realizar operaciones de sólo lectura, como se introdujo en ["Referencias y instantáneas"](./ch04-02-referencias-and-snapshots.md).
fr: `Span` est une structure qui représente un instantané d'un `Array`. Il est conçu pour fournir un accès sûr et contrôlé aux éléments d'un tableau sans modifier le tableau d'origine. Span est particulièrement utile pour assurer l'intégrité des données et éviter les problèmes d'emprunt lors du passage de tableaux entre les fonctions ou lors de l'exécution d'opérations en lecture seule, comme introduit dans ["Références et Snapshots"](./ch04-02-références-and-snapshots.md).
id: Sistem ini dirancang untuk menyediakan akses yang aman dan terkendali ke unsur-unsur suatu array tanpa memodifikasi array aslinya. Span sangat berguna untuk memastikan integritas data dan menghindari isu pinjaman ketika melewati array antara fungsi atau ketika melakukan operasi baca-saja, sebagaimana diperkenalkan dalam ["References and Snapshots"]./ch04-02 referreferensis-and-nappshots.md).
tr: Span, bir Array'nin anlık görüntüsünü temsil eden bir yapıdır. Orijinal diziyi değiştirmeden bir dizinin elemanlarına güvenli ve kontrollü erişim sağlamak için tasarlanmıştır. Span, işlevler arasında diziler geçerken veya ["References and Snapshots"] bölümünde tanıtıldığı gibi yalnızca okunur işlemler gerçekleştirirken veri bütünlüğünü sağlamak ve ödünç alma sorunlarından kaçınmak için özellikle yararlıdır.
zh_cn: `Span'是代表`Array'的快照的支架,目的是在不修改原始阵列的情况下提供安全和有控制地访问阵列各元素,对于确保数据完整性和避免在函数之间传递阵列时或在进行[“参考和抓图”](./ch04-02-参考-和Snapshots.md)中介绍的只读操作时借用问题特别有用。

source: All methods provided by `Array` can also be used with `Span`, except for the `append()` method.
es: Todos los métodos proporcionados por `Array` también pueden utilizarse con `Span`, excepto el método `append()`.
fr: Toutes les méthodes fournies par `Array` peuvent également être utilisées avec `Span`, à l'exception de la méthode `append()`.
id: Semua metode yang disediakan oleh Array juga dapat digunakan dengan ▪Spané, kecuali metodenya.
tr: Array tarafından sağlanan tüm yöntemler, append() yöntemi dışında Span ile de kullanılabilir.
zh_cn: `Array'提供的所有方法也可以用`span'使用,但`附录()'方法除外。

source: Turning an Array into Span
es: Convirtiendo un Array en Span
fr: Transformer un tableau en spand
id: Mengubah array menjadi Span
tr: Bir Diziyi Span'a Çevirmek
zh_cn: 正在将矩阵转换成 Span

source: To create a `Span` of an `Array`, call the `span()` method:
es: Para crear un `Span` de un `Array`, llame al método `span()`:
fr: Pour créer une `Span` d'une `Array`, appelez la méthode `span()`:
id: Untuk membuat sebuah ▪Spané dari sebuah array, sebutlah metode ini:
tr: Array'nin bir Span'sini oluşturmak için span() metodunu arayın:
zh_cn: 创建`阵列'的`板 ',称为`板()'方法:

source: {{#quiz ../quizzes/ch03-01-arrays.toml}}
fr: {{#quiz../quizes/ch03-01-arrays.toml}}
id: {{#quiz../quizzes/ch03-01-array.toml}}
zh_cn: / quizzes/ch03-01-arrays.toml

source: Cairo provides in its core library a dictionary-like type. The `Felt252Dict<T>` data type represents a collection of key-value pairs where each key is unique and associated with a corresponding value. This type of data structure is known differently across different programming languages such as maps, hash tables, associative arrays and many others.
es: El Cairo proporciona en su biblioteca principal un tipo de diccionario. El tipo de datos `Felt252Dict<TÃ3rs representa una colección de pares de valores clave donde cada clave es única y se asocia con un valor correspondiente. Este tipo de estructura de datos se conoce de manera diferente en diferentes lenguajes de programación, como mapas, tablas de hash, matrices asociativas y muchos otros.
fr: Le Caire fournit dans sa bibliothèque centrale un type de dictionnaire. Le type de données `Felt252Dict<T>` représente une collection de paires de valeurs clés où chaque clé est unique et associée à une valeur correspondante. Ce type de structure de données est connu différemment dans différents langages de programmation tels que les cartes, les tables de hachage, les tableaux associatifs et bien d'autres.
id: Kairo menyediakan di perpustakaan intinya sebuah tipe mirip kamus. Jenis struktur data Felt252Dict<T> Data tipe merepresentasikan koleksi pasangan nilai kunci di mana setiap kunci unik dan terkait dengan nilai yang berhubungan. Jenis struktur data ini dikenal berbeda dalam bahasa pemrograman yang berbeda seperti peta, tabel hash, array asosiatif dan banyak lainnya.
tr: Kahire, çekirdek kütüphanesinde sözlük benzeri bir tür sağlar. Felt252DictT> veri türü, her anahtarın benzersiz olduğu ve karşılık gelen bir değerle ilişkili olduğu bir anahtar-değer çifti koleksiyonunu temsil eder. Bu tür veri yapısı, haritalar, özet tabloları, ilişkilendirme dizileri ve diğerleri gibi farklı programlama dilleri arasında farklı olarak bilinir.
zh_cn: 开罗的核心图书馆提供了类似于字典的类型。 “ Felt252Dict<T}数据类型”代表了每个键的独特和与相应值相关的关键值对的集合。 这种类型的数据结构在地图、散列表、关联阵列和许多其他不同的编程语言(如地图、散列表、连成阵列)中都不同。

source: The `Felt252Dict<T>` type is useful when you want to organize your data in a certain way for which using an `Array<T>` and indexing doesn't suffice. Cairo dictionaries also allow the programmer to easily simulate the existence of mutable memory when there is none.
es: El tipo `Felt252Dict<TÃ3r es útil cuando desea organizar sus datos de una cierta manera para la que el uso de un `Array<TÃ3r y la indexación no es suficiente. Los diccionarios de El Cairo también permiten al programador simular fácilmente la existencia de memoria mutable cuando no hay ninguna.
fr: Le type `Felt252Dict<T>` est utile lorsque vous voulez organiser vos données d'une certaine manière pour laquelle l'utilisation d'un `Array<T>` et l'indexation ne suffit pas. Les dictionnaires du Caire permettent également au programmeur de simuler facilement l'existence de la mémoire mutable quand il n'y en a pas.
id: Tipe Felt252Dict<T> berguna ketika Anda ingin mengatur data Anda dengan cara tertentu yang menggunakan array<T> dan pengindeksan tidak cukup. Dictionary Kairo juga memungkinkan programmer untuk dengan mudah mensimulasikan keberadaan memori mutable ketika tidak ada.
tr: Felt252DictT> türü, verilerinizi bir ArrayT> kullanarak ve indekslemenin yeterli olmadığı belirli bir şekilde düzenlemek istediğinizde kullanışlıdır. Kahire sözlükleri, programcının hiçbir şey olmadığında değişken belleğin varlığını kolayca simüle etmesine de izin verir.
zh_cn: `Felt252Dict<T}当您想要以某种方式组织您的数据时,使用“Array<T}”和“索引”是不够的。开罗词典还允许程序员在不存在时很容易地模拟移动内存的存在。

source: Basic Use of Dictionaries
es: Uso básico de diccionarios
fr: Utilisation de base des dictionnaires
id: Penggunaan Kamus Dasar
tr: Sözlüklerin Temel Kullanımı
zh_cn: 字典基本使用

source: It is normal in other languages when creating a new dictionary to define the data types of both key and value. In Cairo, the key type is restricted to `felt252`, leaving only the possibility to specify the value data type, represented by `T` in `Felt252Dict<T>`.
es: Es normal en otros idiomas cuando se crea un nuevo diccionario para definir los tipos de datos tanto de clave como de valor. En El Cairo, el tipo de clave se limita a `felt252`, dejando sólo la posibilidad de especificar el tipo de datos de valor, representado por `T` en `Felt252Dict<T».
fr: Il est normal dans d'autres langues lors de la création d'un nouveau dictionnaire pour définir les types de données à la fois de clé et de valeur. Au Caire, le type de clé est limité à `felt252`, ne laissant que la possibilité de spécifier le type de données de valeur, représenté par `T` dans `Felt252Dict<T>`.
id: Hal ini normal dalam bahasa lain ketika membuat kamus baru untuk mendefinisikan tipe data dari kunci dan nilai. Di Kairo, jenis kunci dibatasi untuk <T>.
tr: Diğer dillerde hem anahtar hem de değerin veri türlerini tanımlamak için yeni bir sözlük oluştururken normaldir. Kahire'de, anahtar türü felt252 ile sınırlıdır, bu da T ile temsil edilen değer veri türünü Felt252DictT> olarak belirtme olanağını bırakır.
zh_cn: 在创建新字典以定义键和值的数据类型时,在其他语言中这是正常的。 在开罗, 关键类型仅限于“ felt252 ”, 只留下指定价值数据类型的可能性, 在“ Felt252Dict<T> 中以“ T” 表示 。

source: The core functionality of a `Felt252Dict<T>` is implemented in the trait `Felt252DictTrait` which includes all basic operations. Among them we can find:
es: La funcionalidad básica de un `Felt252Dict<T® se implementa en el rasgo `Felt252DictTrait` que incluye todas las operaciones básicas, entre ellas podemos encontrar:
fr: La fonctionnalité de base d'un `Felt252Dict<T>` est implémentée dans le trait `Felt252DictTrait` qui comprend toutes les opérations de base.
id: Fungsi inti dari sebuah Felt252Dict<T> diimplementasikan dalam sifat yang dapat kita temukan:
tr: Bir Felt252DictT>'nin temel işlevselliği, tüm temel işlemleri içeren Felt252DictTrait özelliğinde uygulanır. Bunlar arasında şunları bulabiliriz:
zh_cn: “Felt252Dict<T”的核心功能在“Felt252DictTrait”特性下实施,其中包括所有基本操作。

source: `insert(felt252, T) -> ()` to write values to a dictionary instance and
es: `insértese(felt252, T) -> ()` para escribir valores en una instancia del diccionario y
fr: `insert(felt252, T) -> ()` pour écrire des valeurs dans une instance de dictionnaire et
id: -> () Untuk menulis nilai ke kamus contoh dan
tr: insert(felt252, T) -> () bir sözlük örneğine değerler yazmak ve
zh_cn: `插入(felt252, T) - > ()'将值写入字典实例和

source: `get(felt252) -> T` to read values from it.
es: `get(felt252) -> T` para leer los valores de él.
fr: `get(felt252) -> T` pour lire les valeurs de celui-ci.
id: -> Untuk membaca nilai-nilai dari itu.
tr: get(felt252)> Ondan değerleri okumak için T.
zh_cn: `get(felt252) - > T` 读取它的值。
