Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: _`keys`_: The event’s keys. These are analogous to Ethereum’s event topics, you can use the starknet_getEvents method to filter by these keys.
es: _`keys`_: Las claves del evento. Estos son análogos a los temas del evento de Ethereum, puede utilizar el método Starknet_getEvents para filtrar por estas teclas.
fr: _`keys`_: Les touches event='s. Elles sont analogues aux sujets event Ethereum='s, vous pouvez utiliser la méthode starknet_getEvents pour filtrer par ces touches.
id: Kunci acara ini mirip dengan topik-topik peristiwa Eseum, Anda dapat menggunakan metode starnet_getEvents untuk menyaring dengan kunci-kunci ini.
tr: _keys_: Etkinliğin anahtarları. Bunlar Ethereum'un etkinlik konularına benzer, bu tuşlara göre filtrelemek için starknet_getEvents yöntemini kullanabilirsiniz.
zh_cn: keys: 事件密钥。 这些与 Eceenum 事件主题相似, 您可以使用 Starknet_ get Events 方法过滤这些密钥 。

source: _`data`_: The event’s data.
es: _`data`_: Los datos del evento.
fr: _`data`_: Les données de l'événement.
id: Data acara.
tr: _data_: Etkinliğin verileri.
zh_cn: @data:事件数据。

source: The following example emits an event with two keys, the strings `status` and `deposit` and three data elements: `1`, `2`, and `3`.
es: El siguiente ejemplo emite un evento con dos claves, las cadenas `status` y `deposit` y tres elementos de datos: `1`, `2` y `3`.
fr: L'exemple suivant émet un événement avec deux touches, les chaînes `status` et `dépôt` et trois éléments de données: `1`, `2` et `3`.
id: Contoh berikut memancarkan suatu peristiwa dengan dua tombol, senarnya dan tiga unsur data: ▪1, 2; dan (3).
tr: Aşağıdaki örnek, status ve deposit dizeleri ve üç veri elemanı olan bir olay yayar: 1, 2 ve 3.
zh_cn: 以下例子显示了一个有两个关键要素的活动,即`状态'和`交存'的字符串以及三个数据要素:`1'、`2'和`3'。

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L30)
id: Font color = "# 404040" siscalls.cairo]://https://gitub.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e58767974f20994d0ba64183/src/starknet/scalls.cairo#L30)
zh_cn: [缩略语.cairo] (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L30)

source: `library_call`
es: `biblioteca_call`
zh_cn: `图书馆呼叫 '

source: Calls the requested function in any previously declared class. The class is only used for its logic.
es: Llama a la función solicitada en cualquier clase previamente declarada. La clase sólo se utiliza para su lógica.
fr: Appelle la fonction demandée dans n'importe quelle classe précédemment déclarée. La classe n'est utilisée que pour sa logique.
id: Memanggil fungsi yang diminta di setiap kelas yang sebelumnya dinyatakan. Kelas hanya digunakan untuk logikanya.
tr: Daha önce ilan edilmiş herhangi bir sınıfta istenen işlevi çağırır. Sınıf sadece mantığı için kullanılır.
zh_cn: 在先前申报的类别中调用请求的函数。 该类别仅用于逻辑 。

source: This system call replaces the known delegate call functionality from Ethereum, with the important difference that there is only one contract involved.
es: Esta llamada del sistema reemplaza la conocida funcionalidad de llamada delegada de Ethereum, con la importante diferencia de que sólo hay un contrato involucrado.
fr: Cet appel système remplace la fonctionnalité connue d'appel délégué de Ethereum, avec la différence importante qu'il n'y a qu'un seul contrat en cause.
id: Panggilan sistem ini menggantikan fungsi panggilan delegasi yang diketahui dari Ethereum, dengan perbedaan penting bahwa hanya ada satu kontrak yang terlibat.
tr: Bu sistem çağrısı, yalnızca bir sözleşmenin söz konusu olduğu önemli farkla, Ethereum'dan bilinen delege çağrı işlevselliğinin yerini alır.
zh_cn: 这一系统呼叫取代了Etheum已知的代表呼叫功能,但有重要区别,即只涉及一项合同。

source: _`class_hash`_: The hash of the class you want to use.
es: _`class_hash`_: El hash de la clase que quieres usar.
fr: _`class_hash`_: Le hachage de la classe que vous voulez utiliser.
id: Hash dari kelas yang ingin kau gunakan.
tr: _class_hash_: Kullanmak istediğiniz sınıfın hash'i.
zh_cn: ===================================================================================================================== ============================================================================================中要使用的类的类中的分数分数分数==============中分分分分分分分分分分分分分分分===============================================

source: _`function_selector`_: A selector for a function within that class, can be computed with the `selector!` macro.
es: _`function_selector`_: Un selector para una función dentro de esa clase, se puede calcular con la macro `selector!`.
fr: _`fonction_selector`_: Un sélecteur pour une fonction dans cette classe, peut être calculé avec la macro `selector!`.
id: Sebuah pemilih untuk sebuah fungsi di dalam kelas itu, dapat dihitung dengan ahli bedah!
tr: _function_selector_: Bu sınıftaki bir fonksiyon için bir seçici, selector! makrosu ile hesaplanabilir.
zh_cn: “函数_选择 ” : 该类中函数的选择器可用“ 选择器! ” 宏计算。

source: _`calldata`_: The calldata.
es: _`calldata`_: Los calldata.
fr: _`calldata`_: Les calldata.
id: Si Calldata.
tr: _calldata_: Calldata.
zh_cn: 呼叫数据:呼叫数据。

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L43)
id: Font color = "# 404040" siscalls.cairo]://https://gitub.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e587679774f20994d0ba64183/src/starknet/scalls.cairo#L43)
zh_cn: [声传 (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L43)

source: Sends a message to L1.
es: Envía un mensaje a L1.
fr: Envoie un message à L1.
id: Mengirim pesan ke L1.
tr: L1'e bir mesaj gönderir.
zh_cn: 向 L1 发送消息 。

source: This system call includes the message parameters as part of the proof’s output and exposes these parameters to the `StarknetCore` contract on L1 once the state update, including the transaction, is received.
es: Esta llamada al sistema incluye los parámetros del mensaje como parte de la salida de la prueba y expone estos parámetros al contrato `StarknetCore` en L1 una vez que se recibe la actualización del estado, incluida la transacción.
fr: Cet appel système inclut les paramètres de message dans le cadre de la sortie de proof-S et expose ces paramètres au contrat `StarknetCore` sur L1 une fois que la mise à jour de l'état, y compris la transaction, est reçue.
id: Panggilan sistem ini mencakup parameter pesan sebagai bagian dari bukti outputs dan mengekspos parameter ini ke kontrak L1 setelah pemutakhiran negara, termasuk transaksi, diterima.
tr: Bu sistem çağrısı, kanıtın çıktısının bir parçası olarak mesaj parametrelerini içerir ve bu parametreleri işlem de dahil olmak üzere devlet güncellemesi alındıktan sonra L1'deki StarknetCore sözleşmesine ifşa eder.
zh_cn: 这一系统电话包括作为证据输出一部分的信息参数,一旦收到包括交易在内的更新情况,这些参数即暴露于L1号StarknetCore合同中。

source: For more information, see Starknet’s [messaging mechanism](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
es: Para más información, véase el [mecanismo de mensajería] de Starknet (https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
fr: Pour plus d'informations, voir Starknets [mécanisme de messagerie] (https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
id: Untuk informasi lebih lanjut, lihat Starknet [mekanisme pesan][Awttps://docts.starknet.io/dokumentasi/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
tr: Daha fazla bilgi için Starknet'in [mesajlama mekanizması](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/mesajlama-mekanizma/) sayfasına bakın.
zh_cn: 更多信息见斯塔克内特的[消息机制](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Articture/Message-mechanism/)。

source: _`to_address`_: The recipient’s L1 address.
es: _`to_address`_: La dirección L1 del destinatario.
fr: _`to_address`_: L'adresse L1 du destinataire.
id: Alamat penerima L1.
tr: _to_address_: Alıcının L1 adresi.
zh_cn: @to_address:收件人的 L1 地址 。

source: _`payload`_: The array containing the message payload.
es: _`payload`_: La matriz que contiene la carga útil del mensaje.
fr: _`payload`_: Le tableau contenant la charge utile du message.
id: Array berisi muatan pesan.
tr: _payload_: İleti yükünü içeren dizi.
zh_cn: payload: 包含信件有效载荷的阵列 。

source: The following example sends a message whose content is `(1,2)` to the L1 contract whose address is `3423542542364363`.
es: El siguiente ejemplo envía un mensaje cuyo contenido es `(1,2)` al contrato L1 cuya dirección es `3423542542364363`.
fr: L'exemple suivant envoie un message dont le contenu est `(1,2)` au contrat L1 dont l'adresse est `3423542542364363`.
id: Contoh berikut mengirimkan pesan yang isinya adalah å1,2) ke kontrak L1 yang alamatnya adalah 33423542542364363.
tr: Aşağıdaki örnek, içeriği (1,2) olan bir mesajı, adresi 3423542364363 olan L1 sözleşmesine gönderir.
zh_cn: 以下示例向地址为`3423542542364363'的L1合同发送内容为`1,2'的电文。

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L51)
id: Font color = "# 404040" siscalls.cairo]://https://gitub.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e58767974f20994d0ba64183/src/starknet/scalls.cairo#L51)
zh_cn: [缩略语.cairo] (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L51)

source: `replace_class`
es: «reemplazar_clase»
fr: `remplacer_classe`
id: replace_class_class
zh_cn: `替换等级 '

source: Once `replace_class` is called, the class of the calling contract (i.e. the contract whose address is returned by `get_contract_address` at the time the syscall is called) will be replaced by the class whose hash is given by the class_hash argument.
es: Una vez llamado `replace_class`, la clase del contrato que llama (es decir, el contrato cuya dirección es devuelta por `get_contract_adress` en el momento en que se llama a syscall) será reemplazada por la clase cuyo hash es dado por el argumento class_hash.
fr: Une fois que `replace_class` est appelé, la classe du contrat d'appel (c'est-à-dire le contrat dont l'adresse est retournée par `get_contract_address` au moment où le syscall est appelé) sera remplacée par la classe dont le hash est donné par l'argument class_hash.
id: Setelah replace_class_class called, kelas dari kontrak pemanggilan (mis. kontrak yang alamat yang dikembalikan oleh argumen class_hash.
tr: Bir kez replace_class çağrıldığında, çağrı sözleşmesinin sınıfı (yani adresi get_contract_address tarafından iade edilen sözleşme), syscall çağrıldığı sırada, hash'ı class_hash argümanı tarafından verilen sınıfla değiştirilir.
zh_cn: 一旦将`替换类'称为`替换类 ',调用合同的类别(即调用调用时`get_contract_address'返回的地址为`get_contract_address'的合同)将被类中按等级_hash论点提供大麻的类别所取代。

source: After calling `replace_class`, the code currently executing from the old class will finish running.
es: Después de llamar a `replace_class`, el código que actualmente se ejecuta desde la clase antigua terminará de ejecutarse.
fr: Après avoir appelé `remplace_class`, le code en cours d'exécution à partir de l'ancienne classe finira en cours d'exécution.
id: Setelah memanggil åreplace_class_class, kode yang saat ini mengeksekusi dari kelas lama akan selesai berjalan.
tr: replace_class'yi aradıktan sonra, şu anda eski sınıftan çalıştırılan kod çalışmayı bitirecektir.
zh_cn: 在调用`替换班'后,从旧班执行的代码将完成运行。

source: The new class will be used from the next transaction onwards or if the contract is called via the `call_contract` syscall in the same transaction (after the replacement).
es: La nueva clase se utilizará a partir de la siguiente transacción o si el contrato se llama a través del syscall `call_contract'en la misma transacción (después de la sustitución).
fr: La nouvelle classe sera utilisée à partir de la prochaine transaction ou si le contrat est appelé via le syscall `call_contract` dans la même transaction (après le remplacement).
id: Kelas baru akan digunakan dari transaksi berikutnya dan seterusnya atau jika kontrak disebut melalui siscall_contract; dalam transaksi yang sama (setelah penggantian).
tr: Yeni sınıf, bir sonraki işlemden itibaren veya sözleşme aynı işlemde (değiştirildikten sonra) call_contract syscall aracılığıyla çağrıldıysa kullanılacaktır.
zh_cn: 新的类别将从下一笔交易开始使用,或从同一笔交易(更换后)中通过`调用合同'调用合同。

source: _`class_hash`_: The hash of the class you want to use as a replacement.
es: _`class_hash`_: El hash de la clase que desea utilizar como reemplazo.
fr: _`class_hash`_: Le hachage de la classe que vous voulez utiliser comme remplacement.
id: Hash dari kelas yang ingin kau gunakan sebagai pengganti.
tr: _class_hash_: Değiştirme olarak kullanmak istediğiniz sınıfın hash'i.
zh_cn: ===================================================================================================================== ============================================================================================================新新新新新时要用来取代的班的班的班中新班的班中的班中时时段===============================================

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L77)
id: Font color = "# 404040" siscalls.cairo]://https://gitub.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e587679774f20994d0ba64183/src/starknet/scalls.cairo#L77)
zh_cn: [syscalles.cairo] (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L77)

source: `storage_read`
es: `almacenamiento_read`
fr: `stockage_read`
zh_cn: `储存-读 '

source: Gets the value of a key in the storage of the calling contract.
es: Obtiene el valor de una llave en el almacenamiento del contrato de llamada.
fr: Obtient la valeur d'une clé dans le stockage du contrat d'appel.
id: Mendapatkan nilai kunci dalam penyimpanan kontrak pemanggilan.
tr: Arama sözleşmesinin depolanmasında bir anahtarın değerini alır.
zh_cn: 在电话合同的存储中 找到钥匙的价值

source: This system call provides direct access to any possible key in storage, in contrast with `var.read()`, which enables you to read storage variables that are defined explicitly in the contract.
es: Esta llamada del sistema proporciona acceso directo a cualquier posible clave en el almacenamiento, en contraste con `var.read()`, que le permite leer variables de almacenamiento que se definen explícitamente en el contrato.
fr: Cet appel système fournit un accès direct à toute clé possible dans le stockage, contrairement à `var.read()`, qui vous permet de lire les variables de stockage qui sont définies explicitement dans le contrat.
id: Panggilan sistem ini menyediakan akses langsung ke setiap kunci yang mungkin ada dalam penyimpanan, berbeda dengan Ávar.readó), yang memungkinkan Anda membaca variabel penyimpanan yang didefinisikan secara eksplisit dalam kontrak.
tr: Bu sistem çağrısı, sözleşmede açıkça tanımlanan depolama değişkenlerini okumanızı sağlayan var.read() ile aksine, depolamadaki olası herhangi bir anahtara doğrudan erişim sağlar.
zh_cn: 这个系统电话可直接访问储存中的任何可能的钥匙,与`var.read()'不同,后者使你能够阅读合同中明确规定的储存变量。

source: For information on accessing storage by using the storage variables, see [storage variables](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables).
es: Para obtener información sobre el acceso al almacenamiento utilizando las variables de almacenamiento, véase [variables de almacenamiento](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables).
fr: Pour plus d'informations sur l'accès au stockage en utilisant les variables de stockage, voir [variables de stockage] (https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-stockage/#storage_variables).
id: Untuk informasi tentang mengakses penyimpanan dengan menggunakan variabel penyimpanan, lihat [variabel penyimpanan]bahi [stracts/contract-storage/#storage_variables].
tr: Depolama değişkenlerini kullanarak depolamaya erişim hakkında bilgi için bkz. [depolama değişkenleri](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contracts-storage/#storage_variables).
zh_cn: 关于使用储存变量获取储存的信息,见[储存变量](https://docs.starknet.io/documentation/architecture_and_confits/Smart_contracts/contract-stories/#storage_可变性])。

source: _`address_domain`_: The domain of the key, used to separate between different data availability modes. This separation is used in Starknet to offer different data availability modes. Currently, only the onchain mode (where all updates go to L1), indicated by domain `0`, is supported. Other address domains which will be introduced in the future will behave differently in terms of publication (in particular, they will not be posted on L1, creating a tradeoff between cost and security).
es: _`direccion_dominio`_: El dominio de la clave, utilizado para separar entre diferentes modos de disponibilidad de datos. Esta separación se utiliza en Starknet para ofrecer diferentes modos de disponibilidad de datos. Actualmente, sólo se admite el modo onchain (donde todas las actualizaciones van a L1), indicado por el dominio `0`. Otros dominios de direcciones que se introducirán en el futuro se comportarán de manera diferente en términos de publicación (en particular, no se publicarán en L1, creando una compensación entre costo y seguridad).
fr: _`address_domain`_: Le domaine de la clé, utilisé pour séparer les différents modes de disponibilité des données. Cette séparation est utilisée dans Starknet pour offrir différents modes de disponibilité des données. Actuellement, seul le mode onchain (où toutes les mises à jour vont à L1), indiqué par le domaine `0`, est supporté. D'autres domaines d'adresses qui seront introduits dans le futur se comporteront différemment en termes de publication (en particulier, ils ne seront pas affichés sur L1, créant un compromis entre coût et sécurité).
id: _doddress_domain__: Domain kunci, yang digunakan untuk memisahkan antara mode ketersediaan data yang berbeda. Pemisahan ini digunakan di Starknet untuk menawarkan mode ketersediaan data yang berbeda. Saat ini, hanya pada mode onchain (dimana semua pemutakhiran pergi ke L1), yang diindikasikan oleh domain ▪0, didukung. Alamat lain yang akan diperkenalkan di masa depan akan berperilaku berbeda dalam hal publikasi (khususnya, mereka tidak akan diposting pada L1, membuat pertukaran antara biaya dan keamanan).
tr: _address_domain_: Anahtarın etki alanı, farklı veri kullanılabilirlik modları arasında ayırmak için kullanılır. Bu ayrım, Starknet'te farklı veri kullanılabilirlik modları sunmak için kullanılır. Şu anda, yalnızca onchain modu (tüm güncellemelerin L1'e gittiği, 0 etki alanı ile gösterilen) desteklenir. Gelecekte tanıtılacak diğer adres etki alanları, yayın açısından farklı davranacaktır (özellikle, L1'de yayınlanmayacaktır, bir ticaret ve maliyet arasında).
zh_cn: “地址'dmain ” : 用于区分不同数据可用模式的密钥域。 Starknet 使用此分隔法提供不同的数据可用模式。 目前, 仅支持链路模式( 所有更新都使用L1), 按域“ 0 ” 表示 。 未来引入的其他地址域在发布上将表现不同( 尤其是不会在L1上公布, 从而在成本和安全之间实现平衡 ) 。

source: _`address`_: The requested storage address.
es: _`dirección`_: La dirección de almacenamiento solicitada.
fr: _`adresse`_: L'adresse de stockage demandée.
id: Alamat penyimpanan yang diminta.
tr: _adres_: İstenen depolama adresi.
zh_cn: 地址:要求的存储地址。

source: The value of the key, of type `SyscallResult<felt252>`.
es: El valor de la clave, del tipo `SyscallResult<felt252».
fr: La valeur de la clé, de type `SyscallResult<felt252>`.
id: Nilai kunci, jenis ¤SiscallResult<felt252>.
tr: Anahtarın değeri, türü SyscallResultfelt252>.
zh_cn: 键的值, 类型“ 系统呼叫Result < felt252 ” 。

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L60)
id: Font color = "# 404040" siscalls.cairo]://https://gitub.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e587679774f20994d0ba64183/src/starknet/scalls.cairo#L60)
zh_cn: [syscalles.cairo] (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L60)

source: `storage_write`
es: `almacenamiento_escritura`
zh_cn: `储存_write '

source: Sets the value of a key in the storage of the calling contract.
es: Establece el valor de una clave en el almacenamiento del contrato de llamada.
fr: Définit la valeur d'une clé dans le stockage du contrat d'appel.
id: Mengatur nilai sebuah kunci dalam penyimpanan kontrak pemanggilan.
tr: Arama sözleşmesinin depolanmasında bir anahtarın değerini ayarlar.
zh_cn: 设定调用合同存储中键值。

source: This system call provides direct access to any possible key in storage, in contrast with `var.write()`, which enables you to write to storage variables that are defined explicitly in the contract.
es: Esta llamada del sistema proporciona acceso directo a cualquier posible clave en el almacenamiento, en contraste con `var.write()`, que le permite escribir a las variables de almacenamiento que se definen explícitamente en el contrato.
fr: Cet appel système fournit un accès direct à toute clé possible dans le stockage, contrairement à `var.write()`, qui vous permet d'écrire sur des variables de stockage qui sont définies explicitement dans le contrat.
id: Panggilan sistem ini menyediakan akses langsung ke setiap kunci yang mungkin ada dalam penyimpanan, berbeda dengan åvar.writeó), yang memungkinkan Anda untuk menulis ke variabel penyimpanan yang didefinisikan secara eksplisit dalam kontrak.
tr: Bu sistem çağrısı, sözleşmede açıkça tanımlanan depolama değişkenlerine yazmanızı sağlayan var.write() ile aksine, depolamadaki olası herhangi bir anahtara doğrudan erişim sağlar.
zh_cn: 与`var.write()'相比,这个系统电话可直接进入储存中的任何可能的钥匙,使您能够写到合同中明确规定的储存变量。

source: _`value`_: The value to write to the key.
es: _`value`_: El valor a escribir en la clave.
fr: _`value`_: La valeur à écrire à la clé.
id: Nilai untuk menulis ke kunci.
tr: _value_: Anahtara yazılacak değer.
zh_cn: & value *} : 写到密钥的值 。

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L70)
id: Font color = "# 404040" siscalls.cairo]://https://gitub.com/starkware-libs/cairo/cairo/cca08c8eb0eb3e58767974f20994d0ba64183/src/starknet/scalls.cairo#L70)
zh_cn: [声传 (https://github.com/starkware-libs/cairo/blob/cca08c898f0eb358797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L70)

source: Testing Cairo Programs
es: Pruebas de los programas de El Cairo
fr: Tester les programmes du Caire
tr: Kahire Programlarının Test Edilmesi

source: {{#quiz ../quizzes/ch06-01-enums.toml}}
fr: {{#quiz../quizes/ch06-01-enums.toml}}

source: {{#quiz ../quizzes/ch06-02-match.toml}}
fr: {{#quiz../quizes/ch06-02-match.toml}}

source: "{} by {} ({})"
es: " por ()"
fr: "{} par {} ({})"

source: {{#quiz ../quizzes/ch08-02-traits.toml}}
fr: {{#quiz../quizes/ch08-02-traits.toml}}

source: `in`
es: `en`
fr: "en"
id: Dalam hal tertentu.

source: `try`
es: `tratar`
fr: "Essai"
id: Coba saja.

source: `~expr`
fr: "~expirer"
id: Aku tidak tahu apa yang akan terjadi.

source: `PartialEq`
fr: `Eqpartielle`

source: `Sub`
fr: `Sous`
id: Jadi, mari kita lihat apa yang akan kita lakukan.

source: `SubEq`
fr: "Sous-Eq"

source: _`class_hash`_: The class hash of the contract to be deployed.
es: _`class_hash`_: La clase hash del contrato a ser desplegado.
fr: _`class_hash`_: Le hachage de classe du contrat à déployer.
id: Kelas hash dari kontrak yang akan dieksposkan.
tr: _class_hash_: Görevlendirilecek sözleşmenin sınıf hash'i.

source: `u8`
id: [ Gambar di hlm.

source: `u16`
id: Ãu16_BAR_

source: `u32`
id: ▪u32ltu.

source: `u128`
id: Áu128

source: `u256`
id: ·u256_BAR_
