Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Nevertheless, applying the `inline` attribute to a function with a lot of code and few parameters might result in an increased code size, especially if the inlined function is used many times in the codebase. Use inlining only where it makes sense, and be aware that the compiler handles inlining by default. Therefore, manually applying inlining is not recommended in most situations, but can help improve and fine-tune your code's behavior.
es: Sin embargo, aplicar el atributo `inline` a una función con mucho código y pocos parámetros podría resultar en un mayor tamaño de código, especialmente si la función inlined se utiliza muchas veces en la base de código. Use inlining sólo donde tenga sentido, y tenga en cuenta que el compilador maneja inlining por defecto. Por lo tanto, la aplicación manual de inlining no se recomienda en la mayoría de las situaciones, pero puede ayudar a mejorar y ajustar el comportamiento de su código.
fr: Néanmoins, l'application de l'attribut `inline` à une fonction avec beaucoup de code et peu de paramètres pourrait entraîner une augmentation de la taille du code, surtout si la fonction inlined est utilisée plusieurs fois dans la base de code. Utilisez l'inline uniquement là où cela a du sens, et soyez conscient que le compilateur gère l'inline par défaut. Par conséquent, l'application manuelle de l'inline n'est pas recommandée dans la plupart des situations, mais peut aider à améliorer et à affiner le comportement de votre code.
id: Namun demikian, menerapkan atribut æinline (inline) pada sebuah fungsi dengan banyak kode dan beberapa parameter mungkin menghasilkan peningkatan ukuran kode, terutama jika fungsi inline digunakan berkali-kali dalam basis kode. Gunakan inlining hanya di mana ia masuk akal, dan menyadari bahwa kompiler menangani inlining secara baku. Oleh karena itu, secara manual menerapkan inlining tidak disarankan dalam banyak situasi, tetapi dapat membantu meningkatkan dan menyempurnakan perilaku kode Anda.
tr: Yine de, inline özniteliğini çok fazla kod ve az parametre içeren bir fonksiyona uygulamak, özellikle satır içi fonksiyon kod tabanında birçok kez kullanılıyorsa, kod boyutunun artmasına neden olabilir. Sadece mantıklı olduğu yerde satırlama kullanın ve derleyicinin varsayılan olarak satırlama işlemini yerine getirdiğini unutmayın. Bu nedenle, satırlamanın uygulanması çoğu durumda önerilmez, ancak kodunuzun davranışını iyileştirmeye ve ince ayar yapmaya yardımcı olabilir.
zh_cn: 尽管如此,应用“内线属性”到含有大量代码和少数参数的函数,可能会增加代码的大小,特别是如果内线函数在代码库中多次使用,则会增加代码的大小。仅在合理的情况下使用内衬,并注意编译者会处理默认的内衬。因此,大多数情况下不推荐人工应用内衬,但有助于改进和微调您的代码行为。

source: When writing a program, it is quite common to print some data to the console, either for the normal process of the program or for debugging purpose. In this chapter, we describe the options you have to print simple and complex data types.
es: Al escribir un programa, es bastante común imprimir algunos datos en la consola, ya sea para el proceso normal del programa o para el propósito de depuración. En este capítulo, describimos las opciones que tiene para imprimir tipos de datos simples y complejos.
fr: Lors de l'écriture d'un programme, il est assez courant d'imprimer certaines données sur la console, soit pour le processus normal du programme ou à des fins de débogage. Dans ce chapitre, nous décrivons les options que vous devez imprimer des types de données simples et complexes.
id: Ketika menulis sebuah program, cukup umum untuk mencetak beberapa data ke konsol, baik untuk proses normal dari program atau untuk tujuan debugging. Dalam bab ini, kami menjelaskan pilihan yang harus Anda tampilkan tipe data yang sederhana dan kompleks.
tr: Bir program yazarken, programın normal işlemi için veya hata ayıklama amacı için konsola bazı verileri yazdırmak oldukça yaygındır. Bu bölümde, basit ve karmaşık veri türlerini yazdırmanız gereken seçenekleri açıklıyoruz.
zh_cn: 写入程序时, 通常会向控制台打印一些数据, 无论是为程序的正常进程, 还是为调试目的。 在本章中, 我们描述您要打印简单复杂的数据类型的选项 。

source: Printing Standard Data Types
es: Imprimir tipos de datos estándar
fr: Types de données standard d'impression
id: Tipe Data Standar Pencetakan
tr: Standart Veri Tiplerini Yazdırma
zh_cn: 印刷标准标准数据类型

source: Cairo provides two macros to print standard data types:
es: El Cairo proporciona dos macros para imprimir tipos de datos estándar:
fr: Le Caire fournit deux macros pour imprimer des types de données standard:
id: Kairo menyediakan dua makro untuk mencetak tipe data standar:
tr: Kahire standart veri türlerini yazdırmak için iki makro sağlar:
zh_cn: 开罗为打印标准数据类型提供了两个宏:

source: `println!` which prints on a new line
es: `println!` que imprime en una nueva línea
fr: `println!` qui imprime sur une nouvelle ligne
id: Sidik jari yang mana di jalur yang baru.
tr: println! yeni bir satırda yazdırır
zh_cn: 印在新线上的指纹

source: `print!` with inline printing
es: `print!` con impresión en línea
fr: `imprimé!` avec impression en ligne
id: Cetak! Dengan pencetakan inline
tr: print! satır içi baskı ile
zh_cn: " 印刷! ",内印

source: Both take a `ByteArray` string as first parameter (see [Data Types](./ch02-02-data-types.md#byte-array-strings)), which can be a simple string to print a message or a string with placeholders to format the way values are printed.
es: Ambos toman una cadena `ByteArray` como primer parámetro (ver [Tipos de datos](./ch02-02-data-types.md#byte-array-strings)), que puede ser una cadena simple para imprimir un mensaje o una cadena con marcadores de posición para formatear los valores de forma se imprimen.
fr: Les deux prennent une chaîne `ByteArray` comme premier paramètre (voir [Types de données](./ch02-02-data-types.md#byte-array-strings)), qui peut être une chaîne simple pour imprimer un message ou une chaîne avec des placeholders pour formater la façon dont les valeurs sont imprimées.
id: Keduanya mengambil string ·ByteArray) sebagai parameter pertama (lihat [Data Types]↑./ch02-02-data-types.md#byte-array-strings), yang dapat berupa string sederhana untuk mencetak pesan atau string dengan pemegang tempat untuk memformat nilai yang dicetak.
tr: Her ikisi de ilk parametre olarak bir ByteArray dizgesi alır (bakınız [Veri Türleri](./ch02-02-data-types.md#byte-array-strings)), bu da bir iletiyi yazdırmak için basit bir dizge veya değerlerin basılma şeklini biçimlendirmek için yer tutuculu bir dizge olabilir.
zh_cn: 两者均将“ByteArray”字符串作为第一个参数(见 [数据类型] (./ch02-02-d-data-types.md#byte-array-strings)),该字符串可以是打印信件的简单字符串,也可以是带有占位符的字符串,以格式化打印数值的方式。

source: There are two ways to use these placeholders and both can be mixed:
es: Hay dos maneras de utilizar estos marcadores de posición y ambos se pueden mezclar:
fr: Il y a deux façons d'utiliser ces placeholders et les deux peuvent être mélangés:
id: Ada dua cara untuk menggunakan pemegang tempat ini dan keduanya dapat dicampur:
tr: Bu yer tutucuları kullanmanın iki yolu vardır ve her ikisi de karıştırılabilir:
zh_cn: 使用这些占位符有两种方法,两种方法可以混合:

source: empty curly brackets `{}` are replaced by values given as parameters to the `print!` macro, in the same order.
es: los corchetes de rizos vacíos se sustituyen por los valores dados como parámetros a la macro `print!`, en el mismo orden.
fr: Les crochets vides `{}` sont remplacés par des valeurs données en tant que paramètres de la macro `print!`, dans le même ordre.
id: braket keriting kosong {}diganti dengan nilai yang diberikan sebagai parameter untuk cetak! makro, dalam urutan yang sama.
tr: boş kıvırcık parantez, aynı sırayla print! makrosuna parametreler olarak verilen değerlerle değiştirilir.
zh_cn: 空括号 由以“print!” 宏为参数的数值替换,按同一顺序排列。

source: curly brackets with variable names are directly replaced by the variable value.
es: los soportes rizados con nombres variables son reemplazados directamente por el valor variable.
fr: Les parenthèses avec noms de variables sont directement remplacées par la valeur variable.
id: braket keriting dengan nama variabel langsung digantikan oleh nilai variabel.
tr: Değişken isimleri olan kıvırcık parantezler, değişken değeri ile doğrudan değiştirilir.
zh_cn: 带有变量名称的圆括号由变量值直接替换。

source: Here are some examples:
es: He aquí algunos ejemplos:
fr: Voici quelques exemples :
id: Berikut beberapa contohnya:
tr: İşte bazı örnekler:
zh_cn: 以下是一些例子:

source: "Hello world!"
es: "¡Hola mundo!"
fr: "Bonjour!"
id: "Halo dunia!"
tr: "Merhaba dünya!"
zh_cn: "你好世界!"

source: `print!` and `println!` macros use the `Display` trait under the hood, and are therefore used to print the value of types that implement it. This is the case for basic data types, but not for more complex ones. If you try to print complex data type values with these macros, e.g. for debugging purposes, you will get an error. In that case, you can either [manually implement](./ch11-08-printing.md#printing-custom-data-types) the `Display` trait for your type or use the `Debug` trait (see [below](./ch11-08-printing.md#print-debug-traces)).
es: Las macros `print!` y `println!` utilizan el rasgo `Display` bajo el capó y, por lo tanto, se utilizan para imprimir el valor de los tipos que lo implementan. Este es el caso de los tipos de datos básicos, pero no de los más complejos. Si intenta imprimir valores de tipo de datos complejos con estas macros, por ejemplo, con fines de depuración, obtendrá un error. En ese caso, puede [imprimir manualmente](./ch11-08-printing.md#printing-custom-data-types) el rasgo `Display` para su tipo o utilizar el rasgo `Debug` (véase [abajo](./ch11-08-printing.md#print-debug-traces)).
fr: Les macros `print!` et `println!` utilisent le caractère `Display` sous le capot, et sont donc utilisées pour imprimer la valeur des types qui l'implémentent. C'est le cas pour les types de données de base, mais pas pour les types plus complexes. Si vous essayez d'imprimer des valeurs de type de données complexes avec ces macros, par exemple pour le débogage, vous obtiendrez une erreur. Dans ce cas, vous pouvez soit [implémenter manuellement](./ch11-08-printing.md#printing-custom-data-types) le caractère `Display` pour votre type ou utiliser le caractère `Debug` (voir [ci-dessous](./ch11-08-printing.md#print-debug-traces)).
id: Karena itu digunakan untuk mencetak nilai dari tipe yang menerapkannya. Ini adalah kasus untuk tipe data dasar, tapi bukan untuk yang lebih kompleks. Jika Anda mencoba untuk mencetak nilai data kompleks dengan makro ini, misalnya. Untuk tujuan debugging, Anda akan mendapat kesalahan. Dalam hal ini, Anda dapat [biasanya mengimplementasikan] atau menirukan atau menirunya.
tr: print! ve println! makroları başlık altındaki Display özelliğini kullanır ve bu nedenle onu uygulayan türlerin değerini yazdırmak için kullanılır. Bu, temel veri türleri için geçerlidir, ancak daha karmaşık olanlar için değildir. Karmaşık veri türü değerlerini bu makrolarla yazdırmaya çalışırsanız, örneğin hata ayıklama amacıyla bir hata alırsınız. Bu durumda, [manly]
zh_cn: `print!' 和`println!' 宏在引擎盖下使用`display' 特性,因此用于打印执行该特性的类型的值。基本数据类型属于这种情况,但对于较复杂的数据类型则不属于这种情况。如果试图用这些宏打印复杂的数据类型值,例如,为调试目的,则会有一个错误。在这种情况下,您可以使用“display”特性(./ch11-08-printing.md#printing-custom-data-type)来打印类型中的“display”特性,或者使用“dobug”特性(见[blow](/ch11-08-printing.md#print-debug-traces)。

source: Formatting
es: Formato
fr: Formatage
id: Pemformatan
tr: Biçimlendirme
zh_cn: 格式格式化

source: Cairo also provides a useful macro to handle string formatting: `format!`. This macro works like `println!`, but instead of printing the output to the screen, it returns a `ByteArray` with the contents. In the following example, we perform string concatenation using either the `+` operator or the `format!` macro. The version of the code using `format!` is much easier to read, and the code generated by the `format!` macro uses snapshots, so that this call doesn’t take ownership of any of its parameters.
es: El Cairo también proporciona una macro útil para manejar el formato de cadena: `format!`. Esta macro funciona como `println!`, pero en lugar de imprimir la salida a la pantalla, devuelve un `ByteArray` con el contenido. En el siguiente ejemplo, realizamos la concatenación de cadena usando el operador o la macro `format!`. La versión del código usando `format!` es mucho más fácil de leer, y el código generado por la macro `format!` utiliza instantáneas, de modo que esta llamada no toma la propiedad de ninguno de sus parámetros.
fr: Le Caire fournit également une macro utile pour gérer le formatage des chaînes: `format!`. Cette macro fonctionne comme `println!`, mais au lieu d'imprimer la sortie à l'écran, elle retourne un `ByteArray` avec le contenu. Dans l'exemple suivant, nous effectuons la concaténation des chaînes en utilisant soit l'opérateur `+` ou la macro `format!`. La version du code utilisant `format!` est beaucoup plus facile à lire, et le code généré par la macro `format!` utilise des instantanés, de sorte que cet appel ne prend pas en charge l'un de ses paramètres.
id: Kairo juga menyediakan sebuah makro yang berguna untuk menangani format string: ·format!. Makro ini bekerja seperti ·println!, tapi daripada mencetak keluaran ke layar, ia mengembalikan sebuah string formating: dengan isinya. Dalam contoh berikut, kita melakukan konkatensi string menggunakan operator \ atau formatat!
tr: Kahire ayrıca dize biçimlendirmesini işlemek için kullanışlı bir makro sağlar: format!. Bu makro println! gibi çalışır, ancak çıktıyı ekrana yazdırmak yerine, içeriğiyle birlikte bir ByteArray döndürür. Aşağıdaki örnekte, + operatörünü veya format! makrosunu kullanarak dize birleştirme işlemini gerçekleştiriyoruz. format! kodunun herhangi bir sürümünün okunması çok daha kolaydır, ve bu kodu kullanır.
zh_cn: 开罗也提供了处理字符串格式的有用的宏:`format!'。这个宏的写法像`println!',但是它不向屏幕打印输出,而是返回含有内容的`ByteAray'。在下面的例子中,我们使用“format!” 或“format!” 宏来进行字符串拼凑。使用`format!' 的代码版本更容易阅读,而“format!' 宏使用快照生成的代码则容易阅读,这样这个电话就不会拥有它的任何参数。

source: "tic"
zh_cn: "圆"

source: "tac"
zh_cn: "Tac" "Tac" ("Tac")

source: "toe"
es: "Dedo del pie"
fr: "Toi"
zh_cn: "脚趾"

source: // using + operator consumes the strings, so they can't be used again!
es: // usando + operador consume las cadenas, por lo que no se pueden utilizar de nuevo!
fr: // en utilisant + opérateur consomme les chaînes, de sorte qu'elles ne peuvent pas être utilisées à nouveau!
id: //menggunakan + operator mengkonsumsi string, sehingga mereka tidak dapat digunakan lagi!
tr: // + operatörü kullanarak dizeleri tüketir, böylece tekrar kullanılamazlar!
zh_cn: / 使用 + 操作员消耗字符串, 这样它们就不能被再次使用!

source: // s1, s2, s3 are not consumed by format! // or
es: // s1, s2, s3 no se consumen por formato! // o
fr: // s1, s2, s3 ne sont pas consommés par format! // ou
id: // s1, s2, s3 tidak dikonsumsi oleh format! // atau
tr: // s1, s2, s3 formata göre tüketilmez! // veya
zh_cn: / s1, s2, s3 格式不消耗! // 或

source: Printing Custom Data Types
es: Imprimir tipos de datos personalizados
fr: Impression des types de données personnalisés
id: Mencetak Tipe Data Gubahan
tr: Özel Veri Türlerinin Yazdırılması
zh_cn: 打印自定义数据类型

source: As previously explained, if you try to print the value of a custom data type with `print!` or `println!` macros, you'll get an error telling you that the `Display` trait is not implemented for your custom type:
es: Como se ha explicado anteriormente, si intenta imprimir el valor de un tipo de datos personalizado con macros `print!` o `println!`, obtendrá un error diciéndole que el rasgo `Display` no está implementado para su tipo personalizado:
fr: Comme expliqué précédemment, si vous essayez d'imprimer la valeur d'un type de données personnalisé avec des macros `print!` ou `println!`, vous obtiendrez une erreur vous disant que le caractère `Display` n'est pas implémenté pour votre type personnalisé:
id: Seperti yang telah dijelaskan sebelumnya, jika Anda mencoba untuk mencetak nilai dari tipe data kustom dengan cetak! atau pprintln! Anda akan mendapat kesalahan dengan mengatakan bahwa sifat åDisplay tidak diimplementasikan untuk tipe custom Anda:
tr: Daha önce açıklandığı gibi, özel bir veri türünün değerini print! veya println! makroları ile yazdırmaya çalışırsanız, özel türünüz için Display özelliğinin uygulanmadığını söyleyen bir hata alırsınız:
zh_cn: 如前所述,如果试图用“print!” 或“println!” 宏打印自定义数据类型的值,就会有错误地告诉你“display” 特性没有为您的自定义类型执行:

source: The `println!` macro can do many kinds of formatting, and by default, the curly brackets tell `println!` to use formatting known as `Display` - output intended for direct end user consumption. The primitive types we’ve seen so far implement `Display` by default because there’s only one way you’d want to show a `1` or any other primitive type to a user. But with structs, the way `println!` should format the output is less clear because there are more display possibilities: Do we want commas or not? Do we want to print the curly brackets? Should all the fields be shown? Due to this ambiguity, Cairo doesn’t try to guess what we want, and structs don’t have a provided implementation of `Display` to use with `println!` and the `{}` placeholder.
es: La macro `println!` puede hacer muchos tipos de formato, y por defecto, los corchetes rizados le dicen a `println!` que use el formato conocido como `Display` - salida destinada al consumo final directo del usuario. Los tipos primitivos que hemos visto hasta ahora implementar `Display` por defecto porque hay sólo una manera en que usted desea mostrar un `1` o cualquier otro tipo primitivo a un usuario. Pero con estructuras, la forma `println!'debe formatear la salida es menos clara porque hay más posibilidades de visualización: ¿Queremos comas o no? ¿Queremos imprimir los corchetes rizados? ¿Deberíamos mostrar todos los campos? Debido a esta ambigüedad, El Cairo no trata de adivinar lo que queremos, y las estructuras no tienen una implementación proporcionada de `Display` para usar con `println!` y el marcador de posición.
fr: La macro `println!` peut faire de nombreux types de formatage, et par défaut, les crochets bouclés indiquent `println!` d'utiliser le formatage connu sous le nom `Display` - sortie destinée à la consommation finale directe. Les types primitifs que nous avons vu jusqu'à présent implémentent `Display` par défaut parce qu'il n'y a qu'une seule façon que vous vouliez montrer un `1` ou tout autre type primitif à un utilisateur. Mais avec les structures, la façon `println!` devrait formater la sortie est moins claire parce qu'il y a plus de possibilités d'affichage: Voulons-nous des virgules ou non? Voulons-nous imprimer les crochets bouclés? Faut-il que tous les champs soient affichés? En raison de cette ambiguïté, Le Caire n'essaie pas de deviner ce que nous voulons, et les structs ne disposent pas d'une implémentation de `Display` à utiliser avec `println!` et le placeholder `{}`.
id: makro dapat melakukan berbagai bentuk format, dan secara baku, tanda kurung keriting mengatakan bahwa hanya ada satu cara untuk menampilkan format yang dikenal sebagai display atau tipe primitif lainnya yang ditujukan untuk konsumsi pengguna langsung. Tipe primitif yang kita lihat sejauh ini seharusnya kurang menerapkannya karena ada lebih banyak kemungkinan: Apakah kita ingin mencetak ▪1 jenis sederhana lainnya pada pengguna. tetapi dengan struktur °L:
tr: println! makrosu birçok çeşit biçimlendirme yapabilir ve varsayılan olarak, kıvırcık parantez println! Display olarak bilinen biçimlendirmeyi kullanmak için kullanılır! Doğrudan son kullanıcı tüketimi için tasarlanmış çıktı. Şimdiye kadar gördüğümüz ilkel tipler varsayılan olarak Display uygulamasını istemiyor, çünkü bir kullanıcıya 1 veya başka bir ilkel tip göstermek istiyorsunuz.
zh_cn: `println!' 宏可以做许多格式化, 默认情况下, 卷括号可以告诉`println!' 使用被称为`display' 的格式化, 即直接用户消费的输出。 我们所看到的原始类型之所以使用`display'默认,是因为只有一种方式, 你才想向用户显示`1' 或任何其他原始类型。 但是,用支架, `println!' 的方式, 格式应该不那么清晰, 因为有更大的显示可能性: 我们是否想要逗号? 我们是否想要打印卷轴? 是否要打印所有字段? 由于这种模糊性,开罗没有试图猜测我们想要什么, 支架没有提供“ Display” 与`println!'和“ 占位符” 一起使用。

source: Here is the `Display` trait to implement:
es: A continuación se presenta el rasgo de `display` para aplicar:
fr: Voici le caractère "Affichage" à mettre en œuvre:
id: Berikut adalah sifat display untuk diterapkan:
tr: İşte uygulamak için Display özelliği:
zh_cn: 以下是要执行的`演练'特征:

source: The second parameter `f` is of type `Formatter`, which is just a struct containing a `ByteArray`, representing the pending result of formatting:
es: El segundo parámetro `f` es de tipo `Formateria`, que es sólo una estructura que contiene un `ByteArray`, que representa el resultado pendiente del formato:
fr: Le second paramètre `f` est de type `Format, qui n'est qu'une structure contenant un `ByteArray`, représentant le résultat en attente du formatage:
id: Parameter kedua adalah tipe dari formatter, yang hanya struct berisi sebuah ▪ByteArray, mewakili hasil tertunda dari format:
tr: İkinci parametre f, biçimlendirmenin bekleyen sonucunu temsil eden bir ByteArray içeren bir yapı olan Formatter tipidir:
zh_cn: 第二个参数`f'为`Formatter'类型,只是含有`ByteAray'的支架,代表格式化的未决结果:

source: /// The pending result of formatting.
es: /// El resultado pendiente del formato.
fr: /// Le résultat en attente du formatage.
id: / Hasil tertunda dari pemformatan.
tr: /// Biçimlendirmenin bekleyen sonucu.
zh_cn: // 格式化的未决结果。

source: Knowing this, here is an example of how to implement the `Display` trait for a custom `Point` struct:
es: Sabiendo esto, aquí hay un ejemplo de cómo implementar el rasgo `Display` para una estructura `Point` personalizada:
fr: En sachant cela, voici un exemple de la façon de mettre en œuvre le caractère `Affichage` pour une structure `Point` personnalisée:
id: Mengetahui hal ini, ini adalah contoh bagaimana menerapkan sifat display untuk sebuah struktur kustom:
tr: Bunu bilerek, özel bir Point yapısı için Display özelliğinin nasıl uygulanacağına bir örnek:
zh_cn: 了解这一点后,这里的例子说明如何执行“点点”传统结构的`演练'特征:

source: "Point ({}, {})"
es: "Punto (, )"
zh_cn: "点(,)"

source: // Point: (1, 3)
es: // Punto: (1, 3)
tr: // Nokta: (1, 3)
zh_cn: 点数:(1,3)

source: Cairo also provides the `write!` and `writeln!` macros to write formatted strings in a formatter. Here is a short example using `write!` macro to concatenate multiple strings on the same line and then print the result:
es: El Cairo también proporciona las macros `write!` y `writeln!` para escribir cadenas formateadas en formateria. He aquí un ejemplo corto usando `write!` macro para concatenar múltiples cadenas en la misma línea y luego imprimir el resultado:
fr: Le Caire fournit également les macros `write!` et `writeln!` pour écrire des chaînes formatées dans un format. Voici un court exemple utilisant la macro `write!` pour concaténer plusieurs chaînes sur la même ligne, puis imprimer le résultat:
id: Kairo juga menyediakan tulisan! dan menulis! macro untuk menulis string terformat dalam sebuah formateri. ini adalah contoh singkat menggunakan tulisan! makro untuk mengkatenasi beberapa string pada baris yang sama dan kemudian mencetak hasilnya:
tr: Kahire ayrıca biçimlendiricide biçimlendirilmiş dizeler yazmak için write! ve writeln! makrolarını da sağlar. write! makrosunu kullanarak aynı satırda birden fazla dizeyi birleştirmek ve daha sonra sonucu yazdırmak için kısa bir örnek:
zh_cn: 开罗还提供“ write!” 和“ writeln!” 宏, 用于将格式化的字符串写入一个要旨。 下面是使用“ write!” 的简短示例, 用于将多个字符串合并在同一行, 然后打印结果 :

source: "hello"
es: "hola"
fr: "Bonjour"
id: "Halo"
tr: "merhaba"
zh_cn: "你好"

source: "world"
es: "mundo"
fr: "monde"
id: "Dunia"
tr: "Dünya"
zh_cn: "世界"

source: " {a} {b}"
zh_cn: {a}{b} {a} {b} {a} {b} {a} {b} {b} {a} {a} {b} {b} {a}

source: // helloworld 10 20
id: //haloworld 10 20
tr: // aloworld 10 20
zh_cn: 喜好世界 10 20
