Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Speaking of coins, let’s use them as an example using `match`! We can write a function that takes an unknown US coin and, in a similar way as the counting machine, determines which coin it is and returns its value in cents, as shown in Listing 6-1.
es: Hablando de monedas, vamos a utilizarlas como un ejemplo usando `match`! Podemos escribir una función que toma una moneda desconocida de los EE.UU. y, de una manera similar a la máquina de conteo, determina qué moneda es y devuelve su valor en centavos, como se muestra en la Lista 6-1.
fr: En parlant de pièces de monnaie, nous pouvons les utiliser comme un exemple en utilisant `match`! Nous pouvons écrire une fonction qui prend une pièce américaine inconnue et, de la même manière que la machine de comptage, détermine quelle pièce il est et retourne sa valeur en cents, comme indiqué dans Listing 6-1.
id: Kita dapat menulis sebuah fungsi yang membutuhkan koin AS yang tidak diketahui dan, dengan cara yang sama seperti mesin penghitung, menentukan koin mana yang mana dan mengembalikan nilainya dalam sen, seperti yang ditunjukkan dalam Listing 6-1.
tr: Madeni paralardan bahsetmişken, bunları match kullanarak bir örnek olarak kullanalım! Bilinmeyen bir ABD madeni parayı alan bir fonksiyon yazabilir ve sayma makinesine benzer bir şekilde, hangi madeni para olduğunu belirleyebilir ve değerini 6-1 Listeleme'de gösterildiği gibi sent cinsinden döndürür.
zh_cn: 说到硬币,让我们用`匹配'来作为例子!我们可以写一个函数,用一个未知的美国硬币,并以与计数机器类似的方式,决定哪个硬币,并如《名单》6-1所示,以美分返回其价值。

source: <span class="caption">Listing 6-1: An enum and a `match` expression that has the variants of the enum as its patterns</span>
es: <span class="caption">Lista 6-1: Un enum y una expresión `match` que tiene las variantes del enum como sus patrones</span>
fr: <span class="caption">Liste 6-1: Un enum et une expression `match` qui a les variantes de l'enum comme ses motifs</span>
id: <span class="caption">Listing 6-1: Sebuah enum dan sebuah ekspresi åmatché yang memiliki varian dari enum sebagai pola</span>
tr: span class="caption">Listing 6-1: Enum ve match desenleri olarak enum varyantlarına sahip bir ifade/span>
zh_cn: <span类=“caption” > listing 6-1: 以 enum 变量为模式 </span> 的“ match” 表达式和“ match” 表达式

source: Let’s break down the `match` expression in the `value_in_cents` function. First, we list the `match` keyword followed by an expression, which in this case is the value `coin`. This seems very similar to a conditional expression used with the `if` statement, but there’s a big difference: with `if`, the condition needs to evaluate to a boolean value, but here it can be any type. The type of `coin` in this example is the `Coin` enum that we defined on the first line.
es: Desglosemos la expresión `match` en la función `value_in_cents`. En primer lugar, enumeramos la palabra clave `match` seguida de una expresión, que en este caso es el valor `coin`. Esto parece muy similar a una expresión condicional utilizada con la declaración `if`, pero hay una gran diferencia: con `if`, la condición debe evaluarse a un valor booleano, pero aquí puede ser cualquier tipo. El tipo de `coin` en este ejemplo es el enum `Coin` que definimos en la primera línea.
fr: Tout d'abord, nous listons le mot-clé `match` suivi d'une expression, qui dans ce cas est la valeur `coin`. Cela semble très similaire à une expression conditionnelle utilisée avec l'instruction `if`, mais il ya une grande différence: avec `if`, la condition doit évaluer à une valeur booléenne, mais ici il peut être n'importe quel type. Le type de `coin` dans cet exemple est l'enum `Coin` que nous avons défini sur la première ligne.
id: Pertama-tama, kita daftarkan kata kunci yang diikuti dengan ungkapan, yang dalam hal ini adalah nilai enomavalue_in_cents. ini tampak sangat mirip dengan pernyataan thoseafin_cents, tapi ada perbedaan besar: dengan kata kunci berikut, kondisi perlu dievaluasi untuk nilai boolean, tetapi di sini dapat menjadi tipe apapun. tipe enomcoin dalam contoh ini adalah encomin enum yang kita definisikan pada baris pertama.
tr: value_in_cents fonksiyonundaki match ifadesini parçalayalım. İlk olarak, bu durumda coin değeri olan bir ifadeyi takip eden match anahtar kelimesini listeliyoruz. Bu, if ifadesiyle kullanılan koşullu bir ifadeye çok benzer görünüyor, ancak büyük bir fark var: if tipiyle, bu durumun herhangi bir boole değeri için değerlendirilmesi gerekiyor, ancak burada olabilir.
zh_cn: 让我们拆分`value_in_cents' 函数中的`match'表达式。 首先,我们列出`match'关键字,然后列出一个表达式,在此为`coin'值。这似乎与`if'语句中使用的有条件表达式非常相似,但有一个很大的区别:与`if'相比,条件需要评估到布尔值,但这里它可以是任何类型。例子中的`coin'类型是我们在第一行定义的`coin'enum。

source: Next are the `match` arms. An arm has two parts: a pattern and some code. The first arm here has a pattern that is the value `Coin::Penny` and then the `=>` operator that separates the pattern and the code to run. The code in this case is just the value `1`. Each arm is separated from the next with a comma.
es: A continuación están los brazos `match`. Un brazo tiene dos partes: un patrón y algo de código. El primer brazo aquí tiene un patrón que es el valor `Coin::Penny` y luego el operador `= que separa el patrón y el código a ejecutar. El código en este caso es sólo el valor `1`. Cada brazo se separa de la siguiente con una coma.
fr: Ensuite, les bras `match`. Un bras a deux parties: un motif et un code. Le premier bras ici a un motif qui est la valeur `Coin::Penny` et puis l'opérateur `=>` qui sépare le motif et le code à exécuter. Le code dans ce cas est juste la valeur `1`. Chaque bras est séparé du suivant avec une virgule.
id: Berikutnya adalah lengan yang cocok. lengan memiliki dua bagian: pola dan beberapa kode. lengan pertama memiliki pola yang bernilai, yaitu: "Penny." dan kemudian operator yang memisahkan pola dan kode untuk dijalankan. kode dalam kasus ini hanya nilai ·1. masing-masing lengan dipisahkan dari berikutnya dengan koma.
tr: Sonraki match kollarıdır. Bir kolun iki parçası vardır: bir kalıp ve bazı kod. Buradaki ilk kolda Coin::Penny ve daha sonra => operatörü, deseni ve çalıştırılacak kodu ayırır. Bu durumda kod sadece 1 değeridir. Her kol bir virgül ile bir sonrakinden ayrılır.
zh_cn: 下一个是“匹配”的手臂,一个手臂有两个部分:一个图案和一些代码。第一个手臂的图案是“coin:Penny”和“%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

source: When the `match` expression executes, it compares the resultant value against the pattern of each arm, in the order they are given. If a pattern matches the value, the code associated with that pattern is executed. If that pattern doesn’t match the value, execution continues to the next arm, much as in a coin-sorting machine. We can have as many arms as we need: in the above example, our `match` has four arms.
es: Cuando la expresión `match` se ejecuta, se compara el valor resultante con el patrón de cada brazo, en el orden en que se dan. Si un patrón coincide con el valor, se ejecuta el código asociado con ese patrón. Si ese patrón no coincide con el valor, la ejecución continúa hasta el siguiente brazo, tanto como en una máquina de clasificación de monedas. Podemos tener tantos brazos como necesitemos: en el ejemplo anterior, nuestro `match` tiene cuatro brazos.
fr: Lorsque l'expression `match` s'exécute, elle compare la valeur résultante au motif de chaque bras, dans l'ordre où ils sont donnés. Si un motif correspond à la valeur, le code associé à ce motif est exécuté. Si ce motif ne correspond pas à la valeur, l'exécution continue au bras suivant, tout comme dans une machine de tri de pièces. Nous pouvons avoir autant d'armes que nous avons besoin: dans l'exemple ci-dessus, notre `match` a quatre bras.
id: Jika sebuah pola cocok dengan nilai yang sama dengan pola tersebut tidak sesuai dengan nilai, eksekusi terus berlanjut ke lengan berikutnya, seperti dalam mesin pemotong koin. kita dapat memiliki senjata sebanyak yang kita butuhkan: dalam contoh di atas, senjata kita memiliki empat senjata.
tr: match ifadesi çalıştırıldığında, elde edilen değeri, verilen sırayla, her kolun modeline göre karşılaştırır. Bir kalıp değerle eşleşirse, bu kalıpla ilişkili kod yürütülür. Bu kalıp değerle eşleşmiyorsa, yürütme, bir madeni para makinesinde olduğu gibi bir sonraki kola kadar devam eder. İhtiyacımız olan kadar kola sahip olabiliriz: yukarıdaki örnekte, match dört kola sahiptir.
zh_cn: 当“匹配”表达式执行时,它将结果值与每个手臂的图案进行比较,按给定顺序排列。如果一个图案与值相符,则执行与该图案相关的代码。如果该图案与值不匹配,处决将持续到下一个手臂,就像硬币分拣机一样。我们可以拥有我们所需要的武器数量:在以上例子中,我们的“匹配”有四只手臂。

source: The code associated with each arm is an expression, and the resultant value of the expression in the matching arm is the value that gets returned for the entire match expression.
es: El código asociado a cada brazo es una expresión, y el valor resultante de la expresión en el brazo de coincidencia es el valor que se devuelve para toda la expresión de coincidencia.
fr: Le code associé à chaque bras est une expression, et la valeur résultante de l'expression dans le bras correspondant est la valeur qui est retournée pour l'expression de match entière.
id: Kode yang terkait dengan setiap lengan adalah sebuah ekspresi, dan nilai hasil dari ekspresi dalam lengan yang cocok adalah nilai yang akan dikembalikan untuk seluruh ekspresi kecocokan.
tr: Her kolla ilişkili kod bir ifadedir ve eşleşen koldaki ifadenin sonuç değeri, tüm eşleşme ifadesi için iade edilen değerdir.
zh_cn: 与每个臂相关的代码是一个表达式, 匹配臂中表达式的后值是整个匹配表达式返回的值 。

source: We don’t typically use curly brackets if the `match` arm code is short, as it is in our example where each arm just returns a value. If you want to run multiple lines of code in a `match` arm, you must use curly brackets, with a comma following the arm. For example, the following code prints “Lucky penny!” every time the method is called with a `Coin::Penny`, but still returns the last value of the block, `1`:
es: Normalmente no usamos soportes rizados si el código del brazo `match` es corto, como es en nuestro ejemplo donde cada brazo sólo devuelve un valor. Si desea ejecutar varias líneas de código en un brazo `match`, debe utilizar soportes rizados, con una coma que sigue al brazo. Por ejemplo, el siguiente código imprime “Lucky penique!” cada vez que el método se llama con un `Coin::Penny`, pero todavía devuelve el último valor del bloque, `1`:
fr: Nous n'utilisons généralement pas des crochets bouclés si le code de bras `match` est court, comme c'est le cas dans notre exemple où chaque bras retourne juste une valeur. Si vous voulez exécuter plusieurs lignes de code dans un bras `match`, vous devez utiliser des crochets bouclés, avec une virgule qui suit le bras. Par exemple, le code suivant imprime un penny de Lucky!
id: Kami biasanya tidak menggunakan braket keriting jika hurufnya pendek, karena dalam contoh kami, masing-masing lengan hanya mengembalikan nilai. jika Anda ingin menjalankan beberapa baris kode dalam lengan yang cocok, Anda harus menggunakan braket yang keriting, dengan sebuah koma berikut lengan.
tr: match kol kodunun kısa olması durumunda, her kolun sadece bir değer döndürdüğü örneğimizde olduğu gibi, tipik olarak kıvırcık parantez kullanmıyoruz. Bir match kolunda birden fazla kod satırı çalıştırmak istiyorsanız, kolu takip eden bir virgül ile kıvırcık parantez kullanmalısınız. Örneğin, aşağıdaki kod "Lucky penny!" Coin:Penny değeri ile her çağrıldığında, yine de son olarak gelir.
zh_cn: 如果`匹配'武器代码很短,我们通常不使用卷括号,就像我们的例子那样,每个手臂都返回一个值。如果你想在`匹配'武器中运行多行代码,则必须使用卷括号,在手臂后面有一个逗号。例如,每次使用“Coin:Penny',但仍然返回区块的最后值,`1':

source: "Lucky penny!"
es: "¡Afortunado centavo!"
fr: "Penny Lucky!"
tr: "Şanslı kuruş!"
zh_cn: "幸运便士!"

source: Patterns That Bind to Values
es: Patrones que se unen a los valores
fr: Les modèles qui s'attachent aux valeurs
id: Pola yang Ikatan dengan Nilai - Nilai
tr: Değerlere Bağlanan Desenler
zh_cn: 绑绑在价值上的模式

source: Another useful feature of `match` arms is that they can bind to the parts of the values that match the pattern. This is how we can extract values out of enum variants.
es: Otra característica útil de los brazos `match` es que pueden unirse a las partes de los valores que coinciden con el patrón. Así es como podemos extraer los valores de las variantes de enum.
fr: Une autre caractéristique utile des bras `match` est qu'ils peuvent se lier aux parties des valeurs qui correspondent au motif. C'est ainsi que nous pouvons extraire des valeurs des variantes d'enum.
id: Fitur lain yang berguna dari lengan yang cocok adalah bahwa mereka dapat mengikat bagian dari nilai-nilai yang sesuai dengan pola ini adalah bagaimana kita dapat mengekstrak nilai-nilai dari varian enum.
tr: match kollarının bir diğer yararlı özelliği, desene uyan değerlerin parçalarına bağlanabilmeleridir. Enum varyantlarından değerleri bu şekilde çıkarabiliriz.
zh_cn: `匹配'武器的另一个有用的特征是,它们能够与符合模式的值部分捆绑在一起,这就是我们如何从昆虫变异体中提取值。

source: As an example, let’s change one of our enum variants to hold data inside it. From 1999 through 2008, the United States minted quarters with different designs for each of the 50 states on one side. No other coins got state designs, so only quarters have this extra value. We can add this information to our `enum` by changing the `Quarter` variant to include a `UsState` value stored inside it, which we’ve done in Listing 6-2.
es: Como ejemplo, cambiemos una de nuestras variantes de enum para mantener los datos dentro de ella. De 1999 a 2008, los Estados Unidos acuñaron cuartos con diferentes diseños para cada uno de los 50 estados por un lado. Ninguna otra moneda obtuvo diseños de estado, por lo que sólo los cuartos tienen este valor adicional. Podemos añadir esta información a nuestro `enum` cambiando la variante `Cuarto` para incluir un valor `UsState` almacenado dentro de él, que hemos hecho en la Lista 6-2.
fr: De 1999 à 2008, les États-Unis ont modifié les quartiers avec des conceptions différentes pour chacun des 50 états d'un côté. Aucune autre pièce n'a obtenu des conceptions d'état, donc seuls les quartiers ont cette valeur supplémentaire. Nous pouvons ajouter cette information à notre `enum` en changeant la variante `Quarter` pour inclure une valeur `UsState` stockée à l'intérieur, ce que nous avons fait dans la liste 6-2.
id: Sebagai contoh, mari kita ubah salah satu varian enum kita untuk menyimpan data di dalamnya. dari tahun 1999 sampai 2008, Amerika Serikat mencetak koin dengan desain yang berbeda untuk setiap 50 negara bagian di satu sisi. tidak ada koin lain yang memiliki desain negara bagian lain, jadi hanya seperempat yang memiliki nilai ekstra ini. kita dapat menambahkan informasi ini kepada varian kita dengan mengubah varian ▪Quarteráríastasi yang tersimpan di dalamnya, yang telah kita lakukan dalam Listling-2 6.
tr: Örnek olarak, enum varyantlarımızdan birini değiştirerek veriyi içinde tutalım. 1999'dan 2008'e kadar, Amerika Birleşik Devletleri, bir taraftaki 50 eyaletin her biri için farklı tasarımlara sahip çeyrekleri basmıştır. Başka hiçbir madeni para devlet tasarımlarına sahip değildir, bu yüzden sadece çeyrekler bu ekstra değere sahiptir. Bu bilgileri enum varyantına Quarter değerini değiştirerek UsState değerini içinde depolayarak ekleyebiliriz, ki bunu 6'de yaptık.
zh_cn: 举例来说,让我们改变我们的一个昆虫变种,以在其中保留数据。从1999年到2008年,美国将50个州中的每一个州的设计都不同。其他硬币都没有国家设计,因此只有四分之一国家有这种额外价值。我们可以将“四角”变种中包括一个储存在其中的“Us State”值,我们已在6-2清单中这样做,以此将这一信息添加到我们的`enum'变种中。

source: // Debug so we can inspect the state in a minute
es: // Depurar para que podamos inspeccionar el estado en un minuto
fr: // Déboguer pour que nous puissions inspecter l'état dans une minute
id: #/ Debug sehingga kita dapat memeriksa negara dalam satu menit
tr: // Hata ayıklama, böylece bir dakika içinde devleti inceleyebiliriz.
zh_cn: 调试 所以我们可以检查 州在一分钟内

source: <span class="caption">Listing 6-2: A `Coin` enum in which the `Quarter` variant also holds a `UsState` value</span>
es: <span class="caption">Lista 6-2: Un enum `Coin` en el que la variante `Cuarter` también tiene un valor `UsState`</span>
fr: <span class="caption">Liste 6-2: Un enum `Coin` dans lequel la variante `Quarter` détient également une valeur `UsState`</span>
id: <span class="caption">Listing 6-2: A åCoiném di mana varian </span> juga menyimpan sebuah nilai ▪Usstate preference</span>
tr: span class="caption">Listing 6-2: A Coin enum Quarter varyantının da bir UsState değeri taşıdığı/span>
zh_cn: <span类=`Caption' > listing 6-2:`Coin' enum, 其中`Fround'变式也持有`Usstate' 值 </span>

source: Let’s imagine that a friend is trying to collect all 50 state quarters. While we sort our loose change by coin type, we’ll also call out the name of the state associated with each quarter so that if it’s one our friend doesn’t have, they can add it to their collection.
es: Imaginemos que un amigo está tratando de recoger los 50 cuartos de estado. Mientras ordenamos nuestro cambio suelto por tipo de moneda, también llamaremos el nombre del estado asociado con cada cuarto para que si es uno de nuestros amigos no tiene, pueden agregarlo a su colección.
fr: Imaginons qu'un ami essaie de rassembler les 50 quartiers de l'état. Alors que nous trions notre changement lâche par type de pièce, nous appellerons aussi le nom de l'état associé à chaque quartier de sorte que si il est un de nos amis n'ont pas, ils peuvent l'ajouter à leur collection.
id: Mari kita bayangkan bahwa seorang teman mencoba mengumpulkan seluruh 50 koin, sementara kita menyortir uang receh kita, kita juga akan memanggil nama negara yang terkait dengan setiap kuartal sehingga jika itu adalah salah satu teman kita tidak memiliki, mereka dapat menambahkannya ke koleksi mereka.
tr: Bir arkadaşın 50 eyalet çeyreğinin tamamını toplamaya çalıştığını varsayalım. Bozuk para türüne göre gevşek değişikliğimizi sıralarken, her çeyrekle ilişkili devletin adını da çağıracağız, böylece arkadaşımızın sahip olmadığı bir durumsa, koleksiyonlarına ekleyebilirler.
zh_cn: 让我们想象一下,一个朋友试图收集所有50个州的季度。 当我们用硬币类型来排序我们松散的零钱时,我们也会点出每个季度的关联国名称,这样,如果我们的朋友没有,他们就可以把它添加到他们的收藏中。

source: In the `match` expression for this code, we add a variable called `state` to the pattern that matches values of the variant `Coin::Quarter`. When a `Coin::Quarter` matches, the `state` variable will bind to the value of that quarter’s state. Then we can use `state` in the code for that arm, like so:
es: En la expresión `match` para este código, añadimos una variable llamada `state` al patrón que coincide con los valores de la variante `Coin::Quarter`. Cuando una `Coin::Quarter` coincide, la variable `state` se unirá al valor del estado de ese trimestre. Entonces podemos usar `state` en el código para ese brazo, así:
fr: Dans l'expression `match` pour ce code, nous ajoutons une variable appelée `state` au motif qui correspond aux valeurs de la variante `Coin::Quarter`. Lorsqu'une `Coin::Quarter` correspond, la variable `state` se lie à la valeur de cet état de quart. Ensuite, nous pouvons utiliser `state` dans le code pour ce bras, comme ceci:
id: Dalam ekspresi yang cocok untuk kode ini, kami menambahkan variabel yang disebut åstate those to pola yang cocok dengan nilai dari varian Coin:::Qarter. Ketika sebuah åCoin:::Quarter, variabel negara bagian akan mengikat ke nilai negara seperempat itu.
tr: Bu kod için match ifadesinde, Coin::Quarter varyantının değerlerine uyan modele state adı verilen bir değişken ekliyoruz. Bir Coin::Quarter eşleştiğinde, state değişkeni o çeyreğin durumunun değerine bağlanacaktır. O zaman state'i o kol için kodda kullanabiliriz, böylece:
zh_cn: 在本代码的`匹配'表达式中,我们添加一个变量,称为`状态 ',该变量与变量` Coin:Quarter'的值相符。当一个`coin:Quarter'匹配时,`state'变量将与该季度的值挂钩。然后,我们可以在该手臂的代码中使用`状态 ',例如:

source: "State quarter from {:?}!"
es: "El cuarto de estado de {:?}!"
fr: "Quartier d'État de {:?}!"
tr: " :?'den eyalet çeyreği!"
zh_cn: "国家季度 {{{}}? }!"

source: Because `state` is an `UsState` enum which implements the `Debug` trait, we can print `state` value with `println!` macro.
es: Debido a que `estado` es un enum `UsState` que implementa el rasgo `Debug`, podemos imprimir `estado` valor con `println!'macro.
fr: Parce que `state` est un enum `UsState` qui implémente le caractère `Debug`, nous pouvons imprimer `state` valeur avec `println!` macro.
id: Karena negara bagian ini adalah sebuah enum Usstate yang mengimplementasikan sifat debug, kita dapat mencetak nilai negara dengan akselerasi!
tr: state, Debug özelliğini uygulayan bir UsState enum olduğundan, state değerini println! makrosuyla yazdırabiliriz.
zh_cn: 因为`国家'是执行`调试'特性的`国家 ',所以我们可以用`println!'宏来印刷`国家'价值。

source: Note: `{:?}` is a special formatting syntax that allows to print a debug form of the parameter passed to the `println!` macro. You can find more information about it in [Appendix C](./appendix-03-derivable-traits.html#debug-for-printing-and-debugging).
es: Nota: :? es una sintaxis de formato especial que permite imprimir una forma de depuración del parámetro pasado a la macro `println!`. Puede encontrar más información al respecto en [Apéndice C](./apéndice-03-derivable-traits.html#debug-for-printing-and-debugging).
fr: Note : `{:?}` est une syntaxe de formatage spéciale qui permet d'imprimer une forme de débogage du paramètre passé à la macro `println!`. Vous pouvez trouver plus d'informations à ce sujet dans [Appendix C](./appendix-03-derivable-traits.html#debug-for-printing-and-debugging).
id: Catatan: ▪{:?} merupakan sintaks format khusus yang memungkinkan menampilkan bentuk debug dari parameter yang dilewatkan ke makro!
tr: Not: :?, println! makrosuna aktarılan parametrenin hata ayıklama formunun yazdırılmasına izin veren özel bir biçimlendirme sözdizimidir. [Ek C](./appendix-03-türevlenebilir-traits.html#debug-for-printing-and-debugging] bölümünde bu konuda daha fazla bilgi bulabilirsiniz.
zh_cn: 注:{{{{{{}}}}{}}}{}}}是特殊格式的语法,可以打印通过“println!' 宏” 的参数的调试形式。您可以在[附录C] (./ppendix-03-diivable-traits.html#debug- for-printing-and-debuging)中找到更多关于它的信息。
