Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: ```bash+ starkli call 0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349 voter_can_vote 0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0 --rpc http://0.0.0.0:5050 ```
es: Llamada de «Bash+ Starkli» 0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349 votante_can_voto 0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0 --rpc http://0.0.0.0.5050
id: 0x05ea3a390be71c7fsd8395\118111181111411411111111111113334 pemilih_can_vote 0x03e9e18edc11x1111AC11111111f1111111111111111cd762E0 --rpc http://0.0.0.0.0:50:50
tr: bash+ starkli call 0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349 seçmen_can_vote 0x03ee9e18edc71a6df30ac3aca2e0b02a1dbb197480a63d71b
zh_cn: Bash+ Starkli 呼叫 0x05ea3a690be71c7fd83945517f82e8861a97d42fca8ec9a2c46831d11f33349 选民_can_vote 0x03ee9e18edc71a6df30ac3aca2e0b02a1998fcce197480a63a0d71cd76652e0 -rpc http://0.00.0.0:50

source: First we added the address of the contract, then the function we want to call, and finally the input for the function. In this case, we are checking whether the voter at the address `0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0` can vote.
es: Primero añadimos la dirección del contrato, luego la función que queremos llamar, y finalmente la entrada para la función. En este caso, estamos comprobando si el votante en la dirección `0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0` puede votar.
fr: Nous avons d'abord ajouté l'adresse du contrat, puis la fonction que nous voulons appeler, et enfin l'entrée pour la fonction. Dans ce cas, nous vérifions si l'électeur à l'adresse `0x03ee9e18eedc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0` peut voter.
id: Pertama kami menambahkan alamat kontrak, lalu fungsi yang ingin kami hubungi, dan akhirnya masukan untuk fungsinya. dalam kasus ini, kami sedang memeriksa apakah pemilih di alamat 0x03e9e18edca71a11ac3aca2E0b02a98bce19480a63a011Cd76652.0E0
tr: Önce sözleşmenin adresini, daha sonra aramak istediğimiz işlevi ve son olarak fonksiyonun girdisini ekledik. Bu durumda, 0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0 adresindeki seçmenin oy kullanıp kullanmadığını kontrol ediyoruz.
zh_cn: 首先我们添加了合同的地址, 然后我们想要调用的函数, 最后是该函数的输入。 在这种情况下, 我们正在检查“ 0x03ee9e18edc716df30ac3ca2e02a198fce197480a63a0d71cd76652e0” 的选民是否可以投票。

source: Since we provided a registered voter address as an input, the result is 1 (boolean true), indicating the voter is eligible to vote.
es: Dado que proporcionamos una dirección de votante registrada como entrada, el resultado es 1 (verdadero booleano), indicando que el votante es elegible para votar.
fr: Puisque nous avons fourni une adresse d'électeur inscrit à titre d'entrée, le résultat est 1 (booléen vrai), indiquant que l'électeur est admissible au vote.
id: Karena kami memberikan alamat pemilih terdaftar sebagai masukan, hasilnya adalah 1 (kebenaran boolean), menunjukkan pemilih berhak untuk memilih.
tr: Girdi olarak kayıtlı bir seçmen adresi sağladığımızdan, sonuç 1 (boolean true), seçmenin oy kullanmaya uygun olduğunu gösterir.
zh_cn: 由于我们提供了登记选民的地址作为投入,结果为1(绝对真实),表明选民有资格投票。

source: Next, let's call the `is_voter_registered` function using an unregistered account address to observe the output:
es: A continuación, llamemos a la función `is_voter_registered` usando una dirección de cuenta no registrada para observar la salida:
fr: Ensuite, appelons la fonction `is_voter_registred` en utilisant une adresse de compte non enregistrée pour observer la sortie :
id: Selanjutnya, mari kita sebut fungsi ▪is_voter_listed_register menggunakan alamat akun tidak terdaftar untuk mengamati keluaran:
tr: Ardından, çıktıyı gözlemlemek için is_voter_registered fonksiyonunu kayıtsız bir hesap adresi kullanarak çağıralım:
zh_cn: 接下来,让我们使用一个未注册的账户地址,将“is_voter_注册”功能称为“is_votter_注册”功能,以观察产出:

source: With an unregistered account address, the terminal output is 0 (i.e., false), confirming that the account is not eligible to vote.
es: Con una dirección de cuenta no registrada, la salida del terminal es 0 (es decir, falsa), confirmando que la cuenta no es elegible para votar.
fr: Avec une adresse de compte non enregistrée, la sortie du terminal est 0 (c.-à-d. faux), confirmant que le compte n'est pas admissible au vote.
id: Dengan alamat akun yang tidak terdaftar, keluaran terminal adalah 0 (misal, false), mengkonfirmasi bahwa akun tidak memenuhi syarat untuk memilih.
tr: Kayıtsız bir hesap adresi ile, terminal çıktısı 0 (yani yanlış), hesabın oy vermeye uygun olmadığını onaylar.
zh_cn: 有未注册的账户地址,终端输出为0(即虚假),确认账户没有资格投票。

source: Casting a Vote
es: Lanzar un voto
fr: La présentation d'un vote
id: Casting Voting
tr: Oy Vermek
zh_cn: 投 票 投 票

source: Now that we have established how to verify voter eligibility, we can vote! To vote, we interact with the `vote` function, which is flagged as external, necessitating the use of the `starknet invoke` command.
es: Ahora que hemos establecido cómo verificar la elegibilidad de los votantes, ¡podemos votar! Para votar, interactuamos con la función `voto`, que está marcada como externa, necesitando el uso del comando `starknet invoque '.
fr: Maintenant que nous avons établi comment vérifier l'éligibilité des électeurs, nous pouvons voter! Pour voter, nous interagissons avec la fonction `vote`, qui est indiquée comme externe, nécessitant l'utilisation de la commande `starknet invoquer`.
id: Sekarang kita telah menetapkan bagaimana untuk memverifikasi keikutsertaan pemilih, kita dapat memilih! untuk memilih, kita berinteraksi dengan fungsi åvoteó, yang ditandai sebagai eksternal, yang mengharuskan penggunaan perintah åstarknet.
tr: Artık seçmen uygunluğunun nasıl doğrulanacağını belirlediğimize göre, oy verebiliriz! Oy vermek için, starknet çağrısı komutunun kullanımını zorunlu kılan dışsal olarak işaretlenen vote fonksiyonu ile etkileşimde bulunuyoruz.
zh_cn: 现在,我们已经确定了如何核查选民资格,我们可以投票了!为了投票,我们与“投票”功能互动,该功能被标为外部功能,需要使用“星网援引”命令。

source: The `invoke` command syntax resembles the `call` command, but for voting, we submit either `1` (for Yes) or `0` (for No) as our input. When we invoke the `vote` function, we are charged a fee, and the transaction must be signed by the voter; we are writing to the contract's storage.
es: La sintaxis de comando `invoke` se asemeja al comando `call`, pero para votar, enviamos `1` (para Sí) o `0` (para No) como nuestra entrada. Cuando invocamos la función `voto`, se nos cobra una tarifa, y la transacción debe ser firmada por el votante; estamos escribiendo al almacenamiento del contrato.
fr: La syntaxe de commande `invoce` ressemble à la commande `appel`, mais pour le vote, nous soumettons `1` (pour Oui) ou `0` (pour Non) comme notre entrée. Lorsque nous invoquons la fonction `vote`, nous sommes facturés, et la transaction doit être signée par l'électeur; nous écrivons au stockage du contrat.
id: Sintaks perintah ini mirip dengan perintah, tetapi untuk memilih, kita harus menandatanganinya, atau untuk Ya, atau untuk No (untuk No) sebagai masukan kita.
tr: invoke komut sözdizimi call komutunu andırır, ancak oylama için, girdimiz olarak 1 (Evet için) veya 0 (Hayır için) göndeririz. vote işlevini çağırdığımızda, bir ücret alınır ve işlem seçmen tarafından imzalanmalıdır; sözleşmenin deposuna yazıyoruz.
zh_cn: `voke' 命令语法类似于`呼叫'命令,但在投票时,我们要么将`1'(是),要么将`0'(否)作为我们的投入,当我们援引`投票'功能时,我们收取费用,交易必须由选民签字;我们正在写到合同的储存处。

source: You will be prompted to enter the password for the signer. Once you enter the password, the transaction will be signed and submitted to the Starknet network. You will receive the transaction hash as output. With the starkli transaction command, you can get more details about the transaction:
es: Se le pedirá que introduzca la contraseña para el firmante. Una vez que introduzca la contraseña, la transacción será firmada y enviada a la red Starknet. Recibirá el hash de transacción como salida. Con el comando de transacción Starkli, podrá obtener más detalles sobre la transacción:
fr: Vous serez invité à saisir le mot de passe du signataire. Une fois que vous aurez saisi le mot de passe, la transaction sera signée et soumise au réseau Starknet. Vous recevrez le hash de transaction en sortie. Avec la commande de transaction Starkli, vous pouvez obtenir plus de détails sur la transaction :
id: Anda akan diminta untuk memasukkan sandi untuk penandatangan. Setelah Anda memasukkan sandi, transaksi akan ditandatangani dan diserahkan ke jaringan Starknet. Anda akan menerima hash transaksi sebagai keluaran. Dengan perintah transaksi starkli, Anda dapat mendapatkan rincian lebih lanjut tentang transaksi:
tr: İmzalayan kişinin şifresini girmeniz istenecektir. Şifreyi girdikten sonra işlem imzalanacak ve Starknet ağına gönderilecektir. İşlem hash'ini çıktı olarak alacaksınız. Starkli işlem komutu ile işlem hakkında daha fazla bilgi alabilirsiniz:
zh_cn: 您将被提示输入签名者的密码。 一旦您输入了密码, 交易将被签名并提交给 Starknet 网络。 您将接收作为输出的交易散列。 使用 strarkli 交易命令, 您可以得到关于交易的更多细节 :

source: This returns:
es: Esto devuelve:
fr: Ceci retourne :
id: Kembalinya:
tr: Bu döner:
zh_cn: 此返回 :

source: "transaction_hash"
tr: "transaction_hash" (İngilizce).
zh_cn: "交易 -hash" "交易 -hash"

source: "0x5604a97922b6811060e70ed0b40959ea9e20c726220b526ec690de8923907fd"
id: "0x5604a972b6811060e70ed0b40959ea9E20c7220b526ec690de89907fd"
tr: "0x5604a9792b6811060e70ed0b40959ea9e20c726220b526ec690de8923907fd"
zh_cn: “05604a9792b6811060e70ed0b40959ea9e20ee726220b526ec690de8923907fd”

source: "max_fee"
zh_cn: "麻牛'''''''"

source: "0x430e81"
zh_cn: "0x430e81" "0x430e81"

source: "0x1"
zh_cn: “ 0x11”

source: "signature"
es: "Firma"
tr: "imza"
zh_cn: "签名"

source: "0x75e5e4880d7a8301b35ff4a1ed1e3d72fffefa64bb6c306c314496e6e402d57"
id: "0x75e5e4880d7a8301b35ff4a1ed1E3d72fffefa64b6c306c31496e6e402d57"
tr: "0x75e5e4880d7a8301b35ff4a1ed1e3d72ffefa64bb6c306c314496e6e402d57"
zh_cn: "0x75e548e4880d7a8301b35ff4a1ed1e3d72fffefa64b6c306c334496e6e402d57"

source: "0xbb6c459b395a535dcd00d8ab13d7ed71273da4a8e9c1f4afe9b9f4254a6f51"
id: "0xbbb6c459b35a535dd00d8ab13d7ed71273da4a8e9c1f4afe9b9b9f5454A6F51"
zh_cn: “0xbb6c459b395b35ddd00d8ab13d7ed71273da4a8e9c1f4afe9b9f4254a6f51”

source: "nonce"
es: "Ninguna vez"
fr: "rien"
tr: "Saçmalama"
zh_cn: "单"

source: "0x3"
zh_cn: "0x3" (0x3)

source: "INVOKE"
fr: "ENVOYEZ"
zh_cn: "在电影中"

source: "sender_address"
es: «sender_adress»
fr: "adresse de l'enfant"
id: "Sender_alamat"
tr: "sender_adres"
zh_cn: "发件人地址"

source: "0x3ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0"
id: "0x3ee9e18edc71a6df30ac3aca2e0b02a198fce19b7480a63a0d71cbd76652e0"
zh_cn: "0x3ee9e18edc71a6df30ac3aca2e0b02a198fce19b7480a63a0d71cd76652e0"

source: "calldata"
zh_cn: "呼叫数据"

source: "0x5ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349"
fr: "0x5ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f3349"
id: "0x5ea3a3a690menjadi71c7fcd83945517f81f8188111111113349"
zh_cn: "0x5ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2468331d11f3349"

source: "0x132bdf85fc8aa10ac3c22f02317f8f53d4b4f52235ed1eabb3a4cbbe08b5c41"
es: "0x132bdf85fc8a10ac3c22f02317f8f53d4b4f52235ed1eabb3a4cbbe08b5c41"
zh_cn: “0.132bdf85fc8aa10aa10ac3c22f022317f8f53d4b4f52235e1eabb3a4cbb08b5c41”

source: "0x0"
zh_cn: "0x0" (0x0)

source: If you try to vote twice with the same signer you will get an error:
es: Si intentas votar dos veces con el mismo firmante, recibirás un error:
fr: Si vous essayez de voter deux fois avec le même signataire, vous obtiendrez une erreur:
id: Jika Anda mencoba untuk memilih dua kali dengan penandatangan yang sama Anda akan mendapatkan kesalahan:
tr: Aynı imzalayıcı ile iki kez oy vermeye çalışırsanız bir hata alırsınız:
zh_cn: 如果您试图用同一个签名人两次投票, 将会有错误 :

source: "Contract error"
es: "Error de contratación"
fr: "Erreur de contrat"
id: "Kesalahan Kontract"
tr: "Tartışma hatası"
zh_cn: “合同错误”

source: The error is not very informative, but you can get more details when looking at the output in the terminal where you started `katana` (our local Starknet node):
es: El error no es muy informativo, pero puede obtener más detalles al mirar la salida en la terminal donde se inició `katana` (nuestro nodo local Starknet):
fr: L'erreur n'est pas très informative, mais vous pouvez obtenir plus de détails lorsque vous regardez la sortie dans le terminal où vous avez commencé `katana` (notre noeud local Starknet):
id: Kesalahan tidak terlalu informatif, tetapi Anda bisa mendapatkan lebih banyak rincian ketika melihat keluaran di terminal di mana Anda mulai ·katana-- (node Starknet lokal kami):
tr: Hata çok bilgilendirici değildir, ancak katana (yerel Starknet düğümümüz) başlattığınız terminaldeki çıktıya bakarken daha fazla ayrıntı alabilirsiniz:
zh_cn: 错误信息不甚丰富, 但是在您开始“ 卡塔纳” (我们本地的 Starknet 节点) 的终端中查看输出时, 您可以获得更多的细节 :

source: "Error in the called contract (0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0): Error at pc=0:81: Got an exception while executing a hint: Custom Hint Error: Execution failed. Failure reason: \"USER_ALREADY_VOTED\". ...
es: "Error en el contrato llamado (0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0): Error en pc=0:81: Obtuvo una excepción al ejecutar una pista: Error de pista personalizada: La ejecución falló. Razón de fallo: \"USER_ALREADY_VOTED\"....
fr: "Erreur dans le contrat appelé (0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0): Erreur à pc=0:81: J'ai une exception lors de l'exécution d'un indice: Astuce personnalisée Erreur: L'exécution a échoué. Raison de la défaillance: \"USER_ALREADY_VOTED\"....
id: "Error dalam kontrak yang disebut (0x03ee9e18edc71a6df30ac3aca2a0a02a98fce19b74480a63a0d71cd76652e0): Error di pc=0:81: Mendapat pengecualian saat mengeksekusi sebuah petunjuk: Custom Hint Error: Eksekusi gagal. Alasan gagal: "USER_ALREADY_VOWTED\"...
tr: "Söz konusu sözleşmede hata (0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0): PC'de hata=0d71cbd76652e0: Bir ipucu çalıştırırken bir istisna var: Özel İpucu Hatası: Yürütme başarısız oldu. Arıza nedeni: "USER_ALREADY_VOTED".
zh_cn: “在所谓的合同中错误(0x03ee9e18edc71a6df30ac3ca2e0b02a1998fcce19b7480a63a0d71cd76652e0): pc=0.81:在执行提示时有一个例外: 自定义提示错误: 执行失败。 失败原因 :\ "USER_ ALREADY_ VOTED\"...

source: The key for the error is `USER_ALREADY_VOTED`.
es: La clave para el error es `USER_ALREADY_VOTED`.
fr: La clé de l'erreur est `USER_ALREADY_VOTED`.
id: Kunci untuk kesalahan ini adalah ÁUSER_ALREADY_VOTEDER.
tr: Hatanın anahtarı USER_ALREADY_VOTED'dir.
zh_cn: 错误的密钥是`USER_ALREADY_VOTED'。

source: We can repeat the process to create Signers and Account Descriptors for the accounts we want to use for voting. Remember that each Signer must be created from a private key, and each Account Descriptor must be created from a public key, a smart wallet address, and the smart wallet class hash (which is the same for each voter).
es: Podemos repetir el proceso para crear Signatarios y Descriptores de Cuenta para las cuentas que queremos usar para votar. Recuerde que cada Signatario debe ser creado a partir de una clave privada, y cada Descriptor de Cuenta debe ser creado a partir de una clave pública, una dirección de cartera inteligente, y la clase de hash de cartera inteligente (que es lo mismo para cada votante).
fr: Nous pouvons répéter le processus pour créer Signers et Descripteurs de compte pour les comptes que nous voulons utiliser pour voter. Rappelez-vous que chaque Signer doit être créé à partir d'une clé privée, et chaque Descripteur de compte doit être créé à partir d'une clé publique, une adresse de portefeuille intelligente, et le hash de classe de portefeuille intelligent (qui est le même pour chaque électeur).
id: Kita dapat mengulangi proses untuk membuat penanda dan deskripsi akun untuk akun yang ingin kita gunakan untuk memilih. ingatlah bahwa setiap Penandatangan harus dibuat dari kunci pribadi, dan setiap Descriptor Akun harus dibuat dari kunci publik, alamat dompet pintar, dan hash dompet pintar (yang sama untuk setiap pemilih).
tr: Oy vermek için kullanmak istediğimiz hesaplar için Signers ve Account Descriptors oluşturmak için işlemi tekrarlayabiliriz. Her Signer'ın özel bir anahtardan oluşturulması gerektiğini ve her Account Descriptor'un açık bir anahtardan, akıllı bir cüzdan adresinden ve akıllı cüzdan sınıfı hash'ten (her seçmen için aynı) oluşturulması gerektiğini unutmayın.
zh_cn: 我们可以重复为我们要用于投票的账户创建签名人和账户描述符的程序 。 记住每个签名人必须用私人密钥创建,每个账户描述符必须用公共密钥、智能钱包地址和智能钱包类散列(每个选民都一样 ) 创建。

source: Visualizing Vote Outcomes
es: Visualización de los resultados del voto
fr: Visualisation des résultats du crédit
id: Visualizing Voting Outcomes
tr: Oy Sonuçlarını Görselleştirme
zh_cn: 将投票结果可视化

source: To examine the voting results, we invoke the `get_vote_status` function, another view function, through the `starknet call` command.
es: Para examinar los resultados de la votación, invocamos la función `get_vote_status`, otra función de vista, a través del comando `starknet call`.
fr: Pour examiner les résultats du vote, nous invoquons la fonction `get_vote_status`, une autre fonction de vue, par la commande `starknet call`.
id: Untuk memeriksa hasil pemungutan suara, kami meminta perintah åget_vote_status_status, fungsi tampilan lain, melalui panggilan åstarknet.
tr: Oylama sonuçlarını incelemek için, starknet call komutu aracılığıyla başka bir görünüm fonksiyonu olan get_vote_status işlevini çağırıyoruz.
zh_cn: 为了审查投票结果,我们通过“星网呼叫”命令,援引“获得选票”的功能,即另一种视图功能。

source: The output reveals the tally of "Yes" and "No" votes along with their relative percentages.
es: La salida revela el recuento de los votos "Sí" y "No" junto con sus porcentajes relativos.
fr: La sortie révèle le nombre de votes "Oui" et "Non" ainsi que leurs pourcentages relatifs.
id: Hasil mengungkapkan perhitungan "Ya" dan "Tidak" suara bersama dengan persentase relatif mereka.
tr: Çıktı, göreli yüzdeleriyle birlikte "Evet" ve "Hayır" oylarının sayısını ortaya koyuyor.
zh_cn: 产出显示了“是”和“否”的票数及其相对百分比。

source: When developing software, ensuring it functions as intended is usually straightforward. However, preventing unintended usage and vulnerabilities can be more challenging.
es: Al desarrollar software, asegurar que funcione como se pretende es generalmente sencillo. Sin embargo, prevenir el uso no deseado y vulnerabilidades puede ser más difícil.
fr: Lors du développement de logiciels, s'assurer qu'il fonctionne comme prévu est généralement simple. Cependant, prévenir l'utilisation involontaire et les vulnérabilités peut être plus difficile.
id: Namun, mencegah penggunaan dan kerentanan yang tidak disengaja dapat lebih menantang.
tr: Yazılım geliştirirken, amaçlandığı gibi çalışmasını sağlamak genellikle basittir. Bununla birlikte, istenmeyen kullanımın ve güvenlik açıklarının önlenmesi daha zor olabilir.
zh_cn: 在开发软件时,确保软件按预期运行通常是直截了当的,但防止意外使用和脆弱性可能更具挑战性。

source: In smart contract development, security is very important. A single error can result in the loss of valuable assets or the improper functioning of certain features.
es: En el desarrollo de contratos inteligentes, la seguridad es muy importante. Un solo error puede resultar en la pérdida de activos valiosos o el funcionamiento inadecuado de ciertas características.
fr: Dans le développement de contrats intelligents, la sécurité est très importante. Une seule erreur peut entraîner la perte d'actifs précieux ou le mauvais fonctionnement de certaines fonctionnalités.
id: Dalam pengembangan kontrak yang cerdas, keamanan sangat penting. sebuah kesalahan tunggal dapat mengakibatkan hilangnya aset berharga atau fungsi yang tidak patut dari fitur-fitur tertentu.
tr: Akıllı sözleşme geliştirmede güvenlik çok önemlidir. Tek bir hata değerli varlıkların kaybına veya belirli özelliklerin yanlış çalışmasına neden olabilir.
zh_cn: 在智能合同开发中,担保非常重要,单一错误可能导致有价值的资产损失或某些特征的不当运作。

source: Smart contracts are executed in a public environment where anyone can examine the code and interact with it. Any errors or vulnerabilities in the code can be exploited by malicious actors.
es: Los contratos inteligentes se ejecutan en un entorno público donde cualquiera puede examinar el código e interactuar con él. Cualquier error o vulnerabilidad en el código puede ser explotado por actores maliciosos.
fr: Les contrats intelligents sont exécutés dans un environnement public où tout le monde peut examiner le code et interagir avec celui-ci. Toute erreur ou vulnérabilité dans le code peut être exploitée par des acteurs malveillants.
id: Kontrak cerdas dijalankan dalam lingkungan publik di mana siapa pun dapat memeriksa kode dan berinteraksi dengan itu. setiap kesalahan atau kerentanan dalam kode dapat dieksploitasi oleh aktor jahat.
tr: Akıllı sözleşmeler, herkesin kodu inceleyebileceği ve onunla etkileşime girebileceği bir kamu ortamında yürütülür. Koddaki herhangi bir hata veya güvenlik açıkları kötü niyetli aktörler tarafından istismar edilebilir.
zh_cn: 智能合同在公众环境中执行,任何人都可以检查代码并与代码互动,守则中的任何错误或弱点都可以被恶意行为者利用。

source: This chapter presents general recommendations for writing secure smart contracts. By incorporating these concepts during development, you can create robust and reliable smart contracts. This reduces the chance of unexpected behavior or vulnerabilities.
es: Este capítulo presenta recomendaciones generales para escribir contratos inteligentes seguros. Al incorporar estos conceptos durante el desarrollo, puede crear contratos inteligentes robustos y confiables. Esto reduce la posibilidad de comportamiento inesperado o vulnerabilidades.
fr: Ce chapitre présente des recommandations générales pour l'écriture de contrats intelligents sécurisés. En intégrant ces concepts pendant le développement, vous pouvez créer des contrats intelligents robustes et fiables.
id: Bab ini menyajikan rekomendasi umum untuk menulis kontrak cerdas yang aman. Anda dapat menciptakan kontrak cerdas yang kuat dan dapat diandalkan. ini mengurangi kemungkinan perilaku yang tak terduga atau kerentanan.
tr: Bu bölüm, güvenli akıllı sözleşmeler yazmak için genel öneriler sunar. Geliştirme sırasında bu kavramları birleştirerek, sağlam ve güvenilir akıllı sözleşmeler oluşturabilirsiniz. Bu, beklenmedik davranış veya güvenlik açıklarının olasılığını azaltır.
zh_cn: 本章提出起草安全智能合同的一般性建议,通过在开发过程中纳入这些概念,您可以创建强有力和可靠的智能合同,从而减少出现意外行为或脆弱性的可能性。

source: Disclaimer
es: Descargo de responsabilidad
fr: Avertissement
id: Disklaimer
tr: Feragatname
zh_cn: 免责声明者

source: This chapter does not provide an exhaustive list of all possible security issues, and it does not guarantee that your contracts will be completely secure.
es: Este capítulo no proporciona una lista exhaustiva de todas las posibles cuestiones de seguridad, y no garantiza que sus contratos sean completamente seguros.
fr: Ce chapitre ne fournit pas une liste exhaustive de tous les problèmes de sécurité possibles, et il ne garantit pas que vos contrats seront complètement sécurisés.
id: Pasal ini tidak menyediakan daftar lengkap dari semua kemungkinan masalah keamanan, dan tidak menjamin bahwa kontrak Anda akan benar - benar aman.
tr: Bu bölüm, olası tüm güvenlik sorunlarının kapsamlı bir listesini sağlamaz ve sözleşmelerinizin tamamen güvenli olacağını garanti etmez.
zh_cn: 本章没有详尽无遗地列出所有可能的安全问题,也不保证你们的合同将完全安全。
