Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: When `A` goes out of scope, it can't be dropped as it implements neither the `Drop` (as it contains a dictionary and can't `derive(Drop)`) nor the `Destruct` trait. To fix this, we can derive the `Destruct` trait implementation for the `A` type:
es: Cuando `A` sale del ámbito de aplicación, no puede eliminarse ya que no aplica ni el `Drop` (ya que contiene un diccionario y no puede `derive(Drop)`) ni el rasgo `Destruct`. Para solucionarlo, podemos derivar la aplicación del rasgo `Destruct` para el tipo `A`:
fr: Lorsque `A` est hors de portée, il ne peut pas être abandonné car il n'implémente ni le `Drop` (car il contient un dictionnaire et ne peut pas `derive(Drop)`) ni le caractère `Destruct`. Pour corriger cela, nous pouvons dériver l'implémentation de caractère `Destruct` pour le type `A`:
id: Ketika ia keluar dari ruang lingkup, ia tidak dapat dijatuhkan karena ia tidak mengimplementasikannya baik karena ia berisi kamus dan tidak dapat Éderive (proprop) maupun sifat yang terdestruksi. Untuk memperbaiki hal ini, kita dapat mendapatkan implementasi sifat yang didestruksikan untuk tipe ▪A TM:
tr: A kapsam dışına çıktığında, ne Drop (bir sözlük içerdiği ve derive(Drop)) ne de Destruct özelliğini uyguladığı için bırakılamaz. Bunu düzeltmek için, A tipi için Destruct özellik uygulamasını türetebiliriz:
zh_cn: 当`A'超出范围时,它不能被丢弃,因为它既执行`Drop'(因为它既包含字典,也不能`Drop' ),也没有`Derive(Drop)'特性。

source: // No error here
es: // No hay error aquí
fr: // Aucune erreur ici
tr: // Burada hata yok
zh_cn: // 这里没有错误

source: Now, when `A` goes out of scope, its dictionary will be automatically `squashed`, and the program will compile.
es: Ahora, cuando `A` se sale del alcance, su diccionario será automáticamente `squashed`, y el programa se compilará.
fr: Maintenant, quand `A` est hors de portée, son dictionnaire sera automatiquement `squashed`, et le programme sera compilé.
id: Sekarang, ketika A keluar dari ruang lingkup, kamusnya akan otomatis berkubang, dan program ini akan dikompilasi.
tr: Şimdi, A kapsam dışına çıktığında, sözlüğü otomatik olarak squashed olacak ve program derlenecektir.
zh_cn: 现在,当`A'超出范围时,其词典将自动`被压碎 ',程序将加以汇编。

source: Copy Array Data with `clone`
es: Copiar datos de matriz con `clone`
fr: Copier les données d'array avec `clone`
id: Salin Data Array dengan Áclone
tr: Dizi Verilerini clone ile Kopyala
zh_cn: 复制有“ clone” 的阵列数据

source: If we _do_ want to deeply copy the data of an `Array`, we can use a common method called `clone`. We’ll discuss method syntax in a dedicated section in [Chapter 5](./ch05-03-method-syntax.md), but because methods are a common feature in many programming languages, you’ve probably seen them before.
es: Si _do_ queremos copiar profundamente los datos de un `Array`, podemos utilizar un método común llamado `clone`. Vamos a discutir la sintaxis del método en una sección dedicada en [Capítulo 5](./ch05-03-method-syntax.md), pero debido a que los métodos son una característica común en muchos lenguajes de programación, es probable que los haya visto antes.
fr: Si nous _do_ voulons copier profondément les données d'un `Array`, nous pouvons utiliser une méthode commune appelée `clone`. Nous allons discuter de la syntaxe des méthodes dans une section dédiée dans [Chapitre 5](./ch05-03-method-syntax.md), mais parce que les méthodes sont une fonctionnalité commune dans de nombreux langages de programmation, vous les avez probablement vus auparavant.
id: Jika kita ingin benar-benar menyalin data dari sebuah array, kita dapat menggunakan metode umum yang disebut ·clonenene. kita akan membahas metode sintaks dalam bagian yang didedikasikan di [Chapter 5] Allah. /ch05-method-syntax.md), tetapi karena metode adalah fitur umum dalam banyak bahasa pemrograman, Anda mungkin pernah melihatnya sebelumnya.
tr: Bir Array'nin verilerini derinden kopyalamak istiyorsak, clone adlı ortak bir yöntem kullanabiliriz. [Bölüm 5](./ch05-03-method-syntax.md) 'deki özel bir bölümde yöntem sözdizimi tartışacağız, ancak yöntemler birçok programlama dilinde yaygın bir özellik olduğundan, muhtemelen bunları daha önce görmüşsünüzdür.
zh_cn: 如果我们想深入复制`Array' 的数据,我们可以使用一种称为`crone'的共同方法。我们将在[第5章](./ch05-03-method-syngy.md)的一个专门章节中讨论方法语法,但由于方法在许多编程语言中是一个共同特点,你可能已经见过了。

source: Here’s an example of the `clone` method in action.
es: He aquí un ejemplo del método `clone` en acción.
fr: Voici un exemple de la méthode "clone" en action.
id: Berikut ini adalah contoh metode åclone dalam tindakan.
tr: İşte eylemde clone yönteminin bir örneği.
zh_cn: 以下是`核心'行动方法的例子。

source: When you see a call to `clone`, you know that some arbitrary code is being executed and that code may be expensive. It’s a visual indicator that something different is going on. In this case, the _value_ `arr1` refers to is being copied, resulting in new memory cells being used, and a new _variable_ `arr2` is created, referring to the new copied value.
es: Cuando ves una llamada a `clone`, sabes que se está ejecutando algún código arbitrario y que el código puede ser caro. Es un indicador visual de que algo diferente está sucediendo. En este caso, el _value_ `arr1` se refiere a que se está copiando, resultando en el uso de nuevas celdas de memoria, y se crea un nuevo _variable_ `arr2`, refiriéndose al nuevo valor copiado.
fr: Lorsque vous voyez un appel à `clone`, vous savez que certains codes arbitraires sont en cours d'exécution et que ce code peut être coûteux. C'est un indicateur visuel que quelque chose de différent se passe. Dans ce cas, la _value_ `arr1` se réfère à est copiée, ce qui entraîne l'utilisation de nouvelles cellules de mémoire, et une nouvelle _variable_ `arr2` est créée, se référant à la nouvelle valeur copiée.
id: Ketika Anda melihat panggilan ke åclone, Anda tahu bahwa beberapa kode sewenang-wenang sedang dijalankan dan kode tersebut mungkin mahal. Ini indikator visual yang berbeda yang sedang terjadi. Dalam hal ini, _value_ ·arr1; yang mengacu pada salinan, sehingga sel memori baru digunakan, dan _variable_ ·ar2 yang baru dibuat, mengacu pada nilai salinan baru.
tr: clone çağrısını gördüğünüzde, bazı keyfi kodların çalıştırıldığını ve bu kodun pahalı olabileceğini bilirsiniz. Bu, farklı bir şeyin devam ettiğini gösteren görsel bir göstergedir. Bu durumda, _value_ arr1, yeni bellek hücrelerinin kullanılmasıyla sonuçlanan kopyalanıyor ve yeni kopyalanan değere atıfta bulunan yeni bir _variable_ arr2 yaratılıyor.
zh_cn: 当您看到“ 密钥” 的呼叫时, 您知道正在执行某些任意代码, 该代码可能非常昂贵。 这是一个不同事物正在发生的视觉指标 。 在此情况下, 正在复制 ` rr1'指的值, 导致使用新的内存单元格, 并创建了一个新的“ 可变” “ rr2”, 指新的复制值 。

source: Return Values and Scope
es: Valores de retorno y alcance
fr: Valeurs de retour et portée
id: Nilai Kembali dan Cakupan
tr: Dönüş Değerleri ve Kapsamı
zh_cn: 价值和回报范围

source: Returning values is equivalent to _moving_ them. Listing 4-2 shows an example of a function that returns some value, with similar annotations as those in Listing 4-1.
es: El listado 4-2 muestra un ejemplo de una función que devuelve algún valor, con anotaciones similares a las del listado 4-1.
fr: Les valeurs de retour sont équivalentes à _moving_ them. Listing 4-2 montre un exemple de fonction qui renvoie une certaine valeur, avec des annotations similaires à celles de Listing 4-1.
id: Mengembalikan nilai setara dengan memindahkan _mereka. Mendaftarkan 4-2 menampilkan sebuah contoh dari sebuah fungsi yang mengembalikan beberapa nilai, dengan notasi serupa seperti yang ada dalam Daftar 4-1.
tr: Geri dönen değerler, _hareket eden_'ye eşittir. 4-2'yi listelemek, Listeleme 4-1'dekilere benzer açıklamalarla, bir değer döndüren bir fonksiyonun örneğini gösterir.
zh_cn: 返回值相当于_move_它们。列表 4-2 显示一个函数返回某种值的例子,其注释与列表 4-1 中的注释相似。

source: // gives_ownership moves its return // value into a1
es: // gives_ownership mueve su valor de retorno // a1
fr: // donne_propriété déplace son retour // valeur dans a1
tr: // gives_ ownership return // değerini a1'e taşır
zh_cn: / 给予_ 所有权将其返回 // 值移动到 a1

source: // a2 comes into scope
es: // a2 entra en el ámbito de aplicación
fr: // a2 entre dans le champ d'application
id: //a2 masuk ke dalam lingkup
tr: // a2 kapsamına girer
zh_cn: / a2 进入范围

source: // a2 is moved into // takes_and_gives_back, which also // moves its return value into a3
es: // a2 se mueve a // takes_and_gives_back, que también // mueve su valor de retorno a a3
fr: // a2 est déplacé dans // takes_and_gives_back, qui aussi // déplace sa valeur de retour dans a3
tr: // a2 içine taşınır // takes_and_gives_back, ayrıca // dönüş değerini a3'e taşır
zh_cn: / / a2 被移动到 / 采取_ 和_ gives_ back, 并且 / 将返回值移动到 a3

source: // Here, a3 goes out of scope and is dropped. a2 was moved, so nothing // happens. a1 goes out of scope and is dropped.
es: // Aquí, a3 sale fuera de alcance y se cae. a2 fue movido, así que nada // sucede. a1 sale fuera de alcance y se cae.
fr: // Ici, a3 sort du champ d'application et est abandonné. a2 a été déplacé, donc rien // ne se passe. a1 sort du champ d'application et est abandonné.
id: # # Here, a3 goes out of scope and is dropped. a2 was moved, so nothing /// happens. a1 goes out of scope and is dropp.
tr: // Burada, a3 kapsam dışına çıkar ve bırakılır. a2 taşındı, yani hiçbir şey // olmuyor. a1 kapsam dışına çıkar ve düşer.
zh_cn: 这里, a3 超出范围, 被丢弃。 a2 被移走, 所以没有发生 。 a1 脱离范围, 被丢弃 。

source: // gives_ownership will move its // return value into the function // that calls it
es: // gives_ownership moverá su valor // devuelto a la función // que lo llama
fr: // donne_ownership déplacera sa valeur // retour dans la fonction // qui l'appelle
id: // gives_ownership akan memindahkan nilai//kembalinya ke dalam fungsi // yang menyebutnya
tr: // giving_ownership // return değerini // onu çağıran fonksiyona taşıyacaktır.
zh_cn: / 给予_ 所有权将将其 // 返回值移动到函数 / 调用它的函数 / 返回值

source: // some_a comes into scope
es: // some_a entra en el ámbito de aplicación
fr: // some_a entre dans le champ d'application
tr: // bazı_a kapsamına girer
zh_cn: / 某些_a 进入范围

source: // some_a is returned and // moves ownership to the calling // function
es: // some_a es devuelto y // mueve la propiedad a la función llamada //
fr: // some_a est retourné et // déplace la propriété vers la fonction appelante //
id: /// some_a dikembalikan dan //pindahkan kepemilikan ke panggilan // fungsi
tr: // some_a döndürülür ve // sahipliği çağrıya taşır // fonksiyon
zh_cn: / some_a 被返回, // 将所有权移动到调用 // 函数

source: // This function takes an instance some_a of A and returns it
es: // Esta función toma una instancia some_a de A y la devuelve
fr: // Cette fonction prend une instance some_a de A et la renvoie
id: # # This function takes an instance some_a of A and return it
tr: // Bu fonksiyon A'nın bir kısmını alır ve onu döndürür
zh_cn: / 此函数使用 A 的 some_a 实例返回它

source: // some_a is returned and // moves ownership to the calling // function
es: // some_a es devuelto y // mueve la propiedad a la función llamada //
fr: // some_a est retourné et // déplace la propriété vers la fonction appelante //
id: /// some_a dikembalikan dan //pindahkan kepemilikan ke panggilan // fungsi
tr: // some_a döndürülür ve // sahipliği çağrıya taşır // fonksiyon
zh_cn: / some_a 被返回, // 将所有权移动到调用 // 函数

source: <span class="caption">Listing 4-2: Moving return values</span>
es: <span class="caption">Lista 4-2: Mover valores de retorno</span>
fr: <span class="caption">Liste 4-2: Valeurs de retour en mouvement</span>
id: <span class="caption">Listing 4-2: Memindahkan nilai pengembalian</span>
tr: span class="caption">Liste 4-2: Geri dönüş değerlerinin taşınması/span>
zh_cn: <span类="Caption" > listing 4-2: 移动返回值 </span>

source: While this works, moving into and out of every function is a bit tedious. What if we want to let a function use a value but not move the value? It’s quite annoying that anything we pass in also needs to be passed back if we want to use it again, in addition to any data resulting from the body of the function that we might want to return as well.
es: Mientras que esto funciona, entrar y salir de cada función es un poco tedioso. ¿Qué pasa si queremos dejar que una función utilice un valor pero no mover el valor? Es bastante molesto que cualquier cosa que pase en también necesita ser pasado de nuevo si queremos usarlo de nuevo, además de cualquier dato resultante del cuerpo de la función que podríamos querer volver también.
fr: Alors que cela fonctionne, se déplacer dans et hors de chaque fonction est un peu fastidieux. Et si nous voulons laisser une fonction utiliser une valeur mais pas déplacer la valeur? Il est assez ennuyeux que tout ce que nous passons dans doit également être refoulé si nous voulons l'utiliser à nouveau, en plus de toutes les données résultant du corps de la fonction que nous pourrions vouloir retourner aussi bien.
id: Meskipun ini bekerja, bergerak ke dalam dan keluar dari setiap fungsi adalah sedikit membosankan. bagaimana jika kita ingin membiarkan fungsi menggunakan nilai tetapi tidak memindahkan nilai? sangat menjengkelkan bahwa apa pun yang kita masuk juga perlu dilewatkan kembali jika kita ingin menggunakannya lagi, selain data apapun yang dihasilkan dari tubuh fungsi yang mungkin kita ingin kembali juga.
tr: Bu işe yararken, her fonksiyona girip çıkmak biraz sıkıcıdır. Bir fonksiyonun bir değer kullanmasına izin vermek, ancak değeri hareket ettirmemek istersek ne olur? Geçtiğimiz herhangi bir şeyin, fonksiyonun gövdesinden kaynaklanan ve geri dönmek isteyebileceğimiz herhangi bir veriye ek olarak, tekrar kullanmak istersek geri geçirilmesi gerektiği oldukça sinir bozucudur.
zh_cn: 虽然这个功能起作用了,但每个函数的进进出出都有点无聊。 如果我们想让函数使用一个值而不移动该值,那又如何? 如果我们想让一个函数使用一个值而不移动该值,那么我们所通过的任何东西如果想要再次使用,除了从函数体中得出的我们可能也希望返回的任何数据之外,也需要被回传,这很令人烦恼。

source: Cairo does let us return multiple values using a tuple, as shown in Listing 4-3.
es: El Cairo nos permite devolver múltiples valores usando una tupla, como se muestra en Listado 4-3.
fr: Le Caire nous permet de retourner plusieurs valeurs à l'aide d'un tuple, comme indiqué dans Listing 4-3.
id: Kairo tidak membiarkan kita mengembalikan beberapa nilai menggunakan tuple, seperti yang ditunjukkan dalam Daftar 4-3.
tr: Kahire, Liste 4-3'te gösterildiği gibi, bir tuple kullanarak birden fazla değer döndürmemize izin veriyor.
zh_cn: 开罗确实让我们使用图普返回多个值,如清单4-3所示。

source: // len() returns the length of an array
es: // len() devuelve la longitud de una matriz
fr: // len() retourne la longueur d'un tableau
id: //len Allah) mengembalikan panjang sebuah array
tr: // len() bir dizinin uzunluğunu döndürür
zh_cn: / len () 返回数组的长度 。

source: <span class="caption">Listing 4-3: Returning many values</span>
es: <span class="caption">Lista 4-3: Devolviendo muchos valores</span>
fr: <span class="caption">Liste 4-3: Retournant de nombreuses valeurs</span>
id: <span class="caption">Listing 4-3: Mengembalikan banyak nilai</span>
tr: span class="caption">Liste 4-3: Birçok değer döndürme/span>
zh_cn: <span类="Caption" > listing 4-3: 返回许多值 </span>

source: But this is too much ceremony and a lot of work for a concept that should be common. Luckily for us, Cairo has two features for passing a value without destroying or moving it, called _references_ and _snapshots_.
es: Pero esto es demasiada ceremonia y mucho trabajo para un concepto que debería ser común. Afortunadamente para nosotros, El Cairo tiene dos características para pasar un valor sin destruir o moverlo, llamado _referencias_ y _snapshots_.
fr: Mais c'est trop de cérémonie et beaucoup de travail pour un concept qui devrait être commun. Heureusement pour nous, Le Caire a deux caractéristiques pour passer une valeur sans la détruire ou le déplacer, appelé _références_ et _snapshots_.
id: Tapi ini terlalu banyak upacara dan banyak pekerjaan untuk konsep yang harus umum. Untungnya bagi kita, Kairo memiliki dua fitur untuk melewati nilai tanpa menghancurkan atau memindahkannya, disebut _referensi_ dan _snapshots_.
tr: Ancak bu çok fazla tören ve ortak olması gereken bir konsept için çok fazla iş. Neyse ki, Kahire, _references_ ve _snapshots_ olarak adlandırılan bir değeri yok etmeden veya hareket ettirmeden geçmek için iki özelliğe sahiptir.
zh_cn: 但对于一个应该常见的概念来说,这是太多的仪式和许多工作了。 幸运的是,对于我们来说,开罗有两个特征,即不破坏或移动它而传递一个价值,即_references_和_snapshots_。

source: The issue with the tuple code in previous Listing 4-3 is that we have to return the `Array` to the calling function so we can still use the `Array` after the call to `calculate_length`, because the `Array` was moved into `calculate_length`.
es: El problema con el código de tupla en la lista anterior 4-3 es que tenemos que devolver el `Array` a la función de llamada para que podamos seguir utilizando el `Array` después de la llamada a `calculate_longth`, porque el `Array` se trasladó a `calculate_longth`.
fr: Le problème avec le code de tuple dans le Listing précédent 4-3 est que nous devons retourner le `Array` à la fonction appelante afin que nous puissions toujours utiliser le `Array` après l'appel à `calculate_length`, parce que le `Array` a été déplacé dans `calculate_length`.
id: Masalah dengan kode tuple di Listing 4-3 sebelumnya adalah bahwa kita harus kembali Array yang ke fungsi panggilan sehingga kita masih dapat menggunakan thoseArray setelah panggilan ke ·calcululate_length, karena array itu dipindahkan ke ▪calcululate_length_length.
tr: Önceki Listeleme 4-3'teki tuple koduyla ilgili sorun, Array'yi arama işlevine geri döndürmemiz gerektiğidir, böylece calculate_length çağrısından sonra Array'yi hala kullanabiliriz, çünkü Array calculate_length'ye taşındı.
zh_cn: 上一个清单4-3中的图普尔代码问题在于,我们必须将`阵列'还给调用功能,这样我们仍然可以使用呼叫`计算'后`阵列 ',因为`阵列'被移至`计算'中。

source: Snapshots
fr: Captures instantanées
id: Snapshot
zh_cn: 抓图

source: In the previous chapter, we talked about how Cairo's ownership system prevents us from using a variable after we've moved it, protecting us from potentially writing twice to the same memory cell. However, it's not very convenient. Let's see how we can retain ownership of the variable in the calling function using snapshots.
es: En el capítulo anterior, hablamos de cómo el sistema de propiedad de El Cairo nos impide usar una variable después de haberlo movido, protegiéndonos de escribir potencialmente dos veces a la misma celda de memoria. Sin embargo, no es muy conveniente. Veamos cómo podemos retener la propiedad de la variable en la función de llamada usando instantáneas.
fr: Dans le chapitre précédent, nous avons parlé de la façon dont le système de propriété du Caire nous empêche d'utiliser une variable après l'avoir déplacée, en nous protégeant d'écrire potentiellement deux fois dans la même cellule mémoire. Cependant, ce n'est pas très pratique. Voyons comment nous pouvons conserver la propriété de la variable dans la fonction appelante en utilisant des instantanés.
id: Dalam bab sebelumnya, kita berbicara tentang bagaimana sistem kepemilikan Kairo mencegah kita dari menggunakan variabel setelah kita memindahkannya, melindungi kita dari berpotensi menulis dua kali ke sel memori yang sama. namun, itu sangat tidak nyaman. mari kita lihat bagaimana kita dapat mempertahankan kepemilikan variabel dalam fungsi panggilan menggunakan snapshots.
tr: Bir önceki bölümde, Kahire'nin sahiplik sisteminin onu taşıdıktan sonra bir değişkeni kullanmamızı nasıl engellediği hakkında konuştuk, potansiyel olarak iki kez aynı bellek hücresine yazmamızı koruyor. Ancak, çok uygun değil. Çağrı fonksiyonundaki değişkenin sahipliğini anlık görüntüler kullanarak nasıl koruyabileceğimizi görelim.
zh_cn: 在前一章,我们讨论了开罗的拥有权系统如何阻止我们在移动后使用变量, 从而保护我们不会写作两次到同一个记忆细胞。 但是,这不太方便。让我们看看我们如何在调用功能中使用快照来保留变量的所有权。

source: In Cairo, a snapshot is an immutable view of a value at a certain point in time. Recall that memory is immutable, so modifying a value actually creates a new memory cell. The old memory cell still exists, and snapshots are variables that refer to that "old" value. In this sense, snapshots are a view "into the past".
es: En El Cairo, una instantánea es una vista inmutable de un valor en un cierto punto en el tiempo. Recuerde que la memoria es inmutable, por lo que la modificación de un valor realmente crea una nueva célula de memoria. La vieja celda de memoria todavía existe, y las instantáneas son variables que se refieren a ese valor "viejo". En este sentido, las instantáneas son una vista "en el pasado".
fr: Au Caire, un instantané est une vue immuable d'une valeur à un certain moment dans le temps. Rappelez-vous que la mémoire est immuable, donc modifier une valeur crée en fait une nouvelle cellule mémoire. L'ancienne cellule mémoire existe toujours, et les instantanés sont des variables qui se réfèrent à cette "vieille" valeur. En ce sens, les instantanés sont une vue "dans le passé".
id: Di Kairo, sebuah snapshot adalah pandangan yang tak dapat berubah dari suatu nilai pada suatu waktu. Ingatlah bahwa memori tidak dapat berubah, sehingga mengubah sebuah nilai sebenarnya menciptakan sebuah sel memori baru. Sel memori lama masih ada, dan snapshot adalah variabel yang mengacu ke nilai "tua." Dalam arti ini, snapshots adalah tampilan "ke masa lalu."
tr: Kahire'de anlık görüntü, belirli bir zamanda bir değerin değişmez bir görünümüdür. Hafızanın değişmez olduğunu hatırlayın, bu nedenle bir değeri değiştirmek aslında yeni bir bellek hücresi yaratır. Eski bellek hücresi hala var ve anlık görüntüler o "eski" değere atıfta bulunan değişkenlerdir. Bu anlamda, anlık görüntüler "geçmişe" bir görünümdür.
zh_cn: 在开罗,快照是特定时间点值的不可改变的视图。 回顾记忆是不可改变的, 因此修改一个值实际上会创建一个新的记忆单元格。 旧的记忆单元格仍然存在, 抓照是提到“ 旧的” 值的变量。 从这个意义上讲, 抓照是“ 过去的” 视图。
