Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Declare it with the `component!()` macro, specifying
es: Declararlo con la macro `component!()`, especificando
fr: Déclarez-le avec la macro `component!()`, spécifiant
id: Nyatakan dengan komponen! macro, spesifikasikan
tr: component!() makrosu ile açıklayın, belirtin
zh_cn: 以`构件!()`宏观,具体说明

source: The path to the component `path::to::component`.
es: La ruta hacia el componente `camino::a::component`.
fr: Le chemin vers le composant `path::to::component`.
id: Jalan menuju jalan komponen::: Komponen.
tr: path::to:component bileşenine giden yol.
zh_cn: `路径:路径:到:部件'。

source: The name of the variable in your contract's storage referring to this component's storage (e.g. `ownable`).
es: El nombre de la variable en el almacenamiento de su contrato que se refiere al almacenamiento de este componente (por ejemplo, `propietario`).
fr: Le nom de la variable dans le stockage de votre contrat se référant au stockage de ce composant (par exemple `ownable`).
id: Nama variabel penyimpanan kontrakmu yang mengacu pada penyimpanan komponen ini (misalnya dimiliki).
tr: Sözleşmenizin deposundaki değişkenin adı, bu bileşenin deposuna atıfta bulunur (örn. ownable).
zh_cn: 您合同储存中提及该部件储存的变量的名称(例如`拥有')。

source: The name of the variant in your contract's event enum referring to this component's events (e.g. `OwnableEvent`).
es: El nombre de la variante en el enum de evento de su contrato que se refiere a los eventos de este componente (por ejemplo, `OwnableEvent`).
fr: Le nom de la variante dans l'événement de votre contrat enum se référant aux événements de ce composant (par exemple `OwnableEvent`).
id: Nama varian dari acara kontrak Anda yang mengacu pada peristiwa komponen ini (mis. OwnableEvent).
tr: Sözleşmenizin olay enum'undaki varyantın adı bu bileşenin olaylarına atıfta bulunur (örneğin OwnableEvent).
zh_cn: 合同中提及本组成部分的事件(例如`不可撤销的Event')时,合同中事件编号中的变式名称。

source: Add the path to the component's storage and events to the contract's `Storage` and `Event`. They must match the names provided in step 1 (e.g. `ownable: ownable_component::Storage` and `OwnableEvent: ownable_component::Event`).
es: Añádase la ruta al almacenamiento y los eventos del componente a los términos `Almacenamiento` y `Evento` del contrato. Deben coincidir con los nombres indicados en el paso 1 (por ejemplo, `propiedad: propiedad_componente::Almacenamiento` y `OwnableEvento: propiedad_componente::Evento`).
fr: Ajouter le chemin vers le stockage et les événements de la composante au contrat `Storage` et `Event`. Ils doivent correspondre aux noms fournis à l'étape 1 (par exemple `ownable:ownable_component::Storage` et `OwnableEvent:ownable_component::Event`).
id: Tambahkan jalan ke penyimpanan dan kejadian komponen ke penyimpanan kontrak. ke tempat penyimpanan kontrak dan event (Event). Mereka harus mencocokkan nama-nama yang disediakan dalam langkah 1 (mis): dapat dimiliki_component:::Storage dan ▪OwnableEvent: ownable_component::Event).
tr: Bileşenin deposuna ve etkinliklerine yolu sözleşmenin Storage ve Event'sine ekleyin. 1. adımda verilen isimlerle eşleşmelidirler (örneğin ownable: ownable_component::Storage ve OwnableEvent: ownable_component:Event).
zh_cn: 在合同的“标准”和“晚上”中加入部件储存和事件的途径,它们必须与第1步中提供的名称相符(例如,`可拥有的:可拥有的'部件::稳定'和`可拥有的Event:可拥有的_组件:Event')。

source: The storage variable **MUST** be annotated with the `#[substorage(v0)]` attribute.
es: La variable de almacenamiento **MUST** esté anotada con el atributo [subalmacenamiento(v0)]`.
fr: La variable de stockage **MUST** doit être annotée avec l'attribut `#[substorage(v0)]`.
id: Variabel penyimpanan (*MUST** akan dienotasi dengan atribut.
tr: **MUST** depolama değişkeni #[substoage(v0)] özniteliği ile not edilir.
zh_cn: **** 存储变量** 附加“{[次存储(v0)]`属性”的附加说明。

source: Embed the component's logic defined inside your contract, by instantiating the component's generic impl with a concrete `ContractState` using an impl alias. This alias must be annotated with `#[abi(embed_v0)]` to externally expose the component's functions.
es: Incorpore la lógica del componente definida dentro de su contrato, instaurando el impl genérico del componente con un concreto `Contract State` usando un alias de impl. Este alias debe anotarse con '[abi(embed_v0)]` para exponer externamente las funciones del componente.
fr: Intégrez la logique du composant définie dans votre contrat, en injectant l'impl générique du composant avec un `ContractState` concret à l'aide d'un alias impl. Cet alias doit être annoté avec `#[abi(embed_v0)]` pour exposer les fonctions du composant à l'extérieur.
id: Tempelkan logika komponen yang didefinisikan di dalam kontrak Anda, dengan mempercepat impl generik komponen dengan concrete conct contractState menggunakan alias impl. Alias ini harus dienotasi dengan "#[abi[embed_v0) to eksternal mengekspos fungsi komponen.
tr: Bileşenin genel impl'sini bir impl takma adı kullanarak somut bir ContractState ile hazırlayarak, sözleşmenizin içinde tanımlanan bileşenin mantığını yerleştirin. Bu takma ad, bileşenin işlevlerini dıştan açığa çıkarmak için #[abi(embed_v0)]] ile eklenmelidir.
zh_cn: 将部件的逻辑纳入合同中,即用一个混凝土的`缔约国'用隐形别名将部件的通用内插与混凝土`缔约国'连结起来,这一别名必须加上“[babi(embed_v0)]”加注,以外部暴露部件的功能。

source: As you can see, the InternalImpl is not marked with `#[abi(embed_v0)]`. Indeed, we don't want to expose externally the functions defined in this impl. However, we might still want to access them internally.
es: Como puede ver, el In InternalImpl no está marcado con «[abi(embed_v0)]». De hecho, no queremos exponer externamente las funciones definidas en este impl. Sin embargo, todavía podríamos querer acceder a ellas internamente.
fr: Comme vous pouvez le voir, InternalImpl n'est pas marqué par `#[abi(embed_v0)]`. En effet, nous ne voulons pas exposer extérieurement les fonctions définies dans cette impl. Cependant, nous pourrions toujours vouloir y accéder en interne.
id: Seperti yang dapat Anda lihat, InternalImpl tidak ditandai dengan ml ini. Namun, kita mungkin masih ingin mengaksesnya secara internal.
tr: Gördüğünüz gibi, InternalImpl #[abi(embed_v0)] ile işaretli değildir. Gerçekten de, bu impl'de tanımlanan işlevleri dışsal olarak ifşa etmek istemiyoruz. Ancak, yine de bunlara dahili olarak erişmek isteyebiliriz.
zh_cn: 如你所见,《内部问题》没有标记为`{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}}}。事实上,我们不想对外披露此规定所定义的功能。然而,我们可能仍想在内部查阅这些功能。

source: For example, to embed the `Ownable` component defined above, we would do the following:
es: Por ejemplo, para incrustar el componente `Ownable` definido anteriormente, haríamos lo siguiente:
fr: Par exemple, pour intégrer le composant `Ownable` défini ci-dessus, nous ferions ce qui suit :
id: Sebagai contoh, untuk menanamkan komponen yang dapat didefinisikan di atas, kami akan melakukan hal berikut:
tr: Örneğin, yukarıda tanımlanan Ownable bileşenini gömmek için şunları yapardık:
zh_cn: 例如,为了嵌入上文界定的`不可撤销'部分,我们将采取以下行动:

source: The component's logic is now seamlessly part of the contract! We can interact with the components functions externally by calling them using the `IOwnableDispatcher` instantiated with the contract's address.
es: La lógica del componente es ahora parte del contrato sin problemas! Podemos interactuar con las funciones de los componentes externamente llamándolos usando el `IOwnableDispatcher` instantiated con la dirección del contrato.
fr: La logique du composant fait désormais partie intégrante du contrat! Nous pouvons interagir avec les composants en les appelant en utilisant le `IOwnableDispatcher` instantané avec l'adresse du contrat.
id: Kita dapat berinteraksi dengan komponen berfungsi secara eksternal dengan memanggil mereka menggunakan Dispatcher yang dapat dipecahkan seketika dengan alamat kontrak.
tr: Bileşenin mantığı artık sözleşmenin sorunsuz bir parçası! Sözleşmenin adresi ile hazır hale getirilmiş IOwnableDispatcher kullanarak bileşenler işlevlerini harici olarak çağırarak etkileşimde bulunabiliriz.
zh_cn: 部件的逻辑现在是合同的无缝部分! 我们可以使用“IOwnable Dispatcher ” 的地址与部件的外部功能进行互动。

source: Stacking Components for Maximum Composability
es: Componentes de apilado para la máxima composibilidad
fr: Composants de positionnement pour une composabilité maximale
id: Komponen Stacking untuk Komposabilitas Maksimum
tr: Maksimum Kompozisyon için İstifleme Bileşenleri
zh_cn: 最大复合性堆叠元件

source: The composability of components really shines when combining multiple of them together. Each adds its features onto the contract. You can rely on [Openzeppelin's](https://github.com/OpenZeppelin/cairo-contracts) implementation of components to quickly plug-in all the common functionalities you need a contract to have.
es: La composibilidad de los componentes realmente brilla al combinar varios de ellos juntos. Cada uno añade sus características al contrato. Puede confiar en [Openzeppelin's](https://github.com/OpenZeppelin/cairo-contracts) la implementación de componentes para conectar rápidamente todas las funcionalidades comunes que necesita un contrato para tener.
fr: Chacun ajoute ses fonctionnalités au contrat. Vous pouvez vous fier à [Openzeppelin's](https://github.com/OpenZeppelin/cairo-contracts) l'implémentation de composants pour brancher rapidement toutes les fonctionnalités communes que vous avez besoin d'un contrat.
id: Komponen-komponen ini benar-benar bersinar ketika menggabungkan beberapa komponen itu bersama-sama. Masing-masing menambahkan fiturnya ke dalam kontrak. Anda dapat mengandalkan [Penyesalan] kebiasaan yang Anda butuhkan kontrak.
tr: Bileşenlerin bileşimi, birden çok bileşeni bir araya getirirken gerçekten parlar. Her biri, özelliklerini sözleşmeye ekler. [Openzeppelin's](https://github.com/OpenZeppelin/cairo-contracts) bileşenlerin uygulanmasına güvenerek, bir sözleşmeye ihtiyacınız olan tüm ortak işlevleri hızlı bir şekilde takabilirsiniz.
zh_cn: 组合多个组件时,部件的可配置性会真正闪亮。 每个组件都会在合同中添加其特性。 您可以依赖[ Openzeppelin's] (https://github.com/ OpenZeppelin/cairo-contracts) 实施组件, 以快速插入所有您需要的通用功能 。

source: Developers can focus on their core contract logic while relying on battle-tested and audited components for everything else.
es: Los desarrolladores pueden centrarse en su lógica de contrato principal mientras confían en componentes probados y auditados para todo lo demás.
fr: Les développeurs peuvent se concentrer sur leur logique de contrat de base tout en s'appuyant sur des composants éprouvés et vérifiés pour tout le reste.
id: Pengembang dapat berfokus pada logika kontrak inti mereka sambil mengandalkan komponen yang diuji pertempuran dan diaudit untuk segala sesuatu yang lain.
tr: Geliştiriciler, diğer her şey için savaş test edilmiş ve denetlenmiş bileşenlere güvenirken temel sözleşme mantığına odaklanabilirler.
zh_cn: 开发者可以专注于其核心合同逻辑,同时依靠经过战斗试验和审计的部件来完成其他所有工作。

source: Components can even [depend](./ch16-02-02-component-dependencies.md) on other components by restricting the `TContractstate` they're generic on to implement the trait of another component. Before we dive into this mechanism, let's first look at [how components work under the hood](./ch16-02-01-under-the-hood.md).
es: Los componentes pueden incluso [depender](./ch16-02-02-component-dependencias.md) de otros componentes restringiendo el `TContractstate` son genéricos para implementar el rasgo de otro componente. Antes de sumergirnos en este mecanismo, veamos primero [cómo funcionan los componentes bajo el capó](./ch16-02-01-under-the-hood.md).
fr: Les composants peuvent même [dépendre](./ch16-02-02-component-dependences.md) sur d'autres composants en limitant le `TContractstate` sur lequel ils sont génériques pour implémenter le caractère d'un autre composant. Avant de plonger dans ce mécanisme, examinons d'abord [comment les composants fonctionnent sous le capot](./ch16-02-01-under-the-hood.md).
id: Komponen bahkan dapat [depentasi][./ch16-02-02-kompondensi-komponen.md) pada komponen-komponen lain dengan membatasi ÉTContractstateå mereka generik untuk menerapkan sifat komponen lain. Sebelum kita menyelam ke dalam mekanisme ini, mari kita lihat dulu [bagaimana komponen bekerja di bawah kapiler]./ch16-02-under-the-the-hood).
tr: Bileşenler, TContractstate'i kısıtlayarak diğer bileşenlere bile [./ch16-02-02-02-02-bileşen-bağımlılar.md] bağlanabilir - bunlar başka bir bileşenin özelliğini uygulamak için jeneriktir. Bu mekanizmaya dalmadan önce, önce [bileşenlerin kaputun altında nasıl çalıştığına] bakalım (./ch16-02-01-alt-the-hood.md).
zh_cn: 部件甚至可以(./ch16-02-02- 构件依赖性.md)对其他部件进行限制,限制`合同国'的通用性,以实施其他部件的特性。在我们潜入这个机制之前,让我们首先研究[在引擎盖下如何使用部件](./ch16-02-01-under-hood.md)。

source: Components: Under the Hood
es: Componentes: Bajo el capó
fr: Composants: Sous le capot
id: Komponen: Di Bawah Tudung
tr: Bileşenleri: Başlık altında
zh_cn: 组成部分:在兜帽下

source: Components provide powerful modularity to Starknet contracts. But how does this magic actually happen behind the scenes?
es: Los componentes proporcionan una potente modularidad a los contratos de Starknet. Pero, ¿cómo es que esta magia realmente sucede entre bastidores?
fr: Les composants fournissent une modularité puissante aux contrats Starknet. Mais comment cette magie se produit-elle réellement dans les coulisses?
id: Komponen memberikan modularitas kuat untuk kontrak Starknet.
tr: Bileşenleri Starknet sözleşmeleri için güçlü modülerlik sağlar. Ama bu büyü aslında sahne arkasında nasıl gerçekleşir?
zh_cn: 部件为斯塔克内特合同提供了强大的模块性。 但是这个魔法是如何在幕后发生的呢?

source: This chapter will dive deep into the compiler internals to explain the mechanisms that enable component composability.
es: Este capítulo se sumergirá profundamente en los internos del compilador para explicar los mecanismos que permiten la composibilidad de los componentes.
fr: Ce chapitre plongera profondément dans les internes du compilateur pour expliquer les mécanismes qui permettent la composabilité des composants.
id: Bab ini akan menyelam jauh ke dalam internal kompiler untuk menjelaskan mekanisme yang memungkinkan komposabilitas komponen.
tr: Bu bölüm, bileşen uyumluluğunu sağlayan mekanizmaları açıklamak için derleyici içlerinin derinliklerine dalacaktır.
zh_cn: 本章将深入汇编器的内部,以解释能够使组件可混集的机制。

source: A Primer on Embeddable Impls
es: Un Primer sobre Implicaciones Incrustables
fr: Un Primer sur Impls Embeddable
id: A Perdana pada Impls Dapat Dibenamkan
tr: Gömülü İmpler Üzerine Bir Astar
zh_cn: 内嵌的内嵌的内嵌的隐隐性器的开源器

source: Before digging into components, we need to understand _embeddable impls_.
es: Antes de cavar en los componentes, necesitamos entender _embeddable impls_.
fr: Avant de creuser dans des composants, nous devons comprendre impls__embeddable.
id: Sebelum menggali komponen, kita perlu memahami impls_ yang dapat dibenamkan.
tr: Bileşenleri kazmadan önce, _embeddeble impls_ değerini anlamamız gerekir.
zh_cn: 在挖掘部件之前,我们需要了解 易腐性无能。

source: An impl of a Starknet interface trait (marked with `#[starknet::interface]`) can be made embeddable. Embeddable impls can be injected into any contract, adding new entry points and modifying the ABI of the contract.
es: Un impl de un rasgo de interfaz de Starknet (marcado con [starknet::interface]`) se puede hacer incrustable. Impls incrustable se puede inyectar en cualquier contrato, añadiendo nuevos puntos de entrada y modificando el ABI del contrato.
fr: Un impl d'un trait d'interface Starknet (marqué avec `#[starknet::interface]`) peut être intégré. Des impls embarquables peuvent être injectés dans n'importe quel contrat, ajoutant de nouveaux points d'entrée et modifiant l'ABI du contrat.
id: Sebuah impl dari sifat interface Starknet (ditandai dengan ▪#[starknet::interface]) dapat dibuat dapat dibenamkan. dapat dibenamkan impls dapat disuntikkan ke dalam kontrak apapun, menambahkan titik masukan baru dan memodifikasi ABI dari kontrak.
tr: Bir Starknet arayüz özelliğinin bir impl'si (#[starknet::interface] ile işaretlenmiştir) gömülebilir hale getirilebilir. Gömülü impls herhangi bir sözleşmeye enjekte edilebilir, yeni giriş noktaları ekleyebilir ve sözleşmenin ABI'sini değiştirebilir.
zh_cn: Starknet 界面特性( 标记为 @ [ starknet:: interface :') 可以嵌入 。 任何合同中都可以注入嵌入的内脏, 添加新的切入点, 并修改合同的ABI 。

source: Let's look at an example to see this in action:
es: Veamos un ejemplo para ver esto en acción:
fr: Examinons un exemple pour voir ceci en action :
id: Mari kita lihat contoh untuk melihat hal ini dalam tindakan:
tr: Bunu eylemde görmek için bir örneğe bakalım:
zh_cn: 让我们举个例子,

source: By embedding `SimpleImpl`, we externally expose `ret4` in the contract's ABI.
es: Al incorporar `SimpleImpl`, exponemos externamente `ret4` en el ABI del contrato.
fr: En intégrant `SimpleImpl`, nous exposons externement `ret4` dans l'ABI du contrat.
id: Dengan menanamkannya, kita akan mengeksposnya secara eksternal dalam kontrak ABI.
tr: SimpleImpl'yi yerleştirerek, sözleşmenin ABI'sine ret4'yi harici olarak ifşa ediyoruz.
zh_cn: 通过嵌入“SempImpl”号,我们外部暴露了合同ABI中的“rest4”号。

source: Now that we’re more familiar with the embedding mechanism, we can now see how components build on this.
es: Ahora que estamos más familiarizados con el mecanismo de incrustación, ahora podemos ver cómo los componentes se basan en esto.
fr: Maintenant que nous sommes plus familiers avec le mécanisme d'intégration, nous pouvons maintenant voir comment les composants s'appuient sur cela.
id: Sekarang kita lebih akrab dengan mekanisme embedding, kita sekarang dapat melihat bagaimana komponen membangun ini.
tr: Gömme mekanizmasına daha aşina olduğumuza göre, artık bileşenlerin bunun üzerine nasıl inşa edildiğini görebiliriz.
zh_cn: 现在我们更熟悉嵌入机制, 现在可以看到组件是如何以此为基础的。

source: Inside Components: Generic Impls
es: Componentes interiores: Implicaciones genéricas
fr: Composants intérieurs : Impls générique
id: Komponen Dalam: Impl Generik
tr: İç Bileşenleri: Genel Impls
zh_cn: 内装部件:通用Imps

source: Recall the impl block syntax used in components:
es: Recuerde la sintaxis de bloque de impl utilizada en los componentes:
fr: Rappelez-vous la syntaxe de bloc impl utilisée dans les composants:
id: Ingat sintaks blok impl yang digunakan dalam komponen:
tr: Bileşenlerde kullanılan impl blok sözdizimi hatırla:
zh_cn: 回想在组件中使用的 unpl 区块语法 :

source: The key points:
es: Los puntos clave:
fr: Les points clés:
id: Titik kuncinya:
tr: Anahtar noktalar:
zh_cn: 关键要点:

source: `OwnableImpl` requires the implementation of the `HasComponent<TContractState>` trait by the underlying contract, which is automatically generated with the `component!()` macro when using a component inside a contract.
es: `OwnableImpl` requiere la aplicación del rasgo `HasComponent<TContractState® por el contrato subyacente, que se genera automáticamente con la macro `componente!()` cuando se utiliza un componente dentro de un contrato.
fr: `OwnableImpl` nécessite la mise en œuvre du caractère `HasComponent<TContractState>` par le contrat sous-jacent, qui est automatiquement généré avec la macro `component!()` lors de l'utilisation d'un composant à l'intérieur d'un contrat.
id: "OwnableImplpl" memerlukan implementasi dari "HassCompponent<TContractState>" yang secara otomatis dihasilkan dengan makro "component" ketika menggunakan komponen dalam kontrak.
tr: OwnableImpl, bir sözleşmenin içindeki bir bileşeni kullanırken otomatik olarak component!() makrosu ile oluşturulan HasComponentTContractState> özelliğinin altta yatan sözleşme tarafından uygulanmasını gerektirir.
zh_cn: `不可承受性影响'要求根据基本合同执行`是否具有`缔约地国'的特性,在使用合同内某一组成部分时,该特性自动由`组成部分!'()`宏'产生。

source: The compiler will generate an impl that wraps any function in `OwnableImpl`, replacing the `self: ComponentState<TContractState>` argument with `self: TContractState`, where access to the component state is made via the `get_component` function in the `HasComponent<TContractState>` trait.
es: El compilador generará un impl que envuelve cualquier función en `OwnableImpl`, reemplazando el argumento `self: ComponentState<TContractState® por `self: TContractState`, donde el acceso al estado del componente se hace a través de la función `get_component` en el rasgo `HasComponent<TContractState®.
fr: Le compilateur générera un impl qui enveloppe n'importe quelle fonction dans `OwnableImpl`, remplaçant l'argument `self: ComponentState<TContractState>` par `self: TContractState`, où l'accès à l'état composant est fait via la fonction `get_component` dans le caractère `HasComponent<TContractState>`.
id: The compiler will menghasilkan impl yang membungkus setiap fungsi dalam ·OwnableImplplpl, menggantikan dirinya: ComponentState<TContractState> dengan dirinya sendiri: TContractstate, dimana akses ke negara komponen dibuat melalui fungsi komponent_component<Contractate> sifat.
tr: Derleyici, OwnableImpl'deki herhangi bir işlevi saran bir impl oluşturacak, self: ComponentStateTContractState> argümanını self: TContractState ile değiştirecektir, burada bileşen durumuna erişim HasComponentTContractState> özelliğindeki get_component fonksiyonu aracılığıyla yapılır.
zh_cn: 汇编者将生成一个密钥,将任何函数以`不可逆的Impl'封装,用`自我:缔约方'来取代`自我:构成国家'的争论,即通过`哈斯Component < 缔约国家'中的`get_构件'功能进入组成部分状态。

source: For each component, the compiler generates a `HasComponent` trait. This trait defines the interface to bridge between the actual `TContractState` of a generic contract, and `ComponentState<TContractState>`.
es: Para cada componente, el compilador genera un rasgo " HasComponent ", que define la interfaz para establecer un puente entre el " EstadoTContract " real de un contrato genérico y el " EstadoComponent< EstadoTContract".
fr: Pour chaque composant, le compilateur génère un caractère `HasComponent`. Ce caractère définit l'interface entre le `TContractState` réel d'un contrat générique et `ComponentState<TContractState>`.
id: Untuk setiap komponen, kompiler menghasilkan sebuah sifat. Sifat ini mendefinisikan antarmuka untuk menjembatani antarkonstrate yang sebenarnya dari sebuah kontrak umum, dan komponentate<TContractState>.
tr: Her bileşen için derleyici bir HasComponent özelliği oluşturur. Bu özellik, genel bir sözleşmenin gerçek TContractState ile ComponentState arasında köprü kurmak için arayüzü tanımlar.
zh_cn: 对于每个组成部分,汇编者产生一个`哈斯康本特'特性,这一特性界定了通用合同实际`缔约国'与`综合国家`缔约国'之间的连接点。

source: // generated per component
es: // generado por componente
fr: // généré par composant
id: //dihasilkan per komponen
tr: // bileşen başına oluşturulur
zh_cn: / 每一组成部分产生的
