Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: <span class="caption"> Starknet messaging contract interface</span>
es: <span class="caption"> Interfaz de contrato de mensajería Starknet</span>
fr: <span class="caption"> Interface du contrat de messagerie Starknet</span>
id: <span class="caption"> Starknet messaging antar muka kontrak</span>
tr: span class="caption"> Starknet mesajlaşma sözleşme arayüzü/span>
zh_cn: <span类=“caption”>>斯塔克内通信合同界面 </span>

source: In the case of `L1->L2` messages, the Starknet sequencer is constantly listening to the logs emitted by the `StarknetMessaging` contract on Ethereum. Once a message is detected in a log, the sequencer prepares and executes a `L1HandlerTransaction` to call the function on the target L2 contract. This takes up to 1-2 minutes to be done (few seconds for ethereum block to be mined, and then the sequencer must build and execute the transaction).
es: En el caso de los mensajes `L1->L2`, el secuenciador Starknet escucha constantemente los registros emitidos por el contrato `StarknetMessaging` en Ethereum. Una vez que un mensaje se detecta en un registro, el secuenciador prepara y ejecuta una `L1HandlerTransaction` para llamar a la función en el contrato L2 objetivo. Esto tarda hasta 1-2 minutos en hacerse (pocos segundos para que el bloque etéreo se extraiga, y luego el secuenciador debe construir y ejecutar la transacción).
fr: Dans le cas des messages `L1->L2`, le séquenceur Starknet écoute en permanence les journaux émis par le contrat `StarknetMessage` sur Ethereum. Une fois qu'un message est détecté dans un journal, le séquenceur prépare et exécute un `L1HandlerTransaction` pour appeler la fonction sur le contrat L2 cible. Cela prend jusqu'à 1-2 minutes à faire (peu de secondes pour que le bloc éthéré soit extrait, puis le séquenceur doit construire et exécuter la transaction).
id: Dalam kasus ini, pesan pada Ethereum terdeteksi dalam sebuah log, pengurutan Starknet terus-menerus mendengarkan log yang dipancarkan oleh kontrak L2. Ini membutuhkan 1-2 menit untuk dilakukan (beberapa detik untuk blok etereum untuk ditambang, dan kemudian pengurut urutan harus membangun dan menjalankan transaksi).
tr: L1->L2 mesajları durumunda, Starknet sıralayıcısı sürekli olarak StarknetMesaging sözleşmesinin Ethereum üzerinde yaydığı günlükleri dinliyor. Bir günlükte bir mesaj algılandığında, sıralayıcı hedef L2 sözleşmesindeki işlevi çağırmak için bir L1HandlerTransaction hazırlar ve çalıştırır. Bu işlemin yapılması 1-2 dakika kadar sürer (Etherethere için birkaç saniye, daha sonra da maden bloğunun çalıştırılması gerekir).
zh_cn: 在`L1->L2'电文的情况下,斯塔克内特测序器不断监听Etheum的`StarknetMessmaging'合同所排放的日志,一旦在日志中检测到信息,测序器就准备并执行一项`L1HandlerTransaction ',以调用目标L2合同上的函数。这需要多达1-2分钟的时间(要开采的乙醚块的秒,然后序列器必须构建和执行交易)。

source: `L2->L1` messages are prepared by contracts execution on L2 and are part of the block produced. When the sequencer produces a block, it sends the hash of each message prepared by contracts execution to the `StarknetCore` contract on L1, where they can then be consumed once the block they belong to is proven and verified on Ethereum (which for now is around 3-4 hours).
es: Los mensajes `L2->L1` son preparados por la ejecución de contratos en L2 y forman parte del bloque producido. Cuando el secuenciador produce un bloque, envía el hash de cada mensaje preparado por la ejecución de contratos al contrato `StarknetCore` en L1, donde pueden ser consumidos una vez que el bloque al que pertenecen es probado y verificado en Ethereum (que por ahora es de alrededor de 3-4 horas).
fr: Les messages `L2->L1` sont préparés par l'exécution de contrats sur L2 et font partie du bloc produit. Lorsque le séquenceur produit un bloc, il envoie le hachage de chaque message préparé par l'exécution de contrats au contrat `StarknetCore` sur L1, où ils peuvent ensuite être consommés une fois le bloc auquel ils appartiennent prouvé et vérifié sur Ethereum (qui pour l'instant est d'environ 3-4 heures).
id: pesan L2->L1R dipersiapkan oleh eksekusi kontrak di L2 dan bagian dari blok yang diproduksi. ketika pengurut menghasilkan blok, mengirimkan hash dari setiap pesan yang disiapkan oleh eksekusi kontrak ke kontrak kontrak ▪StarknetCore kontrak di L1, di mana mereka kemudian dapat dikonsumsi setelah blok mereka milik terbukti dan diverifikasi pada Etherum (yang untuk saat ini adalah sekitar 3-4 jam).
tr: L2->L1 mesajları, L2 üzerindeki sözleşmeler yürütmesi ile hazırlanır ve üretilen bloğun bir parçasıdır. Sıralayıcı bir blok ürettiğinde, L1 üzerindeki StarknetCore sözleşmesine sözleşmeler yürütmesi ile hazırlanan her mesajın hashini gönderir; böylece ait oldukları blok Ethereum'da kanıtlandıktan ve doğrulandıktan sonra tüketilebilirler (şu an için yaklaşık 3-4 saattir).
zh_cn: `L2>L1'电文由L2的合同执行书制成,是所生产的区块的一部分,当测序器产生一个区块时,它将执行合同的每条电文的散发件发送给L1的`StarknetCore'合同,一旦Ethereum(目前大约为3-4小时)证明和核实其所属区块,这些电文就可以消耗。

source: Sending Messages from Ethereum to Starknet
es: Envío de mensajes de Ethereum a Starknet
fr: Envoi de messages d'Ethereum à Starknet
id: Mengirim Pesan dari Etherum ke Starknet
tr: Ethereum'dan Starknet'e Mesaj Gönderme
zh_cn: 从 Etheum 发送信件到 Starknet

source: If you want to send messages from Ethereum to Starknet, your Solidity contracts must call the `sendMessageToL2` function of the `StarknetMessaging` contract. To receive these messages on Starknet, you will need to annotate functions that can be called from L1 with the `#[l1_handler]` attribute.
es: Si desea enviar mensajes de Ethereum a Starknet, sus contratos de Solidity deben llamar a la función `Enviar MensajeToL2` del contrato `StarknetMessaging`. Para recibir estos mensajes en Starknet, tendrá que anotar funciones que se pueden llamar desde L1 con el atributo `[l1_handler]`.
fr: Si vous souhaitez envoyer des messages d'Ethereum à Starknet, vos contrats Solidity doivent appeler la fonction `sendMessageToL2` du contrat `StarknetMessage`. Pour recevoir ces messages sur Starknet, vous devrez annoter les fonctions qui peuvent être appelées à partir de L1 avec l'attribut `#[l1_handler]`.
id: Jika anda ingin mengirim pesan dari Ethereum ke Starknet, kontrak Soliditas anda harus memanggil fungsi L1 yang dapat dipanggil dari atribut L1 dengan L1&lt;/font&gt; &lt;font color="#ffff00"&gt;î&lt;/font&gt; &lt;font color="#ffff00"&gt;-&lt;/font&gt; &lt;font color="#ffff00"&gt;-&lt;/font&gt; &lt;font color="#ffff00"&gt;Untuk menerima pesan-pesan ini di Starknet, anda akan perlu mengumumkan fungsi yang dapat dipanggil dari L1&lt;/font&gt; &lt;font color="#ffff00"&gt;-
tr: Ethereum'dan Starknet'e mesaj göndermek istiyorsanız, Solidity sözleşmelerinizin StarknetMessage sözleşmesinin sendMessageToL2 işlevini çağırması gerekir. Starknet'te bu mesajları almak için, L1'den #[l1_handler] özniteliği ile çağrılabilecek işlevleri belirtmeniz gerekir.
zh_cn: 如果您想要从 Etheum 发送信息到 Starknet, 您的 Solicity 合同必须调用“ SendMessage ToL2” 合同的功能。 要在 Starknet 上接收这些消息, 您需要用 {l1_ handler} 属性给 L1 调用函数加注 。

source: Let's take a simple contract taken from [this tutorial](https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol) where we want to send a message to Starknet. The `_snMessaging` is a state variable already initialized with the address of the `StarknetMessaging` contract. You can check all Starknet contract and sequencer addresses [here](https://docs.starknet.io/documentation/tools/important_addresses/).
es: Tomemos un simple contrato tomado de [este tutorial] (https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol) donde queremos enviar un mensaje a Starknet. La variable `_snMessaging` es una variable de estado ya inicializada con la dirección del contrato `StarknetMessaging`. Puede comprobar todas las direcciones de contrato y secuenciador de Starknet [aquí] (https://docs.starknet.io/documentation/tools/important_direcciones/).
fr: Prenons un simple contrat tiré de [ce tutoriel](https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol) où nous voulons envoyer un message à Starknet. La variable `_snMessaging` est une variable d'état déjà initialisée avec l'adresse du contrat `StarknetMessaging`. Vous pouvez vérifier toutes les adresses de contrat et de séquenceur de Starknet [ici](https://docs.starknet.io/documentation/tools/important_address/).
id: Mari kita ambil kontrak sederhana yang diambil dari [ tutorial/ContractMsg.sol) di mana kita ingin mengirim pesan ke Starknet.
tr: Starknet'e mesaj göndermek istediğimiz [https://github.com/glihm/starknet-mesajlama-dev/blob/main/solidity/src/ContractMsg.sol] adresinden alınan basit bir sözleşmeyi ele alalım. _sndocument_shttpsaging, Starknet adresiyle zaten başlatılan bir durum değişkenidir.
zh_cn: 让我们从[这一教程](https://github.com/glihm/starknet- messsage-dev/blob/main/solicity/src/contractingMsg.sol)取得一个简单的合同,我们想向Starknet发送一个信息。“snMessage”是一个州变量,已经根据StarknetMessmaging合同的地址启动。你可以查看所有 Starknet合同和测序器地址[此处](https://docs.starknet.io/documentation/tools/importent_addresses/)。

source: // Sends a message on Starknet with a single felt.
es: // Envía un mensaje en Starknet con un solo fieltro.
fr: // Envoie un message sur Starknet avec un seul feutre.
id: //Kirim pesan di Starknet dengan perasaan tunggal.
tr: // Starknet'e tek bir keçe ile mesaj gönderir.
zh_cn: 在史塔克网上发出一个信息 只有一个感觉

source: // We "serialize" here the felt into a payload, which is an array of uint256.
es: // Aquí "serializamos" el fieltro en una carga útil, que es una matriz de uint256.
fr: // Nous "sérialisons" ici le feutre dans une charge utile, qui est un tableau d'uint256.
id: /Kami "serialisasi" di sini merasa ke dalam payload, yang merupakan array Uint256.
tr: // Burada keçeyi bir yük yüküne "serileştiririz", ki bu bir uint256 dizisidir.
zh_cn: 我们在这里“序列化”到一个有效载荷, 也就是五角形256的阵列。

source: // msg.value must always be >= 20_000 wei.
es: // msg.value debe ser siempre = 20_000 wei.
fr: // msg.value doit toujours être >= 20_000 wei.
id: //msg.value harus selalu >=20,000 wei.
tr: // msg.value her zaman>= 20_000 wei olmalıdır.
zh_cn: msg. 值必须始终是 20_ 000 wei。

source: The function sends a message with a single felt value to the `StarknetMessaging` contract. Please note that if you want to send more complex data you can. Just be aware that your Cairo contract will only understand `felt252` data type. So you must ensure that the serialization of your data into the `uint256` array follow the Cairo serialization scheme.
es: La función envía un mensaje con un solo valor de fieltro al contrato `StarknetMessaging`. Tenga en cuenta que si desea enviar datos más complejos que pueda. Sólo tenga en cuenta que su contrato de El Cairo sólo entenderá el tipo de datos `felt252`. Por lo tanto, debe asegurarse de que la serialización de sus datos en la matriz `uint256` siga el esquema de serialización de El Cairo.
fr: La fonction envoie un message avec une seule valeur en feutre au contrat `StarknetMessaging`. Veuillez noter que si vous voulez envoyer des données plus complexes, vous pouvez. Soyez simplement conscient que votre contrat du Caire ne comprendra que le type de données `felt252`. Vous devez donc vous assurer que la sérialisation de vos données dans le tableau `uint256` suit le schéma de sérialisation du Caire.
id: Fungsi mengirim pesan dengan satu perasaan nilai yang dirasakan untuk kontrak StarknetMesaging. Harap dicatat bahwa jika Anda ingin mengirim data yang lebih kompleks Anda bisa. Hanya perlu menyadari bahwa kontrak Kairo Anda hanya akan memahami tipe data felting252. Jadi Anda harus memastikan bahwa serialisasi data Anda ke dalam array serialisasi Kairo 256.
tr: İşlev, StarknetMesaj sözleşmesine tek bir keçe değeri ile bir mesaj gönderir. Daha karmaşık veriler göndermek istiyorsanız, yapabileceğinizi unutmayın. Kahire sözleşmenizin yalnızca felt252 veri türünü anlayacağını unutmayın. Bu nedenle, verilerinizi uint256 dizisine serileştirmenin Kahire serileştirme şemasını takip ettiğinden emin olmalısınız.
zh_cn: 此函数向`StarknetMessmaging' 合同发送含有单一感觉值的信息。 请注意, 如果您想要发送更复杂的数据, 您可以发送。 请注意, 您的开罗合同只能理解“ felt252” 数据类型 。 因此您必须确保您的数据序列化为“ 昆特256” 数组遵循开罗序列化方案。

source: It's important to note that we have `{value: msg.value}`. In fact, the minimum value we've to send here is `20k wei`, due to the fact that the `StarknetMessaging` contract will register the hash of our message in the storage of Ethereum.
es: Es importante tener en cuenta que tenemos value: msg.value. De hecho, el valor mínimo que tenemos que enviar aquí es `20k wei`, debido al hecho de que el contrato `StarknetMessaging` registrará el hash de nuestro mensaje en el almacenamiento de Ethereum.
fr: Il est important de noter que nous avons `{value: msg.value}`. En fait, la valeur minimale que nous devons envoyer ici est `20k wei`, en raison du fait que le contrat `StarknetMessaging` enregistrera le hachage de notre message dans le stockage de Ethereum.
id: Sangat penting untuk dicatat bahwa kita memiliki nilai ▪{value: msg.value}. Bahkan, nilai minimum yang kita kirim di sini adalah 20k wei, karena fakta bahwa kontrak starknetMesaging akan mendaftarkan hash pesan kita dalam penyimpanan Ethereum.
tr: value: msg.value'ye sahip olduğumuzu belirtmek önemlidir. Aslında, burada göndermemiz gereken minimum değer 20k Wei'dir, çünkü StarknetMesaging sözleşmesi mesajımızın hash'ini Ethereum'un deposuna kaydeder.
zh_cn: 必须指出的是,我们的价值是: msg.valu *。事实上,我们在此必须发送的最低价值是`20kwei',因为`StarknetMessmaging'合同将在Etheyum的储存中登记我们信息的散列。

source: In addition to those `20k wei`, since the `L1HandlerTransaction` executed by the sequencer is not tied to any account (the message originates from L1), you must also ensure that you pay enough fees on L1 for your message to be deserialized and processed on L2.
es: Además de los `20k wei`, ya que la `L1HandlerTransaction` ejecutada por el secuenciador no está vinculada a ninguna cuenta (el mensaje se origina en L1), también debe asegurarse de que usted paga suficientes honorarios en L1 para que su mensaje sea deserializado y procesado en L2.
fr: En plus de ces `20k wei`, puisque le `L1HandlerTransaction` exécuté par le séquenceur n'est lié à aucun compte (le message provient de L1), vous devez également vous assurer que vous payez suffisamment de frais sur L1 pour que votre message soit désérialisé et traité sur L2.
id: Selain itu, Anda juga harus memastikan bahwa Anda membayar biaya yang cukup pada L1 untuk pesan Anda untuk dideserialisasi dan diproses pada L2.
tr: Bu 20k wei'lere ek olarak, sıralayıcı tarafından yürütülen L1HandlerTransaction herhangi bir hesaba bağlı olmadığından (mesaj L1), mesajınızın deserialize edilmesi ve L2'de işlenmesi için L1'de yeterli ücret ödediğinizden emin olmalısınız.
zh_cn: 除了这些`20kwei'外,由于定序器执行的`L1Handler Transaction'与任何账户(电文来自L1)没有联系(电文来自L1),你还必须确保支付足够的L1费用,使您的电文在L2上被解密和处理。

source: The fees of the `L1HandlerTransaction` are computed in a regular manner as it would be done for an `Invoke` transaction. For this, you can profile the gas consumption using `starkli` or `snforge` to estimate the cost of your message execution.
es: Los honorarios de la `L1HandlerTransaction` se calculan de manera regular como se haría para una transacción `Invoke`. Para ello, puede perfilar el consumo de gas usando `starkli` o `snforge` para estimar el costo de la ejecución de su mensaje.
fr: Les frais de la `L1HandlerTransaction` sont calculés de manière régulière comme il serait fait pour une transaction `Invoke`. Pour cela, vous pouvez profiler la consommation de gaz en utilisant `starkli` ou `snforge` pour estimer le coût de l'exécution de votre message.
id: Biaya dari L1 HandlerTransaction dihitung secara teratur seperti yang akan dilakukan untuk transaksi invoke.
tr: L1HandlerTransaction ücretleri, bir Invoke işlemi için yapılacağı gibi düzenli bir şekilde hesaplanır. Bunun için, mesaj yürütmenizin maliyetini tahmin etmek için starkli veya snforge kullanarak gaz tüketimini profilleyebilirsiniz.
zh_cn: `L1Handler Transaction'的费用是按对`Invoke'交易的定期计算,为此,您可以用`sharkli'或`Snforge'来估计信息执行费用,来描述气体消耗情况。

source: The signature of the `sendMessageToL2` is:
es: La firma del `enviar MensajeToL2` es:
fr: La signature du `sendMessageToL2` est:
id: Tanda tangan dari 'posedMessageToL2' adalah:
tr: sendMessageToL2 imzası şu şekildedir:
zh_cn: `发送邮件至L2'的签名是:

source: The parameters are as follows:
es: Los parámetros son los siguientes:
fr: Les paramètres sont les suivants:
id: Parameter sebagai berikut:
tr: Parametreler aşağıdaki gibidir:
zh_cn: 参数如下:

source: `toAddress`: The contract address on L2 that will be called.
es: `toAddress`: La dirección del contrato en L2 que se llamará.
fr: `toAddress`: L'adresse du contrat sur L2 qui sera appelé.
id: Alamat kontrak di L2 yang akan disebut.
tr: toAddress: L2'de çağrılacak olan sözleşme adresi.
zh_cn: `联系':将调用L2的合同地址。

source: `selector`: The selector of the function of this contract at `toAddress`. This selector (function) must have the `#[l1_handler]` attribute to be callable.
es: `selector`: El selector de la función de este contrato en `toAddress`. Este selector (función) debe tener el atributo `[l1_handler]` para ser llamado.
fr: `selector`: Le sélecteur de la fonction de ce contrat à `toAddress`. Ce sélecteur (fonction) doit avoir l'attribut `#[l1_handler]` à appeler.
id: Selektor: Pemilih dari fungsi kontrak ini pada ▪to Alamat. Selektor ini (fungsi) harus memiliki atribut yang dapat dipanggil.
tr: selector: Bu sözleşmenin toAddress işlevinin seçicisi. Bu seçici (fonksiyon) #[l1_handler] özniteliğine sahip olmalıdır.
zh_cn: `选择方':本合同在`toAddress'的函数选择方。此选择方( 函数) 必须具有{[l1_ handler] 属性可调用 。

source: `payload`: The payload is always an array of `felt252` (which are represented by `uint256` in Solidity). For this reason we've inserted the input `myFelt` into the array. This is why we need to insert the input data into an array.
es: `payload`: La payload es siempre una matriz de `felt252` (que están representados por `uint256` en Solidity). Por esta razón hemos insertado la entrada `myFelt` en el array. Es por eso que necesitamos insertar los datos de entrada en un array.
fr: `payload`: La charge utile est toujours un tableau de `felt252` (qui sont représentés par `uint256` dans Solidity). Pour cette raison, nous avons inséré l`entrée `myFelt` dans le tableau. C`est pourquoi nous devons insérer les données d`entrée dans un tableau.
id: Untuk alasan ini kita masukkan inputnya ke dalam array ini sebabnya kita perlu memasukkan data input ke dalam susunan.
tr: payload: Yük her zaman bir felt252 dizisidir (Solidity'de uint256 ile temsil edilir). Bu nedenle myFelt girdisini diziye ekledik. Bu yüzden girdi verilerini bir diziye sokmamız gerekiyor.
zh_cn: `有效载荷':有效载荷始终是`felt252'的阵列(由`inut256'在“固体”中表示),因此,我们已将输入的`myFelt'插入阵列,这就是为什么我们需要将输入的数据插入阵列的原因。

source: On the Starknet side, to receive this message, we have:
es: En el lado de Starknet, para recibir este mensaje, tenemos:
fr: Du côté de Starknet, pour recevoir ce message, nous avons :
id: Di sisi Starknet, untuk menerima pesan ini, kita punya:
tr: Starknet tarafında, bu mesajı almak için, elimizde:
zh_cn: 在史塔克内特那边,为了接收这个信息,我们有:

source: // You can now use the data, automatically deserialized from the message payload.
es: // Ahora puede utilizar los datos, automáticamente deserializados de la carga útil del mensaje.
fr: // Vous pouvez maintenant utiliser les données, automatiquement désérialisées à partir de la charge utile du message.
id: //Anda sekarang dapat menggunakan data, otomatis deserialisasi dari muatan pesan.
tr: // Artık ileti yükünden otomatik olarak deserialize edilmiş verileri kullanabilirsiniz.
zh_cn: / 你现在可以使用数据,自动从电文有效载荷中解密。

source: We need to add the `#[l1_handler]` attribute to our function. L1 handlers are special functions that can only be executed by a `L1HandlerTransaction`. There is nothing particular to do to receive transactions from L1, as the message is relayed by the sequencer automatically. In your `#[l1_handler]` functions, it is important to verify the sender of the L1 message to ensure that our contract can only receive messages from a trusted L1 contract.
es: Tenemos que añadir el atributo "[l1_handler]` a nuestra función. Los manejadores L1 son funciones especiales que solo pueden ser ejecutadas por una `L1HandlerTransaction`. No hay nada en particular que hacer para recibir transacciones de L1, ya que el mensaje es transmitido automáticamente por el secuenciador. En sus funciones `[l1_handler]`, es importante verificar el remitente del mensaje L1 para asegurarse de que nuestro contrato solo puede recibir mensajes de un contrato de confianza L1.
fr: Nous devons ajouter l'attribut `#[l1_handler]` à notre fonction. Les gestionnaires L1 sont des fonctions spéciales qui ne peuvent être exécutées que par un `L1HandlerTransaction`. Il n'y a rien de particulier à faire pour recevoir des transactions de L1, car le message est relayé automatiquement par le séquenceur. Dans vos fonctions `#[l1_handler]`, il est important de vérifier l'expéditeur du message L1 pour s'assurer que notre contrat ne peut recevoir que des messages d'un contrat L1 de confiance.
id: Kita perlu menambahkan atribut fungsi kita. L1 handlerTransaction. Tidak ada yang dapat dilakukan untuk menerima transaksi dari L1, pesan yang disampaikan oleh pengurut secara otomatis. Dalam fungsi Anda, penting untuk memverifikasi pengirim pesan L1 untuk memastikan bahwa kontrak kami hanya dapat menerima pesan dari kontrak L1 terpercaya.
tr: Fonksiyonumuza #[l1_handler] özniteliğini eklememiz gerekiyor. L1 işleyicileri, yalnızca bir L1HandlerTransaction tarafından çalıştırılabilen özel işlevlerdir. Mesaj, dizileyici tarafından otomatik olarak iletildiği için L1'den işlem almak için özel bir şey yoktur. #[l1_handler] işlevlerinde, yalnızca L1 iletimizin göndericisini güvenilir bir iletinin almasını sağlamak için doğrulamanız önemlidir.
zh_cn: 我们需要在我们函数中添加 {[l1_ handler] 属性 。 L1 处理器是特殊功能,只能通过“ L1Handler Transaction ” 执行。 接收 L1 的交易没有什么特别需要做的, 因为信件由序列器自动传递 。 在您的 {l1_ handler 函数中, 验证 L1 信件的发件人非常重要, 以确保我们的合同只能接收信任的 L1 合同中的信息 。

source: Sending Messages from Starknet to Ethereum
es: Envío de mensajes de Starknet a Ethereum
fr: Envoi de messages de Starknet à Ethereum
id: Mengirim Pesan dari Starknet ke Ethereum
tr: Starknet'ten Ethereum'a Mesaj Gönderme
zh_cn: 将信件从 Starknet 发送到 Etheum
