Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: If you want to play around with Cairo code and see how it compiles into Sierra (Intermediate Representation) and CASM (Cairo Assembly), you can use [cairovm.codes](https://cairovm.codes/) playground.
es: Si quieres jugar con el código de El Cairo y ver cómo se compila en Sierra (Representación Intermedia) y CASM (El Cairo Assembly), puedes usar [cairovm.codes](https://cairovm.codes/).
fr: Si vous voulez jouer avec le code Cairo et voir comment il se compile dans Sierra (représentation intermédiaire) et CASM (Assemblée du Caire), vous pouvez utiliser [cairovm.codes](https://cairovm.codes/) terrain de jeu.
id: Jika Anda ingin bermain-main dengan kode Kairo dan melihat bagaimana hal itu dikompilasi ke Sierra (Intermediate Representation) dan CASM (AsolusiCairo), Anda dapat menggunakan taman bermain [cairovm.codes] 1964https://cairovm/).
tr: Kahire koduyla oynamak ve Sierra (Intermediate Representation) ve CASM (Cairo Assembly) içine nasıl derlendiğini görmek istiyorsanız, [cairovm.codes](https://cairovm.codes/) oyun alanını kullanabilirsiniz.
zh_cn: 如果您想玩弄开罗代码,看它如何编译成Sierra(中间代表)和CASM(开罗大会),您可以使用[cairovm.codes] (https://cairovm.codes/)操场。

source: Foreword
es: Prólogo
fr: Avant-propos
id: Kata pengantar
tr: Önsöz
zh_cn: 前言

source: In 2020, StarkWare released Cairo 0, a Turing-complete programming language supporting verifiable computation. Cairo started as an assembly language and gradually became more expressive. The learning curve was initially steep, as Cairo 0.x was a low-level language that did not entirely abstract the underlying cryptographic primitives required to build a proof for the execution of a program.
es: En 2020, StarkWare lanzó El Cairo 0, un lenguaje de programación completo Turing que soporta la computación verificable. El Cairo comenzó como un lenguaje ensamblador y gradualmente se volvió más expresivo. La curva de aprendizaje fue inicialmente empinada, ya que El Cairo 0.x era un lenguaje de bajo nivel que no abstraía completamente las primitivas criptográficas subyacentes requeridas para construir una prueba para la ejecución de un programa.
fr: En 2020, StarkWare a publié Cairo 0, un langage de programmation complet de Turing supportant un calcul vérifiable. Cairo a commencé comme un langage d'assemblage et progressivement est devenu plus expressif. La courbe d'apprentissage était initialement raide, car Cairo 0.x était un langage de bas niveau qui n'a pas entièrement abstrait les primitives cryptographiques sous-jacents nécessaires pour construire une preuve pour l'exécution d'un programme.
id: Pada 2020, StarkWare merilis Kairo 0, sebuah bahasa pemrograman lengkap yang mendukung komputasi yang dapat diverifikasi. Kairo dimulai sebagai bahasa perakitan dan secara bertahap menjadi lebih ekspresif. kurva pembelajaran awalnya curam, sebagai Kairo 0.x adalah bahasa tingkat rendah yang tidak sepenuhnya abstrak primitif kriptografik yang diperlukan untuk membangun bukti eksekusi sebuah program.
tr: 2020'de StarkWare, doğrulanabilir hesaplamayı destekleyen bir Turing-tam programlama dili olan Cairo 0'ı yayınladı. Kahire bir montaj dili olarak başladı ve yavaş yavaş daha etkileyici hale geldi. Kahire 0.x, bir programın yürütülmesi için bir kanıt oluşturmak için gerekli olan temel kriptografik ilkelleri tamamen soyutlamayan düşük seviyeli bir dil olduğu için öğrenme eğrisi başlangıçta dikti.
zh_cn: 2020年,史塔克瓦雷发布了支持可核查计算的一个图灵完整编程语言“开罗0 ” ( Cairo0 ) 。 开罗以组装语言开始,并逐渐变得更能表达。 学习曲线最初是陡峭的,因为开罗 0.x 是低层次的语言,并不完全抽象建立执行程序证据所需的基本加密原始语言。

source: With the release of Cairo 1, the developer experience has considerably improved, abstracting away the underlying immutable memory model of the Cairo architecture where possible. Strongly inspired by Rust, Cairo 1 has been built to help you create provable programs without specific knowledge of its underlying architecture so that you can focus on the program itself, increasing the overall security of Cairo programs. Powered by a Rust VM, the execution of Cairo programs is now _blazingly_ fast, allowing you to build an extensive test suite without compromising on performance.
es: Con el lanzamiento de Cairo 1, la experiencia del desarrollador ha mejorado considerablemente, abstrayendo el modelo de memoria inmutable subyacente de la arquitectura de El Cairo siempre que sea posible. Fuertemente inspirado en Rust, El Cairo 1 ha sido construido para ayudarle a crear programas demostrables sin conocimiento específico de su arquitectura subyacente para que pueda centrarse en el propio programa, aumentando la seguridad general de los programas de El Cairo. Powered by a Rust VM, the ejecution of Cairo programs is now _blazingly_ fast, lo que le permite construir una amplia suite de pruebas sin comprometer el rendimiento.
fr: Avec la sortie de Cairo 1, l'expérience développeur s'est considérablement améliorée, abstractionnant le modèle de mémoire immuable sous-jacent de l'architecture Cairo lorsque cela est possible. Fortement inspiré par Rust, Cairo 1 a été construit pour vous aider à créer des programmes prouvables sans connaissance spécifique de son architecture sous-jacente afin que vous puissiez vous concentrer sur le programme lui-même, augmentant la sécurité globale des programmes Cairo.
id: Dengan rilis Kairo 1, pengalaman pengembang telah jauh lebih baik, abstrak jauh model memori yang tersembunyi dari arsitektur Kairo di mana mungkin. Sangat terinspirasi oleh Rust, Kairo 1 telah dibangun untuk membantu Anda membuat program provable tanpa pengetahuan spesifik arsitekturnya sehingga Anda dapat fokus pada program itu sendiri, meningkatkan keseluruhan keamanan program Kairo. Powered oleh Rust VM, eksekusi program Kairo sekarang _blazingly_ cepat, memungkinkan Anda untuk membangun suite luas tanpa mengorbankan kinerja.
tr: Kahire 1'in piyasaya sürülmesiyle, geliştirici deneyimi önemli ölçüde gelişti, mümkün olan yerlerde Kahire mimarisinin altında yatan değişmez bellek modelini soyutladı. Rust'tan güçlü bir şekilde ilham alan Kahire 1, temel mimarisi hakkında belirli bir bilgi sahibi olmadan kanıtlanabilir programlar oluşturmanıza yardımcı olmak için inşa edildi, böylece programın kendisine odaklanabilir, Kahire programlarının genel güvenliğini artırabilirsiniz. Bir Rust VM ile güçlendirilmiş, Kahire programlarının yürütülmesi artık kapsamlı bir test oluşturmaya izin vermeden _blazingly_ hızlıdır.
zh_cn: 随着开罗会议1号的发布,开发者的经验有了相当大的改善,尽可能地将开罗会议建筑的基本不可改变的记忆模型抽取出来。 由鲁斯特(Rust)的强烈启发,开罗会议1号的建立是为了帮助您在对其基本结构没有具体了解的情况下创建可验证的方案,以便您能够专注于方案本身,提高开罗方案的总体安全性。 由拉斯特VM(Rust VM)的推动,开罗方案的执行现在已经是快速的,使得您可以在不损及性能的情况下建立一个广泛的测试套件。

source: Blockchain developers that want to deploy contracts on Starknet will use the Cairo programming language to code their smart contracts. This allows the Starknet OS to generate execution traces for transactions to be proved by a prover, which is then verified on Ethereum L1 prior to updating the state root of Starknet.
es: Los desarrolladores de Blockchain que quieran implementar contratos en Starknet utilizarán el lenguaje de programación de El Cairo para codificar sus contratos inteligentes. Esto permite al sistema operativo Starknet generar trazas de ejecución de transacciones para ser probadas por un probador, que luego se verifica en Ethereum L1 antes de actualizar la raíz de estado de Starknet.
fr: Les développeurs de Blockchain qui veulent déployer des contrats sur Starknet utiliseront le langage de programmation du Caire pour coder leurs contrats intelligents. Cela permet au Starknet OS de générer des traces d'exécution pour les transactions à prouver par un prover, qui est ensuite vérifié sur Ethereum L1 avant de mettre à jour la racine d'état de Starknet.
id: Pengembang rantai blok yang ingin menyebarkan kontrak pada Starknet akan menggunakan bahasa pemrograman Kairo untuk mengkode kontrak cerdas mereka. Hal ini memungkinkan Starknet OS untuk menghasilkan jejak eksekusi untuk transaksi yang akan dibuktikan oleh seorang pembukti, yang kemudian diverifikasi pada Etherum L1 sebelum memperbarui akar negara Starknet.
tr: Starknet'te sözleşmeleri dağıtmak isteyen blok zinciri geliştiricileri, akıllı sözleşmelerini kodlamak için Kahire programlama dilini kullanacaklar. Bu, Starknet OS'nin, işlemlerin bir kanıtlayıcı tarafından kanıtlanması için yürütme izleri üretmesine izin verir, bu da daha sonra Starknet'in devlet kökünü güncellemeden önce Ethereum L1'de doğrulanır.
zh_cn: 想要在 Starknet 上部署合同的街区链开发商将使用开罗编程语言来编码他们的智能合同。 这使得 Starknet OS 能够产生执行追踪, 以便由验证人来验证交易, 然后在更新 Starknet 的状态根之前在 Etheum L1 上验证。

source: However, Cairo is not only for blockchain developers. As a general purpose programming language, it can be used for any computation that would benefit from being proved on one computer and verified on other machines with lower hardware requirements.
es: Sin embargo, El Cairo no es sólo para desarrolladores de blockchain. Como un lenguaje de programación de propósito general, se puede utilizar para cualquier cálculo que se beneficiaría de ser probado en un ordenador y verificado en otras máquinas con menores necesidades de hardware.
fr: Cependant, Le Caire n'est pas seulement pour les développeurs de blockchain. En tant que langage de programmation d'usage général, il peut être utilisé pour tout calcul qui bénéficierait d'être prouvé sur un ordinateur et vérifié sur d'autres machines avec des exigences matérielles plus faibles.
id: Namun, Kairo tidak hanya untuk pengembang rantai blok. dapat digunakan untuk setiap komputasi yang akan bermanfaat dengan satu komputer dan diverifikasi pada mesin lain dengan persyaratan perangkat keras yang lebih rendah.
tr: Bununla birlikte, Kahire sadece blok zinciri geliştiricileri için değildir. Genel amaçlı bir programlama dili olarak, bir bilgisayarda kanıtlanmaktan ve daha düşük donanım gereksinimlerine sahip diğer makinelerde doğrulanmaktan yararlanacak herhangi bir hesaplama için kullanılabilir.
zh_cn: 然而,开罗不仅适用于铁链开发商,而且作为一种通用编程语言,它可以用于任何计算,只要在一台计算机上得到验证,并在硬件需求较低的其他机器上得到验证,就可以从中受益。

source: This book is designed for developers with a basic understanding of programming concepts. It is a friendly and approachable text intended to help you level up your knowledge of Cairo, but also help you develop your programming skills in general. So, dive in and get ready to learn all there is to know about Cairo!
es: Este libro está diseñado para desarrolladores con una comprensión básica de los conceptos de programación. Es un texto amigable y accesible destinado a ayudarle a nivelar sus conocimientos de El Cairo, pero también ayudarle a desarrollar sus habilidades de programación en general. Por lo tanto, bucear y prepararse para aprender todo lo que hay que saber sobre El Cairo!
fr: Ce livre est conçu pour les développeurs avec une compréhension de base des concepts de programmation. C'est un texte amical et accessible destiné à vous aider à mettre à niveau vos connaissances du Caire, mais aussi vous aider à développer vos compétences de programmation en général.
id: Buku ini dirancang untuk pengembang dengan pemahaman dasar tentang konsep pemrograman adalah teks yang ramah dan mudah didekati untuk membantu Anda meningkatkan pengetahuan Anda tentang Kairo, tetapi juga membantu Anda mengembangkan keterampilan pemrograman Anda secara umum.
tr: Bu kitap, temel programlama kavramları anlayışına sahip geliştiriciler için tasarlanmıştır. Kahire bilginizi seviyelendirmenize yardımcı olacak, aynı zamanda genel olarak programlama becerilerinizi geliştirmenize yardımcı olacak dostane ve yaklaşılabilir bir metindir. Bu yüzden, dalış yapın ve Kahire hakkında bilmeniz gereken her şeyi öğrenmeye hazır olun!
zh_cn: 这本书是为对编程概念有基本了解的开发者设计的。 它是一个友好和可接近的文本,旨在帮助您提升对开罗的知识水平,同时也帮助您全面发展您的编程技能。 因此, 跳进并准备学习关于开罗的一切知识!

source: Acknowledgements
es: Agradecimientos
fr: Remerciements
id: Pengakuan
tr: Onaylamalar
zh_cn: 鸣谢

source: This book would not have been possible without the help of the Cairo community. We would like to thank every contributor for their contributions to this book!
es: Este libro no habría sido posible sin la ayuda de la comunidad de El Cairo. Nos gustaría dar las gracias a cada contribuyente por sus contribuciones a este libro!
fr: Ce livre n'aurait pas été possible sans l'aide de la communauté du Caire. Nous tenons à remercier tous les contributeurs pour leurs contributions à ce livre!
id: Buku ini tidak akan mungkin tanpa bantuan komunitas Kairo. kami ingin berterima kasih kepada setiap kontributor mereka untuk buku ini!
tr: Bu kitap Kahire toplumunun yardımı olmadan mümkün olmazdı. Bu kitaba katkılarından dolayı her katılımcıya teşekkür etmek isteriz!
zh_cn: 没有开罗社区的帮助,这本书是不可能出版的,我们要感谢每一个捐款者对这本书的贡献!

source: We would like to thank the Rust community for the [Rust Book](https://doc.rust-lang.org/book/), which has been a great source of inspiration for this book. Many examples and explanations have been adapted from the Rust Book to fit the Cairo programming language, as the two languages share many similarities.
es: Nos gustaría dar las gracias a la comunidad Rust por el [Rust Book] (https://doc.rust-lang.org/book/), que ha sido una gran fuente de inspiración para este libro. Muchos ejemplos y explicaciones se han adaptado del Rust Book para adaptarse al lenguaje de programación de El Cairo, ya que los dos idiomas comparten muchas similitudes.
fr: Nous tenons à remercier la communauté Rust pour le [Livre Rust](https://doc.rust-lang.org/book/), qui a été une grande source d'inspiration pour ce livre. De nombreux exemples et explications ont été adaptés du Livre Rust pour s'adapter au langage de programmation du Caire, car les deux langues partagent de nombreuses similitudes.
id: Kami ingin mengucapkan terima kasih kepada komunitas Rust untuk [Buku Rusia][Ruthttps://doc.rust-lang/book/), yang telah menjadi sumber inspirasi yang besar untuk buku ini. banyak contoh dan penjelasan telah disesuaikan dari Rust Book untuk cocok dengan bahasa pemrograman Kairo, sebagai dua bahasa berbagi banyak kesamaan.
tr: Bu kitap için büyük bir ilham kaynağı olan [Rust Book](https://doc.rust-lang.org/book/) için Rust topluluğuna teşekkür etmek istiyoruz. İki dil birçok benzerliği paylaştığından, Rust Book'tan Kahire programlama diline uyacak şekilde birçok örnek ve açıklama uyarlanmıştır.
zh_cn: 我们要感谢鲁斯特社区编写了[鲁斯特书](https://doc.rust-lang.org/book/),这是这本书灵感的源泉,《鲁斯特书》中的许多例子和解释已经改编,以适应开罗编程语言,因为两种语言有许多相似之处。

source: What is Cairo?
es: ¿Qué es El Cairo?
fr: Qu'est-ce que le Caire?
id: Apa itu Kairo?
tr: Kahire nedir?
zh_cn: 什么是开罗?

source: Cairo is a programming language designed for a virtual CPU of the same name. The unique aspect of this processor is that it was not created for the physical constraints of our world but for cryptographic ones, making it capable of efficiently proving the execution of any program running on it. This means that you can perform time consuming operations on a machine you don't trust, and check the result very quickly on a cheaper machine. While Cairo 0 used to be directly compiled to CASM, the Cairo CPU assembly, Cairo 1 is a higher level language. It first compiles to Sierra, an intermediate representation of Cairo which will compile later down to a safe subset of CASM. The point of Sierra is to ensure your CASM will always be provable, even when the computation fails.
es: El Cairo es un lenguaje de programación diseñado para una CPU virtual del mismo nombre. El aspecto único de este procesador es que no fue creado para las limitaciones físicas de nuestro mundo, sino para las criptográficas, lo que lo hace capaz de probar de manera eficiente la ejecución de cualquier programa que se ejecuta en él. Esto significa que usted puede realizar operaciones que consumen tiempo en una máquina en la que no confía, y comprobar el resultado muy rápidamente en una máquina más barata. Mientras El Cairo 0 solía ser compilado directamente a CASM, el conjunto de CPU de El Cairo, El Cairo 1 es un lenguaje de nivel superior. Primero compila a Sierra, una representación intermedia de El Cairo que se compilará más tarde hasta un subconjunto seguro de CASM. El punto de Sierra es asegurar que su CASM siempre será demostrable, incluso cuando el cálculo falla.
fr: Le Caire est un langage de programmation conçu pour un processeur virtuel du même nom. L'aspect unique de ce processeur est qu'il n'a pas été créé pour les contraintes physiques de notre monde mais pour les cryptographiques, ce qui le rend capable de prouver efficacement l'exécution de n'importe quel programme en cours d'exécution. Cela signifie que vous pouvez effectuer des opérations de temps sur une machine que vous n'avez pas confiance, et vérifier le résultat très rapidement sur une machine moins chère. Alors que le Caire 0 était compilé directement à CASM, l'assemblage du CPU du Caire, Le Caire 1 est un langage de niveau supérieur. Il compile d'abord à Sierra, une représentation intermédiaire du Caire qui se compilera plus tard à un sous-ensemble sûr de CASM. Le point de Sierra est de s'assurer que votre CASM sera toujours prouvable, même si le calcul échoue.
id: Kairo adalah bahasa pemrograman yang dirancang untuk CPU virtual dengan nama yang sama. Aspek unik dari prosesor ini adalah bahwa hal itu tidak dibuat untuk kendala fisik dunia kita tetapi untuk kriptonik, membuatnya mampu secara efisien membuktikan eksekusi dari program apapun yang berjalan di atasnya. Ini berarti Anda dapat melakukan operasi memakan waktu pada mesin yang tidak Anda percaya, dan memeriksa hasilnya sangat cepat pada mesin yang lebih murah. Sementara Kairo 0 digunakan untuk secara langsung dikompilasi ke CASM, CPU Kairo, Kairo 1 adalah bahasa tingkat yang lebih tinggi. Ini pertama kali dikompilasi ke Sierra, sebuah representasi intermedia Kairo yang akan dikompilasi ke subM.
tr: Kahire, aynı adı taşıyan sanal bir CPU için tasarlanmış bir programlama dilidir. Bu işlemcinin benzersiz yönü, dünyamızın fiziksel kısıtlamaları için değil, kriptografik olanlar için yaratılmış olması, üzerinde çalışan herhangi bir programın yürütülmesini verimli bir şekilde kanıtlayabilmesidir. Bu, her zaman güvenmediğiniz bir makinede zaman alıcı işlemleri gerçekleştirebileceğiniz ve sonucu daha sonra daha ucuz bir makinede çok hızlı bir şekilde kontrol edebileceğiniz anlamına gelir. Kahire 0, doğrudan CASM'ye derlendiğinde, Kahire'nin bir derlemesidir.
zh_cn: 开罗是一个为同名的虚拟CPU设计的编程语言。 这个处理器的独特之处在于它不是为世界上的物理限制而创建的,而是为加密的限制而创建的,使得它能够有效地证明任何程序正在运行。 这意味着你可以在一个你不信任的机器上进行耗时操作,并且非常迅速地在更便宜的机器上检查结果。 虽然开罗0曾经直接编译给CASM, 开罗CPU大会, 开罗1是更高层次的语言。 它首先编译给Sierra, 后者是开罗的中间代表, 以后将编成CASM的一个安全子。 塞拉利昂的要点是确保您的CASM永远是可行的, 即使计算失败了 。

source: What Can you Do with It?
es: ¿Qué puedes hacer con él?
fr: Qu'est-ce que tu peux en faire?
id: Apa yang Dapat Anda Lakukan dengan Itu?
tr: Bununla ne yapabilirsiniz?
zh_cn: 你能用它做什么?

source: Cairo allows you to compute trustworthy values on untrusted machines. One major usecase is Starknet, a solution to Ethereum scaling. Ethereum is a decentralized blockchain platform that enables the creation of decentralized applications where every single interaction between a user and a d-app is verified by all the participants. Starknet is a Layer 2 built on top of Ethereum. Instead of having all the participants of the network to verify all user interactions, only one node, called the prover, executes the programs and generates proofs that the computations were done correctly. These proofs are then verified by an Ethereum smart contract, requiring significantly less computational power compared to executing the interactions themselves. This approach allows for increased throughput and reduced transaction costs while preserving Ethereum security.
es: El Cairo le permite calcular valores confiables en máquinas no de confianza. Un caso de uso importante es Starknet, una solución para escalar Ethereum. Ethereum es una plataforma de blockchain descentralizada que permite la creación de aplicaciones descentralizadas donde cada interacción entre un usuario y una aplicación d es verificada por todos los participantes. Starknet es una capa 2 construida encima de Ethereum. En lugar de tener todos los participantes de la red para verificar todas las interacciones de usuario, sólo un nodo, llamado el probador, ejecuta los programas y genera pruebas de que los cálculos se hicieron correctamente. Estas pruebas son verificadas por un contrato inteligente Ethereum, que requiere significativamente menos potencia computacional en comparación con la ejecución de las interacciones en sí. Este enfoque permite aumentar el rendimiento y reducir los costos de transacción mientras se preserva la seguridad de Ethereum.
fr: Le Caire vous permet de calculer des valeurs fiables sur des machines non fiables. L'une des principales applications est Starknet, une solution à l'échelle Ethereum. Ethereum est une plate-forme de blockchain décentralisée qui permet la création d'applications décentralisées où chaque interaction entre un utilisateur et une application d est vérifiée par tous les participants. Starknet est un Layer 2 construit sur le dessus d'Ethereum. Au lieu d'avoir tous les participants du réseau pour vérifier toutes les interactions utilisateur, un seul noeud, appelé le prover, exécute les programmes et génère des preuves que les calculs ont été effectués correctement. Ces preuves sont ensuite vérifiées par un contrat Ethereum smart, nécessitant beaucoup moins de puissance computationnelle par rapport à l'exécution des interactions elles-mêmes. Cette approche permet d'augmenter le débit et de réduire les coûts de transaction tout en préservant la sécurité Ethereum.
id: Kairo memungkinkan Anda untuk menghitung nilai-nilai yang dapat dipercaya pada mesin yang tidak dipercaya. Satu interaksi besar adalah Starknet, solusi untuk skala Ethereum. Etherum adalah platform rantai blok terdesentralisasi yang memungkinkan penciptaan aplikasi terdesentralisasi di mana setiap interaksi utama antara pengguna dan d-app diverifikasi oleh semua partisipan. Starknet adalah Layer 2 dibangun di atas Etherum. Daripada memiliki semua partisipan jaringan untuk memverifikasi semua interaksi pengguna, hanya satu node, yang disebut pembukti, jalankan program dan menghasilkan bukti bahwa perhitungan dilakukan dengan benar. Ini bukti yang diverifikasi oleh Eum maka sebuah kontrak yang cerdas, membutuhkan lebih sedikit kemampuan untuk mengeksekusi diri mereka sendiri melalui pendekatan keamanan sementara untuk menghemat biaya keamanan.
tr: Kahire, güvenilir olmayan makinelerde güvenilir değerleri hesaplamanıza izin verir. Önemli bir kullanım durumu, Ethereum ölçeklendirmesi için bir çözüm olan Starknet'tir. Ethereum, bir kullanıcı ve bir d-app arasındaki her bir etkileşimin tüm katılımcılar tarafından doğrulandığı merkezi olmayan uygulamaların oluşturulmasını sağlayan merkezi olmayan bir blok zinciri platformudur. Starknet, Ethereum'un üzerine inşa edilmiş bir Katman 2'dir. Tüm kullanıcı etkileşimlerini doğrulamak için ağın tüm katılımcılarına sahip olmak yerine, kanıtlayıcı olarak adlandırılan güç etkileşimlerini gerçekleştirir ve uygular.
zh_cn: 开罗允许您在不受信任的机器上计算可信赖的值。 一个主要使用方是 Starknet, 这是 Ethereum 缩放的解决方案 。 Eceenum 是一个分散式的连锁平台, 能够创建分散式应用程序, 让所有参与者都对用户和 d- ap 进行校验。 Starknet 是位于 Etheum 上方的第二层。 Starknet 不是让网络的所有参与者来核查所有用户的相互作用, 而是让网络的所有参与者来核查一个节点, 叫做验证者, 执行程序, 并生成计算正确无误的证明。 这些证明随后由 Eceenum 智能合同进行验证, 与执行互动本身相比, 要求的计算能力要少得多 。 这种方法允许在保护 Etheen 安全的同时增加吞吐量和降低交易成本 。

source: What Are the Differences with Other Programming Languages?
es: ¿Cuáles son las diferencias con otros idiomas de programación?
fr: Quelles sont les différences avec les autres langues de programmation?
id: Apa Perbedaannya dengan Bahasa Pemrograman Lainnya?
tr: Diğer Programlama Dilleri Arasındaki Farklar Nelerdir?
zh_cn: 与其他节目语言有什么不同?
