Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: In our context `ComponentState<TContractState>` is a type specific to the ownable component, i.e. it has members based on the storage variables defined in `ownable_component::Storage`. Moving from the generic `TContractState` to `ComponentState<TContractState>` will allow us to embed `Ownable` in any contract that wants to use it. The opposite direction (`ComponentState<TContractState>` to `ContractState`) is useful for dependencies (see the `Upgradeable` component depending on an `IOwnable` implementation example in the [Components dependencies ](./ch16-02-02-component-dependencies.md) section).
es: En nuestro contexto, `ComponentState<TContractState` es un tipo específico del componente propio, es decir, tiene miembros basados en las variables de almacenamiento definidas en `ownable_component::Storage`. El paso del `TContractState` genérico a `ContractState` genérico nos permitirá insertar `Ownable` en cualquier contrato que desee utilizarlo. La dirección opuesta (`ComponentState<TContractState` a `ContractState`) es útil para las dependencias (véase el componente `Actualable` dependiendo de un ejemplo de aplicación `Iownable` en la sección [Dependencias de los componentes](./ch16-02-02-component-dependencias.md)).
fr: Dans notre contexte, `ComponentState<TContractState>` est un type spécifique à la composante propre, c'est-à-dire qu'il a des membres basés sur les variables de stockage définies dans `ownable_component::Storage`. Le passage de `TContractState` générique à `ComponentState<TContractState>` nous permettra d'intégrer `Ownable` dans tout contrat qui veut l'utiliser. La direction opposée (`ComponentState<TContractState>` à `ContractState`) est utile pour les dépendances (voir la composante `Upgradable` en fonction d'un exemple d'implémentation `IOwnable` dans la section [Components dependences ](./ch16-02-02-component-dependences.md).
id: Dalam konteks kami, anggota-anggota yang didasarkan pada variabel penyimpanan yang dapat dimiliki oleh<TContractState> adalah tipe spesifik untuk komponen yang dapat dimiliki, misalnya. Ia memiliki anggota-anggota yang didasarkan pada variabel penyimpanan yang dapat dimiliki: Komponen. Pindah dari product umum (Kontraktate <ConponentState> ke <Kontract> untuk bergantung pada komponen yang dapat diembangkan (memperankan ánabel dalam setiap kontrak yang ingin menggunakannya.
tr: İçeriğimizde ComponentStateTContractState>, ownable_component::Storage'da tanımlanan depolama değişkenlerine dayanan bir türdür. Genel TContractState'den ComponentStateTContractState>'a (ComponentState) herhangi bir sözleşmede Ownable'ı yerleştirmemize izin verecektir.
zh_cn: 就我们而言,`Compentate <Ttract State'`Compentate <Ttract State'`Confentate <Ttract State\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: To put it briefly, one should think of an implementation of the above `HasComponent<T>` as saying: **“Contract whose state T has the upgradeable component”.**
es: Para decirlo brevemente, uno debe pensar en una implementación de lo anterior `TieneComponente<T® como diciendo: **“Contrato cuyo estado T tiene el componente actualizable”.**
fr: Pour le dire brièvement, on devrait penser à une mise en œuvre de la "HasComponent<T>" ci-dessus comme disant: **=Contract dont l'état T a la composante upgradable.**
id: Untuk mengatakannya secara singkat, seseorang harus memikirkan implementasi dari di atas <T> sebagaimana dikatakan: ** Kontract yang negara bagian T memiliki komponen yang dapat diupgrade.**
tr: Kısaca söylemek gerekirse, yukarıdaki HasComponentT> uygulamasının şöyle bir şekilde uygulanması düşünülmelidir: ** "T durumu yükseltilebilir bileşene sahip olan Contract".**
zh_cn: 简而言之,人们应该将上述`Has Concononent <T'的执行情况看作是说:** " 其状态T具有可升级组成部分的合同 " 。 **

source: `Ownable` is annotated with the `embeddable_as(<name>)` attribute:
es: `Ownable` está anotado con el atributo `embeddable_as(<name>)`:
fr: `Ownable` est annoté avec l'attribut `embeddable_as(<name>)`:
id: Anote dengan atribut yang dapat dibenturkan_as○<name>):
tr: Ownable, embeddable_as(name>) özniteliği ile belirtilir:
zh_cn: `Ownable'带有`embedable_as( <name>)'属性的附加说明:

source: `embeddable_as` is similar to `embeddable`; it only applies to impls of `starknet::interface` traits and allows embedding this impl in a contract module. That said, `embeddable_as(<name>)` has another role in the context of components. Eventually, when embedding `OwnableImpl` in some contract, we expect to get an impl with the following functions:
es: `embeddable_as` es similar a `embeddable`; sólo se aplica a los impls de `starknet::interface` rasgos y permite insertar este impl en un módulo de contrato. Dicho esto, `embeddable_as(<name>)` tiene otro papel en el contexto de los componentes. Eventualmente, al incorporar `OwnableImpl` en algún contrato, esperamos obtener un impl con las siguientes funciones:
fr: `embeddable_as` est similaire à `embeddable`; il ne s'applique qu'aux impls de caractères `starknet::interface` et permet d'intégrer cette impl dans un module de contrat. Cela dit, `embeddable_as(<name>)` a un autre rôle dans le contexte des composants. Finalement, lors de l'intégration de `OwnableImpl` dans un contrat, nous nous attendons à obtenir une impl avec les fonctions suivantes:
id: Ini hanya berlaku untuk impls dari Ástarknet::interface muffile dan memungkinkan embedding ini impl dalam modul kontrak. Yang mengatakan, ·embedable_as Allahume>) hanya memiliki peran lain dalam konteks komponen. Akhirnya, ketika embedding ·OwableImpplum dalam beberapa kontrak, kami berharap untuk mendapatkan sebuah impl dengan fungsi berikut:
tr: embeddable_as, embeddable'a benzer; sadece starknet:interface özellikleri için geçerlidir ve bu impl'yi bir sözleşme modülüne yerleştirmeye izin verir. Bununla birlikte, embeddable_as(name>) bileşenlerin bağlamında başka bir role sahiptir. Sonunda, bazı sözleşmelerde OwnableImpl gömülürken, aşağıdaki işlevleri almayı bekliyoruz:
zh_cn: `emeddable_as'与`embedable'类似;它只适用于`tarknet::Interface'特性,允许在合同模块中嵌入这种隐蔽,也就是说,`emeddable_as( <name>)'在组件方面还有另一个作用。

source: Note that while starting with a function receiving the generic type `ComponentState<TContractState>`, we want to end up with a function receiving `ContractState`. This is where `embeddable_as(<name>)` comes in. To see the full picture, we need to see what is the impl generated by the compiler due to the `embeddable_as(Ownable)` annotation:
es: Tenga en cuenta que al comenzar con una función que recibe el tipo genérico `ComponentState<TContractState®, queremos terminar con una función que recibe `ContractState`. Aquí es donde entra `embeddable_as(<name>)`. Para ver la imagen completa, necesitamos ver cuál es el impl generado por el compilador debido a la anotación `embeddable_as(Ownable)`:
fr: Notez que tout en commençant par une fonction recevant le type générique `ComponentState<TContractState>`, nous voulons finir par une fonction recevant `ContractState`. C'est là que `embeddable_as(<name>)` entre en jeu. Pour voir l'image complète, nous devons voir ce qui est l'impl généré par le compilateur en raison de l'annotation `embeddable_as(Ownable)`:
id: Perhatikan bahwa ketika dimulai dengan sebuah fungsi menerima jenis generik. Ini adalah di mana 'CombuntState<name>' datang. Untuk melihat gambaran lengkap, kita perlu melihat apa yang impl yang dihasilkan oleh kompiler karena embedable_progenable_otifable) annotasi:
tr: ComponentStateTContractState> jenerik türünü alan bir fonksiyonla başlarken, ContractState alan bir fonksiyonla bitirmek istediğimizi unutmayın. embeddable_as(name>) burada devreye girer. Tam resmi görmek için, derleyicinin embeddable_as(Own):
zh_cn: 请注意,在开始接收通用类型`Component State <Ttract State'的函数时,我们希望最终拥有接收`缔约国'的函数。这是`emeddable_as (<name>)'进入该函数的地方。要看到全景,我们需要看到由于`emeddable_as(Ownable)'a注解而由编译者生成的内线是什么:

source: Note that thanks to having an impl of `HasComponent<TContractState>`, the compiler was able to wrap our functions in a new impl that doesn’t directly know about the `ComponentState` type. `Ownable`, whose name we chose when writing `embeddable_as(Ownable)`, is the impl that we will embed in a contract that wants ownership.
es: Tenga en cuenta que gracias a tener un impl de `HasComponent<TContractState®, el compilador fue capaz de envolver nuestras funciones en un nuevo impl que no sabe directamente sobre el tipo `ComponentState`. `Ownable`, cuyo nombre elegimos al escribir `embeddable_as(Ownable)`, es el impl que vamos a insertar en un contrato que quiere propiedad.
fr: Notez que grâce à un impl de `HasComponent<TContractState>`, le compilateur a pu envelopper nos fonctions dans une nouvelle impl qui ne sait pas directement sur le type `ComponentState`. `Ownable`, dont nous avons choisi le nom lors de l'écriture `embeddable_as(Ownable)`, est l'impl que nous intégrerons dans un contrat qui veut la propriété.
id: Perhatikan bahwa terima kasih untuk memiliki impl baru yang tidak langsung tahu tentang tipe COponent<TContractState>, yang namanya kita pilih ketika menulis Éembedtable_asánable), adalah impl yang akan kita masukkan ke dalam kontrak yang ingin dimiliki.
tr: HasComponentTContractState> impl'sine sahip olması sayesinde, derleyici, fonksiyonlarımızı ComponentState tipini doğrudan bilmeyen yeni bir impl'ye sarabildi. embeddable_as(Ownable) yazarken adını seçtiğimiz Ownable, sahiplik isteyen bir sözleşmeye yerleştireceğimiz impl'dir.
zh_cn: 请注意,由于`HasComponent <Ttract State'``HasComponent <Ttractstate'' `HasComponent <Ttracture'`Taccess State'`Twonable'的暗号,编译者得以把我们的功能包装成一个新的暗号,它并不直接了解`Compent State'的类型。 `Ownable ',我们在写`embeddobable_as(Ownnable)'时选择的名称,是我们希望所有权的合同中的暗号。

source: Contract Integration
es: Integración contractual
fr: Intégration des contrats
id: Integrasi Kontrak
tr: Sözleşme Entegrasyonu
zh_cn: 合同一体化

source: We've seen how generic impls enable component reusability. Next let's see how a contract integrates a component.
es: Hemos visto cómo los impls genéricos permiten la reutilizabilidad de los componentes. A continuación vamos a ver cómo un contrato integra un componente.
fr: Nous avons vu comment les impls génériques permettent la réutilisation des composants. Voyons ensuite comment un contrat intègre un composant.
id: Selanjutnya mari kita lihat bagaimana kontrak mengintegrasikan komponen.
tr: Jenerik impls'in bileşen yeniden kullanılabilirliğini nasıl sağladığını gördük. Daha sonra bir sözleşmenin bir bileşeni nasıl entegre ettiğini görelim.
zh_cn: 我们已看到通用内分解是如何使组件可再使用。接下来让我们看看合同如何结合组件。

source: The contract uses an **impl alias** to instantiate the component's generic impl with the concrete `ContractState` of the contract.
es: En el contrato se utiliza un alias **impl** para presentar la impresión genérica del componente con el concreto `Contract State'del contrato.
fr: Le contrat utilise un alias **impl** pour présenter l'impl générique de l'élément avec l'"État contractant" concret du contrat.
id: Kontrak menggunakan **impl alias** untuk mempercepat impl generik komponen dengan beton contractState_BAR_ dari kontrak.
tr: Sözleşme, bileşenin genel impl'sini sözleşmenin beton ContractState ile anlık hale getirmek için **impl takma adını ** kullanır.
zh_cn: 合同使用“简略别名**”来将部件与合同的混凝土`缔约国'的通用分解立即化。

source: The above lines use the Cairo impl embedding mechanism alongside the impl alias syntax. We’re instantiating the generic `OwnableImpl<TContractState>` with the concrete type `ContractState`. Recall that `OwnableImpl<TContractState>` has the `HasComponent<TContractState>` generic impl parameter. An implementation of this trait is generated by the `component!` macro.
es: Las líneas anteriores utilizan el mecanismo de inserción de El Cairo junto con la sintaxis de impl alias. Estamos instaurando el genérico `OwnableImpl<TContractState® con el tipo de concreto `ContractState`. Recordemos que `OwnableImpl<TContractState® tiene el parámetro genérico `HasComponent<TContractState®. Una implementación de este rasgo es generada por el macro `component!`.
fr: Les lignes ci-dessus utilisent le mécanisme d'intégration du Caire à côté de la syntaxe impl alias. Nous sommes en train d'actualiser le générique `OwnableImpl<TContractState>` avec le type de béton `ContractState`. Rappelez-vous que `OwnableImpl<TContractState>` a le paramètre `HasComponent<TContractState>` générique impl. Une implémentation de ce caractère est générée par la macro `component!`.
id: Garis-garis di atas menggunakan mekanisme pemasangan Kairo bersamaan dengan sintaks impl alias. Kami langsung menggunakan generic <TContractIplp<TContractState> dengan tipe beton <Contractstate. Sebuah implmeter yang dihasilkan oleh makro!
tr: Yukarıdaki satırlar, impl takma sözdiziminin yanında Kahire impl yerleştirme mekanizmasını kullanır. OwnableImplTContractState> jenerik ContractState beton tipi ile anlık hale getiriyoruz. OwnableImplTContractState>'nin HasComponentTContractState> jenerik impl parametresine sahip olduğunu hatırlayın.
zh_cn: 上述线条使用开罗隐性嵌入机制与隐性别名词语法并用。我们正在将通用的“Ownable Impl <tract State ” 与具体类型的“Part State ” 同步,回顾“Ownable Impl <Ttract State ” 拥有“Has Concomonent <Ttract State ” 通用隐性参数。这种特性的实施是由“组成部分!” 宏产生的。

source: Note that only the using contract could have implemented this trait since only it knows about both the contract state and the component state.
es: Tenga en cuenta que sólo el contrato de uso podría haber implementado este rasgo ya que sólo sabe sobre el estado del contrato y el estado del componente.
fr: Il convient de noter que seul le contrat d'utilisation aurait pu mettre en œuvre ce caractère, car seul il connaît à la fois l'état du contrat et l'état de l'élément.
id: Perhatikan bahwa hanya menggunakan kontrak yang dapat menerapkan sifat ini karena hanya dia yang tahu tentang keadaan kontrak dan kondisi komponen.
tr: Sadece kullanım sözleşmesinin bu özelliği uygulayabileceğini unutmayın, çünkü sadece sözleşme durumu ve bileşen durumu hakkında bilgi sahibidir.
zh_cn: 请注意,只有使用合同才能实施这一特性,因为只有使用合同方既了解合同状况,又了解合同的构成状态。

source: This glues everything together to inject the component logic into the contract.
es: Esto pega todo para inyectar la lógica del componente en el contrato.
fr: Cela colle tout ensemble pour injecter la logique des composants dans le contrat.
id: Ini lem semuanya bersama-sama untuk menyuntikkan logika komponen ke dalam kontrak.
tr: Bu, bileşen mantığını sözleşmeye enjekte etmek için her şeyi birbirine yapıştırır.
zh_cn: 这把所有东西粘在一起 将部件逻辑输入到合同中

source: Key Takeaways
es: Llaves para llevar
fr: Prises en charge des clés
id: Takeaway Kunci
tr: Anahtar Takeaways
zh_cn: 密钥外出

source: Embeddable impls allow injecting components logic into contracts by adding entry points and modifying the contract ABI.
es: Los impls integrables permiten inyectar componentes lógicos en los contratos añadiendo puntos de entrada y modificando el contrato ABI.
fr: Les imples intégrables permettent la logique des composants d'injection dans les contrats en ajoutant des points d'entrée et en modifiant le contrat ABI.
id: Terbenamkan impls memungkinkan menyuntikkan komponen logika ke dalam kontrak dengan menambahkan titik masuk dan memodifikasi kontrak ABI.
tr: Gömülü impls, giriş noktaları ekleyerek ve sözleşmeyi değiştirerek bileşenlerin mantığını sözleşmelere enjekte etmeye izin verir.
zh_cn: 可嵌入的不规则通过增加切入点和修改ABI合同,使合同中包含的成分具有逻辑性。

source: The compiler automatically generates a `HasComponent` trait implementation when a component is used in a contract. This creates a bridge between the contract's state and the component's state, enabling interaction between the two.
es: El compilador genera automáticamente un rasgo de `HasComponent` cuando un componente se utiliza en un contrato, lo que crea un puente entre el estado del contrato y el estado del componente, permitiendo la interacción entre ambos.
fr: Le compilateur génère automatiquement une implémentation de caractère `HasComponent` lorsqu'un composant est utilisé dans un contrat, ce qui crée un pont entre l'état du contrat et l'état du composant, permettant l'interaction entre les deux.
id: Secara otomatis, kompiler secara otomatis menghasilkan sebuah implementasi sifat åSCoponenté ketika sebuah komponen digunakan dalam sebuah kontrak. Hal ini menciptakan sebuah jembatan antara negara kontrak dan negara komponen, memungkinkan interaksi antara keduanya.
tr: Derleyici, bir sözleşmede bir bileşen kullanıldığında otomatik olarak bir HasComponent özellik uygulaması oluşturur. Bu, sözleşmenin durumu ile bileşenin durumu arasında bir köprü oluşturarak ikisi arasındaki etkileşimi sağlar.
zh_cn: 汇编器自动生成“在合同中使用某一部件时,是否具有特性的履行”,从而在合同的状况和组成部分的状况之间架起桥梁,使两者之间能够相互作用。

source: Components encapsulate reusable logic in a generic, contract-agnostic way. Contracts integrate components through impl aliases and access them via the generated `HasComponent` trait.
es: Los componentes encapsulan la lógica reutilizable de manera genérica y agnóstica: los contratos integran componentes mediante alias y acceden a ellos a través del rasgo generado " HasComponent ".
fr: Les composants encapsulent la logique réutilisable d'une manière générique, contract-agnostic. Les contrats intègrent les composants par des alias impl et y accèdent via le caractère généré `HasComponent`.
id: Komponen merangkumkan logika yang dapat digunakan ulang dengan cara yang generik, agnostik kontrak. Kontrak mengintegrasikan komponen melalui alias impl dan mengaksesnya melalui sifat yang dihasilkan.
tr: Bileşenler, yeniden kullanılabilir mantığı genel, sözleşme-agnostik bir şekilde kapsüller. Sözleşmeler, bileşenleri impl takma adlarıyla bütünleştirir ve oluşturulan HasComponent özelliği ile bunlara erişir.
zh_cn: 合同以通用的、合同不可知的方式将部件整合为可重复使用的逻辑,合同通过插管别名将部件整合为一体,并通过生成的 " 是否具有 " 特性获取这些部件。

source: Components build on embeddable impls by defining generic component logic that can be integrated into any contract wanting to use that component. Impl aliases instantiate these generic impls with the contract's concrete storage types.
es: Los componentes se basan en impls incrustables mediante la definición de la lógica genérica de componentes que puede integrarse en cualquier contrato que desee utilizar ese componente. Implicar alias instanciar estos impls genéricos con los tipos de almacenamiento de hormigón del contrato.
fr: Components build on embeddable impls by definition general component logique that can be integrated in any contract want to use this component. Impl alias inconcevable ces impls génériques avec les types de stockage en béton du contrat.
id: Komponen membangun pada impls yang dapat dibenamkan dengan mendefinisikan logika komponen generik yang dapat diintegrasikan ke dalam kontrak apapun yang ingin menggunakan komponen tersebut. Nama alias Implate instantate ini impls generik dengan tipe penyimpanan konkrit kontrak.
tr: Bileşenler, bu bileşeni kullanmak isteyen herhangi bir sözleşmeye entegre edilebilen jenerik bileşen mantığını tanımlayarak yerleştirilebilir impls üzerine inşa edilir. Impl takma adları, bu jenerik impls'leri sözleşmenin beton depolama türleriyle anlıklaştırır.
zh_cn: 部件以嵌入的内分泌内分泌为基础,界定通用部件逻辑,可以纳入任何希望使用该部件的合同。 隐含化别名,将这些通用内分泌与合同的混凝土储存类型同步。

source: Working with components becomes more complex when we try to use one component inside another. As mentioned earlier, a component can only be embedded within a contract, meaning that it's not possible to embed a component within another component. However, this doesn't mean that we can't use one component inside another. In this section, we will see how to use a component as a dependency of another component.
es: Trabajar con componentes se vuelve más complejo cuando tratamos de usar un componente dentro de otro. Como se mencionó anteriormente, un componente sólo puede ser incrustado dentro de un contrato, lo que significa que no es posible incrustar un componente dentro de otro componente. Sin embargo, esto no significa que no podamos utilizar un componente dentro de otro. En esta sección, veremos cómo utilizar un componente como dependencia de otro componente.
fr: Travailler avec des composants devient plus complexe lorsque nous essayons d'utiliser un composant à l'intérieur d'un autre. Comme mentionné précédemment, un composant ne peut être intégré qu'à l'intérieur d'un contrat, ce qui signifie qu'il n'est pas possible d'intégrer un composant à un autre composant. Cependant, cela ne signifie pas que nous ne pouvons pas utiliser un composant à l'intérieur d'un autre. Dans cette section, nous verrons comment utiliser un composant comme dépendance d'un autre composant.
id: Bekerja dengan komponen menjadi lebih kompleks ketika kita mencoba menggunakan satu komponen di dalam komponen lain. sebagaimana disebutkan sebelumnya, sebuah komponen hanya dapat tertanam dalam sebuah kontrak, berarti tidak mungkin untuk menanamkan komponen dalam komponen lain. namun, ini tidak berarti bahwa kita tidak dapat menggunakan satu komponen di dalam komponen lain. di bagian ini, kita akan melihat bagaimana menggunakan komponen sebagai ketergantungan dari komponen lain.
tr: Bileşenlerle çalışmak, bir bileşeni diğerinin içinde kullanmaya çalıştığımızda daha karmaşık hale gelir. Daha önce de belirtildiği gibi, bir bileşen yalnızca bir sözleşmenin içine yerleştirilebilir, yani bir bileşeni başka bir bileşenin içine yerleştirmenin mümkün olmadığı anlamına gelir. Bununla birlikte, bu, bir bileşeni diğerinin içinde kullanamayacağımız anlamına gelmez. Bu bölümde, bir bileşeni başka bir bileşenin bağımlılığı olarak nasıl kullanacağımızı göreceğiz.
zh_cn: 当我们试图在另一个组件中使用一个组件时,与组件一起工作会变得更加复杂。如前所述,一个组件只能嵌入合同中,这意味着无法在另一个组件中嵌入一个组件。然而,这并不意味着我们不能在另一个组件中使用一个组件。在本节中,我们将看到如何使用一个组件作为另一个组件的依赖性。

source: Consider a component called `OwnableCounter` whose purpose is to create a counter that can only be incremented by its owner. This component can be embedded in any contract, so that any contract that uses it will have a counter that can only be incremented by its owner.
es: Considere un componente llamado `OwnableCounter` cuyo propósito es crear un contador que sólo puede ser incrementado por su propietario. Este componente puede ser incrustado en cualquier contrato, de modo que cualquier contrato que lo utilice tendrá un contador que sólo puede ser incrementado por su propietario.
fr: Considérez un composant appelé `OwnableCounter` dont le but est de créer un compteur qui ne peut être incrémenté que par son propriétaire. Ce composant peut être intégré dans n'importe quel contrat, de sorte que tout contrat qui l'utilise aura un compteur qui ne peut être incrémenté que par son propriétaire.
id: Pertimbangkan sebuah komponen yang disebut "OwnableCounter" yang bertujuan untuk membuat penghitung yang hanya dapat ditingkatkan oleh pemiliknya. Komponen ini dapat tertanam dalam kontrak apapun, sehingga setiap kontrak yang digunakan akan memiliki counter yang hanya dapat diinkrementasi oleh pemiliknya.
tr: Amacı sadece sahibi tarafından artırılabilen bir sayaç oluşturmak olan OwnableCounter adlı bir bileşen düşünün. Bu bileşen herhangi bir sözleşmeye gömülebilir, böylece onu kullanan herhangi bir sözleşme yalnızca sahibi tarafından artırılabilen bir sayaç olacaktır.
zh_cn: 考虑一个称为`不可撤销 Coounter'的部件,其目的是建立一个只能由所有人加注的柜台,这一部件可以嵌入任何合同,这样,任何使用它的合同都有一个只能由所有人加注的柜台。
