Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: `0b01`
id: 0b01_BAR_

source: `dyn`
id: [ Gambar di hlm.

source: `Rem`
id: Remé.

source: `AddEq`
id: TINGGALKAN SIFAT

source: `Neg`
id: Tidak.

source: `var -= expr`
id: ▪var -= exprå

source: `var /= expr`
id: ▪var /= exprå

source: `var = expr`
id: ▪var = exprå

source: `pat => expr`
id: åpat => exprNeal

source: <code>\|</code>
id: <kode>\æu</kode>

source: <code>\|\|</code>
id: <kode>\Neal\Neal</kode>

source: `impl<...> ...`
id: åimpl<...>...

source: `assert_eq!`
id: S_assert_eq!

source: `send_message_to_L1`
id: Send_message_to_L1) fs-type

source: "b = {}"
es: "b = فارسى"

source: "{c} {a} {}"
es: " {c} {a} {a}"

source: `@var`
es: â € € ¢varâ

source: `#[flat]`
es: «[plano]»

source: `format!`
es: `formato! '

source: "https://github.com/keep-starknet-strange/alexandria.git"
tr: "https://github.com/keep-starknet-strange/alexandria.git" (İngilizce).
