Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The `Storage` struct is a [struct](./ch05-00-using-structs-to-structure-related-data.md) like any other, except that it **must** be annotated with the `#[storage]` attribute. This annotation tells the compiler to generate the required code to interact with the blockchain state, and allows you to read and write data from and to storage. Moreover, this allows you to define storage mappings using the dedicated `LegacyMap` type.
es: La estructura `Almacenamiento` es un [struct](./ch05-00-using-structs-to-structure-related-data.md) como cualquier otro, excepto que **debe** estar anotado con el atributo '[Almacenamiento]`. Esta anotación le dice al compilador que genere el código requerido para interactuar con el estado blockchain, y le permite leer y escribir datos desde y hasta el almacenamiento. Además, esto le permite definir asignaciones de almacenamiento utilizando el tipo dedicado `LegacyMap`.
fr: La structure `Storage` est un [struct](./ch05-00-using-structs-to-structure-related-data.md) comme tout autre, sauf qu'elle **doit** être annotée avec l'attribut `#[storage]`. Cette annotation indique au compilateur de générer le code requis pour interagir avec l'état de la chaîne de blocs, et vous permet de lire et d'écrire des données depuis et jusqu'au stockage. De plus, cela vous permet de définir des mappages de stockage en utilisant le type `LegacyMap` dédié.
id: Strukturnya adalah sebuah struktur [struct][struct]. /ch05-00-posting-structs-to-structural-dikaitkan-data.md) seperti yang lain, kecuali bahwa itu **harus dinotasikan dengan atribut those#[storage] those annotasi ini memberitahu compiler untuk membuat kode yang diperlukan untuk berinteraksi dengan negara rantai blok, dan memungkinkan Anda untuk membaca dan menulis data dari dan ke penyimpanan. Selain itu, ini memungkinkan Anda untuk mendefinisikan pemetaan penyimpanan menggunakan tipe yang berdedikasi.
tr: Storage struct, herhangi bir diğerleri gibi bir [struct] (./ch05-00-using-structs-to-structure-related-data.md) 'dir, bunun dışında ** #[storage] özniteliği ile anons edilmelidir. Bu açıklama derleyiciye blok zinciri durumuyla etkileşime girmesi için gerekli kodu oluşturmasını ve bu veriyi okumasını ve yazmasını sağlar.
zh_cn: `压力'结构是一个[支架](./ch05-00-using-structs-to-结构相关数据.md),与其他任何系统一样,但****必须附加“[储存]”属性的注解。该注解告诉汇编者生成与链条状态互动所需的代码,并允许您读写数据,从和从和存储数据。此外,这允许您使用专用的“egacyMap”类型定义存储图示。

source: Variables declared in the `Storage` struct are not stored contiguously but in different locations in the contract's storage. The storage address of a particular variable is determined by the variable's name, and the eventual keys of the variable if it is a mapping.
es: Las variables declaradas en la estructura `Almacenamiento` no se almacenan de manera contigua, sino en diferentes ubicaciones del almacenamiento del contrato. La dirección de almacenamiento de una variable determinada se determina por el nombre de la variable y las claves de la variable si se trata de un mapeo.
fr: Les variables déclarées dans la structure `Storage` ne sont pas stockées de manière contiguë, mais dans différents emplacements du stockage du contrat. L'adresse de stockage d'une variable particulière est déterminée par le nom de la variable et les clés éventuelles de la variable si elle est un mappage.
id: Variabel yang dideklarasikan dalam struktur lturia tidak disimpan secara kontiguously tetapi di lokasi yang berbeda dalam penyimpanan kontrak. Alamat penyimpanan dari variabel tertentu ditentukan oleh nama variabel, dan kunci akhir variabel jika itu adalah pemetaan.
tr: Storage yapısında beyan edilen değişkenler bitişik olarak değil, sözleşmenin deposundaki farklı konumlarda depolanır. Belirli bir değişkenin depolama adresi, değişkenin adı ve bir haritalama ise değişkenin nihai anahtarları ile belirlenir.
zh_cn: `Storage` struct' 中申报的变量不以毗连方式储存,而是在合同储存的不同地点储存。特定变量的存储地址由变量的名称决定,如果是绘图,则由变量的最终密钥确定。

source: Addresses of Storage Variables
es: Direcciones de las variables de almacenamiento
fr: Adresses des variables de stockage
id: Alamat Variabel Penyimpanan
tr: Depolama Değişkenlerinin Adresleri
zh_cn: 存储变量地址

source: The address of a storage variable is computed as follows:
es: La dirección de una variable de almacenamiento se calcula de la siguiente manera:
fr: L'adresse d'une variable de stockage est calculée comme suit:
id: Alamat dari variabel penyimpanan dihitung sebagai berikut:
tr: Bir depolama değişkeninin adresi aşağıdaki gibi hesaplanır:
zh_cn: 存储变量的地址计算如下:

source: If the variable is a single value, the address is the `sn_keccak` hash of the ASCII encoding of the variable's name. `sn_keccak` is Starknet's version of the Keccak256 hash function, whose output is truncated to 250 bits.
es: Si la variable es un valor único, la dirección es el hash `sn_keccak` de la codificación ASCII del nombre de la variable. `sn_keccak` es la versión de Starknet de la función de hash Keccak256, cuya salida está truncada a 250 bits.
fr: Si la variable est une valeur unique, l'adresse est le hachage `sn_keccak` de l'encodage ASCII du nom de la variable. `sn_keccak` est la version de Starknet de la fonction de hachage Keccak256, dont la sortie est tronquée à 250 bits.
id: Jika variabelnya adalah satu nilai, alamatnya adalah versi dari fungsi keccak256 dari pengkodean ASCII dari nama variabel.
tr: Değişken tek bir değer ise, adres değişkenin adının ASCII kodlamasının sn_keccak hash'idir. sn_keccak, Starknet'in çıkışı 250 bite kadar kesilen Keccak256 hash fonksiyonunun sürümüdür.
zh_cn: 如果变量是一个单一值,地址是变量名称的 ASCII 编码中的“sn_keccak' hash”。 “sn_keccak” 是 Keccak256 hash 函数的 Starknet 版本, 其输出被缩短为 250 比特。

source: If the variable is composed of multiple values (i.e., a tuple, a struct or an enum), we also use the `sn_keccak` hash of the ASCII encoding of the variable's name to determine the base address in storage. Then, depending on the type, the storage layout will differ. See the ["Storing Custom Types"](./ch14-01-contract-storage.md#storing-custom-types) section.
es: Si la variable está compuesta por varios valores (es decir, una tupla, una estructura o un enum), también utilizamos el hash `sn_keccak` de la codificación ASCII del nombre de la variable para determinar la dirección de la base en almacenamiento. Luego, dependiendo del tipo, el diseño de almacenamiento diferirá. Vea la sección ["Tipos personalizados de almacenamiento"](./ch14-01-contract-storage.md#storing-custom-types).
fr: Si la variable est composée de plusieurs valeurs (c.-à-d. un tuple, un struct ou un enum), nous utilisons également le hash `sn_keccak` de l'encodage ASCII du nom de la variable pour déterminer l'adresse de base dans le stockage. Ensuite, selon le type, la mise en page de stockage sera différente. Voir la section [./ch14-01-contract-storage.md#storing-custom-types).
id: Jika variabelnya terdiri dari beberapa nilai (misalnya., sebuah tuple, sebuah struct atau enum), kami juga menggunakan ·sn_keccak--h dari pengkodean ASCII dari nama variabel untuk menentukan alamat dasar dalam penyimpanan. Kemudian, tergantung pada tipe, tata letak penyimpanan akan berbeda. Lihat ["Storing Custom Typs"] susah./ch-contract-torage.m#storing-custom-type) bagian.
tr: Değişken birden fazla değerden (yani, bir tuple, bir struct veya bir enum) oluşursa, depolamadaki temel adresi belirlemek için değişkenin adının ASCII kodlamasının sn_keccak hash'ini de kullanırız. Daha sonra, türüne bağlı olarak, depolama düzeni farklı olacaktır. ["Storing Custom Types"](./ch14-01-contract-storm) bölümüne bakın.
zh_cn: 如果变量由多个值组成(如图普尔、支架或昆虫),我们也会使用变量名称的 ASCII 编码中的“sn_keccak' hash” 来决定存储中的基地址。然后,根据类型,存储布局会有所不同。请参见 [“Storing 自定义类型”] (./ch14-01-contract-soldage.md#storning-custom-types) 部分。

source: If the variable is a [mapping](./ch14-01-contract-storage.html#storage-mappings) with a key `k`, the address of the value at key `k` is `h(sn_keccak(variable_name),k)`, where ℎ is the Pedersen hash and the final value is taken modulo \\( {2^{251}} - 256\\). If the key is composed of more than one `felt252`, the address of the value will be `h(...h(h(sn_keccak(variable_name),k_1),k_2),...,k_n)`, with `k_1,...,k_n` being all `felt252` that constitute the key. In the case of mappings to complex values (e.g., tuples or structs), then this complex value lies in a continuous segment starting from the address calculated with the previous formula. Note that 256 field elements is the current limitation on the maximal size of a complex storage value.
es: Si la variable es un [mapping](./ch14-01-contract-storage.html#storage-mappings) con una clave `k`, la dirección del valor en clave `k` es `h(sn_keccak(variable_name),k)`, donde h es el hash de Pedersen y el valor final se toma modulo
fr: Si la variable est un [mapping](./ch14-01-contract-storage.html#storage-mappings) avec une clé `k`, l'adresse de la valeur à la clé `k` est `h(sn_keccak(variable_name),k)`, où h est le hash de Pedersen et la valeur finale est prise modulo \\( {2^{251} - 256\). Si la clé est composée de plus d'un `felt252`, l'adresse de la valeur sera `h(...h(sn_keccak(variable_name),k_1),k_2),...,k_n)`, avec `k_1,...,k_n` étant tous `felt252` qui constituent la clé. Dans le cas de mappings vers des valeurs complexes (par exemple, tuples ou structs), alors cette valeur complexe se situe dans un segment continu à partir de l'adresse calculée avec la formule précédente.
id: Jika variabelnya [mapping]. /ch14-01-contract-storage.html#mage-mappings) dengan kunci yang telah diambil \\k://1} kunci - 256} - 256). Jika kunci terdiri dari lebih dari satu quartavable_name), k), k), di mana hersen hash dan nilai akhir diambil modulo \ \\{2{1}.
tr: Eğer değişken bir [mapping](./ch14-01-contract-storage.html#storage-mappings) k tuşu ile k değeri, k anahtarındaki değerin h(sn_keccak(variable_name),k değeri, padersen hash olan ve son değerin modulo ( 225) olarak alındığı bir değerdir.
zh_cn: 如果变量是 [mapping] (./ch14-01- Contract-storage-storage.html#storage-mappings), 带有密钥`k' 的地址是`h(sn_keccak (可变_name), k), h 是Pedersen hash, 最后的值被取用 modulo\\\ ({2251}- 256\\) 。 如果密钥由多个“felt252” 组成, 数值的地址将是'h(h) (h) (sn_keccak(可变数_name), k_1, k_2)..., k_n) 的地址是`k_k_ 1,..., k_n' 的地址是所有构成密钥的“felt252 ” 的数值的地址。在绘制复杂值(例如 tuples或structs) 的情况下, 复杂的数值将包含从先前公式计算的地址开始的连续一段。 。 注意, 25656 字段元素是目前对复杂存储价值的最大尺寸的限制。

source: You can access the address of a storage variable by calling the `address` function on the variable, which returns a `StorageBaseAddress` value.
es: Puede acceder a la dirección de una variable de almacenamiento llamando a la función `dirección` de la variable, que devuelve un valor `AlmacenamientoBaseAddress`.
fr: Vous pouvez accéder à l'adresse d'une variable de stockage en appelant la fonction `address` sur la variable, qui retourne une valeur `StorageBaseAddress`.
id: Anda dapat mengakses alamat dari variabel penyimpanan dengan memanggil fungsi ·addressé pada variabel, yang mengembalikan nilai ▪StorageBaseAverss.
tr: StorageBaseAddress değerini döndüren değişken üzerindeki address fonksiyonunu arayarak bir depolama değişkeninin adresine erişebilirsiniz.
zh_cn: 您可以通过在变量上调用“地址”函数访问存储变量的地址,该函数返回“StorageBaseAddress”值。

source: Interacting with Storage Variables
es: Interacción con las variables de almacenamiento
fr: Interagir avec les variables de stockage
id: Interacting dengan Variabel Penyimpanan
tr: Depolama Değişkenleri ile Etkileşim
zh_cn: 与存储变量交互

source: Variables stored in the `Storage` struct can be accessed and modified using the `read` and `write` functions, respectively. As previously mentioned, you can get their address in storage using the `address` function. All these functions are automatically generated by the compiler for each storage variable.
es: Se puede acceder a las variables almacenadas en la estructura `Almacenamiento` y modificarlas utilizando las funciones `read` y `write`, respectivamente. Como se mencionó anteriormente, puede obtener su dirección en el almacenamiento utilizando la función `dirección`. Todas estas funciones son generadas automáticamente por el compilador para cada variable de almacenamiento.
fr: Les variables stockées dans la structure `Storage` peuvent être consultées et modifiées en utilisant les fonctions `read` et `write` respectivement. Comme mentionné précédemment, vous pouvez obtenir leur adresse dans le stockage en utilisant la fonction `address`. Toutes ces fonctions sont automatiquement générées par le compilateur pour chaque variable de stockage.
id: Variabel yang disimpan dalam struktur retorage dapat diakses dan diubah dengan menggunakan fungsi yang dibaca dan ditulis secara otomatis, seperti yang disebutkan sebelumnya, Anda dapat mendapatkan alamat mereka dalam penyimpanan menggunakan fungsi ·addressà. Semua fungsi ini secara otomatis dihasilkan oleh kompiler untuk setiap variabel penyimpanan.
tr: Storage yapısında depolanan değişkenlere sırasıyla read ve write işlevleri kullanılarak erişilebilir ve değiştirilebilir. Daha önce de belirtildiği gibi, address işlevini kullanarak adreslerini depoda alabilirsiniz. Tüm bu işlevler, her depolama değişkeni için derleyici tarafından otomatik olarak oluşturulur.
zh_cn: 储存在`Storage'支架中的变量可以分别使用`read'和`write'函数访问和修改,如前所述,您可以使用`地址'函数在存储中获取其地址,所有这些功能都是由每个存储变量的汇编者自动生成的。

source: To read the value of the `owner` storage variable, which is a single value, we call the `read` function on the `owner` variable, passing in no parameters.
es: Para leer el valor de la variable de almacenamiento `propietario`, que es un valor único, llamamos a la función `leído` en la variable `propietario`, sin pasar parámetros.
fr: Pour lire la valeur de la variable de stockage `owner`, qui est une valeur unique, nous appelons la fonction `read` sur la variable `owner`, en passant en aucun paramètre.
id: Untuk membaca nilai dari variabel penyimpanan yang dimiliki pemilik, yang merupakan satu nilai, kita sebut fungsinya pada variabel åowner, yang tidak ada parameternya.
tr: Tek bir değer olan owner depolama değişkeninin değerini okumak için, owner değişkenindeki read fonksiyonuna hiçbir parametrede geçmeksizin diyoruz.
zh_cn: 阅读`所有者'储存变量的值,这是一个单一值,我们称之为`所有者'变量上的`阅读'功能,不通过参数。

source: To read the value of the storage variable `names`, which is a mapping from `ContractAddress` to `felt252`, we call the `read` function on the `names` variable, passing in the key `address` as a parameter. If the mapping had more than one key, we would pass in the other keys as parameters as well.
es: Para leer el valor de la variable de almacenamiento `nombres`, que es una asignación de `ContractAddress` a `felt252`, llamamos a la función `read` en la variable `nombres`, pasando la clave `dirección` como parámetro. Si la asignación tuviera más de una clave, también pasaríamos las otras claves como parámetros.
fr: Pour lire la valeur de la variable de stockage `names`, qui est un mapping de `ContractAddress` à `felt252`, nous appelons la fonction `read` sur la variable `names`, en passant dans la clé `address` comme paramètre. Si le mapping avait plus d'une clé, nous passerions dans les autres clés comme paramètres.
id: Untuk membaca nilai dari variabel penyimpanan, yang merupakan pemetaan dari contractAddress, menjadi 252, kita sebut fungsi baca di variabel åname, melewati kunci sebagai parameter. Jika pemetaan memiliki lebih dari satu kunci, kita akan melewati tombol lain juga parameter.
tr: ContractAddress ile felt252 arasında bir haritalama olan names depolama değişkeninin değerini okumak için, names değişkenindeki read fonksiyonunu parametre olarak address anahtarına geçiyoruz. Haritalamanın birden fazla anahtarı olsaydı, diğer anahtarlarda da parametre olarak geçerdik.
zh_cn: 读取存储变量`名称'的值,即从`合同地址'到`felt252'的映射,我们称之为`名称'变量上的`读'函数,在键`地址'中以参数通过。如果映射有一个以上的键,我们也会通过其他键作为参数。

source: To write a new value to the storage slot of a storage variable, we call the `write` function passing in the eventual keys and the value as arguments. As with the `read` function, the number of arguments depends on the storage variable type. Here, we only pass in the value to write to the `owner` variable as it is a simple variable.
es: Para escribir un nuevo valor en la ranura de almacenamiento de una variable de almacenamiento, llamamos a la función `write` pasando las claves eventuales y el valor como argumentos. Al igual que con la función `read`, el número de argumentos depende del tipo de variable de almacenamiento. Aquí, sólo pasamos en el valor para escribir a la variable `owner` ya que es una variable simple.
fr: Pour écrire une nouvelle valeur à la fente de stockage d'une variable de stockage, nous appelons la fonction `write` passant dans les clés éventuelles et la valeur comme arguments. Comme pour la fonction `read`, le nombre d'arguments dépend du type de variable de stockage. Ici, nous passons seulement dans la valeur pour écrire à la variable `owner` comme c'est une variable simple.
id: Untuk menulis nilai baru ke slot penyimpanan dari variabel penyimpanan, kami menyebut fungsi menulis yang melewati kunci yang akhirnya dan nilai sebagai argumen. seperti dengan fungsi Áreadé, jumlah argumen tergantung pada tipe variabel penyimpanan. Di sini, kami hanya lulus dalam nilai untuk menulis ke variabel thoseowneré karena itu adalah variabel sederhana.
tr: Bir depolama değişkeninin depolama yuvasına yeni bir değer yazmak için, nihai anahtarlarda geçen write fonksiyonu ve argüman olarak değer diyoruz. read fonksiyonunda olduğu gibi, argüman sayısı depolama değişken türüne bağlıdır. Burada, basit bir değişken olduğu için owner değişkenine yazmak için sadece değer geçeriz.
zh_cn: 要给存储变量的存储位置写一个新的值, 我们将“ write” 函数称为“ write” 函数通过最终的密钥和作为参数的值。 至于“ read” 函数, 参数的数量取决于存储变量的类型。 在这里, 我们只需将值通过写入“ 拥有者” 变量, 因为它是一个简单的变量 。

source: In this second example, we need to pass `user` and `name` as arguments, because `names` is a mapping, with `user` as key and `name` as value.
es: En este segundo ejemplo, tenemos que pasar `usuario` y `nombre` como argumentos, porque `nombres` es un mapeo, con `usuario` como clave y `nombre` como valor.
fr: Dans ce deuxième exemple, nous devons passer `user` et `name` comme arguments, parce que `names` est un mapping, avec `user` comme clé et `name` comme valeur.
id: Dalam contoh kedua ini, kita perlu melewati pengguna dan nama samaran sebagai argumen, karena nama adalah pemetaan, dengan kunci dan nama yang sama nilainya.
tr: Bu ikinci örnekte, user ve name'yi argüman olarak geçmemiz gerekir, çünkü names bir haritalamadır, user anahtar ve name değer olarak.
zh_cn: 在第二个例子中,我们需要将`用户'和`名称'作为论据,因为`名称'是一种绘图,`用户'作为关键,`名称'作为价值。

source: Storing Custom Types
es: Almacenar tipos personalizados
fr: Stockage des types personnalisés
id: Menyimpan Tipe Gubahan
tr: Özel Türlerin Saklanması
zh_cn: 存储自定义类型

source: The `Store` trait, defined in the `starknet::storage_access` module, is used to specify how a type should be stored in storage. In order for a type to be stored in storage, it **must** implement the `Store` trait. Most types from the core library, such as unsigned integers (`u8`, `u128`, `u256`...), `felt252`, `bool`, `ByteArray`, `ContractAddress`, etc. implement the `Store` trait and can thus be stored without further action.
es: El rasgo `Almacenamiento`, definido en el módulo `starknet::storage_access`, se utiliza para especificar cómo debe almacenarse un tipo. Para que un tipo se almacene, **debe** implementar el rasgo `Almacenamiento`. La mayoría de los tipos de la biblioteca central, como los enteros no firmados (`u8`, `u128, `u256`...), `felt252`, `bool`, `ByteArray`, `ContractAddress`, etc., aplican el rasgo `Almacenamiento` y, por lo tanto, pueden almacenarse sin más medidas.
fr: Le caractère `Store`, défini dans le module `starknet::storage_access`, est utilisé pour spécifier comment un type doit être stocké. Pour qu'un type soit stocké, il **doit** implémenter le caractère `Store`. La plupart des types de la bibliothèque centrale, tels que les entiers non signés (`u8`, `u128`, `u256`...), `felt252`, `bool`, `ByteArray`, `ContractAddress`, etc., implémentent le caractère `Store` et peuvent donc être stockés sans autre action.
id: Sifat yang harus disimpan dalam penyimpanan, didefinisikan dalam ·starknet:: storage_access_accessé modul, digunakan untuk menentukan bagaimana sebuah tipe harus disimpan dalam penyimpanan. Dalam rangka untuk jenis yang disimpan dalam penyimpanan, itu *usstore** mengimplementasikan sifat ÁStore. Kebanyakan tipe dari perpustakaan inti, seperti integers unsigned (u8, u128, ▪256), ±2, ántray, dan lain-lain.
tr: starknet::storage_access modülünde tanımlanan Store özelliği, bir türün depolamada nasıl saklanması gerektiğini belirtmek için kullanılır. Bir türün depolamada saklanması için, **Store özelliğinin uygulanması gerekir. İmzasız tamsayılar (u8, u128, u256...), felt gibi çekirdek kütüphaneden gelen çoğu tür
zh_cn: `恒星网:储存_存取'模块中定义的`轮胎'特性,用于具体说明一种类型应如何储存在储存中,为了将某种类型储存在储存中,它****必须**执行`轮胎'特性,核心图书馆的大多数类型,如未符号的整数(`u8'、`u128'、`u256')、`felt252'、`bool'、`ByteAray'、`合同通讯'等,实施`轮胎'特性,从而可以储存而不采取进一步行动。

source: But what if you wanted to store a type that you defined yourself, such as an enum or a struct? In that case, you have to explicitly tell the compiler how to store this type.
es: Pero, ¿qué pasa si quieres almacenar un tipo que te definiste a ti mismo, como un enum o una estructura? En ese caso, tienes que decirle explícitamente al compilador cómo almacenar este tipo.
fr: Mais que faire si vous vouliez stocker un type que vous avez défini vous-même, comme un enum ou un struct? Dans ce cas, vous devez explicitement dire au compilateur comment stocker ce type.
id: Tapi bagaimana jika Anda ingin menyimpan tipe yang Anda definisikan sendiri, seperti enum atau struct? Dalam hal ini, Anda harus secara eksplisit memberitahu kompiler bagaimana menyimpan jenis ini.
tr: Ancak, kendinizi tanımladığınız bir türü, örneğin bir enum veya bir struct depolamak isteseydiniz? Bu durumda, derleyiciye bu türün nasıl saklanacağını açıkça söylemeniz gerekir.
zh_cn: 但如果你想存储一种你定义自己的类型,比如 enum 或 struct 。 那么, 您必须明确告诉编译者如何存储这种类型 。

source: In our example, we want to store a `Person` struct in storage, which is only possible by implementing the `Store` trait for the `Person` type. This can be simply achieved by adding a `#[derive(starknet::Store)]` attribute on top of our struct definition. Note that all the members of the struct need to implement the `Store` trait.
es: En nuestro ejemplo, queremos almacenar una estructura `Person` en el almacenamiento, que sólo es posible mediante la aplicación del rasgo `Almacenamiento` para el tipo `Persona`. Esto puede lograrse simplemente añadiendo un atributo `[derive(starknet::Store)]` encima de nuestra definición de estructura. Tenga en cuenta que todos los miembros de la estructura necesitan implementar el rasgo `Almacenamiento`.
fr: Dans notre exemple, nous voulons stocker une structure `Personne` dans le stockage, ce qui n'est possible qu'en implémentant le caractère `Store` pour le type `Personne`. Cela peut être simplement réalisé en ajoutant un attribut `#[derive(starknet::Store)]` en plus de notre définition de structure. Notez que tous les membres de la structure doivent mettre en œuvre le caractère `Store`.
id: Dalam contoh kami, kami ingin menyimpan sebuah bangunan di penyimpanan, yang hanya mungkin dengan mengimplementasikan sifat untuk tipe ÉPersoné. Ini dapat dicapai dengan menambahkan sebuah ▪#[dederive Donnellystarknet::Store) atribut di atas definisi struct kami. perhatikan bahwa semua anggota struktur perlu menerapkan sifat ÁStore.
tr: Örneğimizde, sadece Person tipi için Store özelliğini uygulayarak mümkün olan bir Person yapısı depolamada saklamak istiyoruz. Bu, yapı tanımımızın üzerine bir #[türev(starknet::Store)]] özniteliği eklenerek basitçe elde edilebilir. Yapıtın tüm üyelerinin Store özelliğini uygulamak zorunda olduklarını unutmayın.
zh_cn: 例如,我们想在储存中储存`人'结构,只有执行`人'类型`轮胎'特性才有可能,而仅仅通过在我们结构定义之上添加`[疗效网:斯塔雷 属性即可做到这一点,请注意,该结构的所有成员都需要执行`轮胎'特性。
