Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: After `#[test]` we add the `#[ignore]` line to the test we want to exclude. Now when we run our tests, `it_works` runs, but `expensive_test` doesn’t:
es: Después de `[test]` añadimos la línea `[ignore]` a la prueba que queremos excluir. Ahora, cuando ejecutamos nuestras pruebas, `it_works` se ejecuta, pero ` caro_test` no lo hace:
fr: Après `#[test]` nous ajoutons la ligne `#[ignorer]` au test que nous voulons exclure. Maintenant, quand nous effectuons nos tests, `it_works` tourne, mais `expensive_test` ne fait pas:
id: Setelah kami melakukan tes, kami menambahkan baris untuk tes yang ingin kami abaikan.
tr: #[test]'den sonra #[ignore] çizgisini dışlamak istediğimiz teste ekleriz. Şimdi testlerimizi çalıştırdığımızda it_works çalışır, ancak pensive_test çalışmaz:
zh_cn: 在`````之后,我们在我们想要排除的测试中加入```````````````````````````[举 ``[举 `线。现在当我们进行测试时,``它`工作'在运行,但`昂贵的`检验'没有':

source: The `expensive_test` function is listed as ignored.
es: La función `exclusive_test` se enumera como ignorada.
fr: La fonction `expensive_test` est listée comme ignorée.
id: Fungsi yang paling bergantung pada fungsi terdaftar sebagai diabaikan.
tr: pensive_test işlevi göz ardı edilmiş olarak listelenir.
zh_cn: `昂贵的测试'功能被列为被忽略。

source: When you’re at a point where it makes sense to check the results of the ignored tests and you have time to wait for the results, you can run `scarb cairo-test --include-ignored` to run all tests, whether they’re ignored or not.
es: Cuando estás en un punto en el que tiene sentido comprobar los resultados de las pruebas ignoradas y tienes tiempo para esperar los resultados, puedes ejecutar `scarb cairo-test --include-ignored` para ejecutar todas las pruebas, sean o no ignoradas.
fr: Lorsque vous êtes à un point où il est logique de vérifier les résultats des tests ignorés et vous avez le temps d'attendre les résultats, vous pouvez exécuter `scarb cairo-test --include-ignored` pour exécuter tous les tests, qu'ils soient ignorés ou non.
id: Ketika Anda berada pada titik di mana masuk akal untuk memeriksa hasil tes yang diabaikan dan Anda punya waktu untuk menunggu hasilnya, Anda dapat menjalankan cairo-test --include-ignored, apakah mereka diabaikan atau tidak.
tr: Görmezden gelinen testlerin sonuçlarını kontrol etmenin mantıklı olduğu bir noktadaysanız ve sonuçları beklemek için zamanınız olduğunda, göz ardı edilip edilmediklerine bakılmaksızın tüm testleri çalıştırmak için scarb cairo-testi -ignored - çalıştırabilirsiniz.
zh_cn: 当您处在检查被忽略的测试结果是有道理的并且您有时间等待结果的时候,您可以运行“ccarb cairo-test-including-ignored”来运行所有测试,不管它们是否被忽略。

source: Testing Recursive Functions or Loops
es: Pruebas de funciones recursivas o loops
fr: Essai des fonctions récursives ou des boucles
id: Menguji Fungsi atau Loop Rekursif
tr: Özyinelemeli Fonksiyonları veya Döngüleri Test Etmek
zh_cn: 测试递归函数或循环

source: When testing recursive functions or loops, the test is instantiated by default with a maximum amount of gas that it can consume. This prevents running infinite loops or consuming too much gas, and can help you benchmark the efficiency of your implementations. This value is assumed reasonably large enough, but you can override it by adding the `#[available_gas(<Number>)]` attribute to the test function. The following example shows how to use it:
es: Al probar funciones recursivas o bucles, la prueba se instaura por defecto con una cantidad máxima de gas que puede consumir. Esto evita correr bucles infinitos o consumir demasiado gas, y puede ayudarle a comparar la eficiencia de sus implementaciones. Este valor se supone que es lo suficientemente grande, pero puede anularlo añadiendo el atributo "[disponible_gas(<Numero>)]` a la función de prueba. El siguiente ejemplo muestra cómo usarlo:
fr: Lorsque vous testez des fonctions ou des boucles récursives, le test est instantané par défaut avec une quantité maximale de gaz qu'il peut consommer. Cela empêche les boucles infinies ou consomme trop de gaz, et peut vous aider à comparer l'efficacité de vos implémentations. Cette valeur est supposée assez grande, mais vous pouvez la surcharger en ajoutant l'attribut `#[available_gas(<Number>)]` à la fonction de test. L'exemple suivant montre comment l'utiliser :
id: Ketika pengujian fungsi rekursif atau loops, tes ini instansiated secara baku dengan jumlah maksimum gas yang dapat dikonsumsi. Hal ini mencegah berjalan loop tak terbatas atau mengkonsumsi terlalu banyak gas, dan dapat membantu Anda memposisikan efisiensi implementasi Anda. Nilai ini diasumsikan cukup besar, tetapi Anda dapat menimpanya dengan menambahkannya "#[available_gas<Number>)] atribut untuk tes fungsi. Contoh berikut menunjukkan bagaimana menggunakannya:
tr: Özyinelemeli fonksiyonları veya döngüleri test ederken, test varsayılan olarak tüketebileceği maksimum miktarda gaz ile hızlandırılır. Bu, sonsuz döngülerin çalıştırılmasını veya çok fazla gaz tüketmenizi önler ve uygulamalarınızın verimliliğini ölçmenize yardımcı olabilir. Bu değer yeterince büyük kabul edilir, ancak test fonksiyonuna #[kullanılabilir_gazlar(Number>]]] özniteliğini ekleyerek geçersiz kılabilirsiniz. Aşağıdaki örnek nasıl kullanılacağını gösterir:
zh_cn: 当测试递归函数或循环时,该测试会默认地以其消耗的气体最大数量即时进行。这样可以防止运行无限循环或消耗过多气体,并且可以帮助您测量执行效率。这个数值被合理假定为足够大,但您可以通过在测试函数中添加 {[可获取_gas( < number > )'属性来覆盖它。以下示例显示如何使用它 :

source: "result is not 55"
es: "El resultado no es 55"
fr: "le résultat n'est pas 55"
id: "Hasil bukan 55"
tr: "Cevap 55 değil"
zh_cn: "结果不是55"

source: Benchmarking the Gas Usage of a Specific Operation
es: Evaluación comparativa del uso del gas en una operación específica
fr: Analyse comparative de l'utilisation du gaz d'une opération spécifique
id: Benchmarking the Gas Usage of a Spesifik Operation
tr: Belirli Bir Operasyonun Gaz Kullanımının Karşılaştırılması
zh_cn: 确定具体行动使用天然气的基准

source: When you want to benchmark the gas usage of a specific operation, you can use the following pattern in your test function.
es: Cuando desea comparar el uso de gas de una operación específica, puede utilizar el siguiente patrón en su función de prueba.
fr: Lorsque vous voulez comparer l'utilisation de gaz d'une opération spécifique, vous pouvez utiliser le modèle suivant dans votre fonction de test.
id: Bila Anda ingin menandai penggunaan gas dari suatu operasi spesifik, Anda dapat menggunakan pola berikut dalam fungsi tes Anda.
tr: Belirli bir operasyonun gaz kullanımını kıyaslamak istediğinizde, test fonksiyonunuzda aşağıdaki deseni kullanabilirsiniz.
zh_cn: 当您想要对特定操作的气体使用量进行基准测试时,您可以在测试函数中使用以下模式。

source: /// code we want to bench.
es: /// código que queremos banco.
fr: /// code que nous voulons poser.
id: / /Kode kami ingin bangku.
tr: /// kodu biz bank istiyoruz.
zh_cn: / 代码,我们想坐以待毙。

source: "{}\n"
zh_cn: "n" "n" "n"

source: The following example shows how to use it to test the gas function of the `sum_n` function above.
es: El siguiente ejemplo muestra cómo utilizarlo para probar la función de gas de la función `sum_n` arriba.
fr: L'exemple suivant montre comment l'utiliser pour tester la fonction gaz de la fonction `sum_n` ci-dessus.
id: Contoh berikut menunjukkan bagaimana menggunakannya untuk menguji fungsi gas dari fungsi Ásum_n di atas.
tr: Aşağıdaki örnek, yukarıdaki sum_n fonksiyonunun gaz fonksiyonunu test etmek için nasıl kullanılacağını gösterir.
zh_cn: 以下示例显示如何使用它测试上面`sum_n'函数的气体函数。

source: "consumed gas: {}\n"
es: "gas consumido: n"
fr: "gaz consommé: {}\n"
id: "gas yang dikonsumsi: [}\n"
tr: "tüketimli gaz: n"
zh_cn: (消耗气体:n)

source: The value printed when running `scarb cairo-test` is the amount of gas that was consumed by the benchmarked operation.
es: El valor impreso cuando se ejecuta la prueba de `scarb cairo'es la cantidad de gas consumida por la operación de referencia.
fr: La valeur imprimée lors de l'essai du «carbe cairo» est la quantité de gaz consommée par l'opération de référence.
id: Nilai yang dicetak ketika menjalankan cairo-test adalah jumlah gas yang dikonsumsi oleh operasi benchmarked.
tr: scarb cairo-test çalıştırılırken basılan değer, karşılaştırmalı işlem tarafından tüketilen gaz miktarıdır.
zh_cn: 运行 " 碎屑测试 " 时打印的价值是基准作业消耗的天然气数量。

source: Here, the gas usage of the `sum_n` function is `80690` (decimal representation of the hex number). The total amount consumed by the test is slightly higher at `140100`, due to some extra steps required to run the entire test function.
es: En este caso, el uso de gas de la función `sum_n` es `80690` (representación decimal del número hexadecimal). La cantidad total consumida por el ensayo es ligeramente superior a `140100`, debido a algunos pasos adicionales necesarios para ejecutar toda la función de ensayo.
fr: Ici, l'utilisation de gaz de la fonction `sum_n` est `80690` (représentation décimale du nombre d'hexagones). La quantité totale consommée par l'essai est légèrement plus élevée à `140100`, en raison de certaines étapes supplémentaires nécessaires pour exécuter l'ensemble de la fonction d'essai.
id: Di sini, penggunaan gas dari fungsi ısum_n adalah 80690 representasi dari nomor hex (jumlah total yang dikonsumsi oleh tes sedikit lebih tinggi pada 140100, karena beberapa langkah ekstra yang diperlukan untuk menjalankan seluruh fungsi tes.
tr: Burada, sum_n fonksiyonunun gaz kullanımı 80690'dir (onaltılık sayının onaltılık gösterimi). Test tarafından tüketilen toplam miktar, tüm test fonksiyonunu çalıştırmak için gereken bazı ekstra adımlar nedeniyle 140100'de biraz daha yüksektir.
zh_cn: 此处,`总'函数的气体使用量为`80690'(十六进制数字的十进制表示),由于整个试验函数运行需要一些额外步骤,试验消耗的总金额略高,为`140100'。

source: {{#quiz ../quizzes/ch10-01-how_to_write_tests.toml}}
fr: {{#quiz../quizes/ch10-01-how_to_write_tests.toml}}
id: {{#quiz../quizzes/ch10-01-how_to_write_test.toml}}}
zh_cn: Quiz./quizzes/ch10-01-how_write_tests.toml_toml_

source: We'll think about tests in terms of two main categories: unit tests and integration tests. Unit tests are small and more focused, testing one module in isolation at a time, and can test private functions. Integration tests use your code in the same way any other external code would, using only the public interface and potentially exercising multiple modules per test.
es: Pensaremos en las pruebas en términos de dos categorías principales: pruebas unitarias y pruebas de integración. Las pruebas unitarias son pequeñas y más enfocadas, probando un módulo en aislamiento a la vez, y pueden probar funciones privadas. Las pruebas de integración utilizan su código de la misma manera que cualquier otro código externo, usando sólo la interfaz pública y potencialmente ejerciendo varios módulos por prueba.
fr: Les tests unitaires sont petits et plus ciblés, testent un module isolé à la fois, et peuvent tester des fonctions privées. Les tests d'intégration utilisent votre code de la même manière que tout autre code externe, en utilisant uniquement l'interface publique et potentiellement en exerçant plusieurs modules par test.
id: Kita akan berpikir tentang tes dalam dua kategori utama: tes unit dan tes integrasi. Tes unit kecil dan lebih fokus, pengujian satu modul dalam isolasi pada satu waktu, dan dapat menguji fungsi pribadi. Uji integrasi menggunakan kode Anda dengan cara yang sama dengan kode eksternal lainnya akan, hanya menggunakan antarmuka publik dan berpotensi berolahraga beberapa modul per tes.
tr: İki ana kategori açısından testleri düşüneceğiz: birim testleri ve entegrasyon testleri. Birim testleri küçük ve daha odaklıdır, bir modülü bir kerede izolasyonda test eder ve özel işlevleri test edebilir. Entegrasyon testleri, kodunuzu yalnızca ortak arayüzü kullanarak ve potansiyel olarak test başına birden fazla modülü kullanarak diğer harici kodlarla aynı şekilde kullanır.
zh_cn: 我们将考虑两大类的测试:单位测试和集成测试。单位测试规模小,重点更突出,一次单独测试一个模块,可以测试私人功能。整合测试使用与其它任何外部代码相同的方式使用您的代码,只使用公共界面,并且每个测试可能使用多个模块。

source: Writing both kinds of tests is important to ensure that the pieces of your library are doing what you expect them to, separately and together.
es: Escribir ambos tipos de pruebas es importante para asegurarse de que las piezas de su biblioteca están haciendo lo que usted espera que hagan, por separado y juntos.
fr: Écrire les deux types de tests est important pour s'assurer que les morceaux de votre bibliothèque font ce que vous attendez d'eux, séparément et ensemble.
id: Menulis kedua jenis tes penting untuk memastikan bahwa potongan-potongan dari perpustakaan Anda melakukan apa yang Anda harapkan, secara terpisah dan bersama-sama.
tr: Her iki tür testi de yazmak, kütüphanenizin parçalarının onlardan beklediğinizi ayrı ve birlikte yapmasını sağlamak için önemlidir.
zh_cn: 两种测试的写作都很重要, 以确保您的图书馆的片段能按照您所期望的那样, 单独地和一起地做。

source: Unit Tests
es: Pruebas por unidad
fr: Essais unitaires
id: Unit Test
tr: Birim Testleri
zh_cn: 单位测试

source: The purpose of unit tests is to test each unit of code in isolation from the rest of the code to quickly pinpoint where code is and isn’t working as expected. You’ll put unit tests in the `src` directory in each file with the code that they’re testing.
es: El propósito de las pruebas unitarias es probar cada unidad de código en forma aislada del resto del código para identificar rápidamente dónde está y no está funcionando el código como se esperaba. Pondrá pruebas unitarias en el directorio `src` en cada archivo con el código que están probando.
fr: Le but des tests unitaires est de tester chaque unité de code isolément du reste du code afin de déterminer rapidement où le code est et ne fonctionne pas comme prévu. Vous allez mettre des tests unitaires dans le répertoire `src` dans chaque fichier avec le code qu'ils sont test.
id: Tujuan tes unit adalah untuk menguji setiap unit kode dalam isolasi dari sisa kode untuk dengan cepat menentukan di mana kode dan tidak bekerja seperti yang diharapkan.
tr: Birim testlerinin amacı, kodun nerede olduğunu ve beklendiği gibi çalışmadığını hızlı bir şekilde belirlemek için kodun geri kalanından izole edilmiş olarak her bir birimi test etmektir. Test ettikleri kodla her dosyadaki src dizinine birim testleri koyacaksınız.
zh_cn: 单位测试的目的是在与代码其余部分分开的情况下测试每个代码单位,以便快速确定代码在哪些方面和在哪些方面没有达到预期效果。 单位测试将在每个文件的`src'目录中加上它们正在测试的代码。

source: The convention is to create a module named `tests` in each file to contain the test functions and to annotate the module with `#[cfg(test)]` attribute.
es: La convención es crear un módulo llamado `pruebas` en cada archivo para contener las funciones de prueba y anotar el módulo con el atributo '[cfg(test)]`.
fr: La convention est de créer un module nommé `tests` dans chaque fichier pour contenir les fonctions de test et pour annoter le module avec `#[cfg(test)]` attribut.
id: Konvensi ini untuk membuat sebuah modul bernama åtest dalam setiap berkas untuk memuat fungsi tes dan untuk mengulangi modul dengan atribut "#[cfgresslertest].
tr: Kongre, her dosyada test fonksiyonlarını içerecek ve modülü #[cfg(test)]] özniteliği ile anons edecek tests adında bir modül oluşturmaktır.
zh_cn: 常规是在每个文件中创建一个名为“测试”的模块,以包含测试功能,并用 {[cfg(test)]} 属性对模块进行注释。

source: The Tests Module and `#[cfg(test)]`
es: El módulo de pruebas y el «[cfg(test)]».
fr: Le module Essais et `#[cfg(test)]`
id: Modul Penguji dan C# [cfginskytest]]
tr: Test Modülü ve #[cfg(test)]
zh_cn: 测试模块和{{{[fcg(test)]}`

source: <span class="caption">Filename: src/lib.cairo</span>
fr: <span class="caption">Nom du fichier: src/lib.cairo</span>
tr: span class="caption">Dosya adı: src/lib.cairo/span>
zh_cn: <span类=“ caption” >Filename: src/lib.cairo </span>

source: Integration Tests
es: Pruebas de integración
fr: Essais d'intégration
id: Tes Integrasi
tr: Entegrasyon Testleri
zh_cn: 整合试验

source: The _tests_ Directory
es: El _tests_ Directorio
fr: Le répertoire _tests_
id: _Direktori Tes_t
tr: _tests_ Dizini
zh_cn: 测试目录(_T)

source: "internal_adder failed"
es: "internal_adder falló"
fr: "le _adder interne a échoué"
id: "internal_adder gagal"
tr: "internal_adder başarısız oldu"
zh_cn: “ 内部 - adder 失败 ”

source: {{#quiz ../quizzes/ch10-02-testing-organization.toml}}
fr: {{#quiz../quizes/ch10-02-test-organization.toml}}
id: {{#quiz../quizzes/ch10-02-testing-organisasi.toml}}}
zh_cn: Quiz./quizzes/ch10-02-测试组织.toml

source: Advanced Features
es: Características avanzadas
fr: Caractéristiques avancées
id: Fitur Lanjutan
tr: Gelişmiş Özellikler
zh_cn: 高级特征

source: Now, let's learn about more advanced features offered by Cairo.
es: Ahora, vamos a aprender sobre las características más avanzadas ofrecidas por El Cairo.
fr: Maintenant, nous allons en apprendre plus sur les fonctionnalités plus avancées offertes par le Caire.
id: Sekarang, mari kita belajar tentang fitur yang lebih maju ditawarkan oleh Kairo.
tr: Şimdi Kahire'nin sunduğu daha gelişmiş özellikler hakkında bilgi verelim.
zh_cn: 现在,让我们来学习一下开罗提供的更先进的特色。

source: When you first start programming in Cairo, you'll likely want to use arrays (`Array<T>`) to store collections of data. However, you will quickly realize that arrays have one big limitation - the data stored in them is immutable. Once you append a value to an array, you can't modify it.
es: Cuando empiece a programar por primera vez en El Cairo, es probable que desee utilizar arrays (`Array<TÃ3n) para almacenar colecciones de datos. Sin embargo, se dará cuenta rápidamente de que los arrays tienen una gran limitación - los datos almacenados en ellos son inmutables. Una vez que añada un valor a un array, no puede modificarlo.
fr: Lorsque vous commencerez à programmer au Caire, vous voudrez probablement utiliser des tableaux (`Array<T>`) pour stocker des collections de données. Cependant, vous vous rendrez rapidement compte que les tableaux ont une grande limitation - les données stockées dans eux sont immuables. Une fois que vous ajoutez une valeur à un tableau, vous ne pouvez pas le modifier.
id: Ketika Anda pertama kali memulai pemrograman di Kairo, Anda mungkin ingin menggunakan array (Array<T>) untuk menyimpan koleksi data. Namun, Anda akan segera menyadari bahwa array memiliki satu pembatasan besar - data yang tersimpan di dalamnya dapat berubah. Setelah Anda menambahkan nilai ke array, Anda tidak dapat memodifikasinya.
tr: Kahire'de programlamaya ilk başladığınızda, büyük olasılıkla veri koleksiyonlarını depolamak için diziler (ArrayT>) kullanmak isteyeceksiniz. Bununla birlikte, dizilerin büyük bir sınırlamaya sahip olduğunu çabucak fark edeceksiniz - içlerinde depolanan veriler değiştirilemez. Bir diziye bir değer ekledikten sonra, bunu değiştiremezsiniz.
zh_cn: 当您首次在开罗启动编程时, 您可能想要使用数组 (`Array<T}) 来存储数据收藏。 但是, 您会很快意识到数组有一个很大的限制, 其中存储的数据是不可变的。 一旦您将一个数值附加到一个数组中, 您就不能修改它 。

source: This can be frustrating when you want to use a mutable data structure. For example, say you're making a game where the players have a level, and they can level up. You might try to store the level of the players in an array:
es: Esto puede ser frustrante cuando quieres usar una estructura de datos mutable. Por ejemplo, di que estás haciendo un juego donde los jugadores tienen un nivel, y pueden subir de nivel. Puedes intentar almacenar el nivel de los jugadores en una matriz:
fr: Cela peut être frustrant lorsque vous voulez utiliser une structure de données mutable. Par exemple, dites que vous faites un jeu où les joueurs ont un niveau, et ils peuvent le mettre à niveau. Vous pourriez essayer de stocker le niveau des joueurs dans un tableau:
id: Hal ini dapat membuat frustasi ketika Anda ingin menggunakan struktur data yang dapat berubah-ubah. Sebagai contoh, katakanlah Anda membuat permainan di mana para pemain memiliki tingkat, dan mereka dapat menaikkan level. Anda mungkin mencoba untuk menyimpan tingkat pemain dalam sebuah array:
tr: Değiştirilebilir bir veri yapısı kullanmak istediğinizde bu sinir bozucu olabilir. Örneğin, oyuncuların bir seviyeye sahip olduğu bir oyun yaptığınızı ve seviye atlayabildiklerini varsayalım. Oyuncuların seviyesini bir dizide saklamayı deneyebilirsiniz:
zh_cn: 当您想要使用可变数据结构时, 这可能令人沮丧。 例如, 说您正在做一个游戏, 玩家有一个级别, 并且他们可以平整。 您可能会尝试将玩家的级别存储在一个阵列中 :

source: But then you realize you can't increase the level at a specific index once it's set. If a player dies, you cannot remove it from the array unless he happens to be in the first position.
es: Pero entonces te das cuenta de que no puedes aumentar el nivel en un índice específico una vez que se establece. Si un jugador muere, no puedes eliminarlo de la matriz a menos que esté en la primera posición.
fr: Mais alors vous réalisez que vous ne pouvez pas augmenter le niveau à un index spécifique une fois qu'il est réglé. Si un joueur meurt, vous ne pouvez pas le supprimer du tableau à moins qu'il se trouve être dans la première position.
id: Tapi kemudian Anda menyadari bahwa Anda tidak dapat meningkatkan tingkat pada indeks tertentu setelah diatur. Jika seorang pemain meninggal, Anda tidak dapat menghapusnya dari array kecuali dia kebetulan berada di posisi pertama.
tr: Ancak daha sonra belirli bir indekste seviyeyi ayarlandıktan sonra artıramayacağınızı fark edersiniz. Bir oyuncu ölürse, ilk pozisyonda olmadığı sürece diziden çıkaramazsınız.
zh_cn: 但随后你就会意识到,一旦设定了特定的索引,你就不能提高它的水平。如果玩家死亡,除非他恰好处于第一个位置,否则你不能从数组中移除它。

source: Fortunately, Cairo provides a handy built-in [dictionary type](./ch03-02-dictionaries.md) called `Felt252Dict<T>` that allows us to simulate the behavior of mutable data structures. Let's first explore how to create a struct that contains, among others, a `Felt252Dict<T>`.
es: Afortunadamente, El Cairo proporciona un práctico [tipo diccionario] integrado(./ch03-02-dictionarys.md) llamado `Felt252Dict<Tó que nos permite simular el comportamiento de estructuras de datos mutables. Primero exploremos cómo crear una estructura que contenga, entre otros, un `Felt252Dict<Tó.
fr: Heureusement, le Caire fournit un [type de dictionnaire] (../ch03-02-dictionaries.md) appelé `Felt252Dict<T>` qui nous permet de simuler le comportement des structures de données mutables. Explorons d'abord comment créer une structure qui contient, entre autres, un `Felt252Dict<T>`.
id: Untungnya, Kairo menyediakan built-in yang berguna [tipe dialog][kiamat. /ch03-02-dictionary.md) yang disebut <T 252 Dict> yang memungkinkan kita untuk mensimulasikan perilaku struktur data yang dapat dimutasi. Mari kita pertama-tama mencari cara membuat struktur yang berisi, antara lain, sebuah {Felt252Dict<T>.
tr: Neyse ki, Kahire, değiştirilebilir veri yapılarının davranışını simüle etmemizi sağlayan Felt252DictT> adlı kullanışlı bir yerleşik [dictionary type] (./ch03-02-dictionaries.md) sağlar. İlk olarak, diğerlerinin yanı sıra, bir Felt252DictT> içeren bir yapı oluşturmayı araştıralım.
zh_cn: 幸运的是,开罗提供了一个称为“Felt252Dict<T”的便携内置[字典类型](./ch03-02-字典.md),使我们能够模拟可变数据结构的行为。让我们首先探索如何创建包含“Felt252Dict<T”等内容的支架。
