Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Using these syscalls can be handy for customized error handling or to get more control over the serialization/deserialization of the call data and the returned data. Here's an example demonstrating how to use a `call_contract_sycall` to call the `transfer` function of an ERC20 contract:
es: El uso de estos syscalls puede ser útil para la manipulación personalizada de errores o para obtener más control sobre la serialización/deserialización de los datos de llamada y los datos devueltos. Aquí hay un ejemplo que demuestra cómo usar un `call_contract_sycall` para llamar a la función `transferencia` de un contrato ERC20:
fr: L'utilisation de ces syscalls peut être pratique pour la manipulation d'erreurs personnalisées ou pour obtenir plus de contrôle sur la sérialisation/désactivation des données d'appel et des données retournées. Voici un exemple montrant comment utiliser un `call_contract_sycall` pour appeler la fonction `transfer` d'un contrat ERC20:
id: Menggunakan syscall ini dapat berguna untuk penanganan galat yang disesuaikan atau untuk mendapatkan lebih banyak kontrol atas serialisasi/deserialisasi dari data panggilan dan data yang dikembalikan. Berikut adalah contoh menunjukkan bagaimana menggunakan sebuah ▪call_contract_sycallé untuk memanggil fungsi ERC20:
tr: Bu syscall'ları kullanmak, özelleştirilmiş hata işleme için veya çağrı verilerinin ve iade edilen verilerin serileştirilmesi / serileştirilmesi üzerinde daha fazla kontrol elde etmek için kullanışlı olabilir. İşte bir ERC20 sözleşmesinin transfer işlevini aramak için bir call_contract_sycall nasıl kullanılacağını gösteren bir örnek:
zh_cn: 使用这些系统可方便地处理定制的错误,或对调用数据和返回的数据的序列化/脱序化获得更大的控制权。

source: "transferFrom"
es: "Transferencia de"
fr: "transfert de"
zh_cn: "从"

source: <span class="caption">Listing 15-6: A sample contract using syscalls.</span>
es: <span class="caption">Lista 15-6: Un contrato de muestra usando syscalls.</span>
fr: <span class="caption">Liste 15-6: Un contrat d'échantillon utilisant des syscalls.</span>
id: <span class="caption">Listing 15-6: Sebuah kontrak cuplikan menggunakan syscalls.</span>
tr: span class="caption="Listing 15-6: Syscalls kullanarak bir örnek sözleşme./span>
zh_cn: <span类=“caption” > listing 15-6: 使用 Syscalls 的样本合同。 </span>

source: To use this syscall, we passed in the contract address, the selector of the function we want to call (see next section), and the call arguments.
es: Para usar esta syscall, pasamos en la dirección del contrato, el selector de la función a la que queremos llamar (ver sección siguiente) y los argumentos de la llamada.
fr: Pour utiliser ce syscall, nous avons passé dans l'adresse du contrat, le sélecteur de la fonction que nous voulons appeler (voir la section suivante), et les arguments d'appel.
id: Untuk menggunakan syscall ini, kami melewati alamat kontrak, pemilih dari fungsi yang ingin kami panggil (lihat bagian berikutnya), dan argumen panggilan.
tr: Bu syscall'ı kullanmak için, sözleşme adresini, aramak istediğimiz fonksiyonun seçicisini (bir sonraki bölüme bakın) ve çağrı argümanlarını geçtik.
zh_cn: 为了使用这个轮廓,我们在合同地址、我们想要调用函数的选择人(见下一节)和调用参数中通过了。

source: The call arguments must be provided as an array of `felt252`. To build this array, we serialize the expected function parameters into an `Array<felt252>` using the `Serde` trait, and then pass this array as calldata. At the end, we are returned a serialized value which we'll need to deserialize ourselves!
es: Los argumentos de llamada deben ser provistos como una matriz de `felt252`. Para construir esta matriz, serializamos los parámetros de función esperados en un `Array<felt252® usando el rasgo `Serde`, y luego pasamos este array como calldata. Al final, se nos devuelve un valor seriado que necesitaremos para deserializarnos a nosotros mismos!
fr: Les arguments d'appel doivent être fournis en tant que tableau de `felt252`. Pour construire ce tableau, nous sérialisons les paramètres de fonction attendus en un `Array<felt252>` en utilisant le caractère `Serde`, puis passons ce tableau comme calldata. À la fin, nous sommes retournés une valeur sérialisée que nous devrons désérialiser nous-mêmes!
id: Argumen panggilan harus disediakan sebagai sebuah array \\fnCandara\fs60\b1\4cH000000\4aH80}untuk membangun array yang diharapkan menjadi sebuah array<felt252> {\4cH1011FF\fnGill Sans Ultra Bold Condensed\fs60\b1\4cH000000\4aH80}dan kemudian melewati array ini sebagai calldata.
tr: Çağrı argümanları bir dizi felt252 olarak sağlanmalıdır. Bu diziyi oluşturmak için, beklenen fonksiyon parametrelerini bir Arrayfelt252> Serde özelliğini kullanarak seri hale getiriyoruz ve daha sonra bu diziyi calldata olarak geçiyoruz. Sonunda, kendimizi deserialize etmemiz gereken serileştirilmiş bir değere geri dönüyoruz!
zh_cn: 调用参数必须作为“ felt252” 的阵列来提供。 要构建此阵列, 我们使用 ` serde' 特性将预期的函数参数序列化为 ` Array< felt252 ', 然后将此阵列作为调用数据传递。 最后, 我们被还回一个序列化值, 以便自我淡化!

source: Entry Point Selector
es: Selector de puntos de entrada
fr: Sélecteur de points d'entrée
id: Pemilih Titik Masukan
tr: Giriş Noktası Seçici
zh_cn: 切入点选择器

source: In the context of a smart contract, a selector is a unique identifier for a specific entrypoint of a contract. When a transaction is sent to a contract, it includes the selector in the calldata to specify which function should be executed.
es: En el contexto de un contrato inteligente, un selector es un identificador único para un punto de entrada específico de un contrato. Cuando una transacción se envía a un contrato, incluye el selector en los datos de llamada para especificar qué función debe ejecutarse.
fr: Dans le contexte d'un contrat intelligent, un sélecteur est un identifiant unique pour un point d'entrée spécifique d'un contrat. Lorsqu'une transaction est envoyée à un contrat, il inclut le sélecteur dans les calldata pour spécifier quelle fonction doit être exécutée.
id: Dalam konteks kontrak pintar, pemilih adalah identifier unik untuk titik masuk tertentu dari sebuah kontrak. Ketika transaksi dikirim ke sebuah kontrak, itu termasuk pemilih dalam calldata untuk menentukan fungsi mana yang mesti dijalankan.
tr: Akıllı bir sözleşme bağlamında, bir seçici, bir sözleşmenin belirli bir giriş noktası için benzersiz bir tanımlayıcıdır. Bir işlem bir sözleşmeye gönderildiğinde, hangi işlevin yürütülmesi gerektiğini belirtmek için çağrı verisindeki seçiciyi içerir.
zh_cn: 在智能合同中,选择人是一个合同具体切入点的独特识别符。在将交易发送给合同时,在调用数据中包括选择人,以具体说明应履行哪些职能。

source: On Starknet, the selector is computed by applying the `sn_keccak` hash function to the string representation of the function name. If the function name is `transfer`, the selector can be computed with `selector!("transfer")`
es: En Starknet, el selector se calcula aplicando la función `sn_keccak` hash a la representación de cadena del nombre de la función. Si el nombre de la función es `transferencia`, el selector se puede calcular con `selector!("transferencia")`
fr: Sur Starknet, le sélecteur est calculé en appliquant la fonction de hachage `sn_keccak` à la représentation en chaîne du nom de la fonction. Si le nom de la fonction est `transfer`, le sélecteur peut être calculé avec `selector!("transfer")`
id: Di Starknet, pemilih menghitung dengan menerapkan fungsi hash dari string representasi dari nama fungsi.
tr: Starknet'te seçici, fonksiyon adının dize gösterimine sn_keccak hash fonksiyonunu uygulayarak hesaplanır. Eğer fonksiyon adı transfer ise, seçici selector!("transfer") ile hesaplanabilir.
zh_cn: 在 Starknet 上,选择器的计算方法是将`sn_keccak' 散列函数应用到函数名称的字符串表示中。如果函数名称是`传输',选择器可以用`选择器! (')'来计算。

source: Note that in `starknet::call_contract_syscall`, we didn't specify the function name as a string, but rather used the `selector!` macro, which computes the `sn_keccak` hash of the provided function signature.
es: Tenga en cuenta que en `starknet::call_contract_syscall`, no especificamos el nombre de la función como una cadena, sino que usamos la macro `selector!`, que calcula el hash `sn_keccak` de la firma de la función proporcionada.
fr: Notez que dans `starknet::call_contract_syscall`, nous n'avons pas spécifié le nom de la fonction comme une chaîne de caractères, mais plutôt utilisé la macro `selector!`, qui calcule le hachage `sn_keccak` de la signature de la fonction fournie.
id: Perhatikan bahwa dalam åstarknet:call_contract_syscallé, kami tidak menspesifikasikan nama fungsi sebagai string, tetapi lebih memilih menggunakan makro!, yang menghitung hash fungsi yang diberikan.
tr: starknet::call_contract_syscall'de fonksiyon adını dize olarak belirtmediğimizi, bunun yerine verilen fonksiyon imzasının sn_keccak hash'ini hesaplayan selector! makrosunu kullandığını unutmayın.
zh_cn: 请注意,在“星网:Call_contract_syscall”中,我们没有指定函数名称为字符串,而是使用了`选择者!' 宏,该宏计算了所提供的函数签名的`sn_keccak' hash。

source: Bit-packing is a simple concept: use as few bits as possible to store a piece of data. When done well, it can significantly reduce the size of the data you need to store. This is especially important in smart contracts, where storage is expensive.
es: El empaquetado de bits es un concepto simple: utilizar tan pocos bits como sea posible para almacenar un pedazo de datos. Cuando se hace bien, puede reducir significativamente el tamaño de los datos que necesita almacenar. Esto es especialmente importante en los contratos inteligentes, donde el almacenamiento es caro.
fr: Le bit-packing est un concept simple: utiliser le moins de bits possible pour stocker un morceau de données. Une fois bien fait, il peut réduire considérablement la taille des données que vous devez stocker. Ceci est particulièrement important dans les contrats intelligents, où le stockage est coûteux.
id: Mengepak bit adalah konsep sederhana: gunakan beberapa bit mungkin untuk menyimpan sepotong data. Ketika dilakukan dengan baik, ia dapat secara signifikan mengurangi ukuran data yang perlu Anda simpan. Hal ini terutama penting dalam kontrak pintar, di mana penyimpanan mahal.
tr: Bit paketleme basit bir kavramdır: bir veri parçasını saklamak için mümkün olduğunca az bit kullanın. İyi yapıldığında, saklamanız gereken verilerin boyutunu önemli ölçüde azaltabilir. Bu, depolamanın pahalı olduğu akıllı sözleşmelerde özellikle önemlidir.
zh_cn: 比特包是一个简单的概念: 尽可能少使用比特来存储一个数据。 如果做得好, 它会大大缩小您需要存储的数据的大小 。 这在智能合同中特别重要, 智能合同中存储费用昂贵 。

source: When writing Cairo smart contracts, it is important to optimize storage usage to reduce gas costs. Indeed, most of the cost associated with a transaction is related to storage updates; and each storage slot costs gas to write to. This means that by packing multiple values into fewer slots, you can decrease the gas cost incurred by the users of your smart contract.
es: Al escribir contratos inteligentes de El Cairo, es importante optimizar el uso de almacenamiento para reducir los costos de gas. De hecho, la mayor parte del costo asociado con una transacción está relacionado con actualizaciones de almacenamiento; y cada ranura de almacenamiento cuesta gas a escribir. Esto significa que al empaquetar varios valores en menos ranuras, puede disminuir el costo de gas en que incurran los usuarios de su contrato inteligente.
fr: En effet, la plupart des coûts associés à une transaction sont liés à des mises à jour de stockage; et chaque fente de stockage coûte du gaz à écrire. Cela signifie qu'en emballeant plusieurs valeurs dans moins de fentes, vous pouvez réduire les coûts de gaz encourus par les utilisateurs de votre contrat intelligent.
id: Ketika menulis Kairo kontrak cerdas, sangat penting untuk mengoptimalkan penggunaan penyimpanan untuk mengurangi biaya gas. Memang, sebagian besar biaya yang terkait dengan transaksi terkait dengan pemutakhiran; dan setiap slot penyimpanan gas biaya untuk ditulis. Ini berarti bahwa dengan mengepak beberapa nilai ke slot yang lebih sedikit, Anda dapat mengurangi biaya gas yang dikeluarkan oleh pengguna kontrak pintar Anda.
tr: Kahire akıllı sözleşmeleri yazarken, gaz maliyetlerini azaltmak için depolama kullanımını optimize etmek önemlidir. Gerçekten de, bir işlemle ilişkili maliyetin çoğu depolama güncellemeleri ile ilgilidir; ve her bir depolama yuvasına yazılacak gaz maliyeti. Bu, birden fazla değeri daha az yuvaya paketleyerek, akıllı sözleşmenizin kullanıcılarının maruz kaldığı gaz maliyetini azaltabileceğiniz anlamına gelir.
zh_cn: 当签订开罗智能合同时,必须优化存储使用以降低天然气成本。 事实上,与交易相关的大部分成本都与存储更新相关;而每个存储槽的成本都与需要写入的天然气相关。 这意味着通过将多个价值包装到更少的空位中,您可以降低您智能合同用户的天然气成本。

source: Integer Structure and Bitwise Operators
es: Estructura integral y operadores de Bitwise
fr: Structure entière et opérateurs bitwise
id: Integer Structure dan Operator Bitwise
tr: Integer Yapısı ve Bitwise Operatörleri
zh_cn: 整数结构和位元运算符

source: An integer is coded on a certain number of bits, depending on its size (For example, a `u8` integer is coded on 8 bits).
es: Un entero está codificado en un cierto número de bits, dependiendo de su tamaño (Por ejemplo, un entero `u8` está codificado en 8 bits).
fr: Un entier est codé sur un certain nombre de bits, en fonction de sa taille (par exemple, un entier `u8` est codé sur 8 bits).
id: Sebuah integer dikodekan pada sejumlah bit tertentu, tergantung pada ukurannya (misalnya, sebuah integer dikodekan pada 8 bit).
tr: Bir tam sayı, boyutuna bağlı olarak belirli sayıda bit üzerinde kodlanır (örneğin, bir u8 tamsayısı 8 bit üzerinde kodlanır).
zh_cn: 整数根据其大小根据一定数位数编码(例如,“u8”整数按8位数编码)。

source: Intuitively, several integers can be combined into a single integer if the size of this single integer is greater than or equal to the sum of the sizes of the integers (For example, two `u8` and one `u16` in one `u32`).
es: Intuitivamente, varios enteros se pueden combinar en un solo entero si el tamaño de este entero es mayor o igual a la suma de los tamaños de los enteros (Por ejemplo, dos `u8` y uno `u16` en uno `u32`).
fr: Intuitivement, plusieurs entiers peuvent être combinés en un entier unique si la taille de cet entier unique est supérieure ou égale à la somme des grandeurs des entiers (par exemple, deux `u8` et un `u16` dans un seul `u32`).
id: Secara intuitif, beberapa integer dapat digabung menjadi satu integer jika ukuran integer tunggal ini lebih besar atau sama dengan jumlah dari ukuran integer (misalnya, dua ·u8) dan satu Áu16 dalam satu Áu32).
tr: Sezgisel olarak, bu tek tamsayının boyutu tamsayıların boyutlarının toplamından büyük veya eşitse, birkaç tamsayı tek bir tamsayıda birleştirilebilir (örneğin, iki u8 ve bir u16 bir u32).
zh_cn: 直观地说,如果单整数的大小大于或等于整数的大小之和(例如,一个`u32'中有两个`u8'和一个`u16'),几个整数可以合并成一个单整数。

source: But, to do that, we need some bitwise operators:
es: Pero, para hacer eso, necesitamos algunos operadores bitwise:
fr: Mais, pour ce faire, nous avons besoin de quelques opérateurs bitwise:
id: Tapi, untuk melakukan itu, kita perlu beberapa operator bitwise:
tr: Ancak, bunun için, bazı bitwise operatörlerine ihtiyacımız var:
zh_cn: 但是,为了做到这一点,我们需要一些略微明智的操作员:

source: multiplying or dividing an integer by a power of 2 shifts the integer value to the left or to the right respectively
es: multiplicar o dividir un entero por una potencia de 2 desplaza el valor entero a la izquierda o a la derecha respectivamente
fr: en multipliant ou en divisant un entier par une puissance de 2 déplace la valeur entière vers la gauche ou vers la droite respectivement
id: mengalikan atau membagi bilangan integer dengan kekuatan dari 2 menggeser nilai integer ke kiri atau ke kanan masing-masing
tr: Bir tamsayıyı 2'lik bir güçle çarpmak veya bölmek, tamsayı değerini sırasıyla sola veya sağa kaydırır.
zh_cn: 以 2 的功率乘或除以整数,将整数分别向左或向右移动

source: applying a mask (`AND` operator) on an integer value isolates some bits of this integer
es: aplicar una máscara (‘AND’ operator) a un valor entero aísla algunos bits de este entero
fr: l'application d'un masque (opérateur 'AND') sur une valeur entière isole certains bits de cet entier
id: menerapkan topeng (AND) pada nilai integer mengisolasi beberapa bit integer ini
tr: Bir tam sayı değeri üzerine bir maske (AND operatörü) uygulamak, bu tam sayının bazı bitlerini izole eder.
zh_cn: 在整数值上应用掩码 (`AND' 运算符) 来分离此整数的某些位数

source: adding (`OR` operator) two integers will combine both values into a single one.
es: añadir (‘OR’ operador) dos enteros combinarán ambos valores en uno solo.
fr: ajouter ("OU" opérateur) deux entiers combineront les deux valeurs en une seule.
id: menambahkan (Negara operator) dua integer akan menggabungkan kedua nilai menjadi satu.
tr: (OR operatörü) ekleyerek iki tam sayı, her iki değeri de tek bir değerde birleştirecektir.
zh_cn: 添加两个整数,将两个数值合并成一个数值。

source: With these bitwise operators, let's see how to combine two `u8` integers into a single `u16` integer (called `packing`) and reversely (called `unpacking`) in the following example:
es: Con estos operadores bitwise, veamos cómo combinar dos enteros `u8` en un solo entero `u16` (llamado `embalaje`) e inversamente (llamado `desembalaje`) en el siguiente ejemplo:
fr: Avec ces opérateurs bitwise, voyons comment combiner deux entiers `u8` en un seul entier `u16` (appelé `packing`) et inversement (appelé `unpacking`) dans l'exemple suivant:
id: Dengan operator bitwise ini, mari kita lihat bagaimana menggabungkan dua bilangan integer menjadi satu integer (disebut pengepakan secara terbalik) dalam contoh berikut:
tr: Bu bitwise operatörleri ile, iki u8 tamsayısını tek bir u16 tamsayısı (packing olarak adlandırılır) ve ters olarak (unpacking olarak adlandırılır) aşağıdaki örnekte nasıl birleştireceğimizi görelim:
zh_cn: 使用这些比位运算符,让我们看看如何将两个`u8'整数合并成一个`u16'整数(称为`包装'),并在以下示例中反向(称为`包装'):

source: Bit-packing in Cairo
es: Envases en Bit-packing en El Cairo
fr: Bit-packing au Caire
id: Mengepak bit di Kairo
tr: Kahire'de Bit-paketleme
zh_cn: 开罗的比特包装

source: The storage of a Starknet smart contract is a map with 2<sup>251</sup> slots, where each slot is a `felt252` which is initialized to 0.
es: El almacenamiento de un contrato inteligente Starknet es un mapa con 2 ranuras<sup>251</sup>, donde cada ranura es un `felt252` que se inicializa a 0.
fr: Le stockage d'un contrat intelligent Starknet est une carte avec 2 <sup>251</sup> slots, où chaque slot est un `felt252` qui est initialisé à 0.
id: Penyimpanan sebuah kontrak cerdas Starknet adalah peta dengan 2<sup>251</sup> slot, di mana masing-masing slot adalah a TMT252-- yang diinisialisasi menjadi 0.
tr: Bir Starknet akıllı sözleşmenin depolanması, her bir yuvanın 0 olarak başlatıldığı felt252 olan 2sup>251/sup> yuvalarına sahip bir haritadır.
zh_cn: Starknet智能合同的存储是一张2<sup>251 </sup> 槽的地图,其中每个槽为“felt252”,初始化为0。

source: As we saw earlier, to reduce gas costs due to storage updates, we have to use as few bits as possible, so we have to organize stored variables by packing them.
es: Como vimos antes, para reducir los costos de gas debido a las actualizaciones de almacenamiento, tenemos que utilizar tan pocos bits como sea posible, por lo que tenemos que organizar las variables almacenadas mediante el embalaje.
fr: Comme nous l'avons vu plus tôt, pour réduire les coûts du gaz en raison des mises à jour de stockage, nous devons utiliser le moins de bits possible, de sorte que nous devons organiser les variables stockées en les emballer.
id: Seperti yang kita lihat sebelumnya, untuk mengurangi biaya gas karena pemutakhiran penyimpanan, kita harus menggunakan beberapa bit sebisa mungkin, jadi kita harus mengatur variabel yang tersimpan dengan mengemasnya.
tr: Daha önce gördüğümüz gibi, depolama güncellemeleri nedeniyle gaz maliyetlerini azaltmak için mümkün olduğunca az bit kullanmak zorundayız, bu yüzden bunları paketleyerek depolanan değişkenleri organize etmeliyiz.
zh_cn: 正如我们早些时候所看到的那样,为了减少储存更新导致的气体成本,我们必须尽可能少地使用比特,所以我们必须通过包装来组织储存的变量。

source: For example, consider the following `Sizes` struct with 3 fields of different types: one `u8`, one `u32` and one `u64`. The total size is 8 + 32 + 64 = 104 bits. This is less than a slot size (i.e 251 bits) so we can pack them together to be stored into a single slot.
es: Por ejemplo, considere la siguiente estructura con tres campos de diferentes tipos: un `u8`, un `u32` y un `u64`. El tamaño total es de 8 + 32 + 64 = 104 bits. Esto es menos que un tamaño de ranura (es decir 251 bits) para que podamos empaquetarlos juntos para que se almacenen en una sola ranura.
fr: Par exemple, considérez la structure `Taille` suivante avec 3 champs de différents types: un `u8`, un `u32` et un `u64`. La taille totale est de 8 + 32 + 64 = 104 bits. C'est moins qu'une taille de fente (c'est-à-dire 251 bits) afin que nous puissions les emballer ensemble pour être stockés dans une seule fente.
id: Sebagai contoh, perhatikan struktur berikut ini dengan 3 bidang berbagai jenis: satu jenis ·u8, satu åu32 dan satu ukuran total adalah 8 + 32 + 64 = 104 bits. ini kurang dari ukuran slot (i.e 251 bits) sehingga kita dapat mengemasnya bersama-sama untuk disimpan ke dalam slot tunggal.
tr: Örneğin, aşağıdaki Sizes yapısını 3 farklı türdeki alanla düşünün: bir u8, bir u32 ve bir u64. Toplam boyut 8 + 32 + 64 = 104 bit'tir. Bu, bir yuva boyutundan (yani 251 bit) daha azdır, böylece onları tek bir yuvaya saklamak için bir araya getirebiliriz.
zh_cn: 例如,考虑以下`Sizes'结构有3个不同类型字段:1个`u8'、1个`u32'和1个`u64 ',总尺寸为8+32+64=104位,小于一个空位大小(即251位),这样我们就可以把它们放在一个空格中储存。

source: Note that, as it also fits in a `u128`, it's a good practice to use the smallest type to pack all your variables, so here a `u128` should be used.
es: Tenga en cuenta que, como también cabe en un `u128, es una buena práctica utilizar el tipo más pequeño para empaquetar todas sus variables, por lo que aquí se debe utilizar un `u128`.
fr: Notez que, comme il s'inscrit également dans un `u128`, c'est une bonne pratique d'utiliser le plus petit type pour emballer toutes vos variables, donc ici un `u128` doit être utilisé.
id: Perhatikan bahwa, karena itu juga cocok dalam sebuah ·u128, itu adalah praktek yang baik untuk menggunakan tipe terkecil untuk pak semua variabel Anda, jadi di sini a ·u128 yang harus digunakan.
tr: u128'ye de uyduğu için, tüm değişkenlerinizi paketlemek için en küçük türü kullanmak iyi bir uygulamadır, bu nedenle burada bir u128 kullanılmalıdır.
zh_cn: 请注意,由于它也适合`u128',因此使用最小类型来打包所有变量是一种良好做法,因此此处应使用`u128'。

source: To pack these 3 variables into a `u128` we have to successively shift them to the left, and finally sum them.
es: Para envasar estas 3 variables en un `u128` tenemos que desplazarlas sucesivamente a la izquierda, y finalmente sumarlas.
fr: Pour emballer ces 3 variables dans un `u128`, nous devons successivement les déplacer vers la gauche, et finalement les résumer.
id: Untuk mengemas 3 variabel ini ke dalam sebuah ·u128. Kita harus secara berturut-turut menggesernya ke kiri, dan akhirnya merangkumnya.
tr: Bu 3 değişkeni bir u128 olarak paketlemek için bunları art arda sola kaydırmamız ve son olarak bunları özetlememiz gerekir.
zh_cn: 要将这三个变数包装成一个`u128 ',我们就必须相继把它们移到左边,最后把它们相加。

source: To unpack these 3 variables from a `u128` we have to successively shift them to the right and use a mask to isolate them.
es: Para desenvasar estas 3 variables de un `u128` tenemos que desplazarlas sucesivamente a la derecha y utilizar una máscara para aislarlas.
fr: Pour déballer ces 3 variables d'un `u128`, nous devons successivement les déplacer vers la droite et utiliser un masque pour les isoler.
id: Untuk membongkar 3 variabel ini dari sebuah åu128. Kita harus secara berturut-turut memindahkannya ke kanan dan menggunakan topeng untuk mengisolasi mereka.
tr: Bu 3 değişkeni bir u128'den açmak için bunları art arda sağa kaydırmalı ve onları izole etmek için bir maske kullanmalıyız.
zh_cn: 要将这3个变量从`u128'中解开,我们必须相继将它们转移到右边,并用面具孤立它们。

source: The `StorePacking` Trait
es: El rasgo de `Almacenamiento`
fr: Le trait `StorePacking`
id: Trait StorePacking.
tr: StorePacking Trait
zh_cn: `托盘包装'托盘
