Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The example function body uses the `assert!` macro, which contains the result of adding 2 and 2, which equals 4. This assertion serves as an example of the format for a typical test. We'll explain in more detail how `assert!` works later in this chapter. Let’s run it to see that this test passes.
es: El cuerpo de la función de ejemplo utiliza la macro `assert!`, que contiene el resultado de añadir 2 y 2, que es igual a 4. Esta afirmación sirve como un ejemplo del formato para una prueba típica. Explicaremos con más detalle cómo `assert!` funciona más adelante en este capítulo. Vamos a ejecutarlo para ver que esta prueba pasa.
fr: Le corps de la fonction exemple utilise la macro `assert!`, qui contient le résultat de l'ajout de 2 et 2, qui est égal à 4. Cette affirmation sert d'exemple du format pour un test typique. Nous allons expliquer plus en détail comment `assert!` fonctionne plus loin dans ce chapitre.
id: Contoh tubuh fungsi menggunakan makro! yang berisi hasil penambahan 2 dan 2, yang sama dengan 4. pernyataan ini berfungsi sebagai contoh dari format untuk tes khas. kita akan menjelaskan secara lebih detail bagaimana assert! bekerja kemudian di bab ini.
tr: Örnek fonksiyon gövdesi, 2 ve 2 ekleme sonucunu içeren assert! makrosunu kullanır, bu da 4'e eşittir. Bu iddia, tipik bir test için formatın bir örneği olarak hizmet eder. assert!'nin bu bölümde daha sonra nasıl çalıştığını daha ayrıntılı olarak açıklayacağız. Bu testin geçtiğini görmek için çalıştıralım.
zh_cn: 示例函数主体使用`assirt!' 宏, 其中包括增加2和2的结果, 等于 4 。 此声明是典型测试格式的一个例子。 我们将更详细地解释`assirt!' 如何在本章后面部分起作用。 让我们运行它,看看这个测试是否通过。

source: The `scarb cairo-test` command runs all tests found in our project, and shows the following output:
es: El comando `scarb cairo-test` ejecuta todas las pruebas encontradas en nuestro proyecto, y muestra la siguiente salida:
fr: La commande `scarb cairo-test` exécute tous les tests trouvés dans notre projet, et affiche la sortie suivante:
id: Perintah kairo-test-timbun menjalankan semua tes yang ditemukan dalam proyek kami, dan menunjukkan output berikut:
tr: scarb cairo-test komutu projemizde bulunan tüm testleri çalıştırır ve aşağıdaki çıktıyı gösterir:
zh_cn: `scarb cairo-test'命令运行我们项目中发现的所有测试,并显示以下产出:

source: `scarb cairo-test` compiled and ran the test. We see the line `running 1 test`. The next line shows the name of the test function, called `it_works`, and that the result of running that test is `ok`. The test runner also provides an estimation of the gas consumption. The overall summary `test result: ok.` means that all the tests passed, and the portion that reads `1 passed; 0 failed` totals the number of tests that passed or failed.
es: La siguiente línea muestra el nombre de la función de prueba, llamada `it_works`, y que el resultado de la ejecución de esa prueba es `ok`. El corredor de la prueba también proporciona una estimación del consumo de gas. El resumen general `test result: ok.` significa que todas las pruebas pasaron, y la porción que dice `1 pasó; 0 falló` totaliza el número de pruebas que pasaron o fallaron.
fr: La ligne suivante indique le nom de la fonction d'essai, appelée `it_works`, et le résultat de l'exécution de cet essai est `ok`. Le coureur d'essai fournit également une estimation de la consommation de gaz. Le résumé général `résultat d'essai: ok.` signifie que tous les essais ont réussi, et la partie qui se lit `1 réussi; 0 échoué` totalise le nombre d'essais qui ont réussi ou échoué.
id: baris berikutnya menunjukkan nama dari fungsi tes, yang disebut æit_worksést, dan bahwa hasil dari menjalankan tes tersebut adalah ook. pelari yang juga memberikan estimasi dari konsumsi gas.
tr: scarb cairo-test derlendi ve testi çalıştırdı. running 1 test çizgisini görüyoruz. Bir sonraki satır it_works denilen test fonksiyonunun adını gösterir ve bu testin sonucunun ok olduğunu gösterir. Test koşucusu ayrıca gaz tüketiminin bir tahminini de sağlar. Genel özet test sonucu: Tamam. tüm testlerin geçtiği ve 0'ın geçtiği anlamına gelir;
zh_cn: " scarb cairo-test " 编译并运行了测试,我们看到了 " 运行1号测试 " 的线条。下一行显示测试函数的名称,称为`it_works ',测试结果为`ok ',测试运行结果也提供了气体消耗量的估计。总体摘要 " 测试结果:OK. " 是指所有测试都通过,以及部分内容为`1号通过;0号失败 " 的测试总数为通过或失败的测试总数。

source: It’s possible to mark a test as ignored so it doesn’t run in a particular instance; we’ll cover that in the [Ignoring Some Tests Unless Specifically Requested](#ignoring-some-tests-unless-specifically-requested) section later in this chapter. Because we haven’t done that here, the summary shows `0 ignored`. We can also pass an argument to the `scarb cairo-test` command to run only a test whose name matches a string; this is called filtering and we’ll cover that in the [Running Single Tests](#running-single-tests) section. Since we haven’t filtered the tests being run, the end of the summary shows `0 filtered out`.
es: Es posible marcar una prueba como ignorada para que no se ejecute en una instancia en particular; cubriremos eso en la sección [Ignorar algunas pruebas a menos que se soliciten específicamente] (#ignoring-some-tests-a menos que se solicite específicamente) más adelante en este capítulo. Debido a que no lo hemos hecho aquí, el resumen muestra `0 ignorado`. También podemos pasar un argumento al comando `scarb cairo-test` para ejecutar sólo una prueba cuyo nombre coincide con una cadena; esto se llama filtrado y lo cubriremos en la sección [Running Single Tests] (#running-single tests). Como no hemos filtrado las pruebas que se están ejecutando, el final del resumen muestra `0 filtrado`.
fr: Il est possible de marquer un test comme ignoré de sorte qu'il n'est pas exécuté dans un cas particulier; nous allons couvrir cela dans la section [Ignorer certains tests à moins que spécifiquement demandé](#ignorer-certains tests-sauf-spécifiquement-requis) plus loin dans ce chapitre. Parce que nous n'avons pas fait cela ici, le résumé montre `0 ignoré`. Nous pouvons également passer un argument à la commande `scarb cairo-test` pour exécuter seulement un test dont le nom correspond à une chaîne; ceci est appelé filtrage et nous allons couvrir cela dans la section [Running Single Tests](#running-single-tests). Puisque nous n'avons pas filtré les tests en cours d'exécution, la fin du résumé montre `0 filtré dehors`.
id: Ini memungkinkan untuk menandai sebuah tes yang diabaikan sehingga tidak berjalan dalam hal tertentu; kita akan menutupi bahwa dalam [Ignore Beberapa Tes Kecuali Khusus Dimohonkan] Kami juga dapat melewati argumen untuk Ásbiro-test-terkecuali-spesifikasi) bagian kemudian dalam bab ini. Karena kita belum melakukan itu di sini, ringkasan menunjukkan ·0 diabaikan.
tr: Belirli bir örnekte çalışmaması için bir testi görmezden gelinmiş olarak işaretlemek mümkündür; Bu bölümde daha sonra [Belirli İstenmedikçe Bazı Testleri Görmezden Gelmek](#ignoring-some-tests-unless-specificly-requested) bölümünde bunu ele alacağız. Çünkü burada sadece bunu yapmadık, özet 0 görmezden gelindi. Ayrıca scar'a bir argüman aktarabiliriz.
zh_cn: 可以将测试标记为忽略,这样它不会在某个特定情况下运行;我们将在本章后面的[具体要求之外的忽略某些测试]部分(#ignoring- some-tests-除非具体要求的)部分中涵盖这一点。由于我们没有这样做,摘要显示“没有忽略”。我们也可以向`scarb cairo-test'命令提出一个论点,只运行一个与字符串相符的测试;这被称为过滤,我们将覆盖在[运行单测试](#运行-sing-le-tests)部分中。由于我们没有过滤正在运行的测试,摘要的结尾显示“无过滤 ” 。

source: Let’s start to customize the test to our own needs. First change the name of the `it_works` function to a different name, such as `exploration`, like so:
es: Comencemos a personalizar la prueba a nuestras propias necesidades. Primero cambie el nombre de la función `it_works` a un nombre diferente, como `exploración`, así:
fr: Laissez-nous commencer à personnaliser le test en fonction de nos propres besoins. Tout d'abord, changez le nom de la fonction `it_works` en un autre nom, tel que `exploration`, comme ceci:
id: Mari kita ubah nama fungsinya menjadi nama yang berbeda, seperti 'exploration'.
tr: Testi kendi ihtiyaçlarımıza göre özelleştirmeye başlayalım. Önce it_works fonksiyonunun adını exploration gibi farklı bir isimle değiştirin:
zh_cn: 让我们开始根据我们自己的需求定制测试。 首先将“it_works” 函数的名称更改为不同的名称, 如“ 探索”, 类似 :

source: Then run `scarb cairo-test` again. The output now shows `exploration` instead of `it_works`:
es: Luego vuelva a ejecutar `scarb cairo-test`. La salida ahora muestra `exploración` en lugar de `it_works`:
fr: Ensuite lancez à nouveau `scarb cairo-test`. La sortie affiche maintenant `exploration` au lieu de `it_works`:
id: Kemudian jalankan lagi. keluaran sekarang menunjukkan eksplorasi, bukan æit_works:
tr: Sonra scarb cairo-test tekrar çalıştır. Çıktı şimdi it_works yerine exploration gösterir:
zh_cn: 然后再次运行“scarb cairo-test” 。 现在的输出显示“ 探索”, 而不是“it_ works ” :

source: Now we’ll add another test, but this time we’ll make a test that fails! Tests fail when something in the test function panics. Each test is run in a new thread, and when the main thread sees that a test thread has died, the test is marked as failed. Enter the new test as a function named `another`, so your _src/lib.cairo_ file looks like in Listing 10-2.
es: Ahora vamos a añadir otra prueba, pero esta vez vamos a hacer una prueba que falla! Las pruebas fallan cuando algo en la función de prueba entra en pánico. Cada prueba se ejecuta en un nuevo hilo, y cuando el hilo principal ve que un hilo de prueba ha muerto, la prueba está marcada como fallida. Introduzca la nueva prueba como una función llamada `otro`, por lo que su _src/lib.cairo_ archivo se ve como en Listado 10-2.
fr: Maintenant nous allons ajouter un autre test, mais cette fois nous allons faire un test qui échoue! Les tests échouent quand quelque chose dans la fonction de test panique. Chaque test est exécuté dans un nouveau thread, et quand le thread principal voit qu'un thread de test est mort, le test est marqué comme échoué. Entrez le nouveau test comme une fonction nommée `another`, de sorte que votre fichier _src/lib.cairo_ ressemble à dans Listing 10-2.
id: Sekarang kita akan menambahkan tes yang lain, tapi kali ini kita akan membuat tes yang gagal! tes gagal ketika sesuatu dalam uji coba panik fungsi. dan ketika benang utama melihat bahwa benang tes telah mati, tes ditandai sebagai gagal. masukkan tes baru sebagai fungsi lain bernama Á, sehingga file Anda _src/.cairo_ tampak seperti Listing 10-2.
tr: Şimdi başka bir test ekleyeceğiz, ancak bu sefer başarısız olan bir test yapacağız! Test fonksiyonundaki bir şey paniklediğinde testler başarısız olur. Her test yeni bir iplikte çalıştırılır ve ana iplik bir test ipliğinin öldüğünü gördüğünde, test başarısız olarak işaretlenir. Yeni testi another adlı bir işlev olarak girin, böylece _src/lib.cairo_ dosyanız Listeleme 10-2'deki gibi görünür.
zh_cn: 现在,我们将添加另一个测试, 但这次我们将做一个失败的测试! 当测试函数中的某些内容出现恐慌时, 测试就会失败 。 每次测试都是在一条新线中运行, 当主线看到测试线索已经死亡时, 测试就会被标记为失败 。 输入新测试时, 函数名称为“ another ”, 所以您的 _ src/lib.cairo_ 文件在 Listing 10-2 中看起来类似 。

source: "Make this test fail"
es: "Haz que esta prueba fracase"
fr: "Faites échouer ce test"
id: "Membuat tes ini gagal"
tr: "Bu testi başarısız kıl"
zh_cn: "让这个测试失败"

source: <span class="caption">Listing 10-2: Adding a second test in _lib.cairo_ that will fail</span>
es: <span class="caption">Lista 10-2: Añadir una segunda prueba en _lib.cairo_ que fallará</span>
fr: <span class="caption">Liste 10-2: Ajout d'un deuxième test dans _lib.cairo_ qui échouera</span>
id: <span class="caption">Listing 10-2: Menambahkan tes kedua dalam _lib.cairo_ yang akan gagal</span>
tr: span class="caption">Listeleme 10-2: Başarısız olacak _lib.cairo_'da ikinci bir test ekleme/span>
zh_cn: <span class="caption" > listing -10: 在 _lib.cairo_ 添加第二个失败测试 </span>

source: Run `scarb cairo-test` and you will see the following output:
es: Ejecute `scarb cairo-test` y verá la siguiente salida:
fr: Exécutez `scarb cairo-test` et vous verrez la sortie suivante:
id: Jalankan kairo-test kareb dan Anda akan melihat keluaran berikut:
tr: scarb cairo-test 'i çalıştırın ve aşağıdaki çıktıyı göreceksiniz:
zh_cn: 运行'scarb cairo-test ',您将看到以下输出 :

source: Instead of `ok`, the line `adder::another` shows `fail`. A new section appears between the individual results and the summary. It displays the detailed reason for each test failure. In this case, we get the details that `another` failed because it panicked with `"Make this test fail"` error.
es: En lugar de `ok`, la línea `adder::another` muestra `fail`. Aparece una nueva sección entre los resultados individuales y el resumen. Muestra la razón detallada de cada fallo de prueba. En este caso, obtenemos los detalles de que `otro` falló porque entró en pánico con `"Haga que esta prueba falle"` error.
fr: Au lieu de `ok`, la ligne `adder::another` affiche `fail`. Une nouvelle section apparaît entre les résultats individuels et le résumé. Il affiche la raison détaillée de chaque échec de test. Dans ce cas, nous obtenons les détails que `another` a échoué parce qu'il a paniqué avec `"Make this test fail"` erreur.
id: Alih-alih dari ikhtisar, baris ini menunjukkan bahwa bagian baru muncul antara hasil individu dan ringkasannya. menunjukkan alasan rinci untuk setiap kegagalan tes. dalam hal ini, kita mendapatkan rincian yang lain gagal karena panik dengan "Membuat tes ini gagal" gagal.
tr: ok yerine, adder::another satırı fail gösterir. Bireysel sonuçlar ve özet arasında yeni bir bölüm görünür. Her test hatasının ayrıntılı nedenini gösterir. Bu durumda, "Bu testin başarısız olmasını sağla" hatası ile paniklediği için another başarısız olduğu ayrıntılarını alırız.
zh_cn: 而不是`ok', `adder::another' 显示`fail'。在单个结果和摘要之间出现新的一节,显示每次测试失败的详细原因。在此情况下,我们得到的细节是`另一个'失败,因为它惊慌失措,`让这个测试失败'错误。

source: The summary line is displayed at the end: overall, our test result is `FAILED`. We had one test pass and one test fail.
es: La línea de resumen se muestra al final: en general, nuestro resultado de la prueba es `FAILED`. Tuvimos un pase de prueba y un fallo de prueba.
fr: La ligne de résumé est affichée à la fin : dans l'ensemble, notre résultat de test est « FAILED ». Nous avons eu une réussite de test et un échec de test.
id: Secara keseluruhan, hasil tes kami gagal dan satu tes gagal.
tr: Özet satırı sonunda görüntülenir: genel olarak, bizim test sonucu FAILED. Biz bir test geçiş ve bir test başarısız vardı.
zh_cn: 总线在结尾处显示:总体而言,我们的测试结果为 " FAILED ",我们有一个测试通过,一个测试失败。

source: Now that you’ve seen what the test results look like in different scenarios, let’s look at some functions that are useful in tests.
es: Ahora que usted ha visto cómo se ven los resultados de la prueba en diferentes escenarios, vamos a ver algunas funciones que son útiles en las pruebas.
fr: Maintenant que vous avez vu à quoi ressemblent les résultats des tests dans différents scénarios, laissez-nous regarder certaines fonctions qui sont utiles dans les tests.
id: Sekarang Anda telah melihat apa hasil tes terlihat dalam skenario yang berbeda, mari kita lihat beberapa fungsi yang berguna dalam tes.
tr: Test sonuçlarının farklı senaryolarda nasıl göründüğünü gördüğünüze göre, testlerde yararlı olan bazı işlevlere bakalım.
zh_cn: 现在你们已经看到测试结果在不同情景中是什么样子, 让我们来看看在测试中有用的一些功能。

source: Checking Results with the `assert!` Macro
es: Comprobar los resultados con la macro `asertar!`
fr: Vérification des résultats avec le Macro `assert!`
id: Memeriksa Hasil dengan Macro
tr: Sonuçları assert! Makro ile kontrol etmek
zh_cn: 与“Assrt!” 宏核对结果

source: The `assert!` macro, provided by Cairo, is useful when you want to ensure that some condition in a test evaluates to `true`. We give the `assert!` macro the first argument that evaluates to a boolean. If the value is `true`, nothing happens and the test passes. If the value is `false`, the `assert!` macro calls `panic()` to cause the test to fail with a message we defined as the second argument. Using the `assert!` macro helps us check that our code is functioning in the way we intended.
es: La macro `asertar!`, proporcionada por El Cairo, es útil cuando se desea asegurar que alguna condición en una prueba se evalúa a `verdadero`. Damos a la macro `asertar!` el primer argumento que se evalúa a un booleano. Si el valor es `verdadero`, no pasa nada y la prueba pasa. Si el valor es `falso`, la macro `asertar!` llama a `panic()` para hacer que la prueba falle con un mensaje que definimos como el segundo argumento. El uso de la macro `asertar!'nos ayuda a comprobar que nuestro código está funcionando de la manera que se pretendía.
fr: La macro `assert!`, fournie par le Caire, est utile lorsque vous voulez vous assurer que certaines conditions dans un test évaluent à `true`. Nous donnons la macro `assert!` le premier argument qui évalue à un booléen. Si la valeur est `true`, rien ne se passe et le test passe. Si la valeur est `false`, la macro `assert!` appelle `panic()` pour faire échouer le test avec un message que nous définissons comme étant le deuxième argument. L'utilisation de la macro `assert!` nous aide à vérifier que notre code fonctionne de la manière que nous voulions.
id: Makro pertama yang dievaluasi ke boolean. jika nilainya benar-benar tidak ada yang terjadi dan tes tidak ada yang terjadi.
tr: Kahire tarafından sağlanan assert! makrosu, bir testteki bazı durumların true olarak değerlendirilmesini sağlamak istediğinizde yararlıdır. assert! makrosuna bir boolean'a değer veren ilk argümanı veriyoruz. Eğer değer true ise, hiçbir şey olmaz ve test geçer. Eğer değer false ise, assert! makrosu panic() olarak adlandırılır.
zh_cn: 开罗提供的`Asrt!'宏观,在确保测试中的某些条件对`真'进行评估时,非常有用。我们给`Asrt!'宏观第一个参数对布林进行评价,如果价值是`真',就不会发生任何情况,测试通过。如果价值是`假',那么`Asrt!'宏观调用`panic()'以使我们定义为第二个参数的电文使测试失败。我们使用`assrt!'宏观帮助我们检查我们的代码是否以我们预想的方式运作。

source: Remember in [Chapter 5](./ch05-03-method-syntax.md), we used a `Rectangle` struct and a `can_hold` method, which are repeated here in Listing 10-3. Let’s put this code in the _src/lib.cairo_ file, then write some tests for it using the `assert!` macro.
es: Recuerde en [Capítulo 5](./ch05-03-method-syntax.md), usamos una estructura `Rectangle` y un método `can_hold`, que se repiten aquí en la Lista 10-3. Pongamos este código en el archivo _src/lib.cairo_, luego escribamos algunas pruebas para ello usando la macro `asertar!`.
fr: Rappelez-vous dans [Chapitre 5](./ch05-03-method-syntax.md), nous avons utilisé une struct `Rectangle` et une méthode `can_hold`, qui sont répétés ici dans Listing 10-3. Laissez-nous mettre ce code dans le fichier _src/lib.cairo_, puis écrivez quelques tests pour lui en utilisant la macro `assert!`.
id: Ingat di [Chapter 5] Helsing./ch05-03-method-syntax.md), kami menggunakan ▪Rectangle struct dan sebuah metode ▪can_holdå, yang diulangi di sini dalam Listing 10-3.
tr: Hatırlayın [Bölüm 5](./ch05-03-method-syntax.md), burada Listeleme 10-3'te tekrarlanan bir Rectangle struct ve can_hold yöntemini kullandık. Bu kodu _src/lib.cairo_ dosyasına koyalım, ardından assert! makrosunu kullanarak bazı testler yapalım.
zh_cn: 记住[第5章](./ch05-03-method-syngaty.md),我们使用了`矩形'支架和`Can_hold'方法,在列表 10-3中重复了这些方法。让我们把这个代码放入_src/lib.cairo_文件,然后用`assrt!'宏写一些测试。

source: <span class="caption">Listing 10-3: Using the `Rectangle` struct and its `can_hold` method from Chapter 5</span>
es: <span class="caption">Lista 10-3: Utilizando la estructura `Rectangle` y su método `can_hold` del capítulo 5</span>
fr: <span class="caption">Liste 10-3: Utilisation de la structure `Rectangle` et de sa méthode `can_hold` du chapitre 5</span>
id: <span class="caption">Listing 10-3: Menggunakan ▪Rectangleå struct dan metode åcan_hold predict 5</span>
tr: span class="caption">Listeleme 10-3: Rectangle yapısını ve can_hold yöntemini Bölüm 5/span> kullanarak
zh_cn: <span类=“Caption” > listing 10-3: 使用第5章 </span>中的`矩形'结构及其`Can_hold'方法

source: The `can_hold` method returns a `bool`, which means it’s a perfect use case for the `assert!` macro. We can write a test that exercises the `can_hold` method by creating a `Rectangle` instance that has a width of `8` and a height of `7` and asserting that it can hold another `Rectangle` instance that has a width of `5` and a height of `1`.
es: El método `can_hold` devuelve un `bool`, lo que significa que es un caso de uso perfecto para la macro `assert!`. Podemos escribir una prueba que ejerce el método `can_hold` creando una instancia `Rectangle` que tiene una anchura de `8` y una altura de `7` y afirmando que puede sostener otra instancia `Rectangle` que tiene una anchura de `5` y una altura de `1`.
fr: La méthode `can_hold` renvoie un `bool`, ce qui signifie qu`il est un cas d`utilisation parfait pour la macro `assert!`. Nous pouvons écrire un test qui exerce la méthode `can_hold` en créant une instance `Rectangle` qui a une largeur de `8` et une hauteur de `7` et en affirmant qu`elle peut tenir une autre instance `Rectangle` qui a une largeur de `5` et une hauteur de `1`.
id: Metode tersebut dapat digunakan kembali, yang berarti ini merupakan contoh penggunaan yang sempurna untuk makro. kita dapat menulis sebuah tes yang melatih metode tersebut dengan menciptakan sebuah ·Rectengle yang memiliki lebar 5 dan tinggi 0;1.
tr: can_hold yöntemi bir bool döndürür, bu da assert! makrosu için mükemmel bir kullanım durumu olduğu anlamına gelir. can_hold yöntemini, 8 genişliğinde ve 7 yüksekliğinde bir 7 yüksekliğe sahip bir Rectangle örneği oluşturarak ve 5 genişliğinde başka bir Rectangle örneğini tutabileceğini öne sürerek bir test yazabiliriz.
zh_cn: `Can_hold'方法返回`bool ',这意味着它是`assrt!'宏的完美应用案例。我们可以写一个测试,通过创建宽度为`8'和高度为`7'的`Rectangle'实例,并主张它可以持有另一个宽度为`5'和高度为`1'的`Rectangle'实例。

source: "rectangle cannot hold"
es: "El rectángulo no puede sostener"
fr: "le rectangle ne peut pas tenir"
id: "Rektangle cannot hold"
tr: "Rectangle dayanamaz"
zh_cn: 纠结无法支撑

source: We’ve named our test `larger_can_hold_smaller`, and we’ve created the two `Rectangle` instances that we need. Then we called the `assert!` macro and passed it the result of calling `larger.can_hold(@smaller)`. This expression is supposed to return `true`, so our test should pass. Let’s find out!
es: Hemos llamado a nuestra prueba `larger_can_hold_smaller`, y hemos creado las dos instancias `Rectangle` que necesitamos. Luego llamamos a la macro `assert!` y lo pasamos el resultado de llamar a `larger.can_hold(@smaller)`. Esta expresión se supone que devuelve `verdadero`, por lo que nuestra prueba debe pasar. Vamos a averiguar!
fr: Nous avons nommé notre test `larger_can_hold_smaller`, et nous avons créé les deux instances `Rectangle` dont nous avons besoin. Ensuite, nous avons appelé la macro `assert!` et l'avons passé le résultat de l'appel `larger.can_hold(@smaller)`. Cette expression est censée retourner `true`, donc notre test doit passer.
id: Kami telah menamai tes kami dengan nama yang kami butuhkan.
tr: Testimize büyük_can_hold_small adını verdik ve ihtiyacımız olan iki Rectangle örneğini oluşturduk. Sonra assert! makrosunu çağırdık ve büyüker.can_hold(@small) aramasının sonucunu geçtik. Bu ifadenin true dönmesi gerekiyor, yani testimiz geçmelidir. Hadi öğrenelim!
zh_cn: 我们把测试命名为`大'Can_hold_smaler ',我们创建了我们所需要的两个`矩形'实例,然后我们称之为`Assert!'宏观,通过称之为`大.can_hold(@smaler)'的结果,这个表达方式应该返回`真实 ',所以我们的测试应该通过。让我们找出答案!

source: It does pass! Let’s add another test, this time asserting that a smaller rectangle cannot hold a larger rectangle:
es: ¡Pasa! Agreguemos otra prueba, esta vez afirmando que un rectángulo más pequeño no puede sostener un rectángulo más grande:
fr: Il ne passe! Laissez-nous ajouter un autre test, cette fois affirmant qu'un rectangle plus petit ne peut pas tenir un rectangle plus grand:
id: Ini tidak lulus! kali ini menyatakan bahwa persegi panjang yang lebih kecil tidak dapat menahan persegi panjang yang lebih besar:
tr: Geçer! Bu sefer daha küçük bir dikdörtgenin daha büyük bir dikdörtgeni tutamayacağını öne süren başka bir test ekleyelim:
zh_cn: 我们再加一个测试, 认为一个较小的矩形不能维持一个更大的矩形:
