Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Note: Several concepts used in this chapter were already presented earlier in the book. We recommend checking out the following chapters if you need to revise them: [Structs](ch05-00-using-structs-to-structure-related-data.md), [Methods](./ch05-03-method-syntax.md), [Generic types](./ch08-00-generic-types-and-traits.md), [Traits](./ch08-02-traits-in-cairo.md).
es: Nota: Varios conceptos utilizados en este capítulo ya se presentaron anteriormente en el libro. Recomendamos revisar los siguientes capítulos si es necesario revisarlos: [Estructos](ch05-00-using-structs-to-structs-to-structure-related-data.md), [Métodos](./ch05-03-method-syntax.md), [Tipos genéricos](./ch08-00-tipos genéricos-and-traits.md), [Traits](./ch08-02-traits-in-cairo.md).
fr: Note : Plusieurs concepts utilisés dans ce chapitre ont déjà été présentés plus tôt dans le livre. Nous recommandons de vérifier les chapitres suivants si vous devez les réviser : [Structs](ch05-00-use-structs-to-structure-related-data.md), [Methods](../ch05-03-method-syntax.md), [Generic types](./ch08-00-generic-types-and-trats.md), [Traits](./ch08-02-trats-in-cairo.md).
id: Catatan: Beberapa konsep yang digunakan dalam bab ini telah disajikan sebelumnya dalam buku. kami menyarankan bab-bab berikut jika Anda perlu merevisinya: [Struktur05-00-structs-to-structural-data.md), [Meto-traods]tunik./ch03-method-syntax.md], [Generic types/08-generic-types-and-trats.ms.m],/Tra-tra-in-ird.2.
tr: Not: Bu bölümde kullanılan çeşitli kavramlar daha önce kitapta sunulmuştur. Yeniden gözden geçirmeniz gerekiyorsa aşağıdaki bölümleri kontrol etmenizi tavsiye ederiz: [Yapılar] (ch05-00-kullanım-yapı-yapı-bağlantılı-data.md), [Methods] (./ch05-03-method-syntax.md), [Generic types] (./ch08-00genic-tr.
zh_cn: 注:本书早些时候已经介绍了本章中使用的若干概念。如果需要修改这些概念,我们建议检查以下各章:[Structs](ch05-00-useing-structs-structs-to-结构相关数据.md),[方法](.ch05-03-method-syngy.md),[基因类型](./ch08-00-generic-type-types-and-traits.md),[traits](./ch08-02-traits-in-cairo.md)。

source: Dictionaries as Struct Members
es: Los diccionarios como miembros de la estructura
fr: Dictionnaires en tant que membres structurants
id: Kamus sebagai Anggota Struktur
tr: Struct Üyeleri Olarak Sözlükler
zh_cn: 作为严格成员的字典词典

source: Defining dictionaries as struct members is possible in Cairo but correctly interacting with them may not be entirely seamless. Let's try implementing a custom _user database_ that will allow us to add users and query them. We will need to define a struct to represent the new type and a trait to define its functionality:
es: Definir diccionarios como miembros de la estructura es posible en El Cairo, pero interactuar correctamente con ellos puede no ser totalmente perfecto. Intentemos implementar una base de datos personalizada _usuario_ que nos permitirá añadir usuarios y consultarlos. Necesitaremos definir una estructura para representar el nuevo tipo y un rasgo para definir su funcionalidad:
fr: Il est possible de définir les dictionnaires comme des membres de la structure au Caire, mais l'interaction correcte avec eux peut ne pas être entièrement transparente. Essayons de mettre en œuvre une base de données _user_ personnalisée qui nous permettra d'ajouter des utilisateurs et de les interroger. Nous devrons définir une structure pour représenter le nouveau type et un trait pour définir sa fonctionnalité:
id: Menentukan dictionary sebagai anggota struktur mungkin di Kairo tetapi benar-benar berinteraksi dengan mereka mungkin tidak sepenuhnya mulus. Mari kita coba menerapkan basis data _user_ khusus yang akan memungkinkan kita untuk menambahkan pengguna dan query mereka. Kita perlu mendefinisikan sebuah struktur untuk mewakili tipe baru dan sebuah sifat untuk mendefinisikan fungsinya:
tr: Kahire'de sözlükleri yapısal üyeler olarak tanımlamak mümkündür, ancak onlarla doğru bir şekilde etkileşimde bulunmak tamamen sorunsuz olmayabilir. Kullanıcıları eklememize ve sorgulamamıza izin verecek özel bir _user database_ uygulamasını deneyelim. Yeni türü ve işlevselliğini tanımlamak için bir özelliği temsil edecek bir yapı tanımlamamız gerekecek:
zh_cn: 将字典定义为结构成员在开罗是可能的, 但与它们进行正确互动可能不是完全无缝的。 让我们尝试执行一个自定义的用户数据库, 以便我们添加用户并查询它们。 我们需要定义一个结构来代表新类型, 以及定义其功能的特性 :

source: Our new type `UserDatabase<T>` represents a database of users. It is generic over the balances of the users, giving major flexibility to whoever uses our data type. Its two members are:
es: Nuestro nuevo tipo `UserDatabase<T® representa una base de datos de usuarios. Es genérico sobre los saldos de los usuarios, dando una gran flexibilidad a quien utiliza nuestro tipo de datos. Sus dos miembros son:
fr: Notre nouveau type `UserDatabase<T>` représente une base de données d'utilisateurs. Il est générique sur les soldes des utilisateurs, donnant une grande flexibilité à celui qui utilise notre type de données. Ses deux membres sont:
id: Tipe baru kita, UserDatabase<T> mewakili basis data pengguna. Ini generik atas keseimbangan pengguna, memberikan fleksibilitas utama kepada siapa pun yang menggunakan tipe data kita.
tr: Yeni türümüz UserDatabaseT> kullanıcıların bir veritabanını temsil eder. Kullanıcıların dengeleri üzerinde geneldir ve veri türümüzü kullananlara büyük esneklik sağlar. İki üyesi:
zh_cn: 我们的新类型“UsrDatabase<T ” 是一个用户数据库,通用于用户平衡,给使用我们数据类型的人很大的灵活性。

source: `users_updates`, the number of users updates in the dictionary.
es: `users_updates`, el número de usuarios actualiza en el diccionario.
fr: `users_updates`, le nombre d'utilisateurs mis à jour dans le dictionnaire.
id: Jumlah pengguna baru di kamus.
tr: users_updates, sözlükteki kullanıcı güncellemelerinin sayısı.
zh_cn: " 用户更新 ",即字典中更新的用户数量。

source: `balances`, a mapping of each user to its balance.
es: `equilibrios`, un mapeo de cada usuario a su equilibrio.
fr: "équilibres", une cartographie de chaque utilisateur à son équilibre.
id: Keseimbangan, pemetaan setiap pengguna terhadap keseimbangannya.
tr: balances, her kullanıcının dengesine bir haritalama.
zh_cn: `平衡 ',即每个用户的平衡图。

source: The database core functionality is defined by `UserDatabaseTrait`. The following methods are defined:
es: La funcionalidad básica de la base de datos se define por `UserDatabaseTrait`. Se definen los siguientes métodos:
fr: La fonctionnalité de base de données est définie par `UserDatabaseTrait`. Les méthodes suivantes sont définies:
id: Fungsi fungsi inti basis data didefinisikan oleh UserDatabaseTrait. Metode berikut didefinisikan:
tr: Veritabanı çekirdek işlevselliği UserDatabaseTrait tarafından tanımlanır. Aşağıdaki yöntemler tanımlanmıştır:
zh_cn: 数据库核心功能由 " UserDatabaseTrait " 界定。

source: `new` for easily creating new `UserDatabase` types.
es: `nuevo` para crear fácilmente nuevos tipos `UserDatabase`.
fr: `new` pour créer facilement de nouveaux types `UserDatabase`.
id: Untuk dengan mudah menciptakan jenis-jenis baru UserDatabase.
tr: new kolayca yeni UserDatabase türleri oluşturmak için.
zh_cn: `新 ',便于创建新的`用户数据库'类型。

source: `update_user` to update the balance of users in the database.
es: `update_user` para actualizar el equilibrio de usuarios en la base de datos.
fr: `update_user` pour mettre à jour le solde des utilisateurs dans la base de données.
id: Untuk memperbarui keseimbangan pengguna dalam basis data.
tr: update_user veritabanındaki kullanıcıların dengesini güncellemek için.
zh_cn: `更新用户 ',以更新数据库中用户的平衡。

source: `get_balance` to find user's balance in the database.
es: `get_balance` para encontrar el saldo del usuario en la base de datos.
fr: `get_balance` pour trouver l'équilibre de l'utilisateur dans la base de données.
id: Untuk menemukan keseimbangan pengguna di database.
tr: get_balance kullanıcı dengesini veritabanında bulmak için.
zh_cn: `找到`平衡'在数据库中找到用户的余额。

source: The only remaining step is to implement each of the methods in `UserDatabaseTrait`, but since we are working with [Generic types](./ch08-00-generic-types-and-traits.md) we also need to correctly establish the requirements of `T` so it can be a valid `Felt252Dict<T>` value type:
es: El único paso que queda es implementar cada uno de los métodos en `UserDatabaseTrait`, pero ya que estamos trabajando con [tipos genéricos](./ch08-00-genéricos-tipos-y-traits.md) también necesitamos establecer correctamente los requisitos de `T` para que pueda ser un tipo de valor válido `Felt252Dict<T®:
fr: La seule étape restante est de mettre en œuvre chacune des méthodes dans `UserDatabaseTrait`, mais puisque nous travaillons avec [Generic types](./ch08-00-generic-types-and-traits.md) nous devons également établir correctement les exigences de `T` afin que cela puisse être un type de valeur `Felt252Dict<T>` valide:
id: Satu-satunya langkah yang tersisa adalah mengimplementasikan setiap metode di UserDatabaseTrait, tetapi karena kita bekerja dengan [tipe Generik]./ch08-00-generic-types-and-traits.md) kita juga perlu menetapkan dengan benar persyaratan dari <T) sehingga dapat menjadi tipe nilai yang valid Felt252Dict<T>:
tr: Geriye kalan tek adım, UserDatabaseTrait'deki yöntemlerin her birini uygulamaktır, ancak [Generic types](./ch08-00-generic-types-and-traits.md) ile çalıştığımız için, T'nin gereksinimlerini doğru bir şekilde belirlememiz gerekir, böylece geçerli bir Felt252DictT> değer türü olabilir:
zh_cn: 剩下的唯一步骤是执行`用户DatabaseTrait'的每一种方法,但由于我们正在与[基因类型](./ch08-00-generic-type-types-and-traits.md)合作,我们还需要正确确定`T'的要求,以便它成为有效的`Felt252Dict<T}值类型:

source: `T` should implement the `Copy<T>` since it's required for getting values from a `Felt252Dict<T>`.
es: `T` debe implementar el `Copy<TÃ3n, ya que es necesario para obtener valores de un `Felt252Dict<TÃ3n.
fr: `T` devrait implémenter le `Copy<T>` puisqu'il est nécessaire pour obtenir des valeurs d'un `Felt252Dict<T>`.
id: Anda harus mengimplementasikan <T> karena diperlukan untuk mendapatkan nilai dari sebuah ▪Felt252Dict<T>.
tr: T, CopyT> değerini bir Felt252DictT>'den almak için gerekli olduğu için uygulamalıdır.
zh_cn: `T'应该执行`Copy<T',因为从`Felt252Dict<T'获取数值是必需的。

source: All value types of a dictionary implement the `Felt252DictValue<T>`, our generic type should do as well.
es: Todos los tipos de valor de un diccionario implementan el `Felt252DictValue<T®, nuestro tipo genérico también debería hacerlo.
fr: Tous les types de valeurs d'un dictionnaire implémentent le `Felt252DictValue<T>`, notre type générique devrait faire aussi bien.
id: Semua tipe nilai dari sebuah kamus yang menerapkan Felt252DictValue<T>, tipe umum kita juga harus melakukannya.
tr: Bir sözlüğün tüm değer türleri Felt252DictValueT>'yi uygular, jenerik türümüz de bunu yapmalıdır.
zh_cn: 字典的所有值类型都执行“Felt252DictValue<T,我们的通用类型也应这样做。

source: To insert values, `Felt252DictTrait<T>` requires all value types to be droppable (implement the `Drop<T>` trait).
es: Para insertar valores, `Felt252DictTrait<T® requiere que todos los tipos de valores sean droppable (implementar el rasgo `Drop<T®).
fr: Pour insérer des valeurs, `Felt252DictTrait<T>` exige que tous les types de valeurs soient droppables (mise en œuvre du caractère `Drop<T>`).
id: Untuk memasukkan nilai, diperlukan semua tipe nilai untuk dapat diturunkan (menimplementasi sifat <T> Ddroppable).
tr: Değerleri eklemek için, Felt252DictTraitT> tüm değer türlerinin bırakılabilir olmasını gerektirir (DropT> özelliğini uygulayın).
zh_cn: 要插入值,“Felt252DictTrait<T”要求所有值类型都可投放(执行“滴滴<T”特性)。

source: The implementation, with all restrictions in place, would be as follows:
es: La aplicación, con todas las restricciones, sería la siguiente:
fr: La mise en œuvre, avec toutes les restrictions en place, serait la suivante :
id: In implementasi, dengan semua pembatasan di tempat, akan sebagai berikut:
tr: Uygulama, yürürlükteki tüm kısıtlamalarla birlikte aşağıdaki gibi olacaktır:
zh_cn: 执行工作将按下列方式执行,并实行所有限制:

source: // Creates a database
es: // Crea una base de datos
fr: // Crée une base de données
id: //Membuat suatu basis data
tr: // Bir veritabanı oluşturur
zh_cn: / 创建数据库

source: // Get the user's balance
es: // Consigue el saldo del usuario
fr: // Obtenez le solde de l'utilisateur
tr: // Kullanıcının bakiyesini alın
zh_cn: 获得用户的余额

source: // Add a user
es: // Añadir un usuario
fr: // Ajouter un utilisateur
id: //Tambahkan pengguna
tr: // Bir kullanıcı ekle
zh_cn: / 添加用户

source: Our database implementation is almost complete, except for one thing: the compiler doesn't know how to make a `UserDatabase<T>` go out of scope, since it doesn't implement the `Drop<T>` trait, nor the `Destruct<T>` trait. Since it has a `Felt252Dict<T>` as a member, it cannot be dropped, so we are forced to implement the `Destruct<T>` trait manually (refer to the [Ownership](ch04-01-what-is-ownership.md#the-drop-trait) chapter for more information). Using `#[derive(Destruct)]` on top of the `UserDatabase<T>` definition won't work because of the use of [Generic types](./ch08-00-generic-types-and-traits.md) in the struct definition. We need to code the `Destruct<T>` trait implementation by ourselves:
es: La implementación de nuestra base de datos está casi completa, excepto por una cosa: el compilador no sabe cómo hacer que un `UserDatabase<T® salga del alcance, ya que no implementa el rasgo `Drop<T®, ni el rasgo `Destruct<T®. Ya que tiene un `Felt252Dict<T® como miembro, no puede ser eliminado, por lo que nos vemos obligados a implementar el rasgo `Destruct<T® manualmente (referir a la [Ownnership](ch04-01-what-is-ownership.md#the-drop-trait) capítulo para más información).Utilizar `[derive(Destruct)]` en la parte superior de la `UserDatabase<T® no funcionará debido al uso de [tipos genéricos](./ch08-00-genéricos-types-and-traits.md) en la definición de estructura.
fr: Notre implémentation de base de données est presque terminée, sauf pour une chose : le compilateur ne sait pas comment faire une `Base de données utilisateur<T>` sortir de la portée, puisqu'il n'implémente pas le caractère `Drop<T>` ni le caractère `Destruct<T>`. Puisqu'il a un chapitre `Felt252Dict<T>` en tant que membre, il ne peut pas être abandonné, nous sommes donc obligés d'implémenter le caractère `Destruct<T>` manuellement (voir la définition [Ownership](ch04-01- what-is-ownership.md#-the-drop-trait) pour plus d'informations). Utiliser `#[derive(Destruct)]` au-dessus de la `Base de données utilisateur<T>` ne fonctionnera pas en raison de l'utilisation de [types génériques](./ch08-00-generic-types-and-trats.md) dans la définition de structure. Nous devons coder l'implémentation `Destruct<T>`:
id: In implementasi basis data kami hampir selesai, kecuali satu hal: kompiler tidak tahu bagaimana membuat sebuah karakter ▪UserDatabase<T> pergi keluar dari jangkauan, karena tidak dapat diimplementasikan, jadi kita dipaksa untuk mengimplementasi karakter <T> secara manual, atau destruct<T>. Karena ia memiliki karakter ÁFelt252Dict> sebagai anggota, ia tidak dapat diturunkan, sehingga kita dipaksa untuk mengimplementasikan karakter <T> (refer ke [Ownership]01-isnizeder-thest.Tdrop-it) definisi <Trachigensigensigenik] [.
tr: Veritabanı uygulamamız neredeyse tamamlandı, tek bir şey hariç: derleyici UserDatabaseT> type(DropT>DrectT> typeDrectT> typeDrectT> typeDructT> typeDructT> kullanmak için gerekli değil, bu yüzden Felt252DictT> bir üye olarak, bu uygulama için zorlanırız.
zh_cn: 除了一件事以外,我们的数据库实施几乎是完整的:编译者不知道如何使“用户数据库<T ” 超出范围,因为它没有执行“滴滴<T 特性”或“销毁<T 特性” 。由于它作为成员拥有“Felt252Dict<T ”,因此无法丢弃,因此我们被迫在结构定义中使用“销毁” (./ch08-00-generic-type-type-andrits.md) 的手工特性(指[所有者] (ch04-01-what-what-own-own-own.md#d-droft-trait) 一章,以获取更多信息。在“用户数据库<T 定义” 之前,使用“ 发送(destruction) 定义不会起作用,因为在结构定义中使用[Generic类型] (./ch08-00-generic-ty-ty-ty-and.md) 。我们需要将“设计<T 执行” 定义编码:

source: Implementing `Destruct<T>` for `UserDatabase` was our last step to get a fully functional database. We can now try it out:
es: Implementar `Destruct<T® para `UserDatabase` fue nuestro último paso para obtener una base de datos completamente funcional. Ahora podemos probarlo:
fr: Mettre en œuvre `Destruct<T>` pour `UserDatabase` a été notre dernière étape pour obtenir une base de données entièrement fonctionnelle. Nous pouvons maintenant l'essayer:
id: Meniru Destruct<T> untuk UserDatabase adalah langkah terakhir kita untuk mendapatkan basis data yang berfungsi penuh.
tr: UserDatabase için DestructT> uygulamasının uygulanması, tamamen işlevsel bir veritabanı elde etmek için son adımımızdı. Artık deneyebilirsiniz:
zh_cn: 实施`为`用户数据库'实施“破坏<T'”是我们获得一个功能齐全的数据库的最后一步。

source: "Expected 40"
es: "Expedido 40"
fr: "Pendant 40"
id: "Diduga 40"
tr: "Beklenen 40"
zh_cn: "预期40"

source: "Expected 0"
es: "Especifíquese 0"
fr: "Espéré 0"
id: "Diduga 0"
tr: "Beklenen 0"
zh_cn: "预期0"

source: Simulating a Dynamic Array with Dicts
es: Simulación de una matriz dinámica con dictados
fr: Simulation d'un tableau dynamique avec des dicts
id: Simulasikan Array Dinamis dengan Dicts
tr: Dicts ile Dinamik Dizi Simülasyonu
zh_cn: 用 Dicts 模拟动态阵列

source: First, let's think about how we want our mutable dynamic array to behave. What operations should it support?
es: Primero, pensemos en cómo queremos que se comporte nuestra matriz dinámica mutable. ¿Qué operaciones debería soportar?
fr: Tout d'abord, réfléchissons à la façon dont nous voulons que notre tableau dynamique mutable se comporte.
id: Pertama, mari kita berpikir tentang bagaimana kita ingin kita bermutasi dinamika array untuk berperilaku. operasi apa yang harus mendukung?
tr: Öncelikle, değişken dinamik dizimizin nasıl davranmasını istediğimizi düşünelim. Hangi işlemleri desteklemeli?
zh_cn: 首先,让我们想一想我们如何让变异的动态阵列行为。它应该支持什么行动?

source: It should:
es: Debería:
fr: Il devrait:
id: Seharusnya:
tr: Olmalı:
zh_cn: 它应当:

source: Allow us to append items at the end.
es: Permítanos agregar elementos al final.
fr: Permettez-nous d'ajouter des éléments à la fin.
id: Izinkan kami untuk menambahkan item di akhir.
tr: Sondaki ögeleri eklememize izin verin.
zh_cn: 允许我们在末尾附加项目。

source: Let us access any item by index.
es: Vamos a acceder a cualquier elemento por índice.
fr: Accéder à n'importe quel élément par index.
id: Mari kita akses setiap item dengan indeks.
tr: Herhangi bir öğeye index ile erişmemize izin verin.
zh_cn: 让我们以指数方式查阅任何项目。

source: Allow setting the value of an item at a specific index.
es: Permitir establecer el valor de un elemento en un índice específico.
fr: Permettre de définir la valeur d'un élément à un indice spécifique.
id: Ijinkan menata nilai butir pada indeks tertentu.
tr: Bir öğenin değerini belirli bir indekste ayarlamaya izin verin.
zh_cn: 允许在特定索引中设定项目值。

source: Return the current length.
es: Devuelve la longitud actual.
fr: Retourne la longueur du courant.
id: Kembalikan panjang saat ini.
tr: Mevcut uzunluğu döndürün.
zh_cn: 返回当前长度 。

source: We can define this interface in Cairo like:
es: Podemos definir esta interfaz en El Cairo como:
fr: Nous pouvons définir cette interface au Caire comme:
id: Kita dapat menentukan antarmuka ini di Kairo seperti:
tr: Bu arayüzü Kahire'de şöyle tanımlayabiliriz:
zh_cn: 我们可以将开罗的这个界面定义为:

source: This provides a blueprint for the implementation of our dynamic array. We named it _Vec_ as it is similar to the `Vec<T>` data structure in Rust.
es: Esto proporciona un plano para la implementación de nuestro array dinámico. Lo nombramos _Vec_ ya que es similar a la estructura de datos `Vec<Ter® en Rust.
fr: Ceci fournit un plan pour l'implémentation de notre tableau dynamique. Nous l'avons nommé _Vec_ comme il est similaire à la structure de données `Vec<T>` dans Rust.
id: Ini menyediakan cetak biru untuk implementasi array dinamis kami. Kami menamainya _Vec_ karena mirip dengan struktur data åVec<T>.
tr: Bu, dinamik dizimizin uygulanması için bir taslak sağlar. Rust'taki VecT> veri yapısına benzediği için _Vec_ olarak adlandırdık.
zh_cn: 这是执行动态阵列的蓝图。 我们命名它为 _Vec_, 因为它类似于 Rust 中的“Vec<T ” 数据结构 。

source: Implementing a Dynamic Array in Cairo
es: Implementación de una matriz dinámica en El Cairo
fr: Mise en œuvre d'un tableau dynamique au Caire
id: Mengimplementasi Array Dynamic di Kairo
tr: Kahire'de Dinamik Bir Dizinin Uygulanması
zh_cn: 在开罗实施动态阵列

source: To store our data, we'll use a `Felt252Dict<T>` which maps index numbers (felts) to values. We'll also store a separate `len` field to track the length.
es: Para almacenar nuestros datos, usaremos un `Felt252Dict<T® que mapea los números de índice (se siente) a los valores. También almacenaremos un campo `len` separado para rastrear la longitud.
fr: Pour stocker nos données, nous utiliserons un `Felt252Dict<T>` qui cartographie les numéros d'index (felts) aux valeurs. Nous stockerons également un champ `len` séparé pour suivre la longueur.
id: Untuk menyimpan data kita, kita akan menggunakan medan terpisah Felt252Dict<T> yang memetakan nomor indeks (merasa) ke nilai-nilai.
tr: Verilerimizi depolamak için Felt252DictT> dizini numaralarını (felsefeleri) değerlere eşleyen bir Felt252DictT> kullanacağız. Uzunluğu izlemek için ayrı bir len alanı da depolayacağız.
zh_cn: 为了存储我们的数据, 我们将使用“ Felt252Dict<T” 来绘制值的索引编号( felts) 。 我们还会存储一个单独的“ len” 字段来跟踪长度 。

source: Here is what our struct looks like. We wrap the type `T` inside `Nullable` pointer to allow using any type `T` in our data structure, as explained in the [Dictionaries](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) section:
es: Así es como se ve nuestra estructura. Envolvemos el tipo `T` dentro del puntero `Nulable` para permitir el uso de cualquier tipo `T` en nuestra estructura de datos, como se explica en la sección [Diccionarios](./ch03-02-dictionarys.md#dictionarys-of-types-no-soported-natively):
fr: Voici à quoi ressemble notre structure. Nous enveloppons le type `T` à l'intérieur du pointeur `Nullable` pour permettre d'utiliser n'importe quel type `T` dans notre structure de données, comme expliqué dans la section [Dictionnaires](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natually) :
id: Ini yang terlihat seperti struktur kita. kita membungkus tipenya. /ch03-02-dictionaries.md#dictionary-of-types-not-supported-natively):
tr: İşte yapımızın neye benzediği. [Dictionaries](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) bölümünde açıklandığı gibi, veri yapımızda herhangi bir T tipinin kullanılmasına izin vermek için Nulable işaretçisinin içine T tipini sarıyoruz:
zh_cn: 这就是我们结构的外形。我们把`T'型号包在`Nullble'指针内,以便在我们的数据结构中使用任何类型的`T ',正如[字典](./ch03-02-词典.md#词典-类型不支持-本地)部分所解释的:

source: Since we again have `Felt252Dict<T>` as a struct member, we need to implement the `Destruct<T>` trait to tell the compiler how to make `NullableVec<T>` go out of scope.
es: Ya que tenemos de nuevo `Felt252Dict<T® como miembro de la estructura, tenemos que implementar el rasgo `Destruct<T® para decirle al compilador cómo hacer que `NullableVec<T® salga del alcance.
fr: Puisque nous avons à nouveau `Felt252Dict<T>` en tant que membre de structure, nous devons mettre en œuvre le caractère `Destruct<T>` pour dire au compilateur comment faire `NullableVec<T>` sortir de la portée.
id: Karena kita memiliki lagi Felt252Dict<T> sebagai anggota struct, kita perlu mengimplementasikan destruct <T> sifat untuk memberitahu kompiler bagaimana membuat NOullableVec<T> keluar dari jangkauan.
tr: Felt252DictT> bir yapısal üye olarak tekrar sahip olduğumuzdan, derleyiciye NulableVecT>'nin kapsam dışına çıkmasını söylemek için DestructT> özelliğini uygulamamız gerekir.
zh_cn: 由于我们再次拥有“Felt252Dict<T”作为支架成员,我们需要实施“破坏<T”特性,告诉汇编者如何使“NullbleVec<T”超出范围。
