Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The key thing that makes this vector mutable is that we can insert values into the dictionary to set or update values in our data structure. For example, to update a value at a specific index, we do:
es: Lo clave que hace que este vector mutable es que podemos insertar valores en el diccionario para establecer o actualizar valores en nuestra estructura de datos. Por ejemplo, para actualizar un valor en un índice específico, lo hacemos:
fr: La clé qui rend ce vecteur mutable est que nous pouvons insérer des valeurs dans le dictionnaire pour définir ou mettre à jour des valeurs dans notre structure de données. Par exemple, pour mettre à jour une valeur à un index spécifique, nous faisons:
id: Kunci yang membuat vektor ini dapat bermutasi adalah kita dapat memasukkan nilai ke dalam kamus untuk mengatur atau memperbarui nilai-nilai dalam struktur data kita. Sebagai contoh, untuk memperbarui suatu nilai pada indeks tertentu, kita lakukan:
tr: Bu vektörü değişken kılan en önemli şey, veri yapımızdaki değerleri ayarlamak veya güncellemek için sözlüğe değerler ekleyebilmemizdir. Örneğin, belirli bir indeksteki bir değeri güncellemek için şunları yaparız:
zh_cn: 使矢量变异的关键在于 我们可以在字典中插入值, 以设置或更新数据结构中的值。 例如, 要在特定索引中更新值, 我们做 :

source: "Index out of bounds"
es: "Index fuera de límites"
fr: "Index hors limites"
id: "Indeks out of bounds"
tr: "Sınırların dışında Index"
zh_cn: "内分泌出界"

source: This overwrites the previously existing value at that index in the dictionary.
es: Esto sobrescribe el valor previamente existente en ese índice en el diccionario.
fr: Cela écrase la valeur existante à cet indice dans le dictionnaire.
id: Ini menimpa nilai sebelumnya yang ada pada indeks dalam kamus.
tr: Bu, sözlüğün o indeksinde daha önce var olan değerin üzerine yazılır.
zh_cn: 此溢出在字典中该索引上先前存在的值 。

source: While arrays are immutable, dictionaries provide the flexibility we need for modifiable data structures like vectors.
es: Mientras que los arrays son inmutables, los diccionarios proporcionan la flexibilidad que necesitamos para estructuras de datos modificables como vectores.
fr: Alors que les tableaux sont immuables, les dictionnaires fournissent la flexibilité dont nous avons besoin pour modifier les structures de données comme les vecteurs.
id: Sementara array tidak dapat berubah, kamus menyediakan fleksibilitas yang kita butuhkan untuk struktur data yang dapat diubah seperti vektor.
tr: Diziler değiştirilemezken, sözlükler vektörler gibi değiştirilebilir veri yapıları için ihtiyaç duyduğumuz esnekliği sağlar.
zh_cn: 虽然阵列是不可变的,但词典提供了我们所需要的灵活性,用于可变数据结构,如矢量。

source: The implementation of the rest of the interface is straightforward. The implementation of all the methods defined in our interface can be done as follow :
es: La implementación del resto de la interfaz es sencilla. La implementación de todos los métodos definidos en nuestra interfaz se puede hacer de la siguiente manera:
fr: L'implémentation du reste de l'interface est simple. L'implémentation de toutes les méthodes définies dans notre interface peut se faire comme suit :
id: In implementasi dari seluruh antar muka langsung. implementasi dari semua metoda yang didefinisikan dalam antar muka kita dapat dilakukan sebagai berikut:
tr: Arayüzün geri kalanının uygulanması basittir. Arayüzümüzde tanımlanan tüm yöntemlerin uygulanması aşağıdaki gibi yapılabilir:
zh_cn: 其余接口的实施是直截了当的。

source: The full implementation of the `Vec` structure can be found in the community-maintained library [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_structures/src).
es: La plena aplicación de la estructura " Vec " puede encontrarse en la biblioteca comunitaria [Alexandria] (https://github.com/keep-starknet-strange/alexandria/tree/main/paquetes/data_structures/src).
fr: La mise en œuvre complète de la structure «Vec» se trouve dans la bibliothèque communautaire [Alexandria] (https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_structures/src).
id: In implementasi penuh dari struktur åVecé dapat ditemukan di perpustakaan yang dijaga masyarakat [Alexandria][Alexandria][Alexantria]://github.com/keep-starknet-strange/alandria/tree/main/packages/data_structs/src).
tr: Vec yapısının tam olarak uygulanması topluluk bakımlı kütüphanede bulunabilir [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_structures/src).
zh_cn: 在社区图书馆[Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_strucs/src)中可以找到 " Vec " 结构的充分实施情况。

source: Simulating a Stack with Dicts
es: Simulación de una pila con dictados
fr: Simulation d'une pile avec des dicts
id: Menasimulasi Stack dengan Dicts
tr: Diktlerle Bir Yığın Simülasyonu
zh_cn: 模拟带有二进制的堆叠

source: We will now look at a second example and its implementation details: a Stack.
es: Ahora veremos un segundo ejemplo y sus detalles de implementación: un Stack.
fr: Nous allons maintenant examiner un deuxième exemple et ses détails de mise en œuvre: un Stack.
id: Sekarang kita akan melihat contoh kedua dan rincian implementasinya: sebuah Stack.
tr: Şimdi ikinci bir örneğe ve uygulama detaylarına bakacağız: bir Stack.
zh_cn: 我们现在将研究第二个例子及其执行细节:一个堆叠。

source: A Stack is a LIFO (Last-In, First-Out) collection. The insertion of a new element and removal of an existing element takes place at the same end, represented as the top of the stack.
es: Una pila es una colección LIFO (Last-In, First-Out). La inserción de un elemento nuevo y la eliminación de un elemento existente tiene lugar en el mismo extremo, representado como la parte superior de la pila.
fr: Un Stack est une collection LIFO (Last-In, First-Out). L'insertion d'un nouvel élément et la suppression d'un élément existant a lieu à la même extrémité, représentée comme le sommet de la pile.
id: Stack adalah sebuah koleksi LIFO (Last-In, First-Out). Pemasukan dari elemen baru dan penghapusan dari elemen yang ada terjadi pada bagian yang sama, yang diwakili sebagai puncak stack.
tr: Stack bir LIFO (Last-In, First-Out) koleksiyonudur. Yeni bir elemanın eklenmesi ve mevcut bir elemanın çıkarılması, yığının üst kısmı olarak temsil edilen aynı uçta gerçekleşir.
zh_cn: Stack 是一个 LIFO( Last- in, first- out) 收藏。 插入新元素和删除现有元素发生在同一端, 以堆叠的顶部表示 。

source: Let us define what operations we need to create a stack:
es: Definamos qué operaciones necesitamos para crear una pila:
fr: Définissons quelles opérations nous avons besoin pour créer une pile :
id: Mari kita mendefinisikan operasi apa yang kita butuhkan untuk membuat sebuah stack:
tr: Bir yığın oluşturmak için hangi işlemleri yapmamız gerektiğini tanımlayalım:
zh_cn: 让我们界定我们需要什么行动来创造堆叠:

source: Push an item to the top of the stack.
es: Empuje un elemento en la parte superior de la pila.
fr: Poussez un objet sur le dessus de la pile.
id: Push item ke puncak stack.
tr: Bir öğeyi yığının tepesine itin.
zh_cn: 将一个项目推到堆叠的顶端 。

source: Pop an item from the top of the stack.
es: Añadir un artículo de la parte superior de la pila.
fr: Déposez un objet du haut de la pile.
id: Pop item dari atas tumpukan.
tr: Yığının üst kısmından bir parça aç.
zh_cn: 从堆叠顶部弹出一个项 。

source: Check whether there are still any elements in the stack.
es: Compruebe si todavía hay elementos en la pila.
fr: Vérifiez s'il y a encore des éléments dans la pile.
id: Periksa apakah masih ada elemen dalam stack.
tr: Yığında hala herhangi bir eleman olup olmadığını kontrol edin.
zh_cn: 检查堆栈中是否还有元素 。

source: From these specifications we can define the following interface :
es: A partir de estas especificaciones podemos definir la siguiente interfaz:
fr: A partir de ces spécifications, nous pouvons définir l'interface suivante :
id: Dari spesifikasi ini kita dapat menentukan antarmuka berikut:
tr: Bu özelliklerden aşağıdaki arayüzü tanımlayabiliriz:
zh_cn: 根据这些规格,我们可以界定以下界面:

source: Implementing a Mutable Stack in Cairo
es: Implementación de una pila mutable en El Cairo
fr: Mise en œuvre d'une pile mutable au Caire
id: Mengimplementasi Stack yang Dapat Dimutasi di Kairo
tr: Kahire'de Mutable Stack Uygulaması
zh_cn: 在开罗实施一个 Mutabable堆堆

source: To create a stack data structure in Cairo, we can again use a `Felt252Dict<T>` to store the values of the stack along with a `usize` field to keep track of the length of the stack to iterate over it.
es: Para crear una estructura de datos de pila en El Cairo, podemos usar de nuevo un `Felt252Dict<T® para almacenar los valores de la pila junto con un campo `usize` para hacer un seguimiento de la longitud de la pila para iterar sobre ella.
fr: Pour créer une structure de données de pile au Caire, nous pouvons à nouveau utiliser un `Felt252Dict<T>` pour stocker les valeurs de la pile avec un champ `usize` pour garder une trace de la longueur de la pile pour itérer dessus.
id: Untuk membuat struktur data stack di Kairo, kita dapat menggunakan lagi sebuah ▪Felt252Dict<T> untuk menyimpan nilai-nilai stack bersama dengan sebuah ruas Ãusizé untuk melacak panjang stack ke itaring di atasnya.
tr: Kahire'de bir yığın veri yapısı oluşturmak için, yığının değerlerini tekrarlamak için yığının uzunluğunu takip etmek için bir usize alanıyla birlikte saklamak için bir Felt252DictT> kullanabiliriz.
zh_cn: 要在开罗创建堆叠数据结构, 我们可以再次使用“ Felt252Dict<T ” 来存储堆叠的值, 并同时存储“ 启用” 字段, 以跟踪堆叠在堆叠上的长度 。

source: The Stack struct is defined as:
es: La estructura Stack se define como:
fr: La structure Stack est définie comme suit:
id: Struktur Stack didefinisikan sebagai:
tr: Stack yapısı şöyle tanımlanır:
zh_cn: Stack 支架的定义是:

source: Next, let's see how our main functions `push` and `pop` are implemented.
es: A continuación, veamos cómo se implementan nuestras principales funciones `push` y `pop`.
fr: Ensuite, voyons comment nos fonctions principales `push` et `pop` sont mises en œuvre.
id: Selanjutnya, mari kita lihat bagaimana fungsi utama kita diimplementasikan.
tr: Daha sonra, ana fonksiyonlarımızın push ve pop nasıl uygulandığını görelim.
zh_cn: 接下来,让我们看看我们的主要职能“推”和“波”是如何落实的。

source: The code uses the `insert` and `get` methods to access the values in the `Felt252Dict<T>`. To push an element to the top of the stack, the `push` function inserts the element in the dict at index `len` and increases the `len` field of the stack to keep track of the position of the stack top. To remove a value, the `pop` function decreases the value of `len` to update the position of the stack top and then retrieves the last value at position `len`.
es: El código utiliza los métodos `insert` y `get` para acceder a los valores en el `Felt252Dict<T''. Para empujar un elemento a la parte superior de la pila, la función `push` inserta el elemento en el dict en el `len` índice y aumenta el campo `len` de la pila para mantener un registro de la posición de la pila superior. Para eliminar un valor, la función `pop` disminuye el valor de `len` para actualizar la posición de la pila superior y luego recupera el último valor en la posición `len`.
fr: Le code utilise les méthodes `insert` et `get` pour accéder aux valeurs dans le `Felt252Dict<T>`. Pour pousser un élément vers le haut de la pile, la fonction `push` insère l'élément dans le dict à l'index `len` et augmente le champ `len` de la pile pour garder une trace de la position du haut de la pile. Pour supprimer une valeur, la fonction `pop` diminue la valeur de `len` pour mettre à jour la position du haut de la pile et récupère ensuite la dernière valeur à la position `len`.
id: Kode ini menggunakan metode-metode ini dan mendapatkan akses masuk nilai-nilai di dalam kotak itu. Untuk mendorong elemen ke puncak stack, fungsi pop menurunkan nilai elemen dalam didict dan kemudian mengambil kembali posisi terakhir dari stack top.
tr: Kod, Felt252DictT>'deki değerlere erişmek için insert ve get yöntemlerini kullanır. Bir elemanı yığının tepesine itmek için, push işlevi, len dizinindeki elemanı ekler ve yığının üst kısmının konumunu takip etmek için yığının son len alanını arttırır. Bir değeri kaldırmak için, pop değerinin değerini azaltır.
zh_cn: 代码使用“插入”和“获取”方法来访问“Felt252Dict<T”中的值。要将元素推到堆叠的顶部,“推”功能在索引“ len” 上插入刻录器中的元素,并增加堆叠的“ len” 字段以跟踪堆叠顶部的位置。要删除一个值,“po” 函数会降低“ len” 值以更新堆叠顶部的位置,然后在位置“ len” 上检索最后的值。

source: The full implementation of the Stack, along with more data structures that you can use in your code, can be found in the community-maintained [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_structures/src) library, in the "data_structures" crate.
es: La implementación completa de la pila, junto con más estructuras de datos que puede utilizar en su código, se puede encontrar en la biblioteca comunitaria [Alexandria](https://github.com/keep-starknet-strange/alexandria/main/paquetes/data_structures/src), en la caja "data_structures".
fr: La mise en œuvre complète du Stack, ainsi que d'autres structures de données que vous pouvez utiliser dans votre code, se trouve dans la bibliothèque communautaire [Alexandria] (https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_structures/src), dans la caisse « data_structures ».
id: In implementasi penuh dari Stack, bersama dengan lebih banyak struktur data yang dapat Anda gunakan dalam kode Anda, dapat ditemukan di perpustakaan [Alexandria]://github.com/keep-starknet-strange/alandria/tree/main/packages/data_structs/src), dalam kotak "data_strucs."
tr: Stack'in tam olarak uygulanması, kodunuzda kullanabileceğiniz daha fazla veri yapısıyla birlikte, topluluk bakımı [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_structures/src) kütüphanesinde, "data_structures" kasasında bulunabilir.
zh_cn: 可在社区维护的[Alexandria]图书馆(https://github.com/keep-starknet-strange/alexandria/tree/main/packages/data_结构/src)中找到“数据结构”软件库的全面实施以及可在代码中使用的更多数据结构。

source: {{#quiz ../quizzes/ch11-01-custom-structs.toml}}
fr: {{#quiz../quizes/ch11-01-custom-structs.toml}}
zh_cn: Quiz./quizzes/ch11-01-海关结构.toml

source: Well done! Now you have knowledge of arrays, dictionaries and even custom data structures. While Cairo's memory model is immutable and can make it difficult to implement mutable data structures, we can fortunately use the `Felt252Dict<T>` type to simulate mutable data structures. This allows us to implement a wide range of data structures that are useful for many applications, effectively hiding the complexity of the underlying memory model.
es: ¡Bien hecho! Ahora tiene conocimiento de matrices, diccionarios e incluso estructuras de datos personalizadas. Si bien el modelo de memoria de El Cairo es inmutable y puede dificultar la implementación de estructuras de datos mutables, afortunadamente podemos utilizar el tipo `Felt252Dict<T® para simular estructuras de datos mutables. Esto nos permite implementar una amplia gama de estructuras de datos que son útiles para muchas aplicaciones, ocultando efectivamente la complejidad del modelo de memoria subyacente.
fr: Bien fait! Maintenant, vous avez la connaissance des tableaux, dictionnaires et même des structures de données personnalisées. Bien que le modèle de mémoire du Caire soit immuable et puisse rendre difficile la mise en œuvre de structures de données mutables, nous pouvons heureusement utiliser le type `Felt252Dict<T>` pour simuler des structures de données mutables. Cela nous permet de mettre en œuvre une large gamme de structures de données qui sont utiles pour de nombreuses applications, dissimulant efficacement la complexité du modèle de mémoire sous-jacent.
id: Sekarang Anda memiliki pengetahuan tentang array, dictionary, dan bahkan struktur data gubahan. Sementara model memori Kairo tidak dapat diubah dan dapat membuatnya sulit untuk mengimplementasikan struktur data yang dapat bermutasi, kita dapat dengan senang hati menggunakan struktur data ▪Felt252Dict<T>T. Tipe simulasi struktur data yang dapat disimulasikan. Hal ini memungkinkan kita untuk mengimplementasikan berbagai struktur data yang berguna bagi banyak aplikasi, secara efektif menyembunyikan kompleksitas model memori yang mendasari.
tr: Tebrikler! Artık diziler, sözlükler ve hatta özel veri yapıları hakkında bilginiz var. Kahire'nin bellek modeli değiştirilemez ve değiştirilebilen veri yapılarını uygulamayı zorlaştırabilirken, Felt252DictT> türünü değiştirilebilen veri yapılarını simüle etmek için kullanabiliriz. Bu, birçok uygulama için yararlı olan ve altta yatan bellek modelinin karmaşıklığını etkili bir şekilde gizleyen çok çeşitli veri yapılarını uygulamamızı sağlar.
zh_cn: 做得好! 现在您掌握了阵列、 字典甚至自定义的数据结构的知识。 虽然开罗的记忆模型是不可改变的, 并且可能难以执行可变数据结构, 但幸运的是, 我们可以使用“ Felt252Dict<T ” 类型来模拟可变数据结构。 这使我们能够实施一系列对许多应用都有用的数据结构, 有效地隐藏基本内存模型的复杂性 。

source: A pointer is a general concept for a variable that contains a memory address. This address refers to, or “points at,” some other data. While pointers are a powerful feature, they can also be a source of bugs and security vulnerabilities. For example, a pointer can reference an unassigned memory cell, which means that attempting to access the data at that address would cause the program to crash, making it unprovable. To prevent such issues, Cairo uses _Smart Pointers_.
es: Un puntero es un concepto general para una variable que contiene una dirección de memoria. Esta dirección se refiere, o "puntos a", algunos otros datos. Si bien los punteros son una característica poderosa, también pueden ser una fuente de fallos y vulnerabilidades de seguridad. Por ejemplo, un puntero puede hacer referencia a una celda de memoria no asignada, lo que significa que intentar acceder a los datos en esa dirección causaría que el programa se estrellara, lo que lo haría imposible. Para evitar tales problemas, El Cairo utiliza _Smart Pointers_.
fr: Un pointeur est un concept général pour une variable qui contient une adresse mémoire. Cette adresse fait référence à, ou à des points à,. Bien que les pointeurs sont une fonctionnalité puissante, ils peuvent également être une source de bogues et de vulnérabilités de sécurité. Par exemple, un pointeur peut référencer une cellule mémoire non assignée, ce qui signifie que tenter d'accéder aux données à cette adresse provoquerait l'écrasement du programme, ce qui le rend invraisemblable. Pour prévenir de tels problèmes, Le Caire utilise _Smart Pointers_.
id: Sebuah penunjuk adalah sebuah konsep umum untuk sebuah variabel yang berisi sebuah alamat memori. Alamat ini mengacu pada, atau titik di, beberapa data lainnya. sementara penunjuk adalah fitur yang kuat, mereka juga dapat menjadi sumber dari kerentanan bug dan keamanan. Sebagai contoh, penunjuk dapat mereferensikan sebuah sel memori yang tidak terssigned, yang berarti bahwa mencoba mengakses data pada alamat tersebut akan menyebabkan program mengalami crash, membuatnya tidak provable. Untuk mencegah isu tersebut, Kairo menggunakan _Smart Pointers.
tr: Bir işaretçi, bir bellek adresi içeren bir değişken için genel bir kavramdır. Bu adres, diğer bazı verileri ifade eder veya "noktalar". İşaretçiler güçlü bir özellik olsa da, aynı zamanda bir hata ve güvenlik açıkları kaynağı olabilir. Örneğin, bir işaretçi atanmamış bir bellek hücresine referans verebilir, bu da bu adresteki verilere erişmeye çalışmanın programın çökmesine neden olacağı anlamına gelir, bu da onu kanıtlanamaz hale getirir. Bu tür sorunları önlemek için Kahire Noktası kullanır _Smart.
zh_cn: 指针是包含内存地址的变量的一般概念。 此地址指的是或“ 点点点 ” 的其他一些数据 。 虽然指针是一个强大的特征, 它们也可能是错误和安全弱点的来源。 例如, 指针可以引用一个未指派的内存单元格, 这意味着试图访问该地址的数据会导致程序崩溃, 使其无法证明。 为了防止出现这些问题, 开罗使用 _ Smart Pointers_ 。

source: Smart pointers are data structures that act like a pointer, but also have additional metadata and capabilities. The concept of smart pointers isn’t unique to Cairo: smart pointers originated in C++ and exist in other languages like Rust as well. In the specific case of Cairo, smart pointers ensure that memory is not addressed in an unsafe way that could cause a program to be unprovable, by providing a safe way to access memory through strict type checking and ownership rules.
es: Los punteros inteligentes son estructuras de datos que actúan como punteros, pero también tienen metadatos y capacidades adicionales. El concepto de punteros inteligentes no es exclusivo de El Cairo: los punteros inteligentes se originaron en C++ y existen en otros idiomas como Rust también. En el caso específico de El Cairo, los punteros inteligentes aseguran que la memoria no se aborde de una manera insegura que podría causar que un programa sea imposible de probar, proporcionando una forma segura de acceder a la memoria a través de estrictas reglas de verificación de tipo y propiedad.
fr: Les pointeurs intelligents sont des structures de données qui agissent comme un pointeur, mais ont aussi des métadonnées et des capacités supplémentaires. Le concept de pointeurs intelligents n'est pas unique au Caire : les pointeurs intelligents sont originaires de C++ et existent aussi dans d'autres langues comme Rust. Dans le cas particulier du Caire, les pointeurs intelligents veillent à ce que la mémoire ne soit pas traitée de manière dangereuse qui pourrait faire qu'un programme ne soit pas prouvé, en fournissant un moyen sûr d'accéder à la mémoire par des règles strictes de contrôle de type et de propriété.
id: Penunjuk cerdas adalah struktur data yang bertindak seperti penunjuk, tetapi juga memiliki metadata dan kemampuan tambahan. Konsep dari penunjuk cerdas tidak unik bagi Kairo: penunjuk cerdas berasal dari C++ dan ada dalam bahasa lain seperti Rust juga. Dalam kasus spesifik Kairo, penunjuk cerdas memastikan bahwa memori tidak ditujukan dengan cara yang tidak aman yang dapat menyebabkan program tidak provabel, dengan menyediakan cara yang aman untuk mengakses memori melalui aturan pemeriksaan dan kepemilikan ketat.
tr: Akıllı işaretçiler, bir işaretçi gibi davranan, aynı zamanda ek meta veriler ve yeteneklere sahip veri yapılarıdır. Akıllı işaretçiler kavramı Kahire'ye özgü değildir: akıllı işaretçiler C++ kökenlidir ve Rust gibi diğer dillerde de mevcuttur. Kahire'nin özel durumunda, akıllı işaretçiler, sıkı tip kontrol ve sahiplik kurallarıyla hafızaya güvenli bir şekilde erişmenin güvenli bir yolunu sağlayarak, bir programın kanıtlanamayacak şekilde ele alınmamasını sağlar.
zh_cn: 聪明的指针指针是像指针一样的数据结构,但也具有额外的元数据和能力。 聪明的指针概念不是开罗独有的:聪明的指针起源于C++,也存在于鲁斯特等其他语言中。 在开罗的具体案例中,聪明的指针确保记忆不会以不安全的方式处理,从而通过严格的类型检查和所有制规则提供安全获取内存的途径,从而使程序无法被证实。
