Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The use of this entry list shows how there isn't any rewriting, just the creation of new memory cells per `Felt252Dict<T>` interaction. Let's show an example of this using the `balances` dictionary from the previous section and inserting the users 'Alex' and 'Maria':
es: El uso de esta lista de entradas muestra cómo no hay ninguna reescritura, sólo la creación de nuevas celdas de memoria por la interacción `Felt252Dict<T». Vamos a mostrar un ejemplo de esto usando el diccionario `balances` de la sección anterior e insertando los usuarios 'Alex' y 'Maria':
fr: L'utilisation de cette liste d'entrées montre comment il n'y a pas de réécriture, juste la création de nouvelles cellules mémoire par interaction `Felt252Dict<T>`. Montrons un exemple de ceci en utilisant le dictionnaire `balance` de la section précédente et en insérant les utilisateurs 'Alex' et 'Maria':
id: Penggunaan daftar masukan ini menunjukkan bagaimana tidak ada lagi penulisan ulang, hanya penciptaan sel memori baru per ▪Felt252Dict<T>. Mari kita tunjukkan contoh ini menggunakan kamus kamus requamances dari bagian sebelumnya dan menyisipkan pengguna 'Alex' dan 'Maria':
tr: Bu giriş listesinin kullanımı, herhangi bir yeniden yazmanın olmadığını, sadece Felt252DictT> etkileşimi başına yeni bellek hücrelerinin oluşturulmasını gösterir. Bunun bir örneğini bir önceki bölümden balances sözlüğünü kullanarak ve kullanıcıları 'Alex' ve 'Maria' ekleyerek gösterelim:
zh_cn: 使用此条目列表可以显示为什么没有重写, 只需在“ Felt252Dict<T} 互动关系” 中创建新的内存单元格。 让我们用上一节的“ 平衡” 字典来显示一个实例, 然后插入用户“ Alex” 和“ Maria ” :

source: These instructions would then produce the following list of entries:
es: Estas instrucciones producirían la siguiente lista de entradas:
fr: Ces instructions produiraient alors la liste suivante des rubriques:
id: Instruksi ini kemudian akan menghasilkan daftar berikut dari entri:
tr: Bu talimatlar daha sonra aşağıdaki giriş listesini oluşturacaktır:
zh_cn: 这些指示随后将产生下列条目清单:

source: key
es: tecla
fr: clé
id: kunci
tr: anahtar
zh_cn: 键键

source: previous
es: anterior
fr: précédent
id: sebelumnya
tr: önceki
zh_cn: 上一个

source: new
es: nuevo
fr: nouveaux
id: baru
tr: yeni
zh_cn: 新建新

source: Alex
zh_cn: 亚历克斯

source: Maria
es: María
fr: Le Président. — L'ordre du jour appelle le rapport (doc.
zh_cn: 玛丽亚

source: Notice that since 'Alex' was inserted twice, it appears twice and the `previous` and `current` values are set properly. Also reading from 'Maria' registered an entry with no change from previous to current values.
es: Nótese que desde que 'Alex' se insertó dos veces, aparece dos veces y los valores 'anteriores' y 'corrientes' se establecen correctamente. También la lectura de 'Maria' registró una entrada sin cambios de los valores anteriores a los actuales.
fr: Notez que puisque 'Alex' a été inséré deux fois, il apparaît deux fois et les valeurs `précédente` et `current` sont correctement définies. Aussi, la lecture de 'Maria' a enregistré une entrée sans changement des valeurs antérieures aux valeurs actuelles.
id: Perhatikan bahwa sejak 'Alex' dimasukkan dua kali, ia muncul dua kali dan nilai-nilai yang sebelumnya dan sekarang telah ditetapkan dengan benar. Juga membaca dari 'Maria' mendaftarkan sebuah entri tanpa perubahan dari sebelumnya ke nilai-nilai saat ini.
tr: 'Alex' iki kez eklendiğinden, iki kez göründüğüne ve previous ve current değerlerinin düzgün bir şekilde ayarlandığına dikkat edin. Ayrıca 'Maria'dan okumak, önceki değerlerden geçerli değerlere hiçbir değişiklik yapmadan bir giriş kaydetti.
zh_cn: 请注意,自从插入了“Alex”两次之后,似乎有两次,而“先前的”和“当前”的数值设置得当,从“Maria”中读到的条目与以前的值和目前的值没有变化。

source: This approach to implementing `Felt252Dict<T>` means that for each read/write operation, there is a scan for the whole entry list in search of the last entry with the same `key`. Once the entry has been found, its `new_value` is extracted and used on the new entry to be added as the `previous_value`. This means that interacting with `Felt252Dict<T>` has a worst-case time complexity of `O(n)` where `n` is the number of entries in the list.
es: Este enfoque para implementar `Felt252Dict<T® significa que para cada operación de lectura/escritura, hay un escaneo para toda la lista de entradas en busca de la última entrada con la misma `clave`. Una vez que se ha encontrado la entrada, se extrae su `new_value` y se usa en la nueva entrada que se añadirá como `previous_value`. Esto significa que interactuar con `Felt252Dict<T® tiene una complejidad de tiempo peor de `O(n)` donde `n` es el número de entradas en la lista.
fr: Cette approche pour mettre en œuvre `Felt252Dict<T>` signifie que pour chaque opération de lecture/écriture, il y a un balayage pour toute la liste d'entrée dans la recherche de la dernière entrée avec la même `key`. Une fois que l'entrée a été trouvée, sa `new_value` est extraite et utilisée sur la nouvelle entrée pour être ajoutée comme `previous_value`. Cela signifie que l'interaction avec `Felt252Dict<T>` a une complexité temporelle pire de `O(n)` où `n` est le nombre d'entrées dans la liste.
id: Pendekatan ini untuk mengimplementasikan <T> Felt252Dict berarti bahwa untuk setiap operasi baca/tulis, ada pemindaian untuk seluruh daftar entri dalam pencarian entri terakhir dengan kode yang sama. Setelah entri telah ditemukan, yang baru_nilai pernah diekstrak dan digunakan pada entri baru untuk ditambahkan sebagai daftar pravious_vale. Ini berarti bahwa berinteraksi dengan Felt252Dic<T> memiliki waktu terburuk dari kompleksitas æogen) di mana nomor entri tersebut berada dalam daftar.
tr: Felt252DictT> uygulamasının bu yaklaşımı, her okuma/yazma işlemi için, aynı key ile son girdiyi aramak için tüm giriş listesi için bir tarama olduğu anlamına gelir. Giriş bulunduktan sonra, new_value, previous_value olarak eklenecek yeni girdide çıkarılır ve kullanılır. Bu, Felt252Dic ile etkileşimde bulunulduğu anlamına gelir.
zh_cn: 执行“Felt252Dict<T”的这一方法意味着,对于每个读/写操作,在搜索最后一个条目时,用同一个`键'搜索整个条目列表时都要进行扫描,一旦发现条目,将提取其`新值 ',并将其用于新条目中,作为`前一`值'添加的新条目中,这意味着与`Felt252Dict<T'进行互动时,最坏的情况是`O(n) ',其中`n'是列表中条目的数量。

source: If you pour some thought into alternate ways of implementing `Felt252Dict<T>` you'd surely find them, probably even ditching completely the need for a `previous_value` field, nonetheless, since Cairo is not your normal language this won't work. One of the purposes of Cairo is, with the STARK proof system, to generate proofs of computational integrity. This means that you need to verify that program execution is correct and inside the boundaries of Cairo restrictions. One of those boundary checks consists of "dictionary squashing" and that requires information on both previous and new values for every entry.
es: Si usted vertiera algún pensamiento en formas alternativas de implementar `Felt252Dict<T® seguramente los encontraría, probablemente incluso dejando completamente de lado la necesidad de un campo `previous_value`, sin embargo, ya que El Cairo no es su lenguaje normal esto no funcionará. Uno de los propósitos de El Cairo es, con el sistema de prueba STARK, generar pruebas de integridad computacional. Esto significa que usted necesita verificar que la ejecución del programa es correcta y dentro de los límites de las restricciones de El Cairo. Uno de esos controles de frontera consiste en "aplastamiento diccionario" y que requiere información sobre valores anteriores y nuevos para cada entrada.
fr: Si vous versez quelques réflexions dans d'autres façons de mettre en œuvre `Felt252Dict<T>` vous les trouveriez sûrement, probablement même en abandonnant complètement le besoin d'un champ `previous_value`, cependant, puisque le Caire n'est pas votre langue normale, cela ne fonctionnera pas. L'un des buts du Caire est, avec le système de preuve STARK, de générer des preuves d'intégrité computationnelle. Cela signifie que vous devez vérifier que l'exécution du programme est correcte et à l'intérieur des limites des restrictions du Caire.
id: Jika Anda menuangkan beberapa pemikiran ke dalam bidang alternatif untuk menerapkan bahasa biasa ini tidak akan bekerja. Salah satu tujuan Kairo adalah, dengan sistem bukti STARK, untuk menghasilkan bukti integritas komputasi. Ini berarti bahwa Anda perlu memverifikasi eksekusi program yang benar dan di dalam batas-batas Kairo. Salah satu pemeriksaan batas tersebut terdiri dari "dictionary squashing" dan yang membutuhkan informasi pada setiap masukan sebelumnya dan nilai-nilai baru.
tr: Felt252DictT> uygulamasının alternatif yollarına biraz düşünce dökerseniz, onları mutlaka bulursunuz, hatta Kahire normal diliniz olmadığı için previous_value alanına olan ihtiyacı tamamen ortadan kaldırırsınız. Kahire'nin amaçlarından biri, STARK ispat sistemi ile, hesaplama bütünlüğünün kanıtlarını oluşturmaktır. Bu, uygulamadaki yeni kısıtlamaların doğru ve doğru olduğunu doğrulamanız gerektiği anlamına gelir.
zh_cn: 如果你把一些想法加到执行“Felt252Dict<T>”的替代方法中,你肯定能找到它们,也许甚至完全抛弃了对“前价值”领域的需求,然而,由于开罗并不是你通常的语言,这行不通。开罗的目的之一是利用STARK验证系统来提供计算完整性的证明。这意味着你需要核查程序执行是否正确,并符合开罗限制的界限。其中之一的边界检查包括“辖区压压”,它要求每个条目都提供关于以前和新价值的信息。

source: Squashing Dictionaries
es: Diccionarios de Squashing
fr: Dictionnaires d'écrasement
id: Squashing Kamus
tr: Squashing Sözlükleri
zh_cn: 抖动字典

source: To verify that the proof generated by a Cairo program execution that used a `Felt252Dict<T>` is correct, we need to check that there wasn't any illegal tampering with the dictionary. This is done through a method called `squash_dict` that reviews each entry of the entry list and checks that access to the dictionary remains coherent throughout the execution.
es: Para verificar que la prueba generada por una ejecución del programa de El Cairo que usó un `Felt252Dict<T® es correcta, tenemos que comprobar que no hubo ninguna manipulación ilegal con el diccionario. Esto se hace a través de un método llamado `squash_dict` que revisa cada entrada de la lista de entradas y comprueba que el acceso al diccionario sigue siendo coherente durante toda la ejecución.
fr: Pour vérifier que la preuve générée par une exécution de programme du Caire qui a utilisé un `Felt252Dict<T>` est correcte, nous devons vérifier qu'il n'y a pas eu d'altération illégale du dictionnaire. Ceci est fait à l'aide d'une méthode appelée `squash_dict` qui examine chaque entrée de la liste d'entrée et vérifie que l'accès au dictionnaire reste cohérent tout au long de l'exécution.
id: Untuk memastikan bahwa bukti yang dihasilkan oleh eksekusi program Kairo yang menggunakan ▪Felt252Dict<T> adalah benar, kita perlu memeriksa bahwa tidak ada gangguan ilegal dengan kamus. Hal ini dilakukan melalui metode yang disebut ·squash_dictà yang meninjau setiap entri daftar entri dan memeriksa akses ke kamus tersebut tetap koheren sepanjang eksekusi.
tr: Felt252DictT> kullanan bir Kahire program yürütmesi tarafından oluşturulan kanıtın doğru olduğunu doğrulamak için, sözlükle herhangi bir yasadışı kurcalama olmadığını kontrol etmemiz gerekir. Bu, giriş listesinin her bir girdisini gözden geçiren ve sözlüğe erişimin yürütme boyunca tutarlılığını koruduğunu kontrol eden squash_dict adlı bir yöntem aracılığıyla yapılır.
zh_cn: 为了核实使用“Felt252Dict<T” 的开罗程序执行所产生的证据是正确的,我们需要检查字典是否被非法篡改。 这是通过一个名为“squash_dict”的方法进行的,该方法审查条目清单的每一条目,并检查在执行过程中对字典的查阅是否始终一致。

source: The process of squashing is as follows: given all entries with certain key `k`, taken in the same order as they were inserted, verify that the ith entry `new_value` is equal to the ith + 1 entry `previous_value`.
es: El proceso de aplastamiento es el siguiente: dado que todas las entradas con cierta clave `k`, tomadas en el mismo orden en que fueron insertadas, verificar que la entrada `new_value` es igual a la entrada ith + 1 `previous_value`.
fr: Le processus d'écrasement est le suivant: étant donné toutes les entrées avec une certaine clé `k`, prises dans le même ordre qu'elles ont été insérées, vérifier que l'entrée `new_value` est égale à l'entrée `previous_value`.
id: Proses squashing adalah sebagai berikut: mengingat semua masukan dengan kunci tertentu, diambil dalam urutan yang sama seperti yang dimasukkan, verifikasi bahwa entri ith baru_value sama dengan lith + 1 masukan thoseprevious_value.
tr: Squashing işlemi aşağıdaki gibidir: Belirli anahtar k ile tüm girdiler verildiğinde, yerleştirildikleri sırada aynı sırayla alındığında, new_value ith girişinin previous_value ith + 1 girişine eşit olduğunu doğrulayın.
zh_cn: 挤压过程如下:如果所有带有某些密钥“k”的条目都与插入的顺序相同,则核查Ish条目“新价值”等于Ish+1条目“前置价值”。

source: For example, given the following entry list:
es: Por ejemplo, dada la siguiente lista de entradas:
fr: Par exemple, compte tenu de la liste d'entrées suivante :
id: Sebagai contoh, mengingat daftar berikut:
tr: Örneğin, aşağıdaki giriş listesi göz önüne alındığında:
zh_cn: 例如,考虑到下列条目清单:

source: Charles
fr: C'est moi qui l'ai fait.
zh_cn: 查尔斯·查尔斯

source: After squashing, the entry list would be reduced to:
es: Después de aplastar, la lista de entradas se reduciría a:
fr: Après l'écrasement, la liste d'entrées serait réduite à :
id: Setelah squashing, daftar entri akan dikurangi menjadi:
tr: Squashing'den sonra, giriş listesi aşağıdakilere indirgenir:
zh_cn: 在挤压后,条目清单将缩减为:

source: In case of a change on any of the values of the first table, squashing would have failed during runtime.
es: En caso de un cambio en cualquiera de los valores de la primera tabla, el aplastamiento habría fallado durante el tiempo de ejecución.
fr: En cas de changement sur l'une des valeurs de la première table, l'écrasement aurait échoué pendant l'exécution.
id: Dalam kasus perubahan pada setiap nilai dari tabel pertama, squashing akan gagal selama runtime.
tr: İlk tablonun değerlerinden herhangi birinde bir değişiklik olması durumunda, squashing çalışma süresi boyunca başarısız olurdu.
zh_cn: 如果第一个表格的任何值发生变化,在运行期间,压碎会失败。

source: Dictionary Destruction
es: Destrucción del diccionario
fr: Destruction du dictionnaire
id: Penghancuran Kamus
tr: Sözlük Yıkımı
zh_cn: 词典销毁

source: If you run the examples from ["Basic Use of Dictionaries"](./ch03-02-dictionaries.md#basic-use-of-dictionaries) section, you'd notice that there was never a call to squash dictionary, but the program compiled successfully nonetheless. What happened behind the scene was that squash was called automatically via the `Felt252Dict<T>` implementation of the `Destruct<T>` trait. This call occurred just before the `balance` dictionary went out of scope.
es: Si usted ejecuta los ejemplos de ["Uso básico de diccionarios"](./ch03-02-dictionarys.md#basic-use-of-dictionarys) sección, usted notaría que nunca hubo una llamada al diccionario de squash, pero el programa compilado con éxito sin embargo. Lo que sucedió detrás de la escena fue que squash se llamó automáticamente a través de la aplicación `Felt252Dict<TÃo de la `Destruct<TÃo. Esta llamada ocurrió justo antes de que el diccionario `equilibrio` salió de su alcance.
fr: Si vous lancez les exemples de la section [./ch03-02-dictionaries.md#basic-use-of-dictionaries), vous remarquerez qu'il n'y a jamais eu d'appel au dictionnaire de squash, mais le programme a néanmoins été compilé avec succès. Ce qui s'est passé derrière la scène, c'est que squash a été appelé automatiquement via l'implémentation `Felt252Dict<T>` du caractère `Destruct<T>`. Cet appel s'est produit juste avant que le dictionnaire `balance` ne soit hors de portée.
id: Jika anda menjalankan contoh-contoh dari bagian ["Basic Use of Dictionaries"]. /ch03-02-dictionary.md#basic-use-of-dictionaries), anda akan memperhatikan bahwa tidak pernah ada panggilan ke kamus squash, tetapi program yang dikompilasi tetap berhasil. Apa yang terjadi di belakang adegan itu disebut squash secara otomatis melalui ▪Felt252Dict<T> mengimplementasi sifat <T>. Panggilan ini terjadi tepat sebelum kamus lepassan hilang.
tr: ["Dictionaries Temel Kullanımı"](./ch03-02-02dictionaries.md#basic-use-of-dictionaries] bölümünden örnekleri çalıştırırsanız, squash sözlüğüne hiçbir zaman çağrı yapılmadığını, ancak programın başarılı bir şekilde derlendiğini fark edersiniz. Sahnenin arkasında olan şey, squash'ın Felt252DictT> uygulaması aracılığıyla otomatik olarak çağrıldığıydı.
zh_cn: 如果您运行 [“字典的基本使用 ” (./ch03-02- 字典. md# 基本使用词典) 部分的示例, 您就会注意到, 从来没有人拨打过壁球字典, 但程序还是成功地编译了。 幕后发生的情况是, 壁球通过“ Felt252Dict<T ” 执行“ 破坏 < T 特性” 自动被调用。 此呼叫发生在“ 平衡” 字典超出范围之前 。

source: The `Destruct<T>` trait represents another way of removing instances out of scope apart from `Drop<T>`. The main difference between these two is that `Drop<T>` is treated as a no-op operation, meaning it does not generate new CASM while `Destruct<T>` does not have this restriction. The only type which actively uses the `Destruct<T>` trait is `Felt252Dict<T>`, for every other type `Destruct<T>` and `Drop<T>` are synonyms. You can read more about these traits in [Drop and Destruct](./appendix-03-derivable-traits.md#drop-and-destruct) section of Appendix C.
es: La principal diferencia entre estos dos es que `Drop<T® se trata como una operación no-op, lo que significa que no genera nuevas CASM mientras que `Drop<T® no tiene esta restricción. El único tipo que utiliza activamente el rasgo `Drop<T® es `Felt252Dict<T®, por cada otro tipo `Destruct<T® y `Drop<T® son sinónimos. Puede leer más sobre estos rasgos en [Drop and Destruct](./appendix-03-derivable-traits.md#drop-and-destruct) sección del Apéndice C.
fr: Le caractère `Destruct<T>` représente une autre façon d'éliminer les instances hors de portée en dehors de `Drop<T>`. La principale différence entre ces deux est que `Drop<T>` est traité comme une opération non-op, ce qui signifie qu'il ne génère pas de nouveaux CASM alors que `Destruct<T>` n'a pas cette restriction. Le seul type qui utilise activement le caractère `Destruct<T>` est `Felt252Dict<T>`, pour chaque autre type `Destruct<T>` et `Drop<T>` sont des synonymes. Vous pouvez en lire plus sur ces caractéristiques dans la section [Drop et Destruct](./appendix-03-derivable-traits.md#drop-and-destruct) de l'appendice C.
id: The destruct<T> sifat ini merupakan cara lain untuk menghilangkan contoh dari lingkup terpisah dari <T>. Perbedaan utama di antara keduanya adalah bahwa <T> diperlakukan sebagai operasi no-op, yang berarti tidak menghasilkan CASM baru sementara <T> Destruct <T> tidak memiliki batasan ini. Satu-satunya jenis yang aktif menggunakan sifat <Dstruct<T> adalah (Felt252Dict<T>), untuk setiap jenis lain <T> destrucct-destruct-andprognable. Anda dapat membaca tentang sifat-sifat ini [Deroct-and-and-devix].
tr: DestructT> özelliği, DropT> dışındaki örnekleri kapsam dışı bırakmanın başka bir yolunu temsil eder. Bu ikisi arasındaki temel fark, DropT>'nin DestructT> ile ilgili olarak yeni CASM oluşturmadığı anlamına gelir. DestructT>'yi aktif olarak kullanan tek tür
zh_cn: `Dstruct<T>特性是除`Drop<T>之外的另一种排除范围外事件的方法。这两个特性之间的主要区别是,`Drop<T'被作为无操作处理,意思是它不会产生新的化学文摘社,而`Dstruct<T>没有这种限制。唯一积极使用`Destruct <Tt <T>特性的类型是`Felt252Dict<T,“Drop<T”是同义词。你可以阅读更多关于附录C[drop and destruct] (./apendix-03-derivits-traits.md#dlot-and-destruction)部分中的这些特性。

source: Later in ["Dictionaries as Struct Members"](./ch11-01-custom-data-structures.html#dictionaries-as-struct-members) section, we will have a hands-on example where we implement the `Destruct<T>` trait for a custom type.
es: Más tarde en la sección ["Diccionarios como miembros de estructura"](./ch11-01-custom-data-structures.html#diccionarios como miembros de estructura), tendremos un ejemplo práctico donde implementamos el rasgo `Destruct<TÃ3 ́ para un tipo personalizado.
fr: Plus tard dans la section [./ch11-01-custom-data-structures.html#dictionaries-as-struct-members), nous aurons un exemple pratique où nous implémentons le caractère `Destruct<T>` pour un type personnalisé.
id: Kemudian di ["Dictionary as Struct Members"]][ch11-01-custom-data-structures.html#dictionarys-as-struct- members], kita akan memiliki contoh manual di mana kita menerapkan sifat <T> Destruct untuk tipe kustom.
tr: Daha sonra ["Dictionaries as Struct Members"](./ch11-01-custom-data-structures.html#dictionaries-as-struct-members] bölümünde, özel bir tip için DestructT> özelliğini uyguladığımız uygulamalı bir örneğe sahip olacağız.
zh_cn: 稍后,在““作为严格成员”的词汇” (./ch11-01-海关-数据结构.html#词典-构成成员)一节中,我们将有一个实践实例,说明我们如何对一种习惯类型实施“销毁<T”特性。

source: More Dictionaries
es: Más diccionarios
fr: Autres dictionnaires
id: Lebih Banyak Kamus
tr: Daha fazla Sözlük
zh_cn: 更多字典

source: Up to this point, we have given a comprehensive overview of the functionality of `Felt252Dict<T>` as well as how and why it is implemented in a certain way. If you haven't understood all of it, don't worry because in this section we will have some more examples using dictionaries.
es: Hasta este punto, hemos dado una visión general completa de la funcionalidad de `Felt252Dict<T®, así como cómo y por qué se implementa de cierta manera. Si no lo has entendido todo, no te preocupes porque en esta sección tendremos algunos ejemplos más usando diccionarios.
fr: Jusqu'à ce point, nous avons donné un aperçu complet de la fonctionnalité de `Felt252Dict<T>` ainsi que comment et pourquoi il est implémenté d'une certaine manière. Si vous n'avez pas tout compris, ne vous inquiétez pas parce que dans cette section nous aurons d'autres exemples utilisant des dictionnaires.
id: Sampai pada titik ini, kami telah memberikan gambaran komprehensif tentang fungsionalitas <T25D> dan bagaimana dan mengapa diterapkan dengan cara tertentu. Jika Anda belum memahami semua itu, jangan khawatir karena di bagian ini kita akan memiliki beberapa contoh lagi menggunakan kamus.
tr: Bu noktaya kadar, Felt252DictT>'nin işlevselliğinin yanı sıra belirli bir şekilde nasıl ve neden uygulandığına dair kapsamlı bir genel bakış verdik. Tüm bunları anlamadıysanız, endişelenmeyin, çünkü bu bölümde sözlükleri kullanarak daha fazla örnek vereceğiz.
zh_cn: 至此,我们全面概述了“Felt252Dict<T”的功能,以及如何和为什么以某种方式实施。如果你还没有完全理解,请不要担心,因为在本节中我们将有更多使用字典的例子。

source: We will start by explaining the `entry` method which is part of a dictionary basic functionality included in `Felt252DictTrait<T>` which we didn't mention at the beginning. Soon after, we will see examples of how to use `Felt252Dict<T>` with other [complex types](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) such as `Array<T>`.
es: Comenzaremos explicando el método `entrada` que forma parte de una funcionalidad básica del diccionario incluida en `Felt252DictTrait<T® que no mencionamos al principio. Poco después, veremos ejemplos de cómo usar `Felt252Dict<T® con otros [tipos complejos](./ch03-02-dictionarys.md#dictionarys-of-types-no-supported-natively) como `Array<T®.
fr: Nous commencerons par expliquer la méthode `entry` qui fait partie d'une fonctionnalité de base de dictionnaire incluse dans `Felt252DictTrait<T>` que nous n'avons pas mentionnée au début. Peu après, nous verrons des exemples de la façon d'utiliser `Felt252Dict<T>` avec d'autres [types complexes](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) comme `Array<T>`.
id: Kita akan mulai dengan menjelaskan metode entry) yang merupakan bagian dari fungsi dasar kamus yang termasuk dalam ▪Felt252DictTT> yang tidak kita sebutkan di awal. Segera setelah itu, kita akan melihat contoh-contoh tentang bagaimana menggunakan ▪Felt252Dict<T> dengan tipe lain [kompleks] OFCH03-dictionarys.md#dictionarys-of-no-no-supportated-ative) seperti ÁArray<T>.
tr: Başlangıçta bahsetmediğimiz Felt252DictTraitT> içinde yer alan bir sözlük temel işlevselliğinin parçası olan entry yöntemini açıklayarak başlayacağız. Kısa bir süre sonra, Felt252DictT> diğer [karmaşık tiplerle] (./ch03-02-dictionaries.mddiction-of-ray-types) nasıl kullanılacağına dair örnekler göreceğiz.
zh_cn: 首先,我们将解释“进入”方法,这是“Felt252DictTrait<T”中包含的字典基本功能的一部分,我们一开始没有提及该功能。不久之后,我们将看到如何使用“Felt252Dict<T”和其他[复合类型](./ch03-02-词典.md#词典-类型-不支持-名义)如“Array<T”的例子。
