Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: <span class="caption">Listing 10-4: Adding another test in _lib.cairo_ that will pass</span>
es: <span class="caption">Lista 10-4: Añadir otra prueba en _lib.cairo_ que pasará</span>
fr: <span class="caption">Liste 10-4: Ajout d'un autre test dans _lib.cairo_ qui passera</span>
id: <span class="caption">Listing 10-4: Menambahkan tes lain dalam _lib.cairo_ yang akan melewati</span>
tr: span class="caption">Listing 10-4: Geçecek olan _lib.cairo_'da başka bir test ekleme/span>
zh_cn: <span class="caption" > listing 10-4:在 _lib.cairo_中添加另一个通过 </span>的测试

source: Because the correct result of the `can_hold` method, in this case, is `false`, we need to negate that result before we pass it to the `assert!` macro. As a result, our test will pass if `can_hold` returns `false`:
es: Debido a que el resultado correcto del método `can_hold`, en este caso, es `falso`, tenemos que negar ese resultado antes de pasarlo a la macro `asertar!`. Como resultado, nuestra prueba pasará si `can_hold` devuelve `falso`:
fr: Parce que le résultat correct de la méthode `can_hold`, dans ce cas, est `false`, nous devons annuler ce résultat avant de le passer à la macro `assert!`. Par conséquent, notre test passera si `can_hold` retourne `false`:
id: Karena hasil yang benar dari metode tersebut, dalam hal ini, adalah false, kita perlu meniadakan hasilnya sebelum kita lulus ke makro.
tr: can_hold yönteminin doğru sonucu bu durumda false olduğundan, assert! makrosuna geçmeden önce bu sonucu reddetmeliyiz. Sonuç olarak, can_hold false döndürürse testimiz geçecektir:
zh_cn: 由于`Can-hold'方法(在本案中)的正确结果是`false',我们需要在将结果转嫁给`assrt!'宏观之前否定这一结果,因此,如果`can-hold'return`false':

source: Two tests that pass! Now let’s see what happens to our test results when we introduce a bug in our code. We’ll change the implementation of the `can_hold` method by replacing the `>` sign with a `<` sign when it compares the widths:
es: ¡Dos pruebas que pasan! Ahora vamos a ver lo que sucede con nuestros resultados de prueba cuando introducimos un error en nuestro código. Cambiaremos la implementación del método `can_hold` reemplazando el signo con un signo cuando se comparan los anchos:
fr: Nous allons changer l'implémentation de la méthode `can_hold` en remplaçant le signe `>` par un signe `<` lorsqu'il compare les largeurs:
id: Dua tes yang lulus! Sekarang mari kita lihat apa yang terjadi pada hasil tes kita ketika kita memperkenalkan bug dalam kode kita.
tr: Geçen iki test! Şimdi kodumuzda bir hata tanıttığımızda test sonuçlarımıza ne olduğunu görelim. can_hold yönteminin uygulanmasını, > işaretini, genişlikleri karşılaştırdığında bir işaretiyle değiştirerek değiştireceğiz:
zh_cn: 现在让我们看看在代码中引入一个错误时我们的测试结果会怎样。 我们将改变“ 能够” 方法的实施方式, 比较宽度时用 {{} 符号替换 {} 符号 : @ {} = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =

source: Running the tests now produces the following:
es: La ejecución de las pruebas ahora produce lo siguiente:
fr: L'exécution des essais donne désormais les résultats suivants:
id: Menjalankan tes sekarang menghasilkan hal berikut:
tr: Testleri çalıştırmak şimdi aşağıdakileri üretir:
zh_cn: 正在运行的测试现在产生以下结果:

source: ```shell $ scarb cairo-test testing adder ... running 2 tests test adder::tests::larger_can_hold_smaller ... fail (gas usage est.: 57610) test adder::tests::smaller_cannot_hold_larger ... ok (gas usage est.: 55140) failures: adder::larger_can_hold_smaller - Panicked with "rectangle cannot hold". Error: test result: FAILED. 1 passed; 1 failed; 0 ignored ```
es: Error: resultado de la prueba: FAILED. 1 aprobado; 1 fallado; 0 ignorado
fr: ``shell $ echarb cairo-test tester adder... exécutant 2 tests test adder::tests::larger_can_hold_smaller... failer (utilisation du gaz est.: 57610) test adder::tests::smaller_cannot_hold_larger... ok (utilisation du gaz est.: 55140) failer: adder:larger_can_hold_smaller - Panicked with "rectangle ne peut pas tenir". Erreur: test result: FAILED. 1 passé; 1 échoué; 0 ignoré ````
id: Uji adder:: test adder:::: bigster_can_hold_smaller... gagal penggunaan: larger_smaller: bigger_s_hold_shold_shold_shold_maller -panked dengan "rectangle::: Error: test hasil: FAILED. 1; 1; 0; diabaikan
tr: shell $ scarb cairo-test test adder... running 2 tests test adder::tests::larger_can_hold_smaller... failure (gaz kullanımı est.: 57610) test adder::tests:::smaller_cannot_hold_larger... ok (gaz kullanımı est.: 55140) başarısız: adder:lar_can_hold_small_small - Panick hold
zh_cn: shell $ scarb cairo- 测试添加器... 运行 2 个测试添加器 :: 测试 :: larger_ can_ hold_ smaller... 失败( 气体使用量 : 57610 ) 测试添加器 : 测试 :: 测试 :: 最小_ cannot_ hold_ larger... ok( 气体使用量 : 55140 ) 失败 : 添加器 : 放大_ can_ hold_ smaller - 被“ 矩形无法保持” 粉碎 错误: 测试结果 : FAILED. 1 成功; 1 失败; 0 忽略 {

source: Our tests caught the bug! Because `larger.width` is `8` and `smaller.width` is `5`, the comparison of the widths in `can_hold` now returns `false` (`8` is not less than `5`) in the `larger_can_hold_smaller` test. Notice that the `smaller_cannot_hold_larger` test still passes: to make this test fail, the height comparison should also be modified in `can_hold` method, replacing the `>` sign with a `<` sign.
es: Debido a que `larger.width` es `8` y `larger.width` es `5`, la comparación de las anchuras en `can_hold` ahora devuelve `false` (`8` no es menor que `5`) en la prueba `larger_can_hold_smaller`. Observe que la prueba `larger_cannot_hold_larger` sigue pasando: para que esta prueba fracase, la comparación de altura también debe modificarse en el método `can_hold`, sustituyendo el signo por un signo.
fr: Nos tests ont attrapé le bug! Parce que `larger.width` est `8` et `smaller.width` est `5`, la comparaison des largeurs dans `can_hold` renvoie maintenant `false` (`8` n'est pas moins que `5`) dans le test `larger_can_hold_smaller`. Notez que le test `smaller_cannot_hold_larger` passe toujours: pour faire échouer ce test, la comparaison de hauteur doit également être modifiée dans la méthode `can_hold`, remplaçant le signe `>` par un signe `<`.
id: Tes kami menangkap bug! Karena lebih besar lagi.width adalah kurang dari 8 dan tidak lebih kecil dari 5 di dalam tes phaser_canhold_smaller. perhatikan bahwa tes Ásmaller_not_hold_faller masih dapat melewati: untuk membuat tes ini gagal, perbandingan tinggi harus dimodifikasi dalam metode \01}
tr: Testlerimiz hatayı yakaladı! büyüker.width 8 ve küçük.width 5 olduğu için, can_hold'deki genişliklerin karşılaştırılması false (8 yükseklik 5'den küçük değildir) büyük_can_hold_small testinde de değiştirilmelidir. küçük_connot_blager testinin hala geçmesi gerektiğine dikkat edin:
zh_cn: 我们的测试抓住了错误! 因为`大宽度'是`8 ',`小宽度'是`5 ',因此`能够'持有现在返回`false'(`8'不小于`5')的宽度比较在`大可'持有`小点'的测试中。请注意,`小可'持有`大点'的测试仍然通过:要使这一测试失败,也应修改`能够'持有方法中的高度比较,用`标记'取代`标志'。

source: Testing Equality and Comparisons with the `assert_xx!` Macros
es: Pruebas de igualdad y comparaciones con las macros `assert_xx!`
fr: Tester l'égalité et les comparaisons avec les Macros `assert_xx!`
id: Menguji Kesetaraan dan Perbandingan dengan Macros
tr: Eşitliği ve Karşılaştırmaları assert_xx! Makrolarla Test Etmek
zh_cn: 测试平等和与`Assirt_xx!'宏观的比较

source: `assert_eq!` and `assert_ne!` Macros
es: `assert_eq!` y `assert_ne!` Macros
fr: `assert_eq!` et `assert_ne!` Macros
id: Macros
tr: assert_eq! ve assert_ne! Makrolar
zh_cn: " Assert_eq! " 和 " Assrt_ne! " 宏

source: A common way to verify functionality is to test for equality between the result of the code under test and the value you expect the code to return. You could do this using the `assert!` macro and passing it an expression using the `==` operator. However, this is such a common test that the standard library provides a pair of macros — `assert_eq!` and `assert_ne!` — to perform this test more conveniently. These macros compare two arguments for equality or inequality, respectively. They’ll also print the two values if the assertion fails, which makes it easier to see _why_ the test failed; conversely, the `assert!` macro only indicates that it got a `false` value for the `==` expression, without printing the values that led to the `false` value.
es: Una forma común de verificar la funcionalidad es probar la igualdad entre el resultado del código que se está probando y el valor que se espera que el código devuelva. Usted podría hacer esto usando la macro `asertar!` y pasarla una expresión usando el operador `==`. Sin embargo, esta es una prueba tan común que la biblioteca estándar proporciona un par de macros - `assert_eq!` y `assert_ne!` - para realizar esta prueba más convenientemente. Estas macros comparan dos argumentos de igualdad o desigualdad, respectivamente. También imprimirán los dos valores si la afirmación falla, lo que hace más fácil ver _por qué_ la prueba falló; por el contrario, la macro `asert!` sólo indica que obtuvo un valor `falso` para la expresión `==`, sin imprimir los valores que dieron lugar al valor `falso`.
fr: Une façon courante de vérifier la fonctionnalité est de tester l'égalité entre le résultat du code sous test et la valeur que vous attendez du code à retourner. Vous pouvez le faire en utilisant la macro `assert!` et en lui passant une expression en utilisant l'opérateur `==`. Cependant, il s'agit d'un test si commun que la bibliothèque standard fournit une paire de macros - `assert_eq!` et `assert_ne!` - pour effectuer ce test plus commodément. Ces macros comparent deux arguments pour l'égalité ou l'inégalité, respectivement. Ils vont également imprimer les deux valeurs si l'affirmation échoue, ce qui rend plus facile de voir _Why_ le test a échoué; inversement, la macro `assert!` indique seulement qu'il a obtenu une valeur `false` pour l'expression `==`, sans imprimer les valeurs qui ont conduit à la valeur `false`.
id: Sebuah cara umum untuk menguji fungsinya adalah dengan menguji kesetaraan antara hasil kode yang ada di bawah uji dan nilai yang Anda harapkan kode tersebut. Anda dapat melakukan ini dengan menggunakan makro dan melewatinya dengan ekspresi yang menggunakan operator. Namun, ini adalah tes yang umum bahwa perpustakaan standar menyediakan sepasang macros {asert_eq! dan Áassert_ne! untuk melakukan tes ini dengan lebih mudah.
tr: İşlevselliği doğrulamanın yaygın bir yolu, test altındaki kodun sonucu ile kodun geri dönmesini beklediğiniz değer arasındaki eşitliği test etmektir. Bunu assert! makrosunu kullanarak yapabilir ve sadece == operatörünü kullanarak bir ifadeyi iletebilirsiniz. Ancak, standart kütüphanenin bu iki testi daha uygun bir şekilde yerine getirmek için bir çift makroyu - assert_eq! ve assert_ne'yi de sağlamasının nedeni budur.
zh_cn: 验证功能的一个常见方式是测试测试的代码结果与您期望的代码返回值之间的平等性。 您可以使用“ assrt! 宏” 进行测试, 并使用“ {} {} {} {} {} {} {} {}} {}}} 运算符传递一个表达方式。然而,这是一个常见的检验方法, 标准图书馆提供一对宏——` assrt_eq!} 和` assrt_ne!>, 以更方便地进行这一测试。 这些宏分别比较了两个平等或不平等的参数。 如果声明失败, 它们也会打印这两个值, 从而更容易看到_ whis_ 测试失败; 反之, “ assrt! } 宏观只表示它得到了`false'值, 而没有打印导致“ false” 值。

source: In Listing 10-5, we write a function named `add_two` that adds `2` to its parameter, then we test this function using `assert_eq!` and `assert_ne!` macros.
es: En Listar 10-5, escribimos una función llamada `add_two` que añade `2` a su parámetro, luego probamos esta función usando macros `assert_eq!` y `assert_ne!`.
fr: Dans Listing 10-5, nous écrivons une fonction nommée `add_two` qui ajoute `2` à son paramètre, puis nous testons cette fonction en utilisant `assert_eq!` et `assert_ne!` macros.
id: Di Listing 10-5, kami menulis sebuah fungsi bernama ·add_woad_wor yang menambah parameternya, lalu kami menguji fungsi ini menggunakan macros!
tr: Listeleme 10-5'te, parametresine 2 ekleyen add_two adlı bir fonksiyon yazıyoruz, sonra bu fonksiyonu assert_eq! ve assert_ne! makrolarını kullanarak test ediyoruz.
zh_cn: 在列出 10-5 时,我们写入一个名为`add_ two' 的函数,该函数在其参数中增加`2',然后用`assrt_eq!'和`assrt_ne!' 宏测试该函数。

source: <span class="caption">Listing 10-5: Testing the function `add_two` using `assert_eq!` and `assert_ne!` macros</span>
es: <span class="caption">Lista 10-5: Probando la función `add_two` usando `assert_eq!` y `assert_ne!` macros</span>
fr: <span class="caption">Liste 10-5: Test de la fonction `add_two` en utilisant `assert_eq!` et `assert_ne!` macros</span>
id: <span class="caption">Listing 10-5: Menguji fungsi <add_dua; menggunakan ·assert_eq!
tr: span class="caption">Liste 10-5: asert_eq! ve asert_ne! makrolarını kullanarak add_two işlevini test etmek/span>
zh_cn: <span类=`caption' > listing 10-5:使用`assrt_eq!'和`assrt_ne!'宏 </span>测试函数`add_二'。

source: Let’s check that it passes!
es: ¡Comprobemos que pasa!
fr: Laissez-nous vérifier qu'il passe!
id: Mari kita periksa lewat!
tr: Geçip geçmediğini kontrol edelim!
zh_cn: 让我们检查它是否通过!

source: In the `it_adds_two` test, we pass `4` as argument to `assert_eq!` macro, which is equal to the result of calling `add_two(2)`. The line for this test is `test adder::tests::it_adds_two ... ok`, and the `ok` text indicates that our test passed.
es: En la prueba `it_adds_two`, pasamos `4` como argumento a `assert_eq!` macro, que es igual al resultado de llamar a `add_two(2)`. La línea para esta prueba es `test adder::tests::it_adds_two... ok`, y el texto `ok` indica que nuestra prueba pasó.
fr: Dans le test `it_adds_two`, nous passons `4` comme argument à `assert_eq!` macro, qui est égal au résultat de l'appel `add_two(2)`. La ligne pour ce test est `test adder::tests::it_adds_two... ok`, et le texte `ok` indique que notre test est passé.
id: Dalam tes ini, kami melewati 4% sebagai argumen untuk ·assert_eq! makro, yang sama dengan panggilan ·ok_add_dua). Barisan untuk tes ini adalah adderest::::::it_adds_t_two... ok, dan teks oroglic menunjukkan bahwa tes kami lulus.
tr: it_adds_two testinde, assert_eq! makrosuna argüman olarak add_two(2) diyoruz. Bu testin satırı test adder:::tests:::it_adds_two... ok ve ok metni testimizin geçtiğini gösterir.
zh_cn: 在`it_adds_2'测试中,我们通过`4'作为`assert_eq!'宏观的论证,这等于调用`add_2(2)'的结果。该测试的直线是`测试添加器::it_adds_2`ok ',而`ok'文本表明我们的测试已经通过。

source: In the `wrong_check` test, we pass `0` as argument to `assert_ne!` macro, which is not equal to the result of calling `add_two(2)`. Tests that use the `assert_ne!` macro will pass if the two values we give it are _not_ equal and fail if they’re equal. This macro is most useful for cases when we’re not sure what a value _will_ be, but we know what the value definitely _shouldn’t_ be. For example, if we’re testing a function that is guaranteed to change its input in some way, but how the input is changed depends on the day of the week that we run our tests, the best thing to assert might be that the output of the function is not equal to the input.
es: En la prueba `wrong_check`, pasamos `0` como argumento a `assert_ne!` macro, que no es igual al resultado de llamar a `add_two(2)`. Las pruebas que usan la macro `assert_ne!` pasarán si los dos valores que le damos son _no_ iguales y fallan si son iguales. Esta macro es más útil para casos en los que no estamos seguros de lo que un valor _will_ ser, pero sabemos lo que el valor definitivamente _ shouldn’t_ ser. Por ejemplo, si estamos probando una función que está garantizada para cambiar su entrada de alguna manera, pero cómo se cambia la entrada depende del día de la semana en que ejecutamos nuestras pruebas, lo mejor que podemos afirmar es que la salida de la función no es igual a la entrada.
fr: Dans le test `wrong_check`, nous passons `0` comme argument à `assert_ne!` macro, ce qui n'est pas égal au résultat de l'appel `add_two(2)`. Tests qui utilisent la macro `assert_ne!` passera si les deux valeurs que nous donnons sont _not_ égales et échouent si elles sont égales. Cette macro est la plus utile dans les cas où nous ne sommes pas sûrs de ce qu'est une valeur _will_, mais nous savons ce que la valeur certainement _devrait_t. Par exemple, si nous testons une fonction qui est garantie de changer son entrée d'une certaine manière, mais comment l'entrée est modifiée dépend du jour de la semaine où nous effectuons nos tests, la meilleure chose à affirmer pourrait être que la sortie de la fonction n'est pas égale à l'entrée.
id: Dalam tes salah_check, kami lulus sebagai argumen untuk ·assert_ne! makro, yang tidak sama dengan hasil dari memanggil ·add_t2). Ujilah yang menggunakan nilai _will_ne! macro akan lulus jika dua nilai yang kami berikan adalah _not_ equal dan gagal jika mereka sama. makro ini paling berguna untuk kasus ketika kita tidak yakin apa nilai _will_ne_, tapi kita tahu apa nilai yang pasti _posten_t_t. Sebagai contoh, jika kita memberikan fungsi yang dijamin perubahan dalam beberapa masukan, bagaimana cara ini tergantung pada minggu kita untuk menjalankan hal yang sama dengan fungsi terbaik.
tr: wrong_check testinde, asert_ne! argümanı olarak assert_ne! makrosunu geçeriz. Bu, add_two(2) çağrısının sonucuna eşit değildir. assert_ne! makrosunu kullanan testler, verdiğimiz iki değerin kesinlikle _a eşit olmadığını ve bir değerin ne olduğundan emin olmadığımız durumlarda geçer.
zh_cn: 在`错误_检查'测试中,我们通过`0'作为`assirt_ne!'宏观的论证,这不等于调用`add_2(2)'的结果。使用`assirt_ne!'的测试,如果我们给出的两种值是平等的,那么该宏就会通过。当我们不确定什么值是`会是'时,这个宏最有用,但我们知道一定的值是什么。例如,如果我们正在测试一个保证以某种方式改变输入的函数,但如何改变输入取决于我们进行测试的一周的一天,那么最好的说法是,函数的输出并不等于输入。

source: Let’s introduce a bug into our code to see what `assert_eq!` looks like when it fails. Change the implementation of the `add_two` function to instead add `3`:
es: Vamos a introducir un error en nuestro código para ver cómo se ve `assert_eq!` cuando falla. Cambie la implementación de la función `add_two` para añadir en su lugar `3`:
fr: Laissez-nous introduire un bug dans notre code pour voir à quoi `assert_eq!` ressemble quand il échoue. Changez l'implémentation de la fonction `add_two` pour ajouter `3`:
id: Mari kita perkenalkan bug ke dalam kode kita untuk melihat apa yang terjadi ketika gagal.
tr: assert_eq! başarısız olduğunda neye benzediğini görmek için kodumuza bir hata tanıtalım. Bunun yerine add_two fonksiyonunun uygulanmasını 3 eklemek için değiştirin:
zh_cn: 让我们在代码中引入一个错误, 来查看“ assert_ eq! ” 当它失败时看起来是什么。 更改“ add_ two” 函数的功能执行, 代之以添加 3 :

source: Run the tests again:
es: Ejecutar las pruebas de nuevo:
fr: Exécutez à nouveau les essais:
id: Jalankan tes lagi:
tr: Testleri tekrar yapın:
zh_cn: 再次运行测试 :

source: ```shell $ scarb cairo-test testing adder ... running 2 tests test adder::tests::wrong_check ... ok (gas usage est.: 132000) test adder::tests::it_adds_two ... fail (gas usage est.: 166800) failures: adder::tests::it_adds_two - Panicked with "assertion `4 == add_two(2)` failed. 4: 4 add_two(2): 5". Error: test result: FAILED. 1 passed; 1 failed; 0 ignored ```
es: El resultado de la prueba: FAILED. 1 pasó; 1 falló; 0 no se hizo caso de la prueba: 4: 4 add_two(2): 5". Error: resultado de la prueba: FAILED. 1 pasó; 1 falló; 0 no se hizo caso de la prueba: 4: 4 add_two(2): 5". Error: resultado de la prueba: FAILED. 1 pasó; 1 falló; 0 no se hizo caso de la prueba: 4 add_two(2): 5" Error: resultado de la prueba: FAILED.
fr: ``shell $ echarb cairo-test tester adder... exécutant 2 tests test adder::tests::wrong_check... ok (utilisation du gaz est.: 132000) test adder::tests::it_adds_two... fail (utilisation du gaz est.: 166800) failer: adder::tests::it_adds_two - Panicked avec "affirmation `4 == add_two(2)` échoué. 4: 4 add_two(2): 5". Erreur: résultat du test: FAILED. 1 passé; 1 échoué; 0 ignoré ```
id: ·shell $ scarb cairo-test test adder... menjalankan 2 test adder::: test::: salah_check... ok (gunakan gas est.: 132000) uji adder::::::it_adds_t_dua... gagal (gas penggunaan est.: 1668) gagal: adests:::::::: it_ds_t_t_two - exactioned dengan "astion ·2) gagal.
tr: shell $ scarb cairo-test test adder... running 2 tests test adder::tests:: wrong_check... ok (gaz kullanımı est.: 132000) test adder:::tests::it_adds_two... failure (gaz kullanımı est.: 166800) failure: adder:tests:it_adds_two - Panicked with "addtion 4".
zh_cn: 贝壳 $ carb cairo 测试添加器... 运行 2 个测试添加器 : 测试 : wrong_ check... ok (气体使用量 : 132000) 测试添加器 : 测试 :: it_ adds_ two... 失败 (气体使用量 : 166800) 失败 : 添加器 : 测试 :: 测试 :: it_ adds_ two - 被“ 保证 4 = 添加_ 2 (2) ” 失败 。 4 : 4 添加_ two (2): 5 错误 : 测试结果 : FAILED. 1 passed; 1 失败; 0 忽略 *

source: Our test caught the bug! The `it_adds_two` test failed with the following message: ``Panicked with "assertion `4 == add_two(2)` failed``. It tells us that the assertion that failed was `` "assertion `left == right` failed`` and the `left` and `right` values are printed on the next lines as `left: left_value` and `right: right_value`. This helps us start debugging: the `left` argument was `4` but the `right` argument, where we had `add_two(2)`, was `5`. You can imagine that this would be especially helpful when we have a lot of tests going on.
es: ¡Nuestra prueba captó el error! La prueba `it_adds_two` falló con el siguiente mensaje: ``Panqueado con "asertion `4"== add_two(2)` fracasó``. Nos dice que la afirmación que falló fue ``asertion `left == derech` failed`` y los valores `izquierda` y `derecha` se imprimen en las siguientes líneas como `izquierda: left_value` y `derecha: right_value`. Esto nos ayuda a empezar a depurar: el argumento `izquierda` era `4` pero el argumento `derecha`, donde teníamos `add_two(2)`, era `5`. Pueden imaginarse que esto sería especialmente útil cuando tengamos un montón de pruebas en marcha.
fr: Notre test a attrapé le bug! Le test `it_adds_two` a échoué avec le message suivant: ``Panicked with "assertion `4 == add_two(2)` failed``. Il nous dit que l'affirmation qui a échoué était ``"assertion `left=" right`" et les valeurs `left` et `right` sont imprimées sur les lignes suivantes comme `left: left_value` et `right: left_value`. Cela nous aide à commencer à déboger: l'argument `left` était `4` mais l'argument `right`, où nous avions `add_two(2)`, était `5`. Vous pouvez imaginer que cela serait particulièrement utile lorsque nous avons beaucoup de tests en cours.
id: Uji coba kami menangkap bug! Tes ini gagal dengan pesan berikut: "Panicked dengan "assertion ·4 == add_t_woe2). Ini memberitahu kita bahwa pernyataan yang gagal adalah "assertion ıleft (kiri) == kanan dan kanan kiri dan kanan, di mana kita telah mencetak dua baris berikutnya: kiri dan kanan; kanan; ini membantu kita memulai pengawaungan: argumen yang tersisa adalah benar-benar dapat kita bayangkan ketika kita akan memiliki banyak hasil yang baik.
tr: Testimiz hatayı yakaladı! it_adds_two testi aşağıdaki mesajla başarısız oldu: Panicked with "assertion 4 == add_two(2) failed". Başarısız olan iddianın "assertion left == right failed ve left ve right değerlerinin bir sonraki satırlara left: left_valuve olarak basılabileceğini söyler.
zh_cn: 我们的测试抓住了错误! `it_ adds_ two' 测试失败了, 其电文如下: “ 以`assertion'4 = add_ 2 = = add_ 2 = = 失败了。 它告诉我们, 失败的断言是`assertion'left = right'`faild'和`left'和`right'= value'。 这帮助我们开始调试:`left'参数是`4 ',而`正确的'论点,我们在那里`addad_ 2 (2)'和`left'和`right'值是`5'。 我们可以想象,当我们进行大量测试时,这将特别有用。
