Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Here is how you would define and use a `calculate_length` function that takes a snapshot of an array as a parameter instead of taking ownership of the underlying value. In this example, the `calculate_length` function returns the length of the array passed as a parameter. As we're passing it as a snapshot, which is an immutable view of the array, we can be sure that the `calculate_length` function will not mutate the array, and ownership of the array is kept in the `main` function.
es: Así es como definiría y utilizaría una función `calculate_length` que toma una instantánea de un array como parámetro en lugar de tomar la propiedad del valor subyacente. En este ejemplo, la función `calculate_length` devuelve la longitud del array pasado como parámetro. Al pasarlo como una instantánea, que es una vista inmutable del array, podemos estar seguros de que la función `calculate_length` no muta el array, y la propiedad del array se mantiene en la función `main`.
fr: Voici comment vous définiriez et utiliseriez une fonction `calculate_length` qui prend un instantané d'un tableau comme paramètre au lieu de prendre la propriété de la valeur sous-jacente. Dans cet exemple, la fonction `calculate_length` renvoie la longueur du tableau passé comme paramètre. Comme nous le passons comme un instantané, qui est une vue immuable du tableau, nous pouvons être sûrs que la fonction `calculate_length` ne va pas muter le tableau, et la propriété du tableau est conservée dans la fonction `main`.
id: Berikut adalah bagaimana Anda akan mendefinisikan dan menggunakan fungsi ·calculated_length (kalgulate_length) yang mengambil snapshot dari sebuah array sebagai sebuah parameter bukan mengambil kepemilikan dari nilai yang mendasarinya. Dalam contoh ini, fungsi calcululate_length_length akan kembali panjang array yang melewati sebagai parameter. Ketika kita melewatinya sebagai snapshot, yang merupakan pandangan yang tak dapat berubah dari array, kita dapat yakin bahwa fungsi ▪calcululate_length_lengthate tidak akan bermutasi array, dan kepemilikan array disimpan dalam fungsi valemain.
tr: Alttaki değerin sahipliğini almak yerine bir diziyi parametre olarak görüntüleyen bir calculate_length fonksiyonunu nasıl tanımlar ve kullanırsınız. Bu örnekte, calculate_length işlevi, parametre olarak geçen dizinin uzunluğunu döndürür. Dizinin değişmez bir görünümü olan bir anlık görüntü olarak geçerken, dizinin calculate_length fonksiyonunun sessiz kalmayacağından emin olabiliriz.
zh_cn: 这里您将如何定义和使用“ 计算_ 长度” 函数, 该函数将一个阵列的快照作为参数, 而不是对底值的所有权。 在此示例中, “ 计算_ 长度” 函数返回以参数传递的阵列长度。 当我们把它作为快照通过时, 这是对阵列不可变的视图, 我们就可以确定, ` 计算_ 长度' 函数不会使阵列变形, 并且将阵列的所有权保留在` 主'函数中 。

source: // Take a snapshot of `arr1` at this point in time
es: // Tome una instantánea de `arr1` en este momento
fr: // Prenez un instantané de `arr1` à ce moment-là
id: #/ Take a snapshot of ör1 those at this point in time
tr: // Bu noktada arr1'nin anlık görüntüsünü alın
zh_cn: 此时此刻拍下`1'的快照

source: // Mutate `arr1` by appending a value
es: // Mutar `arr1` añadiendo un valor
fr: // Muter `arr1` en ajoutant une valeur
id: //Mutate Áarr1) dengan menambahkan suatu nilai
tr: // arr1 değerini ekleyerek Mutate
zh_cn: //通过附加一个值来 Mutat `rr1'的变音

source: // Calculate the length of the array when the snapshot was taken
es: // Calcular la longitud de la matriz cuando se tomó la instantánea
fr: // Calculer la longueur du tableau lorsque l'instantané a été pris
id: //Perhitungkan panjang dari array ketika snapshot diambil
tr: // Ekran görüntüsü çekildiğinde dizinin uzunluğunu hesaplayın
zh_cn: / 计算抓图拍摄时数组的长度

source: // Calculate the current length of the array
es: // Calcular la longitud actual de la matriz
fr: // Calculer la longueur actuelle du tableau
id: //Perhitungkan panjang kini dari array
tr: // Dizinin mevcut uzunluğunu hesapla
zh_cn: / 计算数组的当前长度

source: "The length of the array when the snapshot was taken is {}"
es: "La longitud del array cuando se tomó la instantánea es la siguiente:
fr: "La longueur du tableau lorsque l'instantané a été pris est {}"
id: " Panjang array ketika snapshot diambil adalah {}"
tr: "Snapshot çekildiğinde dizinin uzunluğu "
zh_cn: "拍片时的阵列长度是"

source: "The current length of the array is {}"
es: "La longitud actual del array es de.... "
fr: "La longueur actuelle du tableau est {}"
id: " Panjang array saat ini adalah {}"
tr: "Aracın mevcut uzunluğu "
zh_cn: "阵列的当前长度是"

source: Note: it is only possible to call the `len()` method on an array snapshot because it is defined as such in the `ArrayTrait` trait. If you try to call a method that is not defined for snapshots on a snapshot, you will get a compilation error. However, you can call methods expecting a snapshot on non-snapshot types.
es: Nota: sólo es posible llamar al método `len()` en una instantánea de array porque se define como tal en el rasgo `ArrayTrait`. Si intenta llamar a un método que no está definido para instantáneas en una instantánea, obtendrá un error de compilación. Sin embargo, puede llamar a métodos que esperan una instantánea en tipos que no son instantáneas.
fr: Remarque : il est seulement possible d'appeler la méthode `len()` sur un instantané de tableau parce qu'elle est définie comme telle dans le caractère `ArrayTrait`. Si vous essayez d'appeler une méthode qui n'est pas définie pour les instantanés sur un instantané, vous obtiendrez une erreur de compilation. Cependant, vous pouvez appeler des méthodes qui attendent un instantané sur des types non-snapshot.
id: Catatan: hanya mungkin untuk memanggil metode mendapatkan snapshot dalam array karena itu didefinisikan seperti dalam sifat ▪ArrayTraitå. Jika Anda mencoba untuk memanggil metode yang tidak didefinisikan untuk snapshot pada snapshot, Anda akan mendapatkan kesalahan kompilasi. Namun, Anda dapat memanggil metode mengharapkan snapshot pada tipe bukan-snappshot.
tr: Not: ArrayTrait özelliğinde olduğu gibi tanımlandığı için len() metodunu yalnızca bir dizi anlık görüntüsünde aramak mümkündür. Bir anlık görüntüdeki anlık görüntüler için tanımlanmamış bir yöntemi çağırmaya çalışırsanız, derleme hatası alırsınız. Ancak, anlık görüntü olmayan türlerde anlık görüntü bekleyen yöntemleri arayabilirsiniz.
zh_cn: 注意 : 只能将“ len() ” 方法调用在阵列快照上, 因为它在“ ArrayTrait” 特性中被定义为此方法。 如果您试图调用一种对快照上的快照没有定义的方法, 您将会得到一个编译错误。 但是, 您可以调用一些方法, 期待对非弹射类型进行快照。

source: The output of this program is:
es: El resultado de este programa es:
fr: La sortie de ce programme est:
id: Keluaran program ini adalah:
tr: Bu programın çıktısı:
zh_cn: 此程序的产出为:

source: First, notice that all the tuple code in the variable declaration and the function return value is gone. Second, note that we pass `@arr1` into `calculate_length` and, in its definition, we take `@Array<u128>` rather than `Array<u128>`.
es: En primer lugar, note que todo el código de la tupla en la declaración variable y el valor de retorno de la función ha desaparecido. En segundo lugar, note que pasamos arr1` en `calculate_length` y, en su definición, tomamos Array<u128'' en lugar de `Array<u128».
fr: Tout d'abord, remarquez que tout le code de tuple dans la déclaration variable et la valeur de retour de la fonction est parti. Deuxièmement, notez que nous passons `@arr1` dans `calculate_length` et, dans sa définition, nous prenons `@Array<u128>` plutôt que `Array<u128>`.
id: Pertama, perhatikan bahwa semua kode tuple dalam deklarasi variabel dan nilai kembali fungsi hilang. Kedua, perhatikan bahwa kita lulus @arrr1) ke dalam ·calculate_length dan, dalam definisinya, kita ambil @Array<u128>, daripada Array<u128>.
tr: İlk olarak, değişken deklarasyondaki ve fonksiyon dönüş değerindeki tüm tül kodunun kaybolduğuna dikkat edin. İkincisi, arr1'yi calculate_length'ye aktardığımızı ve tanımında Arrayu128> yerine Arrayu128>'yi aldığımızı unutmayın.
zh_cn: 首先, 注意变量声明和函数返回值中的所有 tuple 代码都已删除 。 其次, 注意我们通过 `\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: Let’s take a closer look at the function call here:
es: Echemos un vistazo más de cerca a la llamada de la función aquí:
fr: Laissez-nous regarder de plus près l'appel de la fonction ici:
id: Mari kita lihat lebih dekat pada panggilan fungsi di sini:
tr: Buradaki fonksiyon çağrısına daha yakından bakalım:
zh_cn: 让我们更仔细地看一看函数调用这里 :

source: The `@arr1` syntax lets us create a snapshot of the value in `arr1`. Because a snapshot is an immutable view of a value at a specific point in time, the usual rules of the linear type system are not enforced. In particular, snapshot variables always implement the `Drop` trait, never the `Destruct` trait, even dictionary snapshots.
es: La sintaxis de `arr1` nos permite crear una instantánea del valor en `arr1`. Debido a que una instantánea es una vista inmutable de un valor en un momento determinado, las reglas habituales del sistema de tipo lineal no se aplican. En particular, las variables de instantánea siempre implementan el rasgo `Drop`, nunca el rasgo `Destruct`, ni siquiera las instantáneas del diccionario.
fr: La syntaxe `@arr1` nous permet de créer un instantané de la valeur dans `arr1`. Parce qu'un instantané est une vue immuable d'une valeur à un moment précis, les règles habituelles du système de type linéaire ne sont pas appliquées. En particulier, les variables d'instantané implémentent toujours le caractère `Drop`, jamais le caractère `Destruct`, même les instantanés de dictionnaire.
id: Sintaks @arr1) memungkinkan kita membuat snapshot dari nilai dalam ·arr1. Karena sebuah snapshot adalah pandangan yang tak dapat berubah dari nilai pada suatu titik tertentu dalam waktu tertentu, aturan biasa dari sistem tipe linear tidak dipaksakan. Secara khusus, variabel snapshot selalu mengimplementasikan sifat ådropía, tidak pernah merusak sifat kamus, bahkan snapshots kamus.
tr: arr1 sözdizimi, arr1'deki değerin anlık görüntüsünü oluşturmamızı sağlar. Bir anlık görüntü, belirli bir noktada bir değerin değişmez bir görünümü olduğundan, doğrusal tip sisteminin olağan kuralları uygulanmaz. Özellikle, anlık görüntü değişkenleri her zaman Drop özelliğini uygularlar, asla Destruct özelliği, hatta sözlük anlık görüntüleri.
zh_cn: rr1的语法让我们能够对`arr1' 中的价值做一个快照,因为快照是特定时间某个值的不可改变的视图,因此没有执行线性类型系统的常规规则,特别是,快照变量总是执行`滴滴'特性,从不执行`破坏'特性,甚至字典短照。

source: Similarly, the signature of the function uses `@` to indicate that the type of the parameter `arr` is a snapshot. Let’s add some explanatory annotations:
es: Del mismo modo, la firma de la función utiliza para indicar que el tipo del parámetro `arr` es una instantánea. Añadamos algunas anotaciones explicativas:
fr: De même, la signature de la fonction utilise `@` pour indiquer que le type du paramètre `arr` est un instantané.
id: Serupa dengan itu, tanda tangan dari fungsi tersebut menggunakan <@) untuk menunjukkan bahwa tipe parameternya adalah sebuah snapshot. Mari kita tambahkan beberapa penjelasan:
tr: Benzer şekilde, fonksiyonun imzası, arr parametresinin türünün bir anlık görüntü olduğunu belirtmek için kullanır. Bazı açıklayıcı açıklamalar ekleyelim:
zh_cn: 同样,函数的签名用表示参数`arr'的类型是一个快照。让我们添加一些解释性说明:

source: // array_snapshot is a snapshot of an Array
es: // array_snapshot es una instantánea de un Array
fr: // array_snapshot est un instantané d'un tableau
id: // array_snapshot adalah snapshot dari sebuah Array
tr: // array_snapshot bir Array'in anlık görüntüsüdür
zh_cn: / 数组_ snapshot 是阵列的快照

source: // Here, array_snapshot goes out of scope and is dropped. // However, because it is only a view of what the original array `arr` contains, the original `arr` can still be used.
es: // Aquí, array_snapshot sale fuera de alcance y se cae. // Sin embargo, debido a que es sólo una vista de lo que el array original `arr` contiene, el `arr` original todavía se puede utilizar.
fr: // Ici, array_snapshot sort de la portée et est supprimé. // Cependant, parce que ce n'est qu'une vue de ce que contient le tableau original `arr`, le `arr` original peut encore être utilisé.
id: //Di sini, array_snapshot keluar dari lingkup dan dijatuhkan. / Namun, karena itu hanya pandangan dari apa yang asli array yang ada, yang asli masih dapat digunakan.
tr: // Burada, array_snapshot kapsam dışına çıkar ve bırakılır. // Ancak, orijinal dizi arr'nin içerdiği şeyin bir görünümü olduğundan, orijinal arr hala kullanılabilir.
zh_cn: / 然而,因为它只是观察原始阵列`收发'中包含什么,原始`收发'仍然可以使用。

source: The scope in which the variable `array_snapshot` is valid is the same as any function parameter’s scope, but the underlying value of the snapshot is not dropped when `array_snapshot` stops being used. When functions have snapshots as parameters instead of the actual values, we won’t need to return the values in order to give back ownership of the original value, because we never had it.
es: El alcance en el que la variable `array_snapshot` es válida es el mismo que el alcance de cualquier parámetro de función, pero el valor subyacente de la instantánea no se pierde cuando `array_snapshot` deja de utilizarse. Cuando las funciones tienen instantáneas como parámetros en lugar de los valores reales, no tendremos que devolver los valores para devolver la propiedad del valor original, porque nunca lo tuvimos.
fr: La portée dans laquelle la variable `array_snapshot` est valide est la même que celle de n'importe quel paramètre de fonction, mais la valeur sous-jacente de l'instantané n'est pas supprimée lorsque `array_snapshot` cesse d'être utilisé. Lorsque les fonctions ont des instantanés comme paramètres au lieu des valeurs réelles, nous n'avons pas besoin de retourner les valeurs afin de redonner la propriété de la valeur originale, parce que nous ne l'avons jamais eu.
id: Lingkup di mana variabel ·array_snapshoté valid sama dengan lingkup parameter fungsi apapun, tetapi nilai dasar dari snapshot tidak dijatuhkan ketika ·array_snappshot_s berhenti digunakan. Ketika fungsi memiliki snapshots sebagai parameter daripada nilai sebenarnya, kita tidak perlu mengembalikan nilai dalam rangka untuk memberikan kepemilikan kembali dari nilai asli, karena kita tidak pernah memilikinya.
tr: array_snapshot değişkeninin geçerli olduğu kapsam, herhangi bir fonksiyon parametresinin kapsamı ile aynıdır, ancak array_snapshot kullanımı durduğunda anlık görüntünün altında yatan değer düşürülmez. Fonksiyonlar gerçek değerler yerine parametreler olarak anlık görüntülere sahip olduğunda, orijinal değerin sahipliğini geri vermek için değerleri geri vermemize gerek kalmaz, çünkü hiçbir zaman sahip olmadık.
zh_cn: 变量“ array_ snapshot” 有效的范围与任何函数参数的范围相同,但当“ array_ snapshot” 停止使用时,快照的基本值没有下降。当函数将快照作为参数而不是实际值时,我们不需要返回值,以恢复原始值的所有权,因为我们从未拥有过它。

source: Desnap Operator
es: Operador de desnap
fr: Opérateur de désenclenchement
id: Operator Desnap
tr: Desnap Operatörü
zh_cn: Desnap 运算运算符

source: To convert a snapshot back into a regular variable, you can use the `desnap` operator `*`, which serves as the opposite of the `@` operator.
es: Para convertir una instantánea de nuevo en una variable regular, puede utilizar el operador `desnap` `*`, que sirve como lo contrario del operador.
fr: Pour convertir un snapshot en une variable régulière, vous pouvez utiliser l'opérateur `desnap` `*`, qui sert comme le contraire de l'opérateur `@`.
id: Untuk mengubah snapshot kembali ke variabel biasa, Anda dapat menggunakan operator ådesnapé, yang berfungsi sebagai kebalikan dari operator.
tr: Bir anlık görüntüyü normal bir değişkene geri dönüştürmek için, operatörünün tam tersi olarak hizmet veren desnap operatörü *'yi kullanabilirsiniz.
zh_cn: 要将快照转换为正则变量, 您可以使用“ desnap” 运算符 ”, 与 {% 运算符相反 。

source: Only `Copy` types can be desnapped. However, in the general case, because the value is not modified, the new variable created by the `desnap` operator reuses the old value, and so desnapping is a completely free operation, just like `Copy`.
es: Sin embargo, en el caso general, debido a que el valor no se modifica, la nueva variable creada por el operador de `desnap` reutiliza el valor antiguo, por lo que el desnaping es una operación totalmente libre, al igual que `Copy`.
fr: Cependant, dans le cas général, parce que la valeur n'est pas modifiée, la nouvelle variable créée par l'opérateur `desnap` réutilise l'ancienne valeur, de sorte que le desnaping est une opération totalement libre, tout comme `Copy`.
id: Namun, dalam kasus umum, karena nilai tersebut tidak diubah, variabel baru yang dibuat oleh operator yang menggunakan kembali nilai lama, sehingga desnapping adalah operasi bebas sepenuhnya, sama seperti Connell.
tr: Sadece Copy türleri çıkarılabilir. Ancak, genel durumda, değer değiştirilmediği için, desnap operatörü tarafından oluşturulan yeni değişken eski değeri yeniden kullanır ve böylece desnapping, tıpkı Copy gibi tamamen ücretsiz bir işlemdir.
zh_cn: 只有`Copy'类型才能去除,但是,在一般情况下,由于价值没有改变,“Donnap'经营者创造的新变量重复了旧价值,因此,“Copy”是一种完全自由的操作,就像`Copy'一样。

source: In the following example, we want to calculate the area of a rectangle, but we don't want to take ownership of the rectangle in the `calculate_area` function, because we might want to use the rectangle again after the function call. Since our function doesn't mutate the rectangle instance, we can pass the snapshot of the rectangle to the function, and then transform the snapshots back into values using the `desnap` operator `*`.
es: En el siguiente ejemplo, queremos calcular el área de un rectángulo, pero no queremos tomar la propiedad del rectángulo en la función `calculate_area`, porque podríamos querer utilizar el rectángulo de nuevo después de la llamada a la función. Puesto que nuestra función no muta la instancia del rectángulo, podemos pasar la instantánea del rectángulo a la función, y luego transformar las instantáneas de nuevo en valores usando el operador `desnap` `*`.
fr: Dans l'exemple suivant, nous voulons calculer la zone d'un rectangle, mais nous ne voulons pas prendre la propriété du rectangle dans la fonction `calculate_area`, parce que nous pourrions vouloir utiliser le rectangle à nouveau après l'appel de la fonction. Puisque notre fonction ne mute pas l'instance rectangle, nous pouvons passer l'instantané du rectangle à la fonction, puis transformer les instantanés en valeurs en utilisant l'opérateur `desnap` `*`.
id: Dalam contoh berikut, kami ingin menghitung luas persegi panjang, tapi kami tidak ingin mengambil kepemilikan persegi panjang dalam fungsi ·calcululate_areaá, karena kami mungkin ingin menggunakan persegi panjang lagi setelah panggilan fungsi. karena fungsi kami tidak dapat mengubah snapshot dari rectule ke fungsi, dan kemudian mengubah foto-foto kembali menjadi nilai-nilai menggunakan operator Ásnapáno.
tr: Aşağıdaki örnekte, bir dikdörtgenin alanını hesaplamak istiyoruz, ancak calculate_area fonksiyonundaki dikdörtgenin mülkiyetini almak istemiyoruz, çünkü fonksiyon çağrısından sonra dikdörtgeni tekrar kullanmak isteyebiliriz. Fonksiyonumuz dikdörtgen örneğini mutasyona uğratmadığından, dikdörtgenin anlık görüntüsünü fonksiyona geçirebilir ve ardından anlık görüntüleri desnap operatörünü kullanarak değerlere dönüştürebiliriz *.
zh_cn: 在下面的例子中,我们想要计算矩形的区域, 但我们不想在“ 计算区域” 函数中拥有矩形, 因为我们可能想要在函数调用后再次使用矩形。 由于我们的函数不会变形矩形实例, 我们可以将矩形的抓图传送到函数中, 然后使用 `desnap' 运算符将抓图转换为值 。

source: "Area: {}"
es: "Área:
fr: "Zone: {}"
tr: "Alan: "
zh_cn: "地区: "

source: // As rec is a snapshot to a Rectangle, its fields are also snapshots of the fields types. // We need to transform the snapshots back into values using the desnap operator `*`. // This is only possible if the type is copyable, which is the case for u64. // Here, `*` is used for both multiplying the height and width and for desnapping the snapshots.
es: // Como rec es una instantánea a un rectángulo, sus campos también son instantáneas de los tipos de campos. // Necesitamos transformar las instantáneas de nuevo en valores usando el operador de desnap `*`. // Esto sólo es posible si el tipo es copiable, que es el caso de u64. // Aquí, `*` se utiliza para multiplicar la altura y la anchura y para desnap las instantáneas.
fr: // Comme rec est un snapshot vers un rectangle, ses champs sont également des snapshots des types de champs. // Nous devons transformer les snapshots en valeurs en utilisant l'opérateur de desnaps `*`. // Ceci n'est possible que si le type est copiable, ce qui est le cas pour u64. // Ici, `*` est utilisé à la fois pour multiplier la hauteur et la largeur et pour desnapper les snapshots.
id: //Seperti recc adalah snapshot ke rectangle, bidangnya juga merupakan foto dari jenis bidang. /Kita perlu mengubah snapshot kembali ke nilai menggunakan operator desnap*. /Hal ini hanya mungkin jika jenisnya dapat disalin, yang merupakan kasus untuk u64. / Di sini, digunakan untuk memperkalian tinggi dan lebar dan untuk meniru snapshots.
tr: // Rec bir dikdörtgene anlık görüntü olduğundan, alanları da alan tiplerinin anlık görüntüleridir. // Desnap operatörü * kullanarak anlık görüntüleri tekrar değerlere dönüştürmemiz gerekir. // Bu, yalnızca tip kopyalanabilirse mümkündür, bu u64 için geçerlidir. // Burada, * hem yüksekliği hem de genişliği çarpmak için ve anlık görüntüleri silmek için kullanılır.
zh_cn: 作为矩形的缩影,它的字段也是字段类型的缩图。 / 我们需要使用 desnap 运算符将抓图转换为值 。 / / 只有当该类型可以复制时, 也就是 u64 的情况。 / / 此处, \ 用于乘法高度和宽度, 并用于删除抓图 。

source: But, what happens if we try to modify something we’re passing as a snapshot? Try the code in Listing 4-4. Spoiler alert: it doesn’t work!
es: Pero, ¿qué pasa si tratamos de modificar algo que estamos pasando como una instantánea? Pruebe el código en Listado 4-4. Alerta de spoiler: ¡no funciona!
fr: Mais, que se passe-t-il si nous essayons de modifier quelque chose que nous passons comme un instantané? Essayez le code dans Listing 4-4. Alerte Spoiler : cela ne fonctionne pas!
id: Tapi, apa yang terjadi jika kita mencoba mengubah sesuatu yang kita lewati sebagai foto?
tr: Ancak, anlık görüntü olarak geçtiğimiz bir şeyi değiştirmeye çalışırsak ne olur? Listeleme 4-4'teki kodu deneyin. Spoiler uyarısı: çalışmıyor!
zh_cn: 但是,如果我们试图修改我们作为快照通过的东西呢?试试4-4列表中的代码。 破坏者警告:这行不通!

source: <span class="caption">Listing 4-4: Attempting to modify a snapshot value</span>
es: <span class="caption">Lista 4-4: Intentar modificar un valor de instantánea</span>
fr: <span class="caption">Liste 4-4: Tentative de modification d'une valeur d'instantané</span>
id: <span class="caption">Listing 4-4: Mencoba untuk mengubah nilai snapshot</span>
tr: span class="caption">Liste 4-4: Bir anlık görüntü değerini değiştirmeye çalışmak/span>
zh_cn: <span类=“caption” > listing 4-4: 试图修改快照值 </span>

source: Here’s the error:
es: Aquí está el error:
fr: Voici l'erreur :
id: Ini kesalahannya:
tr: İşte hata:
zh_cn: 以下是错误:

source: The compiler prevents us from modifying values associated to snapshots.
es: El compilador nos impide modificar los valores asociados a las instantáneas.
fr: Le compilateur nous empêche de modifier les valeurs associées aux instantanés.
id: kompiler mencegah kita dari mengubah nilai yang terkait dengan snapshot.
tr: Derleyici, anlık görüntülerle ilişkili değerleri değiştirmemizi engeller.
zh_cn: 编译者阻止我们修改与快照相关的值 。

source: Mutable References
es: Referencias mutables
fr: Références mutables
id: Referensi yang Dapat Dimutasi
tr: Değiştirilebilir Referanslar
zh_cn: 可变引用
