Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: {{#quiz ../quizzes/ch05-02-an-example-program-using-structs.toml}}
fr: {{#quiz../quizes/ch05-02-an-example-program-use-structs.toml}}
id: {{#quiz../quizzes/ch05-02-an-example-program-withing-structs.toml}}
zh_cn: Quiz./quizzes/ch05-02 - a-example-programme-useproducts-structs.toml_________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________

source: _Methods_ are similar to functions: we declare them with the `fn` keyword and a name, they can have parameters and a return value, and they contain some code that’s run when the method is called from somewhere else. Unlike functions, methods are defined within the context of a struct (or an enum which we cover in [Chapter 6](./ch06-01-enums.md)), and their first parameter is always `self`, which represents the instance of the type the method is being called on.
es: _Métodos_ son similares a las funciones: las declaramos con la palabra clave `fn` y un nombre, pueden tener parámetros y un valor de retorno, y contienen algún código que se ejecuta cuando el método se llama desde otro lugar. A diferencia de las funciones, los métodos se definen dentro del contexto de una estructura (o un enum que cubrimos en [Capítulo 6](./ch06-01-enums.md)), y su primer parámetro es siempre `self`, que representa la instancia del tipo que se llama el método.
fr: _Methods_ sont similaires aux fonctions : nous les déclarons avec le mot-clé `fn` et un nom, ils peuvent avoir des paramètres et une valeur de retour, et ils contiennent un certain code qui s'exécute lorsque la méthode est appelée d'un autre endroit. Contrairement aux fonctions, les méthodes sont définies dans le contexte d'une struct (ou d'un enum que nous couvrons dans [Chapitre 6](./ch06-01-enums.md)), et leur premier paramètre est toujours `self`, qui représente l'instance du type sur lequel la méthode est appelée.
id: _Metods_ serupa dengan fungsi: kita menyatakan mereka dengan kata kunci dan nama, mereka dapat memiliki parameter dan nilai kembali, dan mereka berisi beberapa kode yang menjalankan ketika metode dipanggil dari tempat lain. Tidak seperti fungsi, metode didefinisikan dalam konteks dari sebuah struktur (atau enum yang kita meliputi [Chapter 6]./ch06-enums-m), dan parameter pertama mereka selalu oryself, yang merupakan contoh dari tipe metode yang sedang dipanggil.
tr: _Methods_ fonksiyonlara benzer: onları fn anahtar kelimesi ve bir isimle beyan ediyoruz, parametrelere ve bir dönüş değerine sahip olabilirler ve yöntem başka bir yerden çağrıldığında çalışan bazı kodlar içerirler. Fonksiyonların aksine, yöntemler bir yapı (veya [Bölüm 6] (./ch06-01-enums.md olarak adlandırılan) bağlamında tanımlanır ve her zaman ilk parametredir.
zh_cn: _Methods_与函数相似:我们用`fn'关键字和名称宣布它们,它们可以有参数和返回值,它们包含一些代码,当该方法从别处调用时,这些代码会运行。与函数不同,方法是在[第6章](./ch06-01-enums.md)中我们所覆盖的树枝(或树枝)的背景下定义的,而它们的第一个参数总是`self',它代表了所使用方法类型的实例。

source: Defining Methods
es: Definición de métodos
fr: Définition des méthodes
id: Metode Definisi
tr: Tanımlama Yöntemleri
zh_cn: 界定方法

source: Let’s change the `area` function that has a `Rectangle` instance as a parameter and instead make an `area` method defined on the `Rectangle` struct, as shown in Listing 5-11
es: Vamos a cambiar la función `área` que tiene una instancia `Rectángulo` como parámetro y en su lugar hacer un método `área` definido en la estructura `Rectángulo`, como se muestra en la Lista 5-11
fr: Permet de modifier la fonction `area` qui a une instance `Rectangle` comme paramètre et de faire plutôt une méthode `area` définie sur la structure `Rectangle`, comme indiqué dans Listing 5-11
id: Mari kita ubah fungsi yang memiliki sebuah Rectangle sebagai parameter dan sebagai gantinya buatlah sebuah metode yang didefinisikan pada struktur Rectangle, seperti yang ditunjukkan dalam Listing 5-11
tr: Bir Rectangle örneğine sahip olan area fonksiyonunu parametre olarak değiştirelim ve bunun yerine Listeleme 5-11'de gösterildiği gibi Rectangle yapısında tanımlanan bir area yöntemi yapalım.
zh_cn: 让我们改变“区域”函数,即将“矩形”实例作为参数,而将“区域”方法定义为“矩形”构造上定义的“区域”方法,如列表 5-11所示。

source: Listing 5-11: Defining an `area` method on the `Rectangle` struct.
es: Lista 5-11: Definición de un método de `área` en la estructura `Rectángulo`.
fr: Liste 5-11: Définition d'une méthode `area` sur la structure `Rectangle`.
id: Terdaftar 5-11: Mendefinisikan sebuah metode Áareaé pada struktur Rectangle.
tr: Listeleme 5-11: Rectangle yapısında bir area yönteminin tanımlanması.
zh_cn: 列出5-11:界定`矩形'构造上的`区域'方法。

source: To define the function within the context of `Rectangle`, we start an `impl` (implementation) block for a trait `RectangleTrait` that defines the methods that can be called on a `Rectangle` instance. As impl blocks can only be defined for traits and not types, we need to define this trait first - but it's not meant to be used for anything else.
es: Para definir la función en el contexto de `Rectángle`, iniciamos un bloque `impl` (implementación) para un rasgo `RectángleTrait` que define los métodos que se pueden llamar en una instancia `Rectángle`. Como los bloques de impl sólo se pueden definir para rasgos y no tipos, necesitamos definir este rasgo primero - pero no está destinado a ser utilizado para cualquier otra cosa.
fr: Pour définir la fonction dans le contexte de `Rectangle`, nous commençons un bloc `impl` (implémentation) pour un trait `RectangleTrait` qui définit les méthodes qui peuvent être appelées sur une instance `Rectangle`. Comme les blocs impl ne peuvent être définis que pour les caractères et non pour les types, nous devons d'abord définir ce trait - mais il n'est pas destiné à être utilisé pour autre chose.
id: Untuk mendefinisikan fungsi dalam konteks Rectangle, kita memulai sebuah blok Éimplo (implementasi) untuk sebuah sifat ▪RectangTrait) yang mendefinisikan metode-metode yang dapat disebut pada contoh ▪Rectangle. sebagai blok impl hanya dapat didefinisikan untuk sifat-sifat dan bukan tipe, kita perlu mendefinisikan sifat ini terlebih dahulu - tetapi tidak dimaksudkan untuk digunakan untuk hal lain.
tr: Rectangle bağlamında fonksiyonu tanımlamak için, bir RectangleTrait özelliği için bir impl (uygulama) bloğu başlatırız. Bu, Rectangle örneğinde çağrılabilecek yöntemleri tanımlar. İmpl blokları sadece özellikler için tanımlanabilir ve türler için değil, bu özelliği ilk olarak tanımlamamız gerekir - ancak başka bir şey için kullanılması amaçlanmamıştır.
zh_cn: 为了在`矩形'的背景下界定函数,我们为`矩形Trait'的特性启动一个`impl`(实施)块,用于界定可称为`矩形'实例的方法,因为矩形区块只能根据特性而不是类型来定义,我们需要首先界定这一特性,但并非指用于其他任何东西。

source: Everything within this `impl` block will be associated with the `Rectangle` type. Then we move the `area` function within the `impl` curly brackets and change the first (and in this case, only) parameter to be `self` in the signature and everywhere within the body. In `main`, where we called the `area` function and passed `rect1` as an argument, we can instead use _method syntax_ to call the `area` method on our `Rectangle` instance. The method syntax goes after an instance: we add a dot followed by the method name, parentheses, and any arguments.
es: Todo dentro de este bloque `impl` se asociará con el tipo `Rectángle`. Luego moveremos la función `área` dentro de los corchetes `impl` rizados y cambiaremos el primer parámetro (y en este caso, sólo) a `auto' en la firma y en todas partes dentro del cuerpo. En `main`, donde llamamos la función `área` y pasamos `rect1` como argumento, podemos usar _metodo sintaxis_ para llamar al método `área` en nuestra instancia `Rectángle`. La sintaxis del método va después de una instancia: añadimos un punto seguido por el nombre del método, paréntesis, y cualquier argumento.
fr: Tout dans ce bloc `impl` sera associé au type `Rectangle`. Ensuite, nous déplaçons la fonction `area` dans les crochets `impl` et changeons le premier (et dans ce cas, seulement) paramètre pour être `self` dans la signature et partout dans le corps. Dans `main`, où nous avons appelé la fonction `area` et passé `rect1` comme argument, nous pouvons plutôt utiliser _method syntaxe_ pour appeler la méthode `area` sur notre instance `Rectangle`. La syntaxe de la méthode va après une instance: nous ajoutons un point suivi par le nom de la méthode, les parenthèses et tous les arguments.
id: Segala sesuatu yang ada di dalam blok ini akan dihubungkan dengan tipe Rectangle. Kemudian kita memindahkan fungsi ·area) dalam kurung keriting dan mengubah pertama (dan dalam kasus ini, hanya) parameter untuk menjadi dirinya sendiri dalam tanda tangan dan di mana-mana dalam tubuh. Dalam hal ini, di mana kita disebut fungsi ·areaán dan melewati Árect1 sebagai argumen, kita dapat menggunakan metode _method syntax untuk memanggil metode di lingkungan kita.
tr: Bu impl bloğundaki her şey Rectangle türü ile ilişkilendirilecektir. Sonra impl kıvırcık parantez içindeki area fonksiyonunu hareket ettirip ilk (ve bu durumda, sadece) parametreyi self olarak imzaya ve vücudumuzun her yerine ekleriz. main'de, area fonksiyonu dediğimiz ve rect1'i bir argüman olarak geçtiğimiz main.
zh_cn: 在`主要'中,我们称`区域'函数为`区域'函数,并将`区域'函数称为`区域'方法。在`区域'函数中,我们可以用`区域'语法作为参数。在`主要'中,我们把`区域'函数称为`区域'函数,并传过`区域'函数,作为论证。在`区域'实例中,我们可以将`区域'函数称为`区域'方法。方法语法以实例为例:我们增加一个点,然后是方法名称、括号和任何参数。

source: In the signature for `area`, we use `self: @Rectangle` instead of `rectangle: @Rectangle`. Methods must have a parameter named `self`, for their first parameter, and the type of `self` indicates the type that method can be called on. Methods can take ownership of `self`, but `self` can also be passed by snapshot or by reference, just like any other parameter.
es: En la firma para `área`, usamos `self: @Rectangle` en lugar de `rectagle: @Rectangle`. Los métodos deben tener un parámetro llamado `self`, para su primer parámetro, y el tipo de `self` indica el tipo de método al que se puede recurrir. Los métodos pueden hacerse cargo de `self`, pero `self` también se puede pasar por instantánea o por referencia, como cualquier otro parámetro.
fr: Dans la signature pour `area`, nous utilisons `self: @Rectangle` au lieu de `rectangle: @Rectangle`. Les méthodes doivent avoir un paramètre nommé `self`, pour leur premier paramètre, et le type de `self` indique le type sur lequel la méthode peut être appelée. Les méthodes peuvent prendre la propriété de `self`, mais `self` peut également être passé par instantané ou par référence, comme tout autre paramètre.
id: Dalam tanda tangan untuk mahkluka, kita menggunakan diri sendiri: @Rectangle, dan jenis dari dirinya sendiri menunjukkan tipe yang dapat dipanggil. Metoda dapat mengambil kepemilikan dari diri sendiri, tetapi ▪selfself can be pass by snapshot or referion, just the parameter.
tr: area için imzada self: @Rectangle yerine rectangle kullanıyoruz. Yöntemler, ilk parametreleri için self adında bir parametreye sahip olmalıdır ve self türü, yöntemin çağrılabileceği türe işaret eder. Yöntemler self'in mülkiyetini alabilir, ancak self aynı zamanda anlık görüntü veya başka bir parametre ile de geçebilir.
zh_cn: 在“区域”的签名中,我们使用`区域'的“自己:@Rectangle”而不是`rectangle:@Rectangle'。方法必须有一个第一个参数的`自我'参数,而`自我'类型表示该方法可以使用的类型。方法可以拥有`自己'的所有权,但`自我'也可以像任何其他参数一样,通过快照或参考传递。

source: There is no direct link between a type and a trait. Only the type of the `self` parameter of a method defines the type from which this method can be called. That means, it is technically possible to define methods on multiple types in a same trait (mixing `Rectangle` and `Circle` methods, for example). But **this is not a recommended practice** as it can lead to confusion.
es: No existe un vínculo directo entre un tipo y un rasgo. Sólo el tipo del parámetro `auto` de un método define el tipo del que se puede llamar a este método, lo que significa que es técnicamente posible definir métodos sobre varios tipos en un mismo rasgo (mezcla de métodos `Rectángle` y `Circle`, por ejemplo).
fr: Il n'y a pas de lien direct entre un type et un trait. Seul le type de paramètre `self` d'une méthode définit le type à partir duquel cette méthode peut être appelée. Cela signifie qu'il est techniquement possible de définir des méthodes sur plusieurs types dans un même trait (mélanger les méthodes `Rectangle` et `Circle`, par exemple).
id: Tidak ada hubungan langsung antara tipe dan sifat. hanya tipe dari sebuah metode yang mendefinisikan tipe metode ini yang dapat disebut. itu berarti, secara teknis dapat menentukan metode pada berbagai tipe dalam sifat yang sama (menggabungkan Rectleán dan metode sirkula, misalnya).
tr: Bir tür ve bir özellik arasında doğrudan bir bağlantı yoktur. Sadece bir yöntemin self parametresi türü, bu yöntemin adlandırılabileceği türü tanımlar. Bu, aynı özellikte birden fazla türdeki yöntemleri tanımlamak teknik olarak mümkün olduğu anlamına gelir (örneğin Rectangle ve Circle yöntemlerini karıştırmak). Ancak ** Bu, karışıklığa yol açabileceği için önerilen bir uygulama değildir**.
zh_cn: 类型和特性之间没有直接联系,只有方法的`自我'参数类型才能界定该方法的称呼类型,也就是说,在技术上可以确定同一特性(例如混合`链形'和`环形'方法)的多种类型方法。

source: The main reason for using methods instead of functions, in addition to providing method syntax, is for organization. We’ve put all the things we can do with an instance of a type in one `impl` block rather than making future users of our code search for capabilities of `Rectangle` in various places in the library we provide.
es: La razón principal para utilizar métodos en lugar de funciones, además de proporcionar sintaxis de método, es para la organización. Hemos puesto todas las cosas que podemos hacer con una instancia de un tipo en un bloque `impl` en lugar de hacer futuros usuarios de nuestra búsqueda de código de capacidades de `Rectangle` en varios lugares de la biblioteca que proporcionamos.
fr: La principale raison d'utiliser des méthodes au lieu de fonctions, en plus de fournir la syntaxe des méthodes, est pour l'organisation. Nous avons mis toutes les choses que nous pouvons faire avec une instance d'un type dans un bloc `impl` plutôt que de faire de futurs utilisateurs de notre recherche de code des capacités de `Rectangle` dans différents endroits dans la bibliothèque que nous fournissons.
id: Alasan utama untuk menggunakan metode sebagai ganti fungsi, selain menyediakan metode sintaks, adalah untuk organisasi.
tr: Fonksiyonlar yerine yöntemler kullanmanın temel nedeni, yöntem sözdizimi sağlamanın yanı sıra, organizasyon içindir. Sunduğumuz kütüphanede çeşitli yerlerde Rectangle kod arama yeteneklerinin gelecekteki kullanıcılarını yapmak yerine, bir impl bloğunda bir tür örneğiyle yapabileceğimiz her şeyi koyduk.
zh_cn: 除了提供方法语法外,使用方法代替功能的主要原因是组织,我们已经将我们所能做的所有事情都放在一个`隐性'区块中,而不是让未来的用户使用我们的代码搜索,以寻找我们提供的图书馆中各个地方的`连接'能力。

source: The `generate_trait` Attribute
es: El atributo `generate_trait`
fr: L'attribut `generate_trait`
id: Atribut Atribut T_generate_trait)
tr: genate_trait Özniteliği
zh_cn: `generate_trait' 属性

source: If you are familiar with Rust, you may find Cairo's approach confusing because methods cannot be defined directly on types. Instead, you must define a [trait](./ch08-02-traits-in-cairo.md) and an implementation of this trait associated with the type for which the method is intended. However, defining a trait and then implementing it to define methods on a specific type is verbose, and unnecessary: the trait itself will not be reused.
es: Si usted está familiarizado con Rust, puede encontrar el enfoque de El Cairo confuso porque los métodos no se pueden definir directamente en los tipos. En su lugar, usted debe definir un [ratio](./ch08-02-traits-in-cairo.md) y una implementación de este rasgo asociado con el tipo para el cual el método está destinado. Sin embargo, definir un rasgo y luego implementarlo para definir métodos en un tipo específico es verboso, e innecesario: el rasgo en sí mismo no será reutilizado.
fr: Si vous connaissez Rust, vous trouverez peut-être l'approche du Caire confuse parce que les méthodes ne peuvent pas être définies directement sur les types. Au lieu de cela, vous devez définir un [caractère](./ch08-02-trats-in-cairo.md) et une implémentation de ce trait associé au type auquel la méthode est destinée. Cependant, définir un trait et ensuite le mettre en œuvre pour définir des méthodes sur un type spécifique est verbeux, et inutile : le trait lui-même ne sera pas réutilisé.
id: Jika Anda akrab dengan Rust, Anda mungkin menemukan pendekatan Kairo membingungkan karena metode tidak dapat didefinisikan secara langsung pada tipe. Sebaliknya, Anda harus mendefinisikan [trait] Figaro./ch08-02-traits-in-cairo.md) dan impletasi dari sifat yang terkait dengan tipe yang dimaksudkan. Namun, mendefinisikan sebuah sifat dan kemudian mengimplementasikannya untuk mendefinisikan metode pada tipe tertentu adalah verbose, dan tidak perlu: sifat itu sendiri tidak akan digunakan kembali.
tr: Rust'a aşinaysanız, Kahire'nin yaklaşımını kafa karıştırıcı bulabilirsiniz, çünkü yöntemler doğrudan türler üzerinde tanımlanamaz. Bunun yerine, bir [trait] (./ch08-02-traits-in-cairo.md) ve bu özelliğin, yöntemin amaçlandığı türle ilişkili bir uygulamasını tanımlamanız gerekir. Bununla birlikte, bir özelliği tanımlamak ve belirli bir türdeki yöntemleri tanımlamak için uygulamak fiilidir ve gereksizdir: özelliğin kendisi yeniden kullanılmayacaktır.
zh_cn: 如果您熟悉Rust, 您可能会发现开罗的做法令人困惑, 因为方法无法直接根据类型来定义。 相反, 您必须定义一个[ trit] (./ ch08-02- tratits- in- cairo. md), 以及该特性的实施与该方法所针对的类型相关联。 但是, 定义一个特性然后实施该特性来定义特定类型的方法是verbose, 并且没有必要: 特性本身不会被重新使用 。

source: So, to avoid defining useless traits, Cairo provides the `#[generate_trait]` attribute to add above a trait implementation, which tells to the compiler to generate the corresponding trait definition for you, and let's you focus on the implementation only. Both approaches are equivalent, but it's considered a best practice to not explicitly define traits in this case.
es: Por lo tanto, para evitar definir rasgos inútiles, El Cairo proporciona el atributo "[generate_trait]` para agregar por encima de una implementación de rasgo, que le dice al compilador para generar la definición de rasgo correspondiente para usted, y vamos a centrarse en la implementación solamente. Ambos enfoques son equivalentes, pero se considera una mejor práctica no definir explícitamente rasgos en este caso.
fr: Donc, pour éviter de définir des traits inutiles, le Caire fournit l'attribut `#[generate_trait]` à ajouter au-dessus d'une implémentation de caractères, qui dit au compilateur de générer la définition de caractères correspondante pour vous, et vous laissez vous concentrer sur l'implémentation seulement. Les deux approches sont équivalentes, mais il est considéré comme une meilleure pratique de ne pas définir explicitement des caractères dans ce cas.
id: Jadi, untuk menghindari mendefinisikan sifat-sifat yang tidak berguna, Kairo menyediakan ·generate_trait]# [atribut untuk menambahkan di atas sebuah implementasi sifat, yang mengatakan kepada kompiler untuk menghasilkan definisi sifat yang sesuai untuk Anda, dan mari kita fokus pada implementasi saja. Keduanya pendekatan adalah ekuivalen, tetapi itu dianggap merupakan praktek terbaik untuk tidak secara eksplisit mendefinisikan sifat dalam kasus ini.
tr: Bu nedenle, işe yaramaz özellikleri tanımlamaktan kaçınmak için, Kahire, bir özellik uygulamasının üzerine eklemek için #[genate_trait] özniteliğini sağlar, bu da derleyiciye sizin için karşılık gelen özellik tanımını üretmesini söyler ve sadece uygulamaya odaklanalım. Her iki yaklaşım da eşdeğerdir, ancak bu durumda özellikleri açıkça tanımlamamak için en iyi uygulama olarak kabul edilir.
zh_cn: 因此,为了避免定义无用特性,开罗提供了“[遗传_trait]”属性,在特性执行之上添加一个特性执行,该属性要求汇编者为您生成相应的特性定义,而让我们只关注执行。这两种方法都是等效的,但认为最佳做法是在此情况下没有明确界定特性。

source: The previous example can also be written as follows:
es: El ejemplo anterior también puede ser escrito como sigue:
fr: L'exemple précédent peut également être écrit comme suit:
id: Contoh sebelumnya juga dapat ditulis sebagai berikut:
tr: Bir önceki örnek de şu şekilde yazılabilir:
zh_cn: 前一个例子也可以写如下:

source: Let's use this `#[generate_trait]` in the following chapters to make our code cleaner.
es: Vamos a utilizar este "[generate_trait]` en los siguientes capítulos para hacer nuestro código más limpio.
fr: Utilisons ce `#[generate_trait]` dans les chapitres suivants pour rendre notre code plus propre.
id: Mari kita gunakan ini # [generate_trait] dalam bab-bab berikut untuk membuat kode kita bersih.
tr: #[genate_trait] kodumuzu daha temiz hale getirmek için sonraki bölümlerde kullanalım.
zh_cn: 让我们在以下各章中用这个“[遗传_trait]”来清理我们的代码。

source: Snapshots and References
es: Snapshots y referencias
fr: Snapshots et références
id: Snapshot dan Referensi
tr: Snapshots ve Referanslar
zh_cn: 抓图和参考资料

source: As the `area` method does not modify the calling instance, `self` is declared as a snapshot of a `Rectangle` instance with the `@` snapshot operator. But, of course, we can also define some methods receiving a mutable reference of this instance, to be able to modify it.
es: Como el método `area` no modifica la instancia que llama, `self'se declara como una instantánea de una instancia `Rectangle` con el operador de instantáneas. Pero, por supuesto, también podemos definir algunos métodos que reciben una referencia mutable de esta instancia, para poder modificarla.
fr: Comme la méthode `area` ne modifie pas l'instance d'appel, `self` est déclaré comme un instantané d'une instance `Rectangle` avec l'opérateur `@` snapshot. Mais, bien sûr, nous pouvons également définir certaines méthodes recevant une référence mutable de cette instance, pour pouvoir la modifier.
id: Sebagaimana metode tersebut tidak mengubah contoh panggilan, kita juga dapat menentukan beberapa metode menerima referensi yang dapat berubah dari contoh ini, untuk dapat memodifikasinya.
tr: area yöntemi çağrı örneğini değiştirmediği için self, snapshot operatörü ile bir Rectangle örneğinin anlık görüntüsü olarak ilan edilir. Ancak, tabii ki, bu örnekte değiştirilebilen bir referans alan bazı yöntemleri de tanımlayabiliriz.
zh_cn: 由于`地区'方法并不改变呼叫实例,因此`自我'被宣布为与`区域'快速操作员的`链形'实例的快照,但是,当然,我们也可以确定一些方法,从中可变换引用,以便能够修改它。

source: Let's write a new method `scale` which resizes a rectangle of a `factor` given as parameter:
es: Escribamos un nuevo método `escala` que redimensiona un rectángulo de un `factor` dado como parámetro:
fr: Écrivons une nouvelle méthode `scale` qui redimensionne un rectangle d'un `facteur` donné en paramètre:
id: Mari kita menulis sebuah metode baru skala yang mengubah ukuran persegi panjang dari sebuah factor yang diberikan sebagai parameter:
tr: Parametre olarak verilen bir "faktör"ün dikdörtgenini yeniden boyutlandıran yeni bir yöntem scale yazalım:
zh_cn: 让我们写出一种“比例”的新方法,以调整给定参数的“要素”矩形的大小:

source: "The new size is (width: {}, height: {})"
es: "El nuevo tamaño es (ancho: #, altura: #)"
fr: "La nouvelle taille est (largeur: {}, hauteur: {})"
id: "Ukuran baru adalah (width: {}, tinggi: {}) "
tr: "Yeni boyut (genişlik:, yükseklik: )"
zh_cn: "新的尺寸是(宽度:, 高度: )"
