Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: It is also possible to define a method which takes ownership of the instance by using just `self` as the first parameter but it is rare. This technique is usually used when the method transforms `self` into something else and you want to prevent the caller from using the original instance after the transformation.
es: También es posible definir un método que toma la propiedad de la instancia usando sólo `self'como primer parámetro, pero es raro. Esta técnica se utiliza generalmente cuando el método se transforma `self'en otra cosa y desea evitar que el llamante utilice la instancia original después de la transformación.
fr: Il est également possible de définir une méthode qui prend la propriété de l'instance en utilisant simplement `self` comme premier paramètre mais il est rare. Cette technique est habituellement utilisée lorsque la méthode se transforme en quelque chose d'autre et vous voulez empêcher l'appelant d'utiliser l'instance originale après la transformation.
id: Teknik ini biasanya digunakan ketika metode mengubah dirinya sendiri menjadi sesuatu yang lain dan Anda ingin mencegah si penelpon menggunakan contoh asli setelah transformasi.
tr: İlk parametre olarak sadece self kullanarak örneğin mülkiyetini alan bir yöntemi tanımlamak da mümkündür, ancak nadirdir. Bu teknik genellikle yöntem self'yi başka bir şeye dönüştürdüğünde ve dönüşümden sonra arayanın orijinal örneği kullanmasını önlemek istediğinizde kullanılır.
zh_cn: 也可以确定一种方法,即仅将`自我'作为第一个参数,从而获得实例的所有权,但这是罕见的。当该方法将`自己'转化为其他东西时,通常使用这种技术,而你却想阻止呼叫者在变换后使用原始实例。

source: Look at the [Understanding Ownership](ch04-00-understanding-ownership.md) chapter for more details about these important notions.
es: Mira el capítulo [Entender la propiedad](ch04-00-entender la propiedad.md) para más detalles sobre estas nociones importantes.
fr: Consultez le chapitre [Comprendre la propriété](ch04-00-comprendre la propriété.md) pour plus de détails sur ces notions importantes.
id: Lihatlah bab [Mengerti Pemilik][Dimengerti Pemilik][Kh04-00-mengerti-pemilik] untuk rincian lebih lanjut tentang gagasan-gagasan penting ini.
tr: Bu önemli kavramlar hakkında daha fazla ayrıntı için [Anlayışlı Sahiplik] (ch04-00-anlayışlı sahiplik.md) bölümüne bakın.
zh_cn: 关于这些重要概念的更多细节,请看[了解所有权](ch04-00-了解所有权.md)一章。

source: Methods with Several Parameters
es: Métodos con varios parámetros
fr: Méthodes avec plusieurs paramètres
id: Metode dengan Beberapa Parameter
tr: Çeşitli Parametrelerle Yöntemler
zh_cn: 若干参数方法

source: Let’s practice using methods by implementing another method on the `Rectangle` struct. This time we want to write the method `can_hold` which accepts another instance of `Rectangle` and returns `true` if this rectangle can fit completely within self; otherwise, it should return false.
es: Practiquemos usando métodos implementando otro método en la estructura `Rectangle`. Esta vez queremos escribir el método `can_hold` que acepta otra instancia de `Rectangle` y devuelve `true` si este rectángulo puede caber completamente dentro de sí mismo; de lo contrario, debería regresar falso.
fr: Cette fois, nous voulons écrire la méthode `can_hold` qui accepte une autre instance de `Rectangle` et renvoie `true` si ce rectangle peut s'adapter complètement en soi; sinon, il devrait retourner faux.
id: Mari kita berlatih menggunakan metode dengan menerapkan metode lain pada struktur Rectangle. kali ini kita ingin menulis metode tersebut yang menerima contoh lain dari Rectangle dan kembali benar-benar jika persegi ini dapat cocok sepenuhnya dalam diri kita; sebaliknya, harus kembali salah.
tr: Rectangle yapısı üzerinde başka bir yöntem uygulayarak yöntemleri uygulayalım. Bu sefer Rectangle'ın başka bir örneğini kabul eden ve true döndüren can_hold yöntemini yazmak istiyoruz; aksi takdirde, yanlış dönmelidir.
zh_cn: 让我们通过在`矩形'构造上采用另一种方法来实践方法。 这次我们要写出“ 能够'hold'” 的方法,该方法接受另一例`矩形'并返回`真实 ',如果这个矩形可以完全适合自己; 否则,它应该返回假的。

source: "Can rect1 hold rect2? {}"
es: "¿Puede el rect1 sostener el rect2?"
fr: "Peut-on rect1 tenir rect2? {}"
id: "Bisakah rect1 menahan rect2?
tr: "Rekt1 rekt2'yi tutabilir mi?"
zh_cn: 直肠1可以保持直肠2吗?

source: "Can rect1 hold rect3? {}"
es: "¿Puede el rect1 sostener el rect3?"
fr: "Peut-on rect1 tenir rect3? {}"
id: "Bisakah rect1 menahan rect3?
tr: "Rekt1 rekt3'ü tutabilir mi? "
zh_cn: 直肠1可以保持直肠3吗?

source: Here, we expect that `rect1` can hold `rect2` but not `rect3`.
es: En este caso, esperamos que `rect1` pueda contener `rect2` pero no `rect3`.
fr: Ici, nous nous attendons à ce que `rect1` puisse tenir `rect2` mais pas `rect3`.
id: Di sini, kita berharap bahwa kita dapat bertahan tapi tidak dapat mencapai 3.
tr: Burada, rect1'in rect2'yi tutabileceğini, ancak rect3'yi tutamayacağını bekliyoruz.
zh_cn: 在这里,我们期望`rect1'能够保持`rect2',但不能维持`rect3'。

source: Associated functions
es: Funciones asociadas
fr: Fonctions associées
id: Fungsi yang terkait
tr: İlişkili fonksiyonlar
zh_cn: 相关职能

source: We call _associated functions_ all functions that are defined inside an `impl` block that are associated to a specific type. While this is not enforced by the compiler, it is a good practice to keep associated functions related to the same type in the same `impl` block - for example, all functions related to `Rectangle` will be grouped in the same `impl` block for `RectangleTrait`.
es: Llamamos a las funciones _asociadas_ todas las funciones que se definen dentro de un bloque `impl` que están asociadas a un tipo específico. Si bien el compilador no las aplica, es una buena práctica mantener las funciones asociadas relacionadas con el mismo tipo en el mismo bloque `impl` - por ejemplo, todas las funciones relacionadas con `Rectangle` se agruparán en el mismo bloque `impl` para `RectangleTrait`.
fr: Nous appelons les fonctions _associées_ toutes les fonctions qui sont définies à l'intérieur d'un bloc `impl` qui sont associées à un type spécifique. Bien que cela ne soit pas mis en œuvre par le compilateur, c'est une bonne pratique de garder les fonctions associées liées au même type dans le même bloc `impl` - par exemple, toutes les fonctions liées à `Rectangle` seront regroupées dans le même bloc `impl` pour `RectangleTrait`.
id: Kami sebut fungsi _asosiasi_ semua fungsi yang didefinisikan dalam sebuah blok Éimplo yang terkait dengan tipe tertentu. Sementara ini tidak diwajibkan oleh kompiler, adalah praktek yang baik untuk menjaga fungsi yang terkait dengan jenis yang sama dalam blok ▪implpla - misalnya, semua fungsi yang terkait dengan ▪Rectangle TM akan dikelompokkan dalam blok ▪impppplum yang sama untuk ÁRectlerait.
tr: Belirli bir tiple ilişkili bir impl bloğu içinde tanımlanan tüm fonksiyonlara _ilişkili fonksiyonlar_ diyoruz. Bu, derleyici tarafından uygulanmazken, aynı impl bloğunda aynı tiple ilgili işlevlerin tutulması iyi bir uygulamadır - örneğin, Rectangle ile ilgili tüm işlevler RectangleTrai için aynı impl bloğunda gruplandırılacaktır.
zh_cn: 我们称“关联函数”为“与特定类型相关的“内嵌块”内定义的所有函数。虽然汇编者没有强制实施,但将同一类型的相关函数保留在同一“内嵌块”中是一种良好做法,例如,与“红心”有关的所有功能将分组在同一“内嵌块”中,用于“红心trait”的“内嵌块”。

source: Methods are a special kind of associated function, but we can also define associated functions that don’t have `self` as their first parameter (and thus are not methods) because they don’t need an instance of the type to work with, but are still associated with that type.
es: Los métodos son un tipo especial de función asociada, pero también podemos definir funciones asociadas que no tienen `self` como su primer parámetro (y por lo tanto no son métodos) porque no necesitan una instancia del tipo con el que trabajar, pero todavía están asociados con ese tipo.
fr: Les méthodes sont un type particulier de fonction associée, mais nous pouvons également définir les fonctions associées qui ne possèdent pas de `self` comme premier paramètre (et ne sont donc pas des méthodes) parce qu'elles n'ont pas besoin d'une instance du type avec lequel travailler, mais sont toujours associées à ce type.
id: Metode adalah jenis khusus fungsi terkait, tetapi kita juga dapat mendefinisikan fungsi terkait yang tidak memiliki dirinya sendiri sebagai parameter pertama mereka (dan dengan demikian tidak metode) karena mereka tidak membutuhkan contoh dari jenis untuk bekerja dengan, tetapi masih terkait dengan jenis itu.
tr: Yöntemler özel bir tür ilişkili fonksiyondur, ancak kendine sahip olmayan ilişkili işlevleri de ilk parametreleri olarak tanımlayabiliriz (ve bu nedenle yöntemler değildir) çünkü çalışmak için türün bir örneğine ihtiyaç duymazlar, ancak yine de bu türle ilişkilidirler.
zh_cn: 方法是一种特殊的关联功能,但我们也可以将没有`自我'作为第一个参数(因此不是方法)的相关功能界定为它们的第一个参数(因此不是方法),因为它们不需要某种类型的工作实例,但仍然与该类型相关联。

source: Associated functions that aren’t methods are often used for constructors that will return a new instance of the type. These are often called `new`, but `new` isn’t a special name and isn’t built into the language. For example, we could choose to provide an associated function named `square` that would have one dimension parameter and use that as both width and height, thus making it easier to create a square `Rectangle` rather than having to specify the same value twice:
es: Las funciones asociadas que no son métodos se utilizan a menudo para los constructores que devuelven una nueva instancia del tipo. Estas a menudo se llaman `nuevo`, pero `nuevo` no es un nombre especial y no está integrado en el lenguaje. Por ejemplo, podríamos optar por proporcionar una función asociada llamada `cuadrado` que tendría un parámetro de dimensión y utilizarlo como ancho y altura, lo que hace más fácil crear un cuadrado `rectángulo` en lugar de tener que especificar el mismo valor dos veces:
fr: Les fonctions associées qui sont des méthodes sont souvent utilisées pour les constructeurs qui retourneront une nouvelle instance du type. Elles sont souvent appelées `new`, mais `new` n`est pas un nom spécial et n`est pas intégré dans la langue. Par exemple, nous pourrions choisir de fournir une fonction associée nommée `square` qui aurait un paramètre de dimension et utiliserait cela à la fois comme largeur et hauteur, ce qui rendrait plus facile de créer un carré `Rectangle` plutôt que d`avoir à spécifier la même valeur deux fois:
id: Fungsi-fungsi yang terkait dengan metode yang sering digunakan untuk konstruktor yang akan memberikan contoh baru dari jenis tersebut.
tr: Yöntem olmayan ilişkili işlevler genellikle türün yeni bir örneğini döndürecek konstrüktörler için kullanılır. Bunlar genellikle new olarak adlandırılır, ancak new özel bir ad değildir ve dile yerleşik değildir. Örneğin, bir boyut parametresine sahip olacak ve aynı genişlik ve yükseklik yerine iki kez aynı değeri kullanacak olan square adlı ilişkili bir işlev sağlamayı seçebiliriz: böylece kare Rectangle'ı oluşturmayı kolaylaştırır
zh_cn: 没有方法的相关函数通常用于返回同类新实例的构造者。这些函数通常被称为“新”,但“新”不是特殊名称,没有包含在语言中。例如,我们可以选择提供名为“方形”的关联函数,该函数具有一个维度参数,同时使用宽度和高度,从而更容易创建正方形的“矩形”,而不是两次指定相同的值:

source: Let's create the function `new` which creates a `Rectangle` from a `width` and a `height`, `square` which creates a square `Rectangle` from a `size` and `avg` which computes the average of two `Rectangle` instances:
es: Vamos a crear la función `nuevo` que crea un `rectángulo` a partir de un `ancho` y un `altura`, `cuadrado` que crea un cuadrado `rectángulo` a partir de un `tamaño` y `avg` que calcula el promedio de dos instancias `rectángulo`:
fr: Créons la fonction `new` qui crée un `Rectangle` à partir d`une `largeur` et un `hauteur`, `carré` qui crée un `Rectangle` carré à partir d`une `size` et `avg` qui calcule la moyenne de deux instances `Rectangle`:
id: Mari kita buat fungsinya yang baru yang menciptakan sebuah sudut pandang yang berbeda dari yang lain dan yang menghitung rata-rata dari dua contoh Rectangle:
tr: Bir width'den bir Rectangle ve bir height, square'den bir kare Rectangle oluşturan bir new ve avg'den iki Rectangle örneğinin ortalamasını hesaplayan New fonksiyonunu oluşturalım:
zh_cn: 让我们创建函数`新',从`圆'和`高'、`方形'产生`连 ',从`大小'和`avg'产生`连'方形,从`连'和`线'产生`连'方形`连 ',计算两个`连'实例的平均数:

source: "The average Rectangle of {:?} and {:?} is {:?}"
es: "El rectángulo promedio de {:?} y {:?} es {:?}"
fr: "Le rectangle moyen de {:?} et {:?} est {:?}"
id: "Perrataan persegi panjang {:?} dan {:} adalah {:}"
tr: ":? ve :?'nin ortalama dikdörtgeni :?'dir."
zh_cn: "平均矩形 {{:?}和{{{}是{}}}。"

source: To call the `square` associated function, we use the `::` syntax with the struct name; `let sq = Rectangle::square(3);` is an example. This function is namespaced by the struct: the `::` syntax is used for both associated functions and namespaces created by modules. We’ll discuss modules in [Chapter 7](./ch07-02-defining-modules-to-control-scope.md).
es: Para llamar a la función asociada `cuadrado`, usamos la `:` sintaxis con el nombre de la estructura; `let sq = Rectángulo::cuadrado(3);` es un ejemplo. Esta función está espaciada por la estructura: la `:` sintaxis se utiliza tanto para funciones asociadas como para espacios de nombres creados por módulos. Discutiremos módulos en [Capítulo 7](./ch07-02-definir-módulos-a-control-scope.md).
fr: Pour appeler la fonction associée `square`, nous utilisons la syntaxe `:` avec le nom de la structure; `let sq = Rectangle::square(3);` est un exemple. Cette fonction est espacée par le nom de la structure: la syntaxe `:` est utilisée pour les fonctions associées et les espaces de noms créés par les modules. Nous allons discuter des modules dans [Chapitre 7](./ch07-02-defining-modules-to-control-scope.md).
id: Untuk memanggil fungsi yang terkait, kita menggunakan sintaks dengan nama struktur; squaregle = requareáne3); yang contohnya. Fungsi ini diberi nama struct: sintaks:::: sintaks digunakan untuk fungsi yang terkait dan ruang nama yang dibuat oleh modul. Kita akan membahas modul di [Capter 7]. /ch07-defining-moles-to control-scope.d).
tr: square ilişkili fonksiyonu aramak için : struct adı ile sözdizimi; let sq = Dikdörtgen:::square(3); bir örnektir. Bu fonksiyon, struct tarafından aralıklı isimlerdir: :: sözdizimi, modüller tarafından oluşturulan hem ilişkili işlevler hem de ad uzayları için kullanılır. [Bölüm 7](./ch07-02-defind-modul)'de modülleri tartışacağız.
zh_cn: 要调用`quare' 相关函数,我们使用`:`带有结构名称的语法;`let sq =矩形::sqare(3);`就是一个例子。此函数由结构间隔:`:`语法用于相关函数和模块创建的命名空间。我们将在[第7章](./ch07-02-defining-modules-to- control-scope.md)中讨论模块。

source: Note that the `avg` function could also be written as a method with `self` as the first rectangle. In this case, instead of using the method with `RectangleTrait::avg(@rect1, @rect2)`, it would be called with `rect1.avg(rect2)`.
es: Tenga en cuenta que la función `avg` también podría escribirse como un método con `self` como primer rectángulo. En este caso, en lugar de usar el método con `RectangleTrait::avg(@rect1, @rect2)`, se le llamaría con `rect1.avg(rect2)`.
fr: Notez que la fonction `avg` pourrait également être écrite comme une méthode avec `self` comme premier rectangle. Dans ce cas, au lieu d'utiliser la méthode avec `RectangleTrait::avg(@rect1, @rect2)`, elle serait appelée avec `rect1.avg(rect2)`.
id: Perhatikan bahwa fungsi thoseavgán juga dapat ditulis sebagai metode dengan sendirinya sebagai persegi panjang pertama. dalam hal ini, daripada menggunakan metode dengan ▪RectangleTrait::avg Allahlt1, @rect2), ia akan dipanggil dengan ·rect1.avgcaprect2).
tr: avg fonksiyonunun ilk dikdörtgen olarak self ile de bir yöntem olarak yazılabileceğini unutmayın. Bu durumda, RectangleTrait::avg(@retct1, @ret2) metodunu kullanmak yerine rect1.avg(rect2) ile çağrılacaktır.
zh_cn: 请注意, `avg' 函数也可以用`self'作为第一个矩形的一种方法写成。 在这种情况下, 与其使用`RectangleTrait:::avg (@rect1,@rect2)'的方法, 不如用`rect1.avg(rect2)'来称呼它。

source: Multiple Traits and `impl` Blocks
es: Múltiples rasgos y bloques `impl`
fr: Blocks à caractères multiples et "impl`
id: Multiple Traits and æimplo Blocks
tr: Birden fazla özellik ve impl Blokları
zh_cn: 多重轨迹和“impl”块

source: Each struct is allowed to have multiple `trait` and `impl` blocks. For example, the following code is equivalent to the code shown in the _Methods with several parameters_ section, which has each method in its own `trait` and `impl` blocks.
es: Cada estructura tiene múltiples bloques de `trait` e `impl`; por ejemplo, el siguiente código es equivalente al código que se muestra en los _métodos con varios parámetros_, que tiene cada método en sus propios bloques de `trait` e `impl`.
fr: Chaque structure est autorisée à avoir plusieurs blocs `trait` et `impl`. Par exemple, le code suivant est équivalent au code affiché dans les _Méthods avec plusieurs paramètres_ section, qui a chaque méthode dans ses propres blocs `trait` et `impl`.
id: Setiap struktur diijinkan untuk memiliki multiple traitétémpl. Sebagai contoh, kode berikut ini setara dengan kode yang ditampilkan dalam _Metoda dengan beberapa bagian parameter_, yang memiliki setiap metode dalam sendiri blok ·trait. dan ▪implpl.
tr: Her strüktün birden fazla trait ve impl bloklarına sahip olmasına izin verilir. Örneğin, aşağıdaki kod, kendi trait ve impl bloklarında her bir yönteme sahip olan birkaç parametre_ bölümü olan _Method'larda gösterilen koda eşdeğerdir.
zh_cn: 允许每个支架有多个`trait'和`impl'区块,例如,以下代码相当于在`Methods'中显示的具有若干参数的`Methods'区块的代码,该区块在自己的`trait'和`impl'区块中有每种方法。

source: There’s no strong reason to separate these methods into multiple `trait` and `impl` blocks here, but this is valid syntax.
es: No hay ninguna razón sólida para separar estos métodos en múltiples bloques `trait` e `impl` aquí, pero esto es sintaxis válida.
fr: Il n'y a pas de raison forte de séparer ces méthodes en plusieurs blocs "trait" et "impl" ici, mais c'est une syntaxe valide.
id: Tidak ada alasan kuat untuk memisahkan metode-metode ini ke dalam beberapa blok atau blok yang valid di sini, tapi ini adalah sintaks yang valid.
tr: Bu yöntemleri burada çoklu trait ve impl bloklarına ayırmak için güçlü bir neden yoktur, ancak bu geçerli bir sözdizimidir.
zh_cn: 没有理由将这些方法分为多个`trait'和`impl'区块,但这是有效的语法。

source: {{#quiz ../quizzes/ch05-03-method-syntax.toml}}
fr: {{#quiz../quizes/ch05-03-method-syntax.toml}}
zh_cn: QQZ./Qzzes/ch05-03-方法-语法.toml

source: In this chapter, we’ll look at _enumerations_, also referred to as _enums_. Enums allow you to define a type by enumerating its possible _variants_. First, we’ll define and use an enum to show how an enum can encode meaning along with data. Next, we’ll explore a particularly useful enum, called `Option`, which expresses that a value can be either something or nothing. Finally, we’ll look at how pattern matching in the `match` expression makes it easy to run different code for different values of an enum.
es: En este capítulo, veremos _enumeraciones_, también conocido como _enums_. Los enums le permiten definir un tipo enumerando sus posibles _variantes_. Primero, definiremos y usaremos un enum para mostrar cómo un enum puede codificar el significado junto con los datos. A continuación, exploraremos un enum particularmente útil, llamado `Opción`, que expresa que un valor puede ser algo o nada. Finalmente, veremos cómo la coincidencia de patrones en la expresión `match` hace que sea fácil ejecutar código diferente para diferentes valores de un enum.
fr: Dans ce chapitre, nous allons regarder _énumérations_, également appelé _enums_. Les enums vous permettent de définir un type en énumérant ses possibles _variants_. D'abord, nous allons définir et utiliser un enum pour montrer comment un enum peut encoder la signification avec les données. Ensuite, nous allons explorer un enum particulièrement utile, appelé `Option`, qui exprime qu'une valeur peut être quelque chose ou rien. Enfin, nous allons regarder comment la correspondance des motifs dans l'expression `match` permet d'exécuter facilement un code différent pour différentes valeurs d'un enum.
id: Dalam bab ini, kita akan melihat pada _enumerations_, juga disebut _enum_. Enums memungkinkan anda untuk mendefinisikan sebuah tipe dengan menyebutkan kemungkinan _variants_. Pertama, kita akan mendefinisikan dan menggunakan enum untuk menunjukkan bagaimana enum dapat encodes makna bersama dengan data. Berikutnya, kita akan mengeksplorasi sebuah enum yang sangat berguna, yang disebut ÉOption (Option), yang menyatakan bahwa nilai dapat menjadi sesuatu atau tidak sama sekali. Akhirnya, kita akan melihat bagaimana pola pencocokan dalam ekspresi enomatik dapat memudahkan untuk menjalankan kode yang berbeda dari nilai yang berbeda.
tr: Bu bölümde, _enums_ olarak da adlandırılan _enumerations_'a bakacağız. Enumlar, olası _variants_'ını numaralandırarak bir türü tanımlamanıza izin verir. İlk olarak, bir enum'un veri ile birlikte anlamı nasıl kodlayabileceğini göstermek için bir enum tanımlayacağız ve kullanacağız. Daha sonra, bir değerin bir şey veya hiçbir şey olabileceğini ifade eden Option olarak adlandırılan özellikle farklı bir enum'u keşfedeceğiz.
zh_cn: 在此章中, 我们将查看_ 数字_, 也称为_ enums_ 。 英文允许您通过列举其可能的 _ variants_ 来定义某类型。 首先, 我们将定义并使用 enum 来显示一个 enum 如何将含义与数据一起编码。 接下来, 我们将探索一个特别有用的符号, 叫做 “ option ”, 表示一个值可以是某物, 也可以是某物。 最后, 我们将查看“ match ” 表达式的匹配模式如何使得对一个 enum 的不同值使用不同的代码变得容易 。

source: Enums, short for "enumerations," are a way to define a custom data type that consists of a fixed set of named values, called _variants_. Enums are useful for representing a collection of related values where each value is distinct and has a specific meaning.
es: Enums, abreviado para "enumeraciones", son una manera de definir un tipo de datos personalizado que consiste en un conjunto fijo de valores nombrados, llamados _variantes_. Enums son útiles para representar una colección de valores relacionados donde cada valor es distinto y tiene un significado específico.
fr: Les Enums, abrégés pour les "énumérations", sont un moyen de définir un type de données personnalisé qui consiste en un ensemble fixe de valeurs nommées, appelé _variants_. Les Enums sont utiles pour représenter une collection de valeurs liées où chaque valeur est distincte et a une signification spécifique.
id: Enums, singkatan dari "enumerasi," adalah cara untuk mendefinisikan tipe data gubahan yang terdiri dari set tetap dari nilai-nilai bernama, yang disebut _variants_. Enums berguna untuk mewakili koleksi nilai-nilai terkait di mana setiap nilai berbeda dan memiliki arti spesifik.
tr: Enums, "enumerations" kelimesinin kısaltması, _variants_ olarak adlandırılan sabit bir dizi adlandırılmış değerden oluşan özel bir veri türünü tanımlamanın bir yoludur. Enums, her değerin ayrı olduğu ve belirli bir anlamı olduğu ilgili değerlerin bir koleksiyonunu temsil etmek için kullanışlıdır.
zh_cn: Enums, 简称为“ 数字 ”, 是定义自定义数据类型的一种方法, 该自定义数据类型由固定的一组命名值组成, 称为 _ variants_ 。 Enums 可用于代表每个值不同且具有特定含义的相关值的集合。

source: Enum Variants and Values
es: Variantes y valores del Enum
fr: Variantes et valeurs de l'Enum
id: Varian dan Nilai Enum
tr: Enum Çeşitleri ve Değerleri
zh_cn: Enum 变式和价值

source: Here's a simple example of an enum:
es: He aquí un ejemplo simple de un enum:
fr: Voici un exemple simple d'un enum:
id: Ini contoh sederhana dari sebuah enum:
tr: İşte bir enum'un basit bir örneği:
zh_cn: 以下是一个简单的例子:
