Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The first way to implement this is to create a single component that contains both counter and ownership features from within a single component. However, this approach is not recommended: our goal is to minimize the amount of code duplication and take advantage of component reusability. Instead, we can create a new component that _depends_ on the `Ownable` component for the ownership features, and internally defines the logic for the counter.
es: La primera forma de implementar esto es crear un único componente que contenga tanto funciones de contador como de propiedad desde un solo componente. Sin embargo, no se recomienda este enfoque: nuestro objetivo es minimizar la cantidad de duplicación de código y aprovechar la reutilizabilidad de los componentes. En su lugar, podemos crear un nuevo componente que _depende_ del componente `Ownable` para las características de propiedad, y define internamente la lógica para el contador.
fr: La première façon de mettre en œuvre ceci est de créer un composant unique qui contient à la fois des fonctionnalités de compteur et de propriété à partir d'un seul composant. Cependant, cette approche n'est pas recommandée: notre objectif est de minimiser la quantité de duplication de code et de profiter de la réutilisabilité des composants. Nous pouvons plutôt créer un nouveau composant qui _dépend_ du composant `Ownable` pour les fonctionnalités de propriétaire, et définit en interne la logique du compteur.
id: Cara pertama untuk mengimplementasikan hal ini adalah dengan membuat komponen tunggal yang berisi counter dan fitur kepemilikan dari dalam satu komponen. Namun, pendekatan ini tidak disarankan: tujuan kita adalah untuk meminimalisir jumlah duplikasi kode dan mengambil keuntungan dari fungsi komponen. Sebaliknya, kita dapat membuat komponen baru yang _depends_ pada komponen yang dapat ditulis untuk fitur kepemilikan, dan secara internal mendefinisikan logika untuk counter.
tr: Bunu gerçekleştirmenin ilk yolu, hem sayaç hem de sahiplik özelliklerini tek bir bileşenden içeren tek bir bileşen oluşturmaktır. Ancak, bu yaklaşım önerilmez: amacımız kod çoğaltma miktarını en aza indirmek ve bileşen yeniden kullanılabilirliğinden yararlanmaktır. Bunun yerine, sahiplik özellikleri için Sahiplenilebilir bileşenine bağlı olan yeni bir bileşen oluşturabilir ve dahili olarak sayaç için mantığı tanımlar.
zh_cn: 实现这一目的的第一个办法是从一个组成部分内建立一个单一组成部分,既包含反面特征,也包含所有权特征,然而,没有建议采用这一办法:我们的目标是尽量减少代码重复,利用组件可再使用性;相反,我们可以创建一个新的组成部分,在所有权特征的`可操作性'组成部分上,并内部界定柜台的逻辑。

source: Listing 16-1 shows the complete implementation, which we'll break down right after:
es: La lista 16-1 muestra la implementación completa, que desglosaremos inmediatamente después:
fr: Listing 16-1 montre l'implémentation complète, que nous allons décomposer juste après:
id: Daftar 16-1 menunjukkan implementasi lengkap, yang akan kita rusak tepat setelah:
tr: Listeleme 16-1, aşağıdakilerden hemen sonra parçalayacağımız tam uygulamayı gösterir:
zh_cn: 清单16-1显示了完全的落实情况,我们将在以下各段之后予以分解:

source: <span class="caption">Listing 16-1: An OwnableCounter Component</span>
es: <span class="caption">Lista 16-1: Un componente de contador propio</span>
fr: <span class="caption">Liste 16-1: Un composant de counter propre</span>
tr: span class="caption">Listing 16-1: A OwnableCounter Component/span>
zh_cn: <span class="Caption" > listing 16-1: 自有可操作 Counter 组件 </span>

source: Specificities
es: Especificidades
fr: Spécificités
id: Spesifik
tr: Özgüllükler
zh_cn: 具体特性

source: Specifying Dependencies on Another Component
es: Especificación de dependencias en otro componente
fr: Spécifier les dépendances sur un autre composant
id: Menentukan Ketergantungan pada Komponen Lain
tr: Başka Bir Bileşene Bağımlılıklar Belirtilmesi
zh_cn: 指定对另一个构成部分的依赖

source: In [chapter 8](./ch08-02-traits-in-cairo.md), we introduced trait bounds, which are used to specify that a generic type must implement a certain trait. In the same way, we can specify that a component depends on another component by restricting the `impl` block to be available only for contracts that contain the required component. In our case, this is done by adding a restriction `impl Owner: ownable_component::HasComponent<TContractState>`, which indicates that this `impl` block is only available for contracts that contain an implementation of the `ownable_component::HasComponent` trait. This essentially means that the \`TContractState' type has access to the ownable component. See [Components under the hood](ch16-02-01-under-the-hood.md#inside-components-generic-impls) for more information.
es: En [capítulo 8](./ch08-02-traits-in-cairo.md), introdujimos límites de rasgos, que se utilizan para especificar que un tipo genérico debe implementar un determinado rasgo. De la misma manera, podemos especificar que un componente depende de otro componente limitando el bloque `impl` a estar disponible sólo para contratos que contengan el componente requerido. En nuestro caso, esto se hace añadiendo una restricción `impl Propietario: propietario_componente:::TieneComponente<TContractState®, que indica que este bloque `impl` sólo está disponible para contratos que contengan una aplicación del componente `ownable_componente::TieneComponente` trait. Esto significa esencialmente que el tipo TContractState' tiene acceso al componente propio. Véase [Componentes bajo la campana](ch16-02-01-under-the-hood.md#inside-components-generic-impls) para más información.
fr: Dans le [chapitre 8](./ch08-02-traits-in-cairo.md), nous avons introduit des limites de caractères, qui sont utilisées pour spécifier qu'un type générique doit mettre en œuvre un certain caractère. De la même manière, nous pouvons spécifier qu'un composant dépend d'un autre composant en limitant le bloc `impl` à être disponible uniquement pour les contrats qui contiennent le composant requis. Dans notre cas, cela se fait en ajoutant une restriction `impl Propriétaire: propre_composante::HasComponent<TContractState>`, qui indique que ce bloc `impl` n'est disponible que pour les contrats qui contiennent une mise en œuvre du caractère `ownable_composant::HasComponent`. Cela signifie essentiellement que le type \`TContractState' a accès au composant propre. Voir [Components under the hood](ch16-02-01-under-the-hood.md#inside-components-generic-impls) pour plus d'informations.
id: Di [chapter 8]./ch08-02-traits-in-cairo.md), kami memperkenalkan batasan-batasan sifat, yang digunakan untuk menyatakan bahwa tipe generik harus mengimplementasikan suatu sifat tertentu. Dengan cara yang sama, kita dapat menentukan bahwa sebuah komponen tergantung pada komponen lain dengan membatasi blok thoseimploplate>, yang hanya tersedia untuk kontrak yang diperlukan. Dalam kasus kita, ini dilakukan dengan menambahkan sebuah batasan yang dapat diterapkan oleh provider thoseimppl: ownable_component:Hasponent<TractSate>, yang mengindikasikan bahwa auxmpl yang tersedia hanya untuk kontrak yang tersedia untuk implementasi yang diterapkan oleh individual:Haconponent-concent-comctponent.
tr: [chapter 8](./ch08-02-traits-in-cairo.md) 'de, genel bir türün belirli bir özelliği uygulamak zorunda olduğunu belirtmek için kullanılan özellik sınırlarını tanıttık. Aynı şekilde, bir bileşenin yalnızca gerekli bileşeni içeren sözleşmeler için mevcut olmasını kısıtlayarak başka bir bileşene bağlı olduğunu belirtebiliriz. Bizim durumumuzda, bu, bir kısıtlama ekleyerek yapılır _impl Sahibi:
zh_cn: 在[第8章] (./ch08-02-traits- in-cairo.md)中,我们引入了特质界限,这些界限用于具体说明通用类型必须执行某种特性,同样,我们可以具体指明,某一组成部分取决于另一组成部分,方法是限制“只有包含所需组成部分的合同才有`不便'块。就我们而言,这样做的方法是增加一项限制,即`不完全所有人:拥有的构成部分:Hasconconcontent <Ttratic-state ',这表明,这一`不便'区块仅适用于含有`可拥有的构成部分:Hascompent`特性的合同,这基本上意味着“缔约国”类型可以使用可自行具备的构成部分。

source: Although most of the trait bounds were defined using \[anonymous parameters\]\[anonymous generic impl operator\], the dependency on the `Ownable` component is defined using a named parameter (here, `Owner`). We will need to use this explicit name when accessing the `Ownable`component within the`impl` block.
es: Aunque la mayoría de los límites del rasgo se definieron utilizando \[parámetros anónimos\]\[operador genérico de impresión anónimo\], la dependencia del componente `Ownable` se define utilizando un parámetro denominado (aquí, `Owner`). Necesitaremos usar este nombre explícito al acceder al componente `Ownable` dentro del bloque `impl`.
fr: Bien que la plupart des limites des caractères aient été définies en utilisant \[paramètres anonymes\]\[opérateur générique anonyme d'impl\], la dépendance à l'égard du composant `Ownable` est définie en utilisant un paramètre nommé (ici, `Owner`). Nous devrons utiliser ce nom explicite lors de l'accès au composant `Ownable` dans le bloc`impl`.
id: Meskipun sebagian besar batas sifat didefinisikan menggunakan \ \\]\[anonim umum operator impl\], dependensi pada komponen dapat didefinisikan menggunakan sebuah parameter bernama (di sini, ownerà). Kita harus menggunakan nama eksplisit ini ketika mengakses komponen dalam blok ▪implopla.
tr: Her ne kadar özellik sınırlarının çoğu [anonim parametreler][anonim jenerik impl operatörü] kullanılarak tanımlanmış olsa da, Ownable bileşenine bağımlılık, adlandırılmış bir parametre kullanılarak tanımlanır (burada, Owner). impl bloğu içindeki Ownable bileşenine erişirken bu açık adı kullanmamız gerekecektir.
zh_cn: 虽然大多数特质界限是用\[匿名参数\]\[匿名通用杂质运算符]来界定的,但依赖`不可腐蚀'组件的定义是使用一个命名参数(此处为`所有者'),我们需要在使用`不易'块内的`不可腐蚀'组件时使用这一明确名称。

source: While this mechanism is verbose and may not be easy to approach at first, it is a powerful leverage of the trait system in Cairo. The inner workings of this mechanism are abstracted away from the user, and all you need to know is that when you embed a component in a contract, all other components in the same contract can access it.
es: Aunque este mecanismo es verbal y puede no ser fácil de abordar al principio, es un poderoso apalancamiento del sistema de rasgo en El Cairo. El funcionamiento interno de este mecanismo se abstrae del usuario, y todo lo que necesita saber es que cuando se incrusta un componente en un contrato, todos los demás componentes en el mismo contrato pueden acceder a él.
fr: Bien que ce mécanisme soit verbeux et ne soit peut-être pas facile à approcher au début, il est un puissant levier du système de caractères au Caire. Le fonctionnement intérieur de ce mécanisme est retiré de l'utilisateur, et tout ce que vous devez savoir est que lorsque vous intégrez un composant dans un contrat, tous les autres composants dans le même contrat peuvent y accéder.
id: Sementara mekanisme ini adalah verbose dan mungkin tidak mudah untuk pendekatan pada awalnya, itu adalah pengaruh kuat sistem sifat di Kairo. Cara kerja dalam mekanisme ini abstrak jauh dari pengguna, dan semua yang Anda perlu tahu adalah bahwa ketika Anda menanamkan komponen dalam sebuah kontrak, semua komponen lain dalam kontrak yang sama dapat mengaksesnya.
tr: Bu mekanizma fiilen ve ilk başta yaklaşmak kolay olmasa da, Kahire'deki özellik sisteminin güçlü bir kaldıraçtır. Bu mekanizmanın iç işleyişi kullanıcıdan soyutlanır ve bilmeniz gereken tek şey, bir bileşeni bir sözleşmeye gömdüğünüzde, aynı sözleşmedeki diğer tüm bileşenlerin ona erişebileceğidir.
zh_cn: 虽然这一机制是多变的,一开始可能不容易接近,但它是开罗特质系统的强大杠杆。 这一机制的内部运作被从用户中抽取出来,你需要知道的是,当你在合同中嵌入一个组成部分时,同一合同中所有其他组成部分都可以使用它。

source: \[anonymous generic impl operator\]: ./ch08-01-generic-data-types md#anonymous-generic-implementation-parameter--operator
es: \[anónimo genérico impl operator\]:./ch08-01-genérico-datos-tipos md#anonymous-genérico-implementación-parametro--operador
fr: \[anonyme générique impl operator\]:./ch08-01-generic-data-types md#anonyme-generic-implementation-parameter--operator
id: \[ononim umum impl operator\]:./ch08-01-generic-data-types md#anonymous-generic-implementation-parameter--operator
tr: [anonim jenerik impl operatörü]:./ch08-01-generik-veri-tipleri md#anonim-generik-uygulama-parametre--operatör
zh_cn: \[匿名通用通用内插操作员\]:./ch08-01-generic-d-d-type-d-md#anonomous-generic-production-parater-operator

source: Using the Dependency
es: Uso de la dependencia
fr: Utilisation de la dépendance
id: Menggunakan Ketergantungan
tr: Bağımlılığı Kullanmak
zh_cn: 使用依赖关系

source: Now that we have made our `impl` depend on the `Ownable` component, we can access its functions, storage, and events within the implementation block. To bring the `Ownable` component into scope, we have two choices, depending on whether we intend to mutate the state of the `Ownable` component or not. If we want to access the state of the `Ownable` component without mutating it, we use the `get_dep_component!` macro. If we want to mutate the state of the `Ownable` component (for example, change the current owner), we use the `get_dep_component_mut!` macro. Both macros take two arguments: the first is `self`, either as a snapshot or by reference depending on mutability, representing the state of the component using the dependency, and the second is the component to access.
es: Ahora que hemos hecho que nuestro componente `Ownable` dependa del componente `Ownable`, podemos acceder a sus funciones, almacenamiento y eventos dentro del bloque de aplicación. Para poner el componente `Ownable` en el ámbito de aplicación, tenemos dos opciones, dependiendo de si tenemos la intención de mutar el estado del componente `Ownable` o no. Si queremos acceder al estado del componente `Ownable` sin mutarlo, utilizamos el macro `get_dep_component!'. Si queremos mutar el estado del componente `Ownable` (por ejemplo, cambiar el propietario actual), utilizamos el macro `get_dep_component_mut!. Ambos macros tienen dos argumentos: el primero es `auto', ya sea como una instantánea o por referencia dependiendo de la mutabilidad, que representa el estado del componente utilizando la dependencia, y el segundo es el componente al que se accede.
fr: Maintenant que nous avons fait dépendre notre `impl` du composant `Ownable`, nous pouvons accéder à ses fonctions, stockage et événements dans le bloc d'implémentation. Pour faire entrer le composant `Ownable` dans la portée, nous avons deux choix, selon que nous avons l'intention de muter ou non l'état du composant `Ownable`. Si nous voulons accéder à l'état du composant `Ownable` sans le muter, nous utilisons la macro `get_dep_component!`. Si nous voulons muter l'état du composant `Ownable` (par exemple, modifier le propriétaire actuel), nous utilisons la macro `get_dep_component_mut!`. Les deux macros prennent deux arguments: le premier est `self`, soit comme instantané, soit par référence selon la mutabilité, représentant l'état du composant utilisant la dépendance, et le second est le composant à accéder.
id: Sekarang kita telah membuat komponen kita bergantung pada komponen åOwnableé, kita dapat mengakses fungsinya, penyimpanan, dan kejadian dalam blok implementasi. untuk membawa komponen yang dapat diubah menjadi lingkup, kita memiliki dua pilihan, tergantung pada apakah kita berniat untuk mengubah keadaan komponen yang dapat diubah atau tidak. Jika kita ingin mengakses keadaan atau tidak.
tr: Şimdi impl bileşenimizi Ownable bileşenine bağlı hale getirdiğimize göre, uygulama bloğu içindeki işlevlerine, depolamasına ve olaylarına erişebiliriz. Ownable bileşenini kapsam içine getirmek için, Ownable_ bileşeninin durumunu değiştirmek isteyip istemediğimize bağlı olarak iki seçeneğimiz var. Ownable bileşeninin durumunu değiştirmeden erişmek istiyorsak,
zh_cn: 现在,我们已经将“不易”部分作为“不易”部分的“不易”部分,我们可以进入其功能、储存和事件,为了将“不易”部分纳入范围,我们有两个选择,这取决于我们是否打算改变“不易”部分的状态。如果我们想在不进行突变的情况下进入“不易”部分的状态,我们就使用“get_dep_conduction!”宏。如果我们想改变“不易”部分的状态(例如,改变当前所有者),我们就使用“get_dep_deproduction_mut!”宏。两种宏都有两个论点:第一是`self',要么是作为快照,要么是参考根据易变,代表使用依赖的部件的状态;第二是获取的组成部分。

source: In this function, we want to make sure that only the owner can call the `increment` function. We need to use the `assert_only_owner` function from the `Ownable` component. We'll use the `get_dep_component!` macro which will return a snapshot of the requested component state, and call `assert_only_owner` on it, as a method of that component.
es: En esta función, queremos asegurarnos de que sólo el propietario puede llamar a la función `incremento`. Necesitamos utilizar la función `assert_only_owner` desde el componente `Ownable`. Usaremos la macro `get_dep_component!` que devolverá una instantánea del estado del componente solicitado, y llamaremos a `assert_only_owner` en él, como un método de ese componente.
fr: Dans cette fonction, nous voulons nous assurer que seul le propriétaire peut appeler la fonction `increment`. Nous devons utiliser la fonction `assert_only_owner` du composant `Ownable`. Nous allons utiliser la macro `get_dep_component!` qui retournera un instantané de l'état du composant demandé, et appeler `assert_only_owner` dessus, comme méthode de ce composant.
id: Dalam fungsi ini, kami ingin memastikan bahwa hanya pemilik yang dapat dihubungi. kami akan menggunakan komponen yang dapat digunakan untuk kompen! makro yang akan mengembalikan foto-foto dari negara komponen yang diminta, dan memanggil salat_only_owner_owner di atasnya, sebagai metode komponen tersebut.
tr: Bu fonksiyonda, sadece sahibinin arınma fonksiyonunu çağırabileceğinden emin olmak istiyoruz. Ownable bileşeninden assert_only_owner fonksiyonunu kullanmamız gerekiyor. get_dep_component! makrosunu kullanacağız, bu da istenen bileşen durumunun bir anlık görüntüsünü döndürecek ve bu bileşenin bir yöntemi olarak assert_only_owner adını verecektir.
zh_cn: 在此函数中, 我们希望确保只有所有者才能使用“ 加速” 功能, 我们需要使用“ 无效” 组件中的“ 资产独有” 所有人” 功能。 我们将使用“ get_ dep_ party! ” 宏, 该宏将返回所请求组件状态的快照, 并使用“ 资产独有” 所有人, 作为该组件的一种方法。

source: For the `transfer_ownership` function, we want to mutate that state to change the current owner. We need to use the `get_dep_component_mut!` macro, which will return the requested component state as a mutable reference, and call `transfer_ownership` on it.
es: Para la función `transfer_ownership`, queremos mutar ese estado para cambiar el propietario actual. Necesitamos usar la macro `get_dep_component_mut!`, que devolverá el estado de componente solicitado como una referencia mutable, y llamar a `transfer_ownership` en él.
fr: Pour la fonction `transfer_ownership`, nous voulons muter cet état pour changer le propriétaire actuel. Nous devons utiliser la macro `get_dep_component_mut!`, qui retournera l'état de composant demandé comme référence mutable, et appeler `transfer_ownership` dessus.
id: Untuk fungsi transfer_owneré, kami ingin mengubah negara bagian tersebut untuk mengubah pemilik saat ini. kita perlu menggunakan fungsi 'dep' komponent_mut'mut! makro, yang akan mengembalikan komponen negara yang diminta sebagai referensi mutabel, dan memanggil 'transfer_ownership' di atasnya.
tr: transfer_ownership işlevi için, mevcut sahibini değiştirmek için bu durumu değiştirmek istiyoruz. İstenen bileşen durumunu değiştirilebilir bir referans olarak döndürecek olan get_dep_component_mut! makrosunu kullanmamız ve üzerinde transfer_ownership çağırmamız gerekiyor.
zh_cn: 对于`转让_所有权'功能,我们要改变该状态以改变当前所有者。 我们需要使用`get_dep_ controduction_mut!' 宏, 该宏将把请求的构成部分状态恢复为可变的参考, 并称之为`转让_ 所有权'。

source: It works exactly the same as `get_dep_component!` except that we need to pass the state as a `ref` so we can mutate it to transfer the ownership.
es: Funciona exactamente igual que `get_dep_component!` excepto que tenemos que pasar el estado como `ref` para que podamos mutarlo para transferir la propiedad.
fr: Cela fonctionne exactement comme `get_dep_component!` sauf que nous devons passer l'état comme un `ref` pour pouvoir le muter pour transférer la propriété.
id: Ini bekerja persis sama dengan 'dep_component'! kecuali kita harus melewati negara sebagai sebuah'ref' sehingga kita dapat bermutasi untuk mentransfer kepemilikan.
tr: get_dep_component! ile tamamen aynı şekilde çalışır, ancak devleti bir ref olarak geçmemiz gerekir, böylece mülkiyeti aktarmak için onu değiştirebiliriz.
zh_cn: 它与`get_dep_ particip!'完全相同,但我们需要通过国家作为`ref',以便我们可以改变国家,转让所有权。

source: Testing components is a bit different than testing contracts. Contracts need to be tested against a specific state, which can be achieved by either deploying the contract in a test, or by simply getting the `ContractState` object and modifying it in the context of your tests.
es: Los componentes de prueba son un poco diferentes a los contratos de prueba. Los contratos deben ser probados contra un estado específico, que puede lograrse mediante el despliegue del contrato en una prueba, o simplemente obteniendo el objeto `Contract State'y modificándolo en el contexto de sus pruebas.
fr: Les composants d'essai sont un peu différents des contrats d'essai. Les contrats doivent être testés selon un état spécifique, qui peut être réalisé en déployant le contrat dans un test, ou simplement en obtenant l'objet `ContractState` et en le modifiant dans le contexte de vos tests.
id: Menguji komponen sedikit berbeda dari kontrak pengujian. Kontrak perlu diuji terhadap negara tertentu, yang dapat dicapai dengan menyebarkan kontrak dalam tes, atau hanya dengan mendapatkan objek Contracttate dan memodifikasinya dalam konteks tes Anda.
tr: Test bileşenleri, sözleşmeleri test etmekten biraz farklıdır. Sözleşmelerin belirli bir duruma karşı test edilmesi gerekir, bu da sözleşmeyi bir testte dağıtarak veya sadece ContractState nesnesini alarak ve testleriniz bağlamında değiştirerek elde edilebilir.
zh_cn: 测试组件与测试合同略有不同,合同需要根据特定状态进行测试,具体做法可以是将合同部署在测试中,或者只是获取`缔约国'标的并在测试中加以修改。

source: Components are a generic construct, meant to be integrated in contracts, that can't be deployed on their own and don't have a `ContractState` object that we could use. So how do we test them?
es: Los componentes son un constructo genérico, destinado a ser integrado en contratos, que no pueden ser implementados por sí mismos y no tienen un objeto `Contract State` que podamos usar. Entonces, ¿cómo los probamos?
fr: Les composants sont une construction générique, destinée à être intégrée dans les contrats, qui ne peut pas être déployé par eux-mêmes et n'ont pas d'objet "ContractState" que nous pourrions utiliser.
id: Komponen adalah konstruksi umum, yang dimaksudkan untuk diintegrasikan dalam kontrak, yang tidak dapat dikerahkan sendiri dan tidak memiliki objek contractState yang dapat kita gunakan. jadi bagaimana kita menguji mereka?
tr: Bileşenler, kendi başlarına konuşlandırılamayan ve kullanabileceğimiz bir ContractState nesnesine sahip olmayan sözleşmelerde entegre edilmesi amaçlanan genel bir yapıdır. Peki bunları nasıl test edeceğiz?
zh_cn: 部件是一种通用结构,意在纳入合同,不能自行部署,没有我们可以使用的`合同国'物体。我们如何测试它们?

source: Let's consider that we want to test a very simple component called "Counter", that will allow each contract to have a counter that can be incremented. The component is defined in Listing 16-2:
es: Consideremos que queremos probar un componente muy simple llamado "Counter", que permitirá a cada contrato tener un contador que se puede incrementar. El componente se define en Listado 16-2:
fr: Considérons que nous voulons tester un composant très simple appelé "Counter", qui permettra à chaque contrat d'avoir un compteur qui peut être incrémenté. Le composant est défini dans Listing 16-2:
id: Mari kita pertimbangkan bahwa kita ingin menguji komponen yang sangat sederhana yang disebut "Counter," yang akan memungkinkan setiap kontrak untuk memiliki counter yang dapat diincrementasikan. Komponen didefinisikan dalam Listing 16-2:
tr: Her sözleşmenin artırılabilen bir sayaça sahip olmasını sağlayacak "Counter" adlı çok basit bir bileşeni test etmek istediğimizi düşünelim. Bileşen Listeleme 16-2'de tanımlanmıştır:
zh_cn: 让我们考虑一下,我们想测试一个非常简单的部件,叫做“Counter”, 它可以让每份合同都有一个可以增量的柜台。
