Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Similarly, in the case of a nested mapping using a tuple as key, such as `LegacyMap::<(ContractAddress, ContractAddress), u8>`, the address will be computed in the same way, with each element of the tuple being a key: `h(h(sn_keccak(variable_name),k_1),k_2)`.
es: Del mismo modo, en el caso de un mapeo anidado utilizando una tupla como clave, como `LegacyMap::<(ContractAddress, ContractAddress), u8-, la dirección se calculará de la misma manera, siendo cada elemento de la tupla una clave: `h(h(sn_keccak(variable_name),k_1),k_2)`.
fr: De même, dans le cas d'une cartographie imbriquée utilisant un tuple comme clé, comme `LegacyMap::<(ContractAddress, ContractAddress), u8>`, l'adresse sera calculée de la même manière, chaque élément du tuple étant une clé: `h(h(sn_keccak(variable_name),k_1),k_2)`.
id: Demikian pula, dalam kasus pemetaan nested menggunakan tuple sebagai kunci, seperti ▪LegacyMap::<BalchiscoContractAress, ContractAverss), u8>, alamat akan dihitung dengan cara yang sama, dengan setiap elemen tuple menjadi kunci: Áh Allahn_ccakánkvariable_name),k_1),k_2).
tr: Benzer şekilde, LegacyMap::(ContractAddress, ContractAddress), u8> gibi anahtar olarak bir tuple kullanarak bir yuvalanmış haritalama durumunda, adres aynı şekilde hesaplanacaktır, tuple'ın her elemanı bir anahtardır: h(h(sn_keccak(variable_name),k_1,k_2).
zh_cn: 同样,在使用“LegacyMap:<(合同地址、合同地址),u8”等键作为键的嵌套绘图的情况下,地址也将以同样的方式计算,图的每个元素都是一个键:`h(h)(sn_keccak)(变量_name,k_1,k_2)。

source: In this section, we are going to be looking at the different types of functions you could encounter in Starknet smart contracts.
es: En esta sección, vamos a ver los diferentes tipos de funciones que se pueden encontrar en los contratos inteligentes Starknet.
fr: Dans cette section, nous allons examiner les différents types de fonctions que vous pourriez rencontrer dans les contrats intelligents Starknet.
id: Di bagian ini, kita akan melihat berbagai jenis fungsi yang bisa kau temui di kontrak pintar Starknet.
tr: Bu bölümde, Starknet akıllı sözleşmelerinde karşılaşabileceğiniz farklı işlev türlerine bakacağız.
zh_cn: 在本节中,我们将探讨在斯塔克内特智能合同中你可能遇到的不同类型的职能。

source: Functions can access the contract's state easily via `self: ContractState`, which abstracts away the complexity of underlying system calls (`storage_read_syscall` and `storage_write_syscall`). The compiler provides two modifiers: `ref` and `@` to decorate `self`, which intends to distinguish view and external functions.
es: Las funciones pueden acceder fácilmente al estado del contrato a través de `self: ContractState`, que abstrae la complejidad de las llamadas subyacentes del sistema (`storage_read_syscall` y `storage_write_syscall`). El compilador proporciona dos modificadores: `ref` y para decorar `self`, que tiene la intención de distinguir la vista y las funciones externas.
fr: Les fonctions peuvent accéder facilement à l'état du contrat via `self: ContractState`, qui supprime la complexité des appels système sous-jacents (`storage_read_syscall` et `storage_write_syscall`). Le compilateur fournit deux modificateurs: `ref` et `@` pour décorer `self`, qui a l'intention de distinguer la vue et les fonctions externes.
id: Fungsi-fungsi dapat mengakses keadaan kontrak dengan mudah melalui diri sendiri: ContractState, yang abstrak dari kompleks sistem yang mendasari panggilan (alokasi_read_syscall) dan ·storage_write_syscall).
tr: Fonksiyonlar, sözleşmenin durumuna self: ContractState aracılığıyla kolayca erişebilir, bu da altta yatan sistem çağrılarının karmaşıklığını soyutlar (storage_read_syscall ve storage_write_syscall). Derleyici iki değiştirici sağlar: ref ve, görüş ve dış işlevleri ayırt etmeyi amaçlayan self'i süslemek için.
zh_cn: 各种功能可以通过`本身:合同国'轻易地进入合同状态,该合同国将系统下调(“存储_read_syscall”和`存储_write_syscall')的复杂程度归纳为摘要,汇编者提供两种修饰:`检索'和装饰`自我',意在区分视图和外部功能。

source: 1. Constructors
es: 1. Constructores
fr: 1. Constructeurs
id: 1. Konstruktor
tr: 1. Yapıcılar
zh_cn: 1. 建 构 体

source: Constructors are a special type of function that only runs once when deploying a contract, and can be used to initialize the state of a contract.
es: Los constructores son un tipo especial de función que sólo se ejecuta una vez al desplegar un contrato, y se puede utilizar para inicializar el estado de un contrato.
fr: Les constructeurs sont un type spécial de fonction qui ne fonctionne qu'une seule fois lors du déploiement d'un contrat, et peut être utilisé pour initialiser l'état d'un contrat.
id: Konstruktor adalah jenis fungsi khusus yang hanya berjalan sekali ketika menyebarkan kontrak, dan dapat digunakan untuk menginisialisasi keadaan kontrak.
tr: Yapıcılar, bir sözleşmeyi dağıtırken yalnızca bir kez çalışan ve bir sözleşmenin durumunu başlatmak için kullanılabilen özel bir işlev türüdür.
zh_cn: 建筑体是一种特殊类型的功能,在部署合同时只能运行一次,可用于启动合同状态。

source: Some important rules to note:
es: Algunas reglas importantes a tener en cuenta:
fr: Quelques règles importantes à noter:
id: Beberapa aturan penting untuk dicatat:
tr: Dikkat edilmesi gereken bazı önemli kurallar:
zh_cn: 需要指出的一些重要规则如下:

source: A contract can't have more than one constructor.
es: Un contrato no puede tener más de un constructor.
fr: Un contrat ne peut pas avoir plus d'un constructeur.
id: Kontrak tidak bisa memiliki lebih dari satu konstruktor.
tr: Bir sözleşme birden fazla yapıcıya sahip olamaz.
zh_cn: 合同不能有一个以上的建筑师。

source: The constructor function must be named `constructor`, and must be annotated with the `#[constructor]` attribute.
es: La función constructora debe llamarse `constructor`, y debe estar anotada con el atributo '[constructor]`.
fr: La fonction constructeur doit être nommée `constructeur` et doit être annotée avec l'attribut `#[constructeur]`.
id: Fungsi konstruktor harus diberi nama atribut konstruktor.
tr: Yapılandırıcı fonksiyonun adı constructor olmalı ve #[constructor] özniteliği ile anons edilmelidir.
zh_cn: 构建符函数必须命名为`构建符',并附加“[构 属性”注释。

source: The `constructor` function might take arguments, which are passed when deploying the contract. In our example, we pass some value corresponding to a `Person` type as argument in order to store the `owner` information (address and name) in the contract.
es: La función `constructor` podría tomar argumentos, que se pasan al desplegar el contrato. En nuestro ejemplo, pasamos algún valor correspondiente a un tipo `Person'como argumento para almacenar la información de `propietario'(dirección y nombre) en el contrato.
fr: La fonction `constructeur` peut prendre des arguments, qui sont passés lors du déploiement du contrat. Dans notre exemple, nous passons une certaine valeur correspondant à un type `Personne` comme argument afin de stocker les informations `propriétaires` (adresse et nom) dans le contrat.
id: Fungsi konstruktor mungkin mengambil argumen, yang dilewatkan ketika menyebarkan kontrak. sebagai contoh, kita melewatkan beberapa nilai yang berhubungan dengan tipe argumen untuk menyimpan informasi pemilik (alamat dan nama) dalam kontrak.
tr: constructor işlevi, sözleşmeyi dağıtırken geçen argümanları alabilir. Örneğimizde, owner bilgilerini (adres ve ad) sözleşmede saklamak için bir Person türüne karşılık gelen bir miktar değeri argüman olarak geçeriz.
zh_cn: `构件人'功能可能需要在部署合同时通过的论点,例如,我们通过某种与`人'类型相对应的价值作为论证,以便将`所有人'的信息(地址和名称)储存在合同中。

source: Note that the `constructor` function **must** take `self` as a first argument, corresponding to the state of the contract, generally passed by reference with the `ref` keyword to be able to modify the contract's state. We will explain `self` and its type shortly.
es: Obsérvese que la función `constructor` ** debe tomar `auto' como primer argumento, correspondiente al estado del contrato, generalmente aprobado por referencia con la palabra clave `ref` para poder modificar el estado del contrato. Explicaremos `auto' y su tipo en breve.
fr: Notez que la fonction `constructeur` **doit** prendre `self` comme premier argument, correspondant à l'état du contrat, généralement passé par référence avec le mot clé `ref` pour être en mesure de modifier l'état du contrat. Nous allons expliquer `self` et son type sous peu.
id: Perhatikan bahwa fungsi konstruktor **harus ** mengambil diri sebagai argumen pertama, sesuai dengan keadaan kontrak, yang biasanya diteruskan dengan referensi dengan kata kunci untuk dapat mengubah keadaan kontrak. Kami akan menjelaskan sendiri dan tipenya tidak lama lagi.
tr: constructor fonksiyonunun ** self'yi sözleşmenin durumuna karşılık gelen ilk argüman olarak alması gerektiğini, genellikle sözleşmenin durumunu değiştirebilmek için ref anahtar kelimesi ile referansla geçtiğini unutmayın. self ve türünü kısa süre içinde açıklayacağız.
zh_cn: 请注意,`构件人'功能** 必须** 将`自我'作为与合同状况相对应的第一个论点,通常以`ref'关键词作为参考通过,以便能够修改合同的状态,我们将很快解释`自我'及其类型。

source: 2. Public Functions
es: 2. Funciones públicas
fr: 2. Fonctions publiques
id: 2. Fungsi Publik
tr: 2. Kamu Fonksiyonları
zh_cn: 2. 公共职能

source: As stated previously, public functions are accessible from outside of the contract. They are usually defined inside an implementation block annotated with the `#[abi(embed_v0)]` attribute, but might also be defined independently under the `#[external(v0)]` attribute.
es: Como se ha indicado anteriormente, las funciones públicas son accesibles desde fuera del contrato. Generalmente se definen dentro de un bloque de implementación anotado con el atributo '[abi(embed_v0)]`, pero también pueden definirse de forma independiente bajo el atributo '[external(v0)]`.
fr: Comme indiqué précédemment, les fonctions publiques sont accessibles en dehors du contrat. Elles sont généralement définies à l'intérieur d'un bloc d'implémentation annoté avec l'attribut `#[abi(embed_v0)]`, mais peuvent aussi être définies indépendamment sous l'attribut `#[external(v0)]`.
id: Seperti yang telah dinyatakan sebelumnya, fungsi publik dapat diakses dari luar kontrak. Mereka biasanya didefinisikan di dalam sebuah blok implementasi yang dianotasi dengan atribut <0), tetapi juga dapat didefinisikan secara independen di bawah atribut ▪#[external fotostockv0).
tr: Daha önce belirtildiği gibi, kamu işlevleri sözleşmenin dışından erişilebilir. Genellikle #[abi(embed_v0)] özniteliği ile belirtilen bir uygulama bloğu içinde tanımlanırlar, ancak #[external(v0)]] özniteliği altında bağımsız olarak da tanımlanabilirler.
zh_cn: 如前所述,公共职能可以从合同之外获得,通常在附加说明的`[iabi(embed_v0)]`属性的执行区块内加以界定,但也可以在`[external(v0)]`属性下独立界定。

source: The `#[abi(embed_v0)]` attribute means that all functions embedded inside it are implementations of the Starknet interface of the contract, and therefore potential entry points.
es: El atributo "[abi(embed_v0)]" significa que todas las funciones incrustadas en su interior son implementaciones de la interfaz Starknet del contrato, y por lo tanto posibles puntos de entrada.
fr: L'attribut `#[abi(embed_v0)]` signifie que toutes les fonctions intégrées à l'intérieur sont des implémentations de l'interface Starknet du contrat, et donc des points d'entrée potentiels.
id: Atribut yang tertanam di dalamnya adalah implementasi antar-muka Starknet dari kontrak, dan oleh karena itu potensial titik masuk.
tr: #[abi(embed_v0)] özniteliği, içine gömülü tüm fonksiyonların sözleşmenin Starknet arayüzünün uygulamaları ve dolayısıyla potansiyel giriş noktaları olduğu anlamına gelir.
zh_cn: `[{abi(emed_v0)]`属性系指其中所含的所有功能都是执行合同的Starknet接口,因此是潜在的切入点。

source: Annotating an impl block with the `#[abi(embed_v0)]` attribute only affects the visibility (i.e., public vs private/internal) of the functions it contains, but it doesn't inform us on the ability of these functions to modify the state of the contract.
es: Anotar un bloque de impl con el atributo "[abi(embed_v0)]" sólo afecta a la visibilidad (es decir, pública vs privada/interna) de las funciones que contiene, pero no nos informa sobre la capacidad de estas funciones para modificar el estado del contrato.
fr: L'annotation d'un bloc impl avec l'attribut `#[abi(embed_v0)]` n'affecte que la visibilité (c'est-à-dire publique vs privée/interne) des fonctions qu'il contient, mais il ne nous informe pas sur la capacité de ces fonctions à modifier l'état du contrat.
id: Mengumumkan sebuah blok impl dengan fungsi-fungsi yang dikandungnya, tetapi tidak memberi tahu kita tentang kemampuan fungsi-fungsi ini untuk mengubah keadaan kontrak.
tr: #[abi(embed_v0)] özniteliği ile bir impl bloğunun belirtilmesi, yalnızca içerdiği işlevlerin görünürlüğünü (yani kamuya özel/içsel) etkiler, ancak bu işlevlerin sözleşmenin durumunu değiştirme yeteneği hakkında bizi bilgilendirmez.
zh_cn: 说明内插块的“{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}}}`属性只影响其所含功能的可见度(即公共相对于私人/内部),但并不告诉我们这些功能修改合同状态的能力。

source: Similarly to the `constructor` function, all public functions, either standalone functions annotated with the `#[external(v0)]` or functions within an impl block annotated with the `#[abi(embed_v0)]` attribute, **must** take `self` as a first argument. This is not the case for private functions.
es: Similarmente a la función `constructor`, todas las funciones públicas, ya sea funciones independientes anotadas con el '[external(v0)]` o funciones dentro de un bloque de impl anotado con el '[abi(embed_v0)]` atributo, **debe** tomar `self` como primer argumento. Este no es el caso de las funciones privadas.
fr: De même que la fonction `constructeur`, toutes les fonctions publiques, soit des fonctions autonomes annotées avec le `#[external(v0)]`, soit des fonctions dans un bloc impl annoté avec l'attribut `#[abi(embed_v0)]`, **must** prendre `self` comme premier argument, ce qui n'est pas le cas pour les fonctions privées.
id: Demikian pula dengan fungsi-fungsi pengkonstruktor, semua fungsi publik, baik fungsi standalone dinotasikan dengan atribut Â#[external Allahv0)] atau fungsi dalam sebuah blok impl dianotasi dengan atribut ·[abihombed_v0), **must** mengambil diri sebagai argumen pertama. Ini bukan kasus untuk fungsi-fungsi pribadi.
tr: constructor işlevine benzer şekilde, tüm kamu fonksiyonları, ya #[external(v0)] ile belirtilen bağımsız fonksiyonlar ya da #[abi(embed_v0)] özniteliği ile belirtilen bir impl bloğu içindeki fonksiyonlar, ** ilk argüman olarak self almalıdır. Bu özel işlevler için geçerli değildir.
zh_cn: 与`构件'功能相似的是,所有公共职能,要么单独履行附加“[外部(v0)]”说明的职能,要么在“[基础(embed_v0)]”属性下附加附加“[基础(embed_v0)]”说明的分块内履行,**必须**将`自我'作为第一个理由,私人职能则不适用。

source: External Functions
es: Funciones externas
fr: Fonctions extérieures
id: Fungsi Eksternal
tr: Dış Fonksiyonlar
zh_cn: 外部职能

source: External functions are _public_ functions where the `self: ContractState` argument is passed by reference with the `ref` keyword, which exposes both the `read` and `write` access to storage variables. This allows modifying the state of the contract via `self` directly.
es: Las funciones externas son funciones _públicas en las que el argumento `self: ContractState` se pasa por referencia a la palabra clave `ref`, que expone tanto el acceso a las variables de almacenamiento a través de `leed` como `write`, lo que permite modificar directamente el estado del contrato por medio de `self`.
fr: Les fonctions externes sont des fonctions _public_ où l'argument `self: ContractState` est passé par référence avec le mot clé `ref`, qui expose à la fois l'accès `read` et `write` aux variables de stockage. Cela permet de modifier l'état du contrat via `self` directement.
id: Fungsi eksternal adalah fungsi _public_ dimana diri sendiri: Argumen Kontrakstate dilewatkan oleh referensi dengan kata kunci ·refé, yang mengekspos kedua akses thosereadà dan ·writeà ke variabel penyimpanan. Hal ini memungkinkan memodifikasi keadaan kontrak melalui thoseselfself secara langsung.
tr: Harici fonksiyonlar, self: ContractState argümanının, depolama değişkenlerine hem read hem de write erişimini açığa çıkaran ref anahtar kelimesi ile referans yoluyla geçtiği _public_ fonksiyonlarıdır. Bu, sözleşmenin durumunu doğrudan self aracılığıyla değiştirmenizi sağlar.
zh_cn: 外部功能为`公共'功能,其中`本身:合同国'论点以`ref`关键词为参照通过,这暴露了`读'和`写'对储存变量的访问,从而允许直接通过`自己'修改合同状况。

source: View Functions
es: Ver funciones
fr: Fonctions d'affichage
id: Tilik Fungsi
tr: Fonksiyonları Göster
zh_cn: 查看函数

source: View functions are _public_ functions where the `self: ContractState` argument is passed as snapshot, which only allows the `read` access to storage variables, and restricts writes to storage made via `self` by causing compilation errors. The compiler will mark their `state_mutability` to `view`, preventing any state modification through `self` directly.
es: Las funciones View son funciones _public_ en las que el argumento `self: ContractState` se pasa como instantánea, lo que sólo permite el acceso `leer` a las variables de almacenamiento, y restringe la escritura al almacenamiento realizado a través de `self` causando errores de compilación. El compilador marcará su `state_mutabilidad` a `view`, evitando cualquier modificación de estado a través de `self` directamente.
fr: Les fonctions d'affichage sont des fonctions _public_ où l'argument `self: ContractState` est passé comme instantané, ce qui permet seulement l'accès `read` aux variables de stockage, et restreint les écritures au stockage faites via `self` en causant des erreurs de compilation. Le compilateur va marquer leur `state_mutability` à `view`, empêchant toute modification d'état via `self` directement.
id: Fungsi tampilan adalah _public_fungsi dimana diri_ sendiri: Argumen ContractState dilewatkan sebagai snapshot, yang hanya memungkinkan akses ke variabel penyimpanan, dan membatasi menulis ke penyimpanan yang dibuat melalui thoseself dengan menyebabkan kesalahan kompilasi. compiler akan menandai ▪_mutability_mutability mereka untuk melihat, mencegah setiap modifikasi negara melalui ▪selfself secara langsung.
tr: self: ContractState argümanının anlık görüntü olarak geçtiği, yalnızca depolama değişkenlerine read erişimine izin veren ve derleme hatalarına neden olarak self aracılığıyla yapılan depolamaya yazılanları kısıtlayan _public_ fonksiyonlarıdır. Derleyici, state_mutability'lerini view olarak işaretleyecek ve self aracılığıyla herhangi bir durum değişikliğini doğrudan önleyecektir.
zh_cn: 查看功能是`自我:合同国'论点以快照形式传递,只能允许`阅读'查阅储存变量,并限制写作以`自己'方式通过编译错误进行储存,汇编者将标记其`状态可变性'至`观点 ',防止通过`自己'直接进行任何国家修改。

source: State Mutability of Public Functions
es: Mutabilidad estatal de las funciones públicas
fr: Mutation des fonctions publiques par l'État
id: Mutabilitas Negara Fungsi Publik
tr: Kamu Fonksiyonlarının Devlet Mutabilitesi
zh_cn: 国家公共职能的可变性

source: However, as you may have noticed, passing `self` as a snapshot only restricts the storage write access via `self` at compile time. It does not prevent state modification via direct system calls, nor calling another contract that would modify the state.
es: Sin embargo, como usted puede haber notado, pasar `self` como una instantánea sólo restringe el acceso de escritura de almacenamiento a través de `self` en el momento de la compilación. No impide la modificación del estado a través de llamadas directas del sistema, ni llama a otro contrato que modificaría el estado.
fr: Cependant, comme vous l'avez peut-être remarqué, le fait de passer `self` en tant qu'instantané limite uniquement l'accès d'écriture de stockage via `self` au moment de la compilation.
id: Namun, seperti yang mungkin Anda perhatikan, melewati diri sendiri sebagai snapshot hanya membatasi akses penyimpanan menulis melalui waktu sendiri. tidak mencegah modifikasi negara melalui panggilan sistem langsung, atau menghubungi kontrak lain yang akan memodifikasi negara.
tr: Ancak, fark etmiş olabileceğiniz gibi, self'yi bir anlık görüntü olarak geçmek, derleme zamanında yalnızca self aracılığıyla depolama yazma erişimini kısıtlar. Doğrudan sistem çağrıları yoluyla durum değişikliğini engellemez veya durumu değiştirecek başka bir sözleşme çağırmaz.
zh_cn: 然而,正如你可能已经注意到的,通过 " 自己 " 的快照,只会限制通过 " 自己 " 汇编时间的储存书写访问,并不妨碍通过直接的系统电话进行国家修改,也不会要求签订另一项合同来修改国家。

source: The read-only property of view functions is not enforced on Starknet, and sending a transaction targeting a view function _could_ change the state.
es: La propiedad de solo lectura de las funciones de vista no se aplica en Starknet, y el envío de una transacción dirigida a una función de vista _could_ cambiar el estado.
fr: La propriété en lecture seule des fonctions de vue n'est pas imposée sur Starknet, et l'envoi d'une transaction ciblant une fonction de vue _could_ change l'état.
id: Properti hanya-baca dari fungsi tilikan tidak diwajibkan pada Starknet, dan mengirim transaksi menargetkan fungsi pkamung _bisa_ mengubah keadaan.
tr: Yalnızca okunur görünüm işlevleri özelliği Starknet'te uygulanmaz ve bir görünüm fonksiyonunu hedefleyen bir işlem gönderir _could_ durumu değiştirir.
zh_cn: Starknet 不强制执行只读查看属性功能, 发送针对查看函数的交易 _可以改变状态 。

source: In conclusion, even though external and view functions are distinguished by the Cairo compiler, **all public functions** can be called through an invoke transaction and have the potential to modify states on Starknet. Also, all public functions can be queried via `starknet_call` on Starknet, which will not create a transaction and hence will not change the state.
es: En conclusión, aunque las funciones externas y de vista se distinguen por el compilador de El Cairo, **todas las funciones públicas** pueden ser llamadas a través de una transacción invocada y tienen el potencial de modificar estados en Starknet. Además, todas las funciones públicas pueden ser consultadas a través de `starknet_call` en Starknet, que no creará una transacción y por lo tanto no cambiará el estado.
fr: En conclusion, même si les fonctions externes et les fonctions de vue sont distinguées par le compilateur du Caire, ** toutes les fonctions publiques** peuvent être appelées par une transaction d'invocation et ont le potentiel de modifier les états sur Starknet. De plus, toutes les fonctions publiques peuvent être interrogées via `starknet_call` sur Starknet, qui ne créera pas une transaction et ne changera donc pas l'état.
id: Sebagai kesimpulan, meskipun fungsi eksternal dan tampilan dibedakan oleh kompiler Kairo, ** semua fungsi publik dapat dipanggil melalui transaksi pemanggilan dan memiliki potensi untuk memodifikasi negara di Starknet. Juga, semua fungsi publik dapat dipicu melalui Ástarknet_callé di Starknet, yang tidak akan membuat sebuah transaksi dan oleh karena itu tidak akan mengubah keadaan.
tr: Sonuç olarak, dış ve görünüm işlevleri Kahire derleyicisi tarafından ayırt edilmesine rağmen, ** tüm kamu işlevleri ** bir çağrı işlemi yoluyla çağrılabilir ve Starknet'teki durumları değiştirme potansiyeline sahip olabilir. Ayrıca, tüm kamu işlevleri, bir işlem oluşturmayacak ve bu nedenle devleti değiştirmeyecek olan Starknet'te starknet_call aracılığıyla sorgulanabilir.
zh_cn: 最后,即使开罗汇编者区分了外部和视觉功能, **所有公共功能** 都可以通过援引交易来调用,并有可能改变斯塔克内特上的状态。 此外,所有公共功能都可以通过斯塔克内特的“星网呼叫 ” 查询,这不会产生交易,因此不会改变国家。
