Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: <span class="caption">Listing 7-2: The module tree for the code in Listing 7-1</span>
es: <span class="caption">Lista 7-2: El árbol de módulos para el código en Listado 7-1</span>
fr: <span class="caption">Liste 7-2: L'arborescence du module pour le code dans Listing 7-1</span>
tr: span class="caption">Liste 7-2: Listelemede kod için modül ağacı 7-1/span>
zh_cn: <span类="Caption" > listing 7-2: 7-1 </span> 列表中的代码模块树

source: This tree shows how some of the modules nest inside one another; for example, `hosting` nests inside `front_of_house`. The tree also shows that some modules are _siblings_ to each other, meaning they’re defined in the same module; `hosting` and `serving` are siblings defined within `front_of_house`. If module A is contained inside module B, we say that module A is the _child_ of module B and that module B is the _parent_ of module A. Notice that the entire module tree is rooted under the explicit name of the crate _restaurant_.
es: Este árbol muestra cómo algunos de los módulos anidan unos dentro de otros; por ejemplo, `hosting` nidos dentro de `front_of_house`. El árbol también muestra que algunos módulos están _similitudes_ entre sí, lo que significa que están definidos en el mismo módulo; `hosting` y `serving` son hermanos definidos dentro de `front_of_house`. Si el módulo A está contenido dentro del módulo B, decimos que el módulo A es el _child_ del módulo B y que el módulo B es el _parent_ del módulo A. Observe que el árbol del módulo entero está enraizado bajo el nombre explícito de la caja _restaurante_.
fr: Cet arbre montre comment certains modules se nichent l'un dans l'autre; par exemple, `hosting` nids à l'intérieur `front_of_house`. L'arbre montre également que certains modules sont _siblings_ l'un à l'autre, ce qui signifie qu'ils sont définis dans le même module; `hosting` et `serving` sont des frères et sœurs définis dans `front_of_house`. Si le module A est contenu à l'intérieur du module B, nous disons que le module A est le _enfant_ du module B et que le module B est le _parent_ du module A. Notez que l'arborescence entière du module est enracinée sous le nom explicite de _restaurant_.
id: Pohon ini menunjukkan bagaimana beberapa modul saling bersarang satu sama lain, sebagai contoh, sarang-sarang di dalam sarang di depan_of_house. Pohon ini juga menunjukkan bahwa beberapa modul adalah _siblings_ untuk satu sama lain, yang berarti mereka didefinisikan dalam modul yang sama; ôhosing (hosing) dan åserving) adalah saudara kandung didefinisikan dalam ▪f_of_house. Jika modul A dimuat di dalam modul B, kita mengatakan bahwa modul A adalah _child_ B dan modul B adalah _parent_ modul A. Perhatikan bahwa seluruh modul ini berakar secara eksplisit di bawah nama _resan.
tr: Bu ağaç, bazı modüllerin birbirlerinin içinde nasıl yuvalandığını gösterir; örneğin, hosting yuvaları front_of_house içinde. Ağaç ayrıca bazı modüllerin _siblings_ olduğunu gösterir, yani aynı modülde tanımlanırlar; hosting ve serving, front_of_house modülünün içinde tanımlanan kardeşlerdir. Eğer A modülü B modülünün içinde yer alıyorsa, o modülün A modülü olduğunu söyleriz.
zh_cn: 这棵树展示了模块内部的一些巢穴;例如,“主巢”位于`前屋'内。这棵树还显示,一些模块彼此为_siblings_siblings_,意思是它们在同一模块中的定义;`主巢'和`服务'是在`前屋'内定义的兄弟姐妹。如果模块B中包含模块A,我们说模块A是模块B的_child_,模块B是模块A的_own_own_。请注意,整个模块树植根于_restaurant_的明显名称。

source: The module tree might remind you of the filesystem’s directory tree on your computer; this is a very apt comparison! Just like directories in a filesystem, you use modules to organize your code. And just like files in a directory, we need a way to find our modules.
es: El árbol de módulos podría recordarle el árbol de directorios del sistema de archivos en su computadora; ¡esta es una comparación muy apta! Al igual que los directorios en un sistema de archivos, usted utiliza módulos para organizar su código. Y al igual que los archivos en un directorio, necesitamos una manera de encontrar nuestros módulos.
fr: L'arborescence des modules pourrait vous rappeler l'arborescence des répertoires de filesystems sur votre ordinateur; c'est une comparaison très appropriée! Tout comme les répertoires d'un système de fichiers, vous utilisez des modules pour organiser votre code. Et tout comme les fichiers d'un répertoire, nous avons besoin d'un moyen de trouver nos modules.
id: Pohon modul mungkin mengingatkan Anda pada pohon direktori filesystem di komputer Anda; ini adalah perbandingan yang sangat tepat! Sama seperti direktori dalam sistem berkas, Anda menggunakan modul untuk mengatur kode Anda. Dan seperti berkas dalam direktori, kita perlu cara untuk menemukan modul kami.
tr: Modül ağacı size bilgisayarınızdaki dosya sisteminin dizin ağacını hatırlatabilir; bu çok uygun bir karşılaştırmadır! Tıpkı bir dosya sistemindeki dizinler gibi, kodunuzu düzenlemek için modüller kullanırsınız. Ve tıpkı bir dizindeki dosyalar gibi, modüllerimizi bulmak için bir yola ihtiyacımız var.
zh_cn: 模块树可能会提醒您您在计算机上的文件系统目录树; 这是一个非常合适的比较 。 就像文件系统中的目录一样, 您使用模块来组织您的代码。 就像目录中的文件一样, 我们需要找到我们的模块 。

source: {{#quiz ../quizzes/ch07-02-defining-modules-to-control-scope.toml}}
es: quiz../quizzes/ch07-02-definir-módulos-a-control-scope.toml
fr: {{#quiz../quizes/ch07-02-defining-modules-to-control-scope.toml}}
zh_cn: Quiz./quizzes/ch07-02-确定模块-控制范围-toml_

source: To show Cairo where to find an item in a module tree, we use a path in the same way we use a path when navigating a filesystem. To call a function, we need to know its path.
es: Para mostrar El Cairo dónde encontrar un elemento en un árbol de módulos, utilizamos una ruta de la misma manera que usamos una ruta al navegar por un sistema de archivos. Para llamar a una función, necesitamos conocer su ruta.
fr: Pour montrer au Caire où trouver un élément dans un arbre de modules, nous utilisons un chemin de la même manière que nous utilisons un chemin pour naviguer dans un système de fichiers. Pour appeler une fonction, nous devons connaître son chemin.
id: Untuk menunjukkan Kairo di mana untuk menemukan item dalam pohon modul, kita menggunakan jalur dengan cara yang sama kita menggunakan jalur ketika menavigasi sistem berkas. Untuk memanggil sebuah fungsi, kita perlu tahu jalurnya.
tr: Kahire'ye bir modül ağacında bir öğeyi nerede bulabileceğimizi göstermek için, bir dosya sisteminde gezinirken bir yol kullandığımız gibi bir yol kullanırız. Bir işlevi aramak için, yolunu bilmemiz gerekir.
zh_cn: 要显示开罗在模块树中找到项目的位置, 我们使用路径的方式与在浏览文件系统时使用路径的方式相同。 要调用函数, 我们需要知道它的路径 。

source: A path can take two forms:
es: Un camino puede adoptar dos formas:
fr: Un chemin peut prendre deux formes:
id: Sebuah jalur dapat mengambil dua bentuk:
tr: Bir yol iki şekilde olabilir:
zh_cn: 一条路径可以采取两种形式:

source: An _absolute path_ is the full path starting from a crate root. The absolute path begins with the crate name.
es: Una ruta _absoluta_ es la ruta completa a partir de una raíz de caja. La ruta absoluta comienza con el nombre de caja.
fr: Un chemin _absolue_ est le chemin complet à partir d'une racine de caisse. Le chemin absolu commence par le nom de caisse.
id: Path _absolute_ adalah jalur penuh mulai dari akar peti. Path absolut dimulai dengan nama peti.
tr: Bir _mutlak yol_ bir sandık kökünden başlayan tam yoldur. Mutlak yol sandık adı ile başlar.
zh_cn: 绝对路径_absolute 路径是从箱根开始的完整路径。绝对路径从箱名开始。

source: A _relative path_ starts from the current module.
es: Una ruta _relativa_ comienza desde el módulo actual.
fr: Un chemin _relatif_ commence à partir du module actuel.
id: Path _relatif_ dimulai dari modul saat ini.
tr: Bir _relative path_ geçerli modülden başlar.
zh_cn: 相对路徑 _ 从当前模块开始 。

source: Both absolute and relative paths are followed by one or more identifiers separated by double colons (`::`).
es: Tanto los caminos absolutos como los relativos van seguidos de uno o más identificadores separados por dos puntos («:»).
fr: Les chemins absolus et relatifs sont suivis d'un ou plusieurs identifiants séparés par des doubles côlons (`:`).
id: Baik jalur absolut maupun relatif diikuti oleh satu atau lebih pengidentifikasi dipisahkan oleh titik dua (Negara ganda).
tr: Hem mutlak hem de göreceli yollar, çift kolonlarla (:) ayrılmış bir veya daha fazla tanımlayıcı tarafından takip edilir.
zh_cn: 绝对路径和相对路径后面都有一个或几个识别符,用双冒号分隔(`:')。

source: To illustrate this notion let's take back our example Listing 7-1 for the restaurant we used in the last chapter. We have a crate named _restaurant_ in which we have a module named `front_of_house` that contains a module named `hosting`. The `hosting` module contains a function named `add_to_waitlist`. We want to call the `add_to_waitlist` function from the `eat_at_restaurant` function. We need to tell Cairo the path to the `add_to_waitlist` function so it can find it.
es: Para ilustrar esta noción, retomemos nuestro ejemplo Listando 7-1 para el restaurante que usamos en el último capítulo. Tenemos una caja llamada _restaurante_ en la que tenemos un módulo llamado `front_of_house` que contiene un módulo llamado `hosting`. El módulo `hosting` contiene una función llamada `addd_to_waitlist`. Queremos llamar a la función `add_to_waitlist` desde la función `eat_at_restaurant`. Necesitamos decirle a El Cairo la ruta a la función `add_to_waitlist` para que pueda encontrarla.
fr: Nous avons une caisse nommée _restaurant_ dans laquelle nous avons un module nommé `front_of_house` qui contient un module nommé `hosting`. Le module `hosting` contient une fonction nommée `add_to_waitlist`. Nous voulons appeler la fonction `add_to_waitlist` de la fonction `eat_at_restaurant`. Nous devons dire au Caire le chemin vers la fonction `add_to_waitlist` pour qu'il puisse la trouver.
id: Untuk menggambarkan gagasan ini mari kita ambil kembali contoh kami Listing 7-1 untuk restoran yang kami gunakan di bab terakhir. kami memiliki sebuah peti bernama _restaurant_ di mana kami memiliki modul yang bernama ▪front_of_house_house yang berisi modul bernama åhossingé. modul terakhir yang kami gunakan berisi sebuah fungsi bernama ádd_t_waité. Kami ingin menghubungi Ád_t_waitlistée fungsi dari fungsi eat_rest_reurantó. Kita perlu memberitahu Caia jalan ke daftar fungsi yang dapat Anda tunggui sehingga dapat menemukan fungsinya.
tr: Bu nosyonu örneklemek için son bölümde kullandığımız restoran için 7-1 listeleme örneğimizi geri alalım. hosting adlı bir modül içeren front_of_house adlı bir modülümüz var. hosting modülü add_to_waitlist işlevini add_to_waitlist işlevinden çağırmak istiyoruz.
zh_cn: 为了说明这个概念,让我们回顾一下我们在最后一章中使用的餐馆的列表7-1的例子。我们有一个名为_restaurant的箱子,其中我们有一个名为`front_of_house'的模块,其中包括一个名为`东道'的模块。`东道'模块包含一个名为`add_to_waitlist' 的函数。我们要从`eat_at_restaurant'函数中调用`add_to_waitlist' 函数。我们需要告诉开罗通往`add_to_waitlist'函数的路径,以便它能找到它。

source: // Absolute path
es: // Ruta absoluta
fr: // Chemin absolu
id: //Lokasi absolut
tr: // Mutlak yol
zh_cn: / 绝对路径

source: // Relative path
es: // Ruta relativa
fr: // Chemin relatif
id: Path relatif
tr: // Bağıl yol
zh_cn: / 相对路径

source: <span class="caption">Listing 7-3: Calling the `add_to_waitlist` function using absolute and relative paths</span>
es: <span class="caption">Lista 7-3: Llamando a la función `add_to_waitlist` usando rutas absolutas y relativas</span>
fr: <span class="caption">Liste 7-3: Appel à la fonction `add_to_waitlist` en utilisant des chemins absolus et relatifs</span>
id: <span class="caption">Listing 7-3: Memanggil fungsi absolut dan relatif</span>
tr: span class="caption">Liste 7-3: Mutlak ve göreceli yolları kullanarak add_to_waitlist işlevini aramak/span>
zh_cn: <span类=“caption” > listing 7-3:使用绝对和相对路径 </span>调用`add_to_waitlist' 函数

source: The `eat_at_restaurant` function is part of our library's public API, so we mark it with the `pub` keyword. We’ll go into more detail about `pub` in the ["Exposing Paths with the `pub` Keyword"](./ch07-03-paths-for-referring-to-an-item-in-the-module-tree.md#exposing-paths-with-the-pub-keyword) section.
es: La función `eat_at_restaurant` es parte de la API pública de nuestra biblioteca, por lo que la marcamos con la palabra clave `pub`. Vamos a entrar en más detalles sobre `pub` en la ["Exponer rutas con la palabra clave `pub`"](./ch07-03-paths-for-referring-to-an-item-in-the-módule-tree.md#exponer caminos-with-the-pub-keyword) sección.
fr: La fonction `eat_at_restaurant` fait partie de l'API publique de notre bibliothèque, donc nous la marquons avec le mot-clé `pub`. Nous allons entrer plus de détails sur `pub` dans la section ["Exposer les chemins avec le mot-clé `pub`"](./ch07-03-paths-for-referencering-to-an-item-in-the-module-tree.md#exposer les chemins-with-pub-keyword).
id: The eat_at_retaurant_retauráne adalah bagian dari API publik perpustakaan kami, jadi kami menandainya dengan kata kunci. Kami akan membahas lebih rinci tentang åpubà di ["Exposing Paths-pates-with-pub-keyword"]./ch07-pathpers-for-referring-to-an-ite-m-in-module-tree.m#exexexs-paths-with-the-pub-key) bagian.
tr: eat_at_restaurant işlevi kütüphanemizin genel API'sinin bir parçasıdır, bu yüzden pub anahtar kelimesi ile işaretliyoruz. pub hakkında daha fazla ayrıntıya gireceğiz pub Anahtar Kelime ile Yollar pub Anahtar Kelime ile Yollar
zh_cn: `eat_at_restaurant' 功能是我们图书馆公开的API的一部分,因此我们用`pub'关键字标记它。我们将更详细地介绍[“用`pub`关键词'来扩展路径” (./ch07-03-paths-for-referring-a-unit- in-the-module-tree.md#exposing-paths- with-pub-keeyword) 一节中的`pub'部分。

source: The first time we call the `add_to_waitlist` function in `eat_at_restaurant`, we use an absolute path. The `add_to_waitlist` function is defined in the same crate as `eat_at_restaurant`. In Cairo, absolute paths start from the crate root, which you need to refer to by using the crate name. You can imagine a filesystem with the same structure: we’d specify the path _/front_of_house/hosting/add_to_waitlist_ to run the _add_to_waitlist_ program; using the crate name to start from the crate root is like using a slash (`/`) to start from the filesystem root in your shell.
es: La primera vez que llamamos a la función `add_to_waitlist` en `eat_at_restaurant`, utilizamos una ruta absoluta. La función `add_to_waitlist` se define en la misma caja que `eat_at_restaurant`. En El Cairo, las rutas absolutas comienzan desde la raíz de la caja, a la que debe referirse utilizando el nombre de la caja. Puede imaginar un sistema de archivos con la misma estructura: especificaríamos la ruta __front_of_house/hosting/add_to_waitlist_ para ejecutar el programa __add_to_waitlist_; usar el nombre de la caja para comenzar desde la raíz de la caja es como usar una barra (`/`) para empezar desde la raíz del sistema de archivos en su shell.
fr: La première fois que nous appelons la fonction `add_to_waitlist` dans `eat_at_restaurant`, nous utilisons un chemin absolu. La fonction `add_to_waitlist` est définie dans la même caisse que `eat_at_restaurant`. Au Caire, les chemins absolus commencent à partir de la racine de la caisse, à laquelle vous devez vous référer en utilisant le nom de la caisse. Vous pouvez imaginer un système de fichiers avec la même structure : nous avons spécifié le chemin _/front_of_house/hosting/add_to_waitlist_ pour exécuter le programme _add_to_waitlist_; utiliser le nom de la caisse pour démarrer à partir de la racine de la caisse est comme utiliser une barre oblique (`/`) pour démarrer à partir de la racine du système de fichiers dans votre shell.
id: Pertama kali kita sebut fungsi ·add_to_waitlist_waitlistít_at_restaurantán, kita menggunakan jalur absolut. Fungsi yang kita sebut sebagai fungsi absolut. Anda dapat membayangkan sistem berkas dengan struktur yang sama: kami menentukan jalur _/front_house_host_posurant. Di Kairo, jalur absolut dimulai dari akar peti, yang Anda butuhkan untuk merujuk dengan menggunakan nama peti. Anda dapat membayangkan sistem berkas dengan struktur yang sama: kami menspesifikasikan path _/front_house/hos_host_to_waitlist untuk menjalankan _d_t_list; menggunakan nama peti untuk mulai dari akar/zoom.
tr: eat_at_restaurant'daki add_to_waitlist fonksiyonunu ilk kez çağırdığımızda, mutlak bir yol kullanırız. add_to_waitlist işlevi, eat_at_restaurant ile aynı sandıkta tanımlanır. Kahire'de, mutlak yollar, sandık adını kullanarak başvurmanız gereken sandık kökünden başlar. Aynı yapıya sahip bir dosya sistemi hayal edebilirsiniz:
zh_cn: 我们第一次在`eat_at_restaurant'中调用`add_to_waitlist' 函数时,我们使用绝对路径。“add_to_waitlist”函数在同一个箱子中被定义为`eat_at_restaurant'。在开罗,绝对路径从箱根开始,您需要用箱名来参考。你可以想象一个具有相同结构的文件系统:我们指定了运行_add_to_waitlist_程序的路径_/front_house/ hosting/add_to_waitlist_;使用箱名从箱根开始,就像用斜线(`/`)来启动外壳中的文件系统根。

source: The second time we call `add_to_waitlist`, we use a relative path. The path starts with `front_of_house`, the name of the module defined at the same level of the module tree as `eat_at_restaurant`. Here the filesystem equivalent would be using the path _./front_of_house/hosting/add_to_waitlist_. Starting with a module name means that the path is relative to the current module.
es: La segunda vez que llamamos a `add_to_waitlist`, utilizamos una ruta relativa. La ruta comienza con `front_of_house`, el nombre del módulo definido al mismo nivel del árbol del módulo que `eat_at_restaurant`. Aquí el equivalente del sistema de archivos estaría usando la ruta __/front_of_house/hosting/add_to_waitlist_. Comenzando con un nombre del módulo significa que la ruta es relativa al módulo actual.
fr: La deuxième fois que nous appelons `add_to_waitlist`, nous utilisons un chemin relatif. Le chemin commence par `front_of_house`, le nom du module défini au même niveau de l'arborescence du module que `eat_at_restaurant`. Ici, l'équivalent du système de fichiers utiliserait le chemin _./front_of_house/hosting/add_to_waitlist_. En commençant par un nom de module, le chemin est relatif au module courant.
id: Kedua kalinya kita memanggil modul yang sama dengan pohon modul sebagai áeat_resturant_quot; di sini sistem berkas setara akan menggunakan jalur _./front_house/hos/adto_waitlist. Memulai dengan nama modul berarti jalur relatif terhadap modul saat ini.
tr: add_to_waitlist dediğimiz ikinci seferde göreli bir yol kullanırız. add_to_waitlist olarak tanımlanan modül ağacının adı olan front_of_house ile başlar. Burada dosya sistemi eşdeğeri yolu kullanıyor olacaktır _./front_of_house/hosting/add_to_waitlist_. Bir modülle başlamak, bu yol göreceli yol anlamına gelir.
zh_cn: 第二次我们调用“add_to_waitlist”时,我们使用一个相对路径。路径以“front_of_house”开始,即模块树同一层次定义的“eat_at_restaurant”模块的名称。在这里,文件系统等同将使用路径 _./front_house/ hosting/add_to_waitlist_。从模块名称开始,意味着路径与当前模块相对。

source: Let’s try to compile Listing 7-3 and find out why it won’t compile yet! We get the following error:
es: Tratemos de compilar el listado 7-3 y averiguar por qué no se compilará todavía! Obtenemos el siguiente error:
fr: Essayez de compiler Listing 7-3 et découvrez pourquoi il n'a pas encore compilé! Nous obtenons l'erreur suivante:
id: Mari kita coba menyusun Listing 7-3 dan mencari tahu mengapa hal itu belum dapat dikompilasi!
tr: Listeleme 7-3'ü derlemeye çalışalım ve neden henüz derlemeyeceğini öğrenelim! Aşağıdaki hatayı alıyoruz:
zh_cn: 让我们试着编集列表 7-3, 并找出为什么它还没有编成! 我们发现以下错误 :

source: The error messages say that module `hosting` and the `add_to_waitlist` function are not visible. In other words, we have the correct paths for the `hosting` module and the `add_to_waitlist` function, but Cairo won’t let us use them because it doesn’t have access to them. In Cairo, all items (functions, methods, structs, enums, modules, and constants) are private to parent modules by default. If you want to make an item like a function or struct private, you put it in a module.
es: Los mensajes de error dicen que el módulo `hosting` y la función `add_to_waitlist` no son visibles. En otras palabras, tenemos las rutas correctas para el módulo `hosting` y la función `add_to_waitlist`, pero El Cairo no nos permitirá usarlas porque no tiene acceso a ellas. En El Cairo, todos los elementos (funciones, métodos, estructuras, enums, módulos y constantes) son privados a los módulos padre por defecto. Si desea hacer un elemento como una función o struct privado, lo pone en un módulo.
fr: Les messages d'erreur indiquent que le module `hosting` et la fonction `add_to_waitlist` ne sont pas visibles. En d'autres termes, nous avons les chemins corrects pour le module `hosting` et la fonction `add_to_waitlist`, mais le Caire n'a pas laissé nous les utiliser parce qu'il n'a pas accès à eux. Au Caire, tous les éléments (fonctions, méthodes, structs, enums, modules et constantes) sont privés aux modules parent par défaut.
id: Pesan kesalahan mengatakan bahwa modul ·hosing-- dan fungsi ·add_to_waitlist_wait tidak terlihat. Dengan kata lain, kita memiliki jalur yang benar untuk modul åhosting (mengatur, enums, modul, dan konstanta_to_wait, tetapi Kairo tidak membiarkan kita menggunakannya karena ia tidak memiliki akses ke mereka. Di Kairo, semua item (fungsi, metode, struktur, modul, dan konstanta) adalah untuk modul induk secara baku. Jika Anda ingin membuat item seperti fungsi atau struktur pribadi, Anda masukkan ke dalam modul pribadi.
tr: Hata mesajları, hosting modülünün ve add_to_waitlist fonksiyonunun görünür olmadığını söylüyor. Başka bir deyişle, hosting modülü ve add_to_waitlist işlevi için doğru yollara sahibiz, ancak Kahire bunları kullanmamıza izin vermiyor çünkü bunlara erişiminiz yok. Kahire'de, tüm öğeler (fonksiyonlar, yöntemler, yapılar, enumlar, modüller) özel bir işlev, modüller ve modüller olarak kullanılır.
zh_cn: 错误信息中说模块“ 托管” 和“ add_to_ waitlist” 功能不可见。 换句话说, 我们拥有“ 托管” 模块和“ add_to_ waitlist” 功能的正确路径, 但是开罗不允许我们使用它们, 因为它无法访问它们。 在开罗, 所有项目( 函数、 方法、 支架、 enum、 模块和常数) 都默认是父模块的私有。 如果您想要将一个像函数或支架这样的项目设为私有, 您可以将其放入模块 。
