Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Update the `cairo1.languageServerPath` of the Cairo 1.0 extension by pasting the path.
es: Actualizar el `cairo1.languageServerPath` de la extensión El Cairo 1.0 pegando el camino.
fr: Mettre à jour l'extension `cairo1.languageServerPath` du Caire 1.0 en passant le chemin.
id: Update ▪cairo1.languageServerPath dari ekstensi Kairo 1.0 dengan menempelkan jalur.
tr: Yolu yapıştırarak Kahire 1.0 uzantısının cairo1.languageServerPath'sini güncelleyin.
zh_cn: 通过粘贴路径,更新开罗1.0扩展版的`cairo1. 语文服务Path'。

source: All through the previous sections, you've mostly written programs with a `main` entrypoint. In the coming sections, you will learn to write and deploy Starknet contracts.
es: En todas las secciones anteriores, usted ha escrito principalmente programas con un punto de entrada principal. En las secciones siguientes, usted aprenderá a escribir e implementar contratos Starknet.
fr: Tout au long des sections précédentes, vous avez surtout écrit des programmes avec un point d'entrée `main`. Dans les sections à venir, vous apprendrez à écrire et à déployer des contrats Starknet.
id: Semua melalui bagian sebelumnya, Anda sebagian besar telah menulis program dengan titik masuk åmainé. di bagian yang akan datang, Anda akan belajar untuk menulis dan menyebarkan kontrak Starknet.
tr: Önceki bölümler boyunca çoğunlukla main giriş noktası olan programlar yazdınız. Önümüzdeki bölümlerde Starknet sözleşmelerini yazmayı ve dağıtmayı öğreneceksiniz.
zh_cn: 在前几节中,您大多用“主要”切入点撰写程序。在下几节中,您将学习写作和部署斯塔克内特合同。

source: One of the key applications of the Cairo language is writing smart contracts for the Starknet network. Starknet is a permissionless decentralized network that leverages zk-STARKs technology for scalability. As a Layer 2 (L2) scalability solution for Ethereum, Starknet aims to provide fast, secure, and low-cost transactions. It operates as a validity rollup, commonly known as a zero-knowledge rollup, and is built on top of the Cairo VM.
es: Una de las aplicaciones clave del idioma de El Cairo es escribir contratos inteligentes para la red Starknet. Starknet es una red descentralizada sin permiso que aprovecha la tecnología zk-STARKs para la escalabilidad. Como solución de escalabilidad de la capa 2 (L2) para Ethereum, Starknet tiene como objetivo proporcionar transacciones rápidas, seguras y de bajo costo. Funciona como un rollup de validez, comúnmente conocido como un rollup de conocimiento cero, y está construido sobre la VM de El Cairo.
fr: Starknet est un réseau décentralisé sans permission qui exploite la technologie zk-STARKs pour l'évolutivité. En tant que solution d'évolutivité de la couche 2 (L2) pour Ethereum, Starknet vise à fournir des transactions rapides, sécurisées et peu coûteuses. Il fonctionne comme un rollup de validité, communément appelé rollup de zéro connaissance, et est construit sur le sommet de la VM du Caire.
id: Salah satu aplikasi kunci bahasa Kairo adalah menulis kontrak cerdas untuk jaringan Starknet. Starknet adalah jaringan terdesentralisasi tanpa izin yang memanfaatkan teknologi zk-STARKs untuk skalabilitas. Sebagai solusi skalal 2 (L2) untuk Ethereum, Starknet bertujuan untuk menyediakan cepat, aman, dan rendah biaya transaksi. Ini beroperasi sebagai rollup validitas, umumnya dikenal sebagai rollup nol-tahu, dan dibangun di atas Kairo VM.
tr: Kahire dilinin önemli uygulamalarından biri Starknet ağı için akıllı sözleşmeler yazmaktır. Starknet, zk-STARKs teknolojisini ölçeklenebilirlik için kullanan izinsiz merkezi olmayan bir ağdır. Ethereum için Katman 2 (L2) ölçeklenebilirlik çözümü olarak, Starknet hızlı, güvenli ve düşük maliyetli işlemler sağlamayı amaçlamaktadır. Yaygın olarak sıfır bilgili bir rulo olarak bilinen geçerli bir rulo olarak çalışır ve Kahire VM'nin üzerine inşa edilmiştir.
zh_cn: 开罗语言的关键应用之一是为史塔克内特网络签订智能合同。史塔克内特是一个使用兹克-STARKs技术进行可缩放的无权限分散的网络。作为Etheum的2层(L2)缩放解决方案,史塔克内特旨在提供快速、安全和低成本的交易。它作为一个有效性的滚动(通常称为零知识卷动 ), 并建在开罗VM 之上。

source: Starknet contracts are programs specifically designed to run within the Starknet OS. The Starknet OS is a Cairo program itself, which means that any operation executed by the Starknet OS can be proven and succinctly verified. Smart contracts can access Starknet's persistent state through the OS, enabling them to read or modify variables in Starknet’s state, communicate with other contracts, and interact seamlessly with the underlying Layer 1 (L1) network.
es: Los contratos Starknet son programas diseñados específicamente para funcionar dentro del sistema operativo Starknet. El sistema operativo Starknet es un programa de El Cairo en sí mismo, lo que significa que cualquier operación ejecutada por el sistema operativo Starknet puede ser probada y verificada sucintamente. Los contratos inteligentes pueden acceder al estado persistente de Starknet a través del sistema operativo, permitiéndoles leer o modificar variables en el estado de Starknet, comunicarse con otros contratos e interactuar sin problemas con la red subyacente de la capa 1 (L1).
fr: Les contrats Starknet sont des programmes spécifiquement conçus pour fonctionner dans le système d'exploitation Starknet. Le système d'exploitation Starknet est un programme Cairo lui-même, ce qui signifie que toute opération exécutée par le système d'exploitation Starknet peut être prouvée et vérifiée succinctement. Les contrats intelligents peuvent accéder à l'état persistant de Starknet via le système d'exploitation, leur permettant de lire ou de modifier des variables dans l'état de Starknets, de communiquer avec d'autres contrats et d'interagir de manière transparente avec le réseau Layer 1 (L1) sous-jacent.
id: Kontrak Starknet adalah program yang dirancang secara khusus untuk dijalankan dalam OS Starknet. OS Starknet adalah program Kairo sendiri, yang berarti bahwa setiap operasi yang dijalankan oleh OS Starknet dapat dibuktikan dan diverifikasi secara tepat. Kontrak cerdas dapat mengakses negara Starknet yang gigih melalui OS, memungkinkan mereka untuk membaca atau memodifikasi variabel dalam negara Starknet, berkomunikasi dengan kontrak lain, dan berinteraksi dengan lapisan bawah 1 (L1) jaringan.
tr: Starknet sözleşmeleri, Starknet OS içinde çalışacak şekilde özel olarak tasarlanmış programlardır. Starknet OS, bir Kahire programıdır, bu da Starknet OS tarafından yürütülen herhangi bir işlemin kanıtlanabileceği ve kısa sürede doğrulanabileceği anlamına gelir. Akıllı sözleşmeler, Starknet'in işletim sistemi aracılığıyla Starknet'in kalıcı durumuna erişebilir, Starknet'in durumundaki değişkenleri okumalarını veya değiştirmelerini sağlayabilir, diğer sözleşmelerle iletişim kurabilir ve altta yatan Katman 1 (L1) ağıyla sorunsuz bir şekilde etkileşime girebilir.
zh_cn: 斯塔克内特合同是专门设计在斯塔克内特操作系统内部运行的程序。 斯塔克内特操作系统是开罗程序本身,这意味着史塔克内特操作系统实施的任何操作都可以得到证明和简明的核实。 智能合同可以通过操作系统进入史塔克内特的持久性状态,使他们能够读取或修改斯塔克内特状态中的变量,与其他合同进行沟通,并与基础图层1(L1)网络进行无缝互动。

source: If you want to learn more about the Starknet network itself, its architecture and the tooling available, you should read the [Starknet Book](https://book.starknet.io/). In this book, we will only focus on writing smart contracts in Cairo.
es: Si quieres saber más sobre la propia red Starknet, su arquitectura y las herramientas disponibles, debes leer el [Starknet Book] (https://book.starknet.io/). En este libro, sólo nos centraremos en escribir contratos inteligentes en El Cairo.
fr: Si vous souhaitez en savoir plus sur le réseau Starknet lui-même, son architecture et l'outillage disponible, vous devez lire le [Livre Starknet](https://book.starknet.io/). Dans ce livre, nous nous concentrerons uniquement sur l'écriture de contrats intelligents au Caire.
id: Jika Anda ingin belajar lebih banyak tentang jaringan Starknet itu sendiri, arsitekturnya dan tooling yang tersedia, Anda harus membaca [Buku Starknet] 2.0https://book.starknet.io/). dalam buku ini, kita hanya akan fokus pada menulis kontrak cerdas di Kairo.
tr: Starknet ağının kendisi, mimarisi ve mevcut araç gereçler hakkında daha fazla bilgi edinmek istiyorsanız [Starknet Kitabı]'nı (https://book.starknet.io/) okumalısınız. Bu kitapta sadece Kahire'de akıllı sözleşmeler yazmaya odaklanacağız.
zh_cn: 如果您想更多地了解斯塔克内特网络本身、其架构和可用的工具,您应该阅读[星网书](https://book.starknet.io/)。在这本书中,我们只关注在开罗撰写智能合同。

source: Scarb
es: Cicatriz
fr: Écharpe
zh_cn: 刀疤

source: Scarb facilitates smart contract development for Starknet. To enable this feature, you'll need to make some configurations in your _Scarb.toml_ file (see [Installation](./ch01-01-installation.md) for how to install Scarb).
es: Scarb facilita el desarrollo de contratos inteligentes para Starknet. Para habilitar esta función, necesitará realizar algunas configuraciones en su archivo _Scarb.toml_ (ver [Instalación](./ch01-01-installation.md) para saber cómo instalar Scarb).
fr: Scarb facilite le développement de contrats intelligents pour Starknet. Pour activer cette fonctionnalité, vous aurez besoin de faire quelques configurations dans votre fichier _Scarb.toml_ (voir [Installation](./ch01-01-installation.md) pour savoir comment installer Scarb).
id: Scarb memfasilitasi pengembangan kontrak pintar bagi Starknet. Untuk mengaktifkan fitur ini, Anda perlu membuat beberapa konfigurasi dalam berkas _Scarb.toml_ Anda (lihat [Instalasi]./ch01-01-installation.mlasi) untuk cara memasang Scarb).
tr: Scarb, Starknet için akıllı sözleşme geliştirmeyi kolaylaştırır. Bu özelliği etkinleştirmek için, Scarb'ın nasıl kurulacağı için _Scarb.toml_ dosyanızda bazı yapılandırmalar yapmanız gerekir (bkz. [Installation](./ch01-01-installation.md)).
zh_cn: Scarb 有助于为 Starknet 开发智能合同。 要启用此功能, 您需要在您的 _Scarb.toml_ 文件中做出一些配置( 如何安装 scrab, 请参见 [Installation] (./ ch01-01- adplacementation. md) 。

source: First, add the `starknet` dependency to your _Scarb.toml_ file. Next, enable the Starknet contract compilation of the package by adding a `[[target.starknet-contract]]` section. By default, specifying this target will build a Sierra Contract Class file, which can be deployed on Starknet. If you omit to specify the target, your package will compile but will not produce an output that you can use with Starknet.
es: En primer lugar, añada la dependencia `starknet` a su archivo _Scarb.toml_. A continuación, active la compilación del contrato Starknet del paquete añadiendo una sección `[[target.starknet-contract]]`. Por defecto, especificar este objetivo construirá un archivo Sierra Contract Class, que se puede implementar en Starknet. Si omite especificar el objetivo, su paquete compilará pero no producirá una salida que pueda utilizar con Starknet.
fr: D'abord, ajoutez la dépendance `starknet` à votre fichier _Scarb.toml_. Ensuite, activez la compilation du contrat Starknet du paquet en ajoutant une section `[[target.starknet-contract]`. Par défaut, en spécifiant cette cible, vous créerez un fichier Sierra Contract Class, qui peut être déployé sur Starknet. Si vous omettez de spécifier la cible, votre paquet compilera mais ne produira pas une sortie que vous pouvez utiliser avec Starknet.
id: Pertama, tambahkan ketergantungan Ástarknet ke file _Scarb.toml_ Anda. Berikutnya, aktifkan kompilasi kontrak Starknet dari paket dengan menambahkan sebuah å[target.starknet-contract]. Secara baku, spesifikasikan target ini akan membangun sebuah berkas Sierra Contract Class, yang dapat digunakan di Starknet. Jika Anda tidak menspesifikasikan target, paket Anda akan dikompilasi tetapi tidak akan menghasilkan keluaran yang dapat Anda gunakan dengan Starknet.
tr: İlk olarak, starknet bağımlılığını _Scarb.toml_ dosyanıza ekleyin. Daha sonra, bir [target.starknet-contract] bölümü ekleyerek paketin Starknet sözleşme derlemesini etkinleştirin. Varsayılan olarak, bu hedefi belirtmek, Starknet'te konuşlandırılabilecek bir Sierra Contract Class dosyası oluşturacaktır. Hedefi belirtmeyi ihmal ederseniz, paketiniz derlenecek ancak Stark ile kullanabileceğiniz bir çıktı üretmeyecektir.
zh_cn: 首先,在您的 _Scarb.toml_文件中添加“starknet”依赖性。接下来,通过添加“[目标.starknet-contract]]”部分,启用 Starknet 合同包汇编。默认情况下,指定此目标将构建一个可以部署在 Starknet 上的Sierra 合同类文件。如果您忽略指定目标,您的软件包将编集,但不会产生 Starknet 可以使用的输出。

source: Below is the minimal _Scarb.toml_ file required to compile a crate containing Starknet contracts:
es: A continuación se muestra el archivo _Scarb.toml_ mínimo necesario para compilar una caja que contiene los contratos Starknet:
fr: Voici le fichier _scarb.toml_ minimal requis pour compiler une caisse contenant des contrats Starknet :
id: Di bawah ini adalah minimal file _Scarb.toml_ diperlukan untuk mengkompilasi peti berisi kontrak Starknet:
tr: Aşağıda Starknet sözleşmelerini içeren bir sandık derlemek için gereken minimum _Scarb.toml_ dosyası bulunmaktadır:
zh_cn: 以下是为编制含有Starknet合同的箱子所需的最起码的_Scarb.toml_文件:

source: ```toml [package] name = "package_name" version = "0.1.0" [dependencies] starknet = ">=2.6.3" [[target.starknet-contract]] ```
es: Nombre del paquete = "package_name" versión = "0.1.0" [dependencias] blacknet = ">2.6.3" [[target.starknet-contract]]
fr: ```toml [package] name = "package_name" version = "0.1.0" [dependences] starknet = ">=2.6.3" [[target.starknet-contract]] ``
id: nama [paket] = "package_name" versi = "0.1.0" [dependensi] rinnet = ">=2.6.3" [[target.Starknet-contract]]]
tr: toml [package] name = "package_name" version = "0.1.0" [bağımlılar] starknet = ">=2.6.3" [hedef.starknet-sözleşme]
zh_cn: toml [包装] 名称 = "package_name" 版本 = "0.1.0" [依附] tarknet = "2.6.3" [[目标.starknet-合 ]

source: To compile contracts defined in your package's dependencies, please refer to the [Scarb documentation](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#compiling-external-contracts).
es: Para compilar los contratos definidos en las dependencias de su paquete, consulte la [Documentación de Scarb](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#compilating-external-contracts).
fr: Pour compiler les contrats définis dans les dépendances de votre paquet, veuillez consulter la [documentation Scarb](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-cible.html#compiling-external-contracts).
id: Untuk mengkompilasi kontrak yang didefinisikan dalam ketergantungan paket Anda, silakan merujuk ke [Konsersi Scarb][Scarb].https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.htl# kompliling-external-contracts).
tr: Paketinizin bağımlılıklarında tanımlanan sözleşmeleri derlemek için lütfen [Scarb documentation](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#compilling-external-contracts] adresine bakınız.
zh_cn: 为了汇编贵国包件的依附关系所界定的合同,请参看[Scarb文件](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#comping-extern-contracts)。

source: Starknet Foundry
es: Fundición Starknet
fr: Fonderie Starknet
id: Pendirian Starknet
tr: Starknet Dökümhanesi
zh_cn: Starknet 铸造公司

source: Starknet Foundry is a tool chain for Starknet smart contract development. It supports many features, including writing and running tests with advanced features, deploying contracts, interacting with the Starknet network, and more.
es: Starknet Foundry es una cadena de herramientas para el desarrollo de contratos inteligentes Starknet. Soporta muchas características, incluyendo la escritura y la ejecución de pruebas con características avanzadas, el despliegue de contratos, la interacción con la red Starknet, y más.
fr: Starknet Foundry est une chaîne d'outils pour le développement de contrats intelligents Starknet. Il prend en charge de nombreuses fonctionnalités, y compris l'écriture et l'exécution de tests avec des fonctionnalités avancées, le déploiement de contrats, l'interaction avec le réseau Starknet, et plus encore.
id: Pendirian Starknet adalah alat untuk pengembangan kontrak pintar Starknet. dan lebih banyak lagi.
tr: Starknet Foundry, Starknet akıllı sözleşme geliştirme için bir araç zinciridir. Gelişmiş özelliklere sahip testlerin yazılması ve çalıştırılması, sözleşmelerin dağıtılması, Starknet ağıyla etkileşim ve daha fazlası dahil olmak üzere birçok özelliği destekler.
zh_cn: Starknet Foundry是史塔克内特智能合同开发的工具链。 它支持许多功能,包括写作和进行先进功能测试、部署合同、与史塔克内特网络互动等等。

source: We'll describe Starknet Foundry in more detail in [Chapter 17](./ch17-02-testing-smart-contracts.md#testing-smart-contracts-with-starknet-foundry) when discussing Starknet smart contract testing and security.
es: Vamos a describir Starknet Foundry con más detalle en [Capítulo 17](./ch17-02-testing-smart-contracts.md#testing-smart-contracts-with-starknet-foundry) cuando se discute Starknet smart contract testing and security.
fr: Nous décrirons plus en détail Starknet Foundry dans [Chapitre 17](./ch17-02-test-smart-contracts.md#test-smart-contracts-with-starknet-foundry) lors de la discussion de Starknet smart-contract testing and security.
id: Kami akan menggambarkan Starknet Foundry dalam rincian lebih lanjut di [Chapter ofnectann. /ch17-02-testing-smart-contracts.m#testing-mart-contracts-with-starknet-foundry) ketika membahas Starknet uji cobaan cerdas dan keamanan.
tr: Starknet Foundry'yi Starknet akıllı sözleşme testi ve güvenliğini tartışırken [Bölüm 17](./ch17-02-testing-smart-contracts.md#testing-smart-contracts-with-starknet-foundry) 'de daha ayrıntılı olarak açıklayacağız.
zh_cn: 我们在讨论斯塔克内特智能合同测试和安全问题时,将在[第17章](./ch17-02-测试智能合同.md#测试智能合同-与斯塔克内特公司)中更详细地描述斯塔克内特铸造厂。

source: This chapter will give you a high level introduction to what smart contracts are, what they are used for, and why blockchain developers would use Cairo and Starknet. If you are already familiar with blockchain programming, feel free to skip this chapter. The last part might still be interesting though.
es: Este capítulo le dará una introducción de alto nivel a lo que son los contratos inteligentes, lo que se utilizan para, y por qué los desarrolladores de blockchain utilizar El Cairo y Starknet. Si ya está familiarizado con la programación de blockchain, no dude en saltarse este capítulo. La última parte podría ser interesante sin embargo.
fr: Ce chapitre vous donnera une introduction de haut niveau à ce que sont les contrats intelligents, ce qu'ils sont utilisés, et pourquoi les développeurs de blockchain utiliseraient Le Caire et Starknet. Si vous êtes déjà familier avec la programmation de blockchain, n'hésitez pas à sauter ce chapitre. La dernière partie peut être encore intéressante.
id: Bab ini akan memberikan pengenalan tingkat tinggi untuk apa kontrak cerdas, apa yang mereka gunakan, dan mengapa pengembang blockchain akan menggunakan Kairo dan Starknet. jika Anda sudah akrab dengan program blockchain, silakan lewati bab ini. bagian terakhir mungkin masih menarik meskipun.
tr: Bu bölüm size akıllı sözleşmelerin ne olduğuna, ne için kullanıldıklarına ve blok zinciri geliştiricilerinin neden Kahire ve Starknet kullanacağına dair yüksek düzeyde bir giriş sağlayacaktır. Zaten blok zinciri programlamasını biliyorsanız, bu bölümü atlamaktan çekinmeyin. Son bölüm yine de ilginç olabilir.
zh_cn: 本章将给你们一个高层次的介绍,介绍什么是智能合同,什么是智能合同,它们用于什么,为什么连锁开发商会使用开罗和史塔克内特。 如果你已经熟悉连锁程序,你可以跳过这一章。最后部分可能仍然很有趣。

source: Smart Contracts
es: Contratos inteligentes
fr: Contrats intelligents
id: Kontrak Cerdas
tr: Akıllı Sözleşmeler
zh_cn: 智能合同

source: Smart contracts gained popularity and became more widespread with the birth of Ethereum. Smart contracts are essentially programs deployed on a blockchain. The term "smart contract" is somewhat misleading, as they are neither "smart" nor "contracts" but rather code and instructions that are executed based on specific inputs. They primarily consist of two components: storage and functions. Once deployed, users can interact with smart contracts by initiating blockchain transactions containing execution data (which function to call and with what input). Smart contracts can modify and read the storage of the underlying blockchain. A smart contract has its own address and is considered a blockchain account, meaning it can hold tokens.
es: Los contratos inteligentes ganaron popularidad y se generalizaron con el nacimiento de Ethereum. Los contratos inteligentes son esencialmente programas implementados en una cadena de bloques. El término "contrato inteligente" es algo engañoso, ya que no son ni "inteligentes" ni "contratos", sino más bien código e instrucciones que se ejecutan sobre la base de entradas específicas. Se componen principalmente de dos componentes: almacenamiento y funciones. Una vez implementados, los usuarios pueden interactuar con contratos inteligentes iniciando transacciones de cadena de bloques que contienen datos de ejecución (que funcionan para llamar y con qué entrada). Los contratos inteligentes pueden modificar y leer el almacenamiento de la cadena de bloques subyacente. Un contrato inteligente tiene su propia dirección y se considera una cuenta de cadena de bloques, lo que significa que puede contener fichas.
fr: Les contrats intelligents sont essentiellement des programmes déployés sur une chaîne de blocs. Le terme "contrat intelligent" est quelque peu trompeur, car ils ne sont ni "smart" ni "contrats" mais plutôt du code et des instructions qui sont exécutés sur la base d'entrées spécifiques. Ils se composent principalement de deux composants: stockage et fonctions. Une fois déployé, les utilisateurs peuvent interagir avec des contrats intelligents en initiant des transactions de blockchain contenant des données d'exécution (qui fonction d'appeler et avec quelle entrée). Les contrats intelligents peuvent modifier et lire le stockage de la chaîne de blocs sous-jacente. Un contrat intelligent a sa propre adresse et est considéré comme un compte blockchain, ce qui signifie qu'il peut contenir des jetons.
id: Kontrak cerdas mendapatkan popularitas dan menjadi lebih luas dengan kelahiran Ethereaum. Kontrak cerdas pada dasarnya digunakan pada sebuah rantai blok. Istilah "kontrak cerdas" agak menyesatkan, karena mereka bukan "smart" atau "contracts" tapi lebih tepatnya kode dan instruksi yang dijalankan berdasarkan masukan spesifik. Mereka terutama terdiri dari dua komponen: penyimpanan dan fungsi. Sekali digunakan, pengguna dapat berinteraksi dengan kontrak cerdas dengan memulai transaksi blockchain yang berisi data (yang disebut dan dengan masukan). Kontrak cerdas dapat memodifikasi dan membaca penyimpanan di bawah rantai blok.
tr: Akıllı sözleşmeler popülerlik kazandı ve Ethereum'un doğuşuyla daha yaygın hale geldi. Akıllı sözleşmeler aslında bir blok zincirinde konuşlandırılmış programlardır. "Akıllı sözleşme" terimi, "akıllı" veya "sözleşmeler" değil, belirli girdilere dayalı olarak yürütülen kod ve talimatlar olduğu için biraz yanıltıcıdır. Öncelikle iki bileşenden oluşurlar: depolama ve işlevler. Kullanıldıktan sonra, kullanıcılar, yürütme verileri içeren (bir blok zincirini çağırma işlevi ve akıllı girişi olan) blok zinciri işlemlerini başlatarak akıllı sözleşmelerle etkileşime girebilirler.
zh_cn: 智能合同越来越受欢迎,随着Etheum的诞生而变得更加普及。智能合同基本上是在一块铁链上部署的程序。 “智能合同”一词有些误导性,因为它们既不是“智能合同”也不是“合同”而是根据具体投入执行的代码和指令。它们主要由两个组成部分组成:存储和功能。一旦部署,用户可以通过包含执行数据的链交易(该功能可以调用和投入)与智能合同互动。智能合同可以修改和读取基本铁链的存储。智能合同有其自己的地址,并且被视为一个铁链账户,这意味着它可以持有标识。
