Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: This section focuses on the concept of bringing off-chain data to the Starknet blockchain using oracles. Oracles are third-party services that serve as intermediaries, securely transmitting external data, such as asset prices, weather information, or other real-world data, to blockchains and smart contracts. It also provides practical examples and code snippets demonstrating how developers can interact with a specific oracle named Pragma on Starknet network, covering topics like querying and handling price data, and verifiable random function (VRF) to generate random numbers.
es: Esta sección se centra en el concepto de llevar datos fuera de cadena a la cadena de bloques Starknet utilizando oráculos. Oracles son servicios de terceros que sirven como intermediarios, la transmisión segura de datos externos, tales como precios de activos, información meteorológica, u otros datos del mundo real, a blockchains y contratos inteligentes. También proporciona ejemplos prácticos y fragmentos de código que demuestran cómo los desarrolladores pueden interactuar con un oráculo específico llamado Pragma en la red Starknet, cubriendo temas como consulta y manejo de datos de precios, y función aleatoria verificable (VRF) para generar números aleatorios.
fr: Les Oracles sont des services de tiers qui servent d'intermédiaires, transmettent en toute sécurité des données externes, telles que les prix des actifs, les informations météorologiques ou d'autres données du monde réel, aux blockchains et aux contrats intelligents. Ils fournissent également des exemples pratiques et des extraits de code démontrant comment les développeurs peuvent interagir avec un oracle spécifique nommé Pragma sur le réseau Starknet, couvrant des sujets tels que la requête et le traitement des données de prix, et la fonction aléatoire vérifiable (VRF) pour générer des nombres aléatoires.
id: Bagian ini berfokus pada konsep membawa off-chain data ke Starknet blockchain menggunakan peramal. Oracles adalah layanan pihak ketiga yang berfungsi sebagai perantara, secara aman mentransmisikan data eksternal, seperti harga aset, informasi cuaca, atau data real-dunia lainnya, untuk memblokir rantai dan kontrak cerdas. hal ini juga menyediakan contoh praktis dan kode yang menunjukkan bagaimana pengembang dapat berinteraksi dengan tertentu Pragma di jaringan Starknet, mencakup topik seperti menanyakan dan menangani harga data, dan fungsi acak yang dapat diverifikasi (VRF) untuk menghasilkan angka acak.
tr: Bu bölüm, kahinleri kullanarak Starknet blok zincirine zincir dışı veri getirme konseptine odaklanmaktadır. Oracle'lar, varlık fiyatları, hava durumu bilgileri veya diğer gerçek dünya verileri gibi harici verileri blok zincirlere ve akıllı sözleşmelere güvenli bir şekilde aktaran aracılar olarak hizmet veren üçüncü taraf hizmetleridir. Ayrıca, geliştiricilerin Starknet ağındaki Pragma adlı belirli bir kahinle nasıl etkileşime girebileceğini gösteren pratik örnekler ve kod parçacıkları sağlar.
zh_cn: 本节重点阐述利用神器将离链数据带入史塔克内区块链的概念,甲骨文是第三方服务,作为中间人,安全地将资产价格、天气信息或其他真实世界数据等外部数据传送到链条和智能合同,并提供实际例子和代码片,说明开发商如何与斯塔克内区网络上名为Praggma的具体神器进行互动,涵盖诸如查询和处理价格数据以及可核实随机功能以生成随机数字等专题。

source: Price feeds enabled by an oracle serve as a bridge between real-world data feed and the blockchain. They provide real time pricing data that is aggregated from multiple trusted external sources ( e.g. crypto exchanges, financial data providers, etc. ) to the blockchain network.
es: Las fuentes de precios habilitadas por un oráculo sirven de puente entre la fuente de datos del mundo real y la cadena de bloques. Proporcionan datos de precios en tiempo real que se agregan de múltiples fuentes externas de confianza (por ejemplo, intercambios de criptogramas, proveedores de datos financieros, etc.) a la red de cadenas de bloques.
fr: Les flux de prix activés par un oracle servent de pont entre le flux de données du monde réel et la blockchain. Ils fournissent des données de tarification en temps réel qui sont agrégées à partir de sources externes de confiance multiples (par exemple, les échanges de crypto, les fournisseurs de données financières, etc.) au réseau de blockchain.
id: Feed harga yang diaktifkan oleh peramal berfungsi sebagai jembatan antara pakan data dunia nyata dan rantai blok. Mereka menyediakan data real time pricing yang dikumpulkan dari beberapa sumber eksternal terpercaya (mis. crypto pertukaran, penyedia data keuangan, dll.) ke jaringan blockchain.
tr: Bir kahin tarafından etkinleştirilen fiyat beslemeleri, gerçek dünya veri beslemesi ile blok zinciri arasında bir köprü görevi görür. Birden fazla güvenilir dış kaynaktan (örneğin kripto borsaları, finansal veri sağlayıcıları vb.) blok zinciri ağına toplanan gerçek zamanlı fiyatlandırma verileri sağlarlar.
zh_cn: 由甲骨文促成的价格供料是真实世界数据反馈与链链之间的桥梁,提供实时定价数据,这些数据从多个可信赖的外部来源(例如密码交换、金融数据提供者等)到链链网络汇总。

source: For the example in this book section, we will use Pragma Oracle to read the price feed for `ETH/USD` asset pair and also showcase a mini application that utilizes this feed.
es: Para el ejemplo en esta sección del libro, vamos a utilizar Pragma Oracle para leer la fuente de precio para el par de activos `ETH/USD` y también mostrar una mini aplicación que utiliza esta fuente.
fr: Pour l'exemple dans cette section de livre, nous allons utiliser Pragma Oracle pour lire le flux de prix de la paire d'actifs `ETH/USD` et aussi présenter une mini application qui utilise ce flux.
id: Sebagai contoh di bagian buku ini, kita akan menggunakan Pragma Oracle untuk membaca harga pakan untuk pasangan aset pokoknya dan juga menampilkan aplikasi mini yang menggunakan pakan ini.
tr: Bu kitap bölümündeki örnek için, ETH / USD varlık çifti için fiyat beslemesini okumak için Pragma Oracle'ı kullanacağız ve ayrıca bu beslemeyi kullanan bir mini uygulama sergileyeceğiz.
zh_cn: 例如,在本书节中,我们将使用Pragma Oracle阅读`ETH/USD'资产配对的价格饲料,并展示利用这种饲料的微型应用。

source: [Pragma Oracle](https://www.pragma.build/) is a leading zero knowledge oracle that provides access to off-chain data on Starknet blockchain in a verifiable way.
es: [Pragma Oracle](https://www.pragma.build/) es un oráculo de conocimiento cero líder que proporciona acceso a datos fuera de cadena en Starknet blockchain de una manera verificable.
fr: [Pragma Oracle](https://www.pragma.build/) est un oracle de connaissance de premier plan qui fournit un accès aux données hors chaîne sur Starknet blockchain d'une manière vérifiable.
id: [Pragma Oracle] Hawthornehttps://www.pragma.build/) adalah peramal tanpa pengetahuan terkemuka yang menyediakan akses ke off-chain data pada rantai blok Starknet dengan cara yang dapat diverifikasi.
tr: [Pragma Oracle](https://www.pragma.build/) Starknet blok zincirindeki zincir dışı verilere doğrulanabilir bir şekilde erişim sağlayan önde gelen bir sıfır bilgi kahinidir.
zh_cn: [Pragma Oracle] (https://www.pragma.building/)是一个领先的零知识神器,它以可核查的方式提供获取斯塔克内特块链上离链数据的途径。

source: Add Pragma as a Project Dependency
es: Añadir Pragma como dependencia del proyecto
fr: Ajouter Pragma comme dépendance au projet
id: Tambahkan Pragma sebagai Ketergantungan Proyek
tr: Proje Bağımlılığı Olarak Pragma Ekle
zh_cn: 将棱镜添加为项目依赖性

source: To get started with integrating Pragma on your Cairo smart contract for price feed data, edit your project's `Scarb.toml` file to include the path to use Pragma.
es: Para empezar a integrar Pragma en su contrato inteligente de El Cairo para datos de feed de precios, edite el archivo `Scarb.toml` de su proyecto para incluir la ruta para usar Pragma.
fr: Pour commencer avec l'intégration de Pragma sur votre contrat intelligent du Caire pour les données de flux de prix, modifiez le fichier `Scarb.toml` de votre projet pour inclure le chemin d'utilisation de Pragma.
id: Untuk memulai dengan mengintegrasikan Pragma pada kontrak cerdas Kairo Anda untuk data pakan harga, edit proyek Anda apos; s carb.tomlá file untuk memasukkan jalan untuk menggunakan Pragma.
tr: Fiyat besleme verileri için Kahire akıllı sözleşmenizde Pragma'yı entegre etmeye başlamak için, Pragma'yı kullanma yolunu içerecek şekilde projenizin Scarb.toml dosyasını düzenleyin.
zh_cn: 要开始将Pragma纳入您的开罗智能价格反馈数据合同, 请编辑您的项目 `Scarb.toml' 文件, 以包括使用 Pragma 路径 。

source: ```toml [dependencies] pragma_lib = { git = "https://github.com/astraly-labs/pragma-lib" } ```
fr: ```toml [dependences] pragma_lib = { git = "https://github.com/astraly-labs/pragma-lib" } ``
id: PRAGMA_lib = { git = "https://github.com/astraly-labs/pragma-lib" }
tr: toml [bağımlılar] pragma_lib = git = "https://github.com/astraly-labs/pragma-lib"
zh_cn: {git = "https://github.com/astraly-labs/pragma-lib"}}}}{grama_lib="https://gitub.com/astraly-labs/pragma-lib"}}}}{grama_lib={git="https://gitub.com/astraly-labs/pragma-lib"}}}}}{

source: Creating a Price Feed Contract
es: Creación de un contrato de suministro de precios
fr: Création d'un contrat de distribution de prix
id: Membuat Kontrak Asupan Harga
tr: Fiyat Besleme Sözleşmesi Oluşturmak
zh_cn: 订立价格饲料合同

source: After adding the required dependencies for your project, you'll need to define a contract interface that includes the required pragma price feed entry point.
es: Después de añadir las dependencias necesarias para su proyecto, tendrá que definir una interfaz de contrato que incluya el punto de entrada de entrada de precio de pragma requerido.
fr: Après avoir ajouté les dépendances requises pour votre projet, vous aurez besoin de définir une interface contractuelle qui inclut le point d'entrée pragma de prix requis.
id: Setelah menambahkan ketergantungan yang diperlukan bagi projek Anda, Anda perlu mendefinisikan antar muka kontrak yang mencakup titik masukan pakan pragma yang diperlukan.
tr: Projeniz için gerekli bağımlılıkları ekledikten sonra, gerekli pragma fiyat besleme giriş noktasını içeren bir sözleşme arayüzü tanımlamanız gerekir.
zh_cn: 在为您的项目添加所需的依赖关系之后, 您将需要定义一个合同界面, 包括所需的实用价格馈送切入点 。

source: Contract Interface
es: Interfaz de contrato
fr: Interface contractuelle
id: Antarmuka Kontrak
tr: Sözleşme Arayüzü
zh_cn: 合同接口

source: Of the two public functions exposed in the `IPriceFeedExample`, the one necessary to interact with the pragma price feed oracle is the `get_asset_price` function, a view function that takes in the `asset_id` argument and returns a `u128` value.
es: De las dos funciones públicas expuestas en el `IPriceFeedEjemplo`, la necesaria para interactuar con el oráculo de alimentación de precios de pragma es la función `get_asset_price`, una función de vista que toma el argumento `asset_id` y devuelve un valor `u128`.
fr: Parmi les deux fonctions publiques exposées dans le `IPriceFeedExample`, celle nécessaire pour interagir avec le pragma price feed oracle est la fonction `get_asset_price`, une fonction de vue qui prend dans l'argument `asset_id` et retourne une valeur `u128`.
id: Dari dua fungsi publik yang terpapar dalam fungsi ÉIPriceFeedExample, yang diperlukan untuk berinteraksi dengan pragma feed oracle adalah fungsi picture_priceFeed, fungsi tampilan yang mengambil dalam argumen ·asset_idà dan kembali nilai Áu128.
tr: IPriceFeedExample'da açığa çıkan iki kamu işlevinden, pragma fiyat besleme kahini ile etkileşime girmek için gerekli olan get_asset_price işlevi, asset_id argümanını alan ve u128 değerini döndüren bir görünüm fonksiyonudur.
zh_cn: 在`IPriceFeedExample'中暴露的两种公共职能中,与软体价格饲料或质谱互动所必需的一种是`get_asset_price'功能,一种在`asset_id'参数中取而代之的视图功能,并返回`u128'值。

source: Pragma Dependency Import to Contract
es: Importación al contrato de dependencia de Pragma
fr: Importation de Pragma Dépendance au contrat
id: Pragma Ketergantungan Impor ke Kontrak
tr: Pragma Bağımlılığı Sözleşmeye İthalat
zh_cn: 合同的进口

source: The snippet above shows the necessary imports you need to add to your contract module in order to interact with the Pragma oracle.
es: El fragmento anterior muestra las importaciones necesarias que necesita añadir a su módulo de contrato para interactuar con el oráculo de Pragma.
fr: L'extrait ci-dessus montre les importations nécessaires que vous devez ajouter à votre module de contrat afin d'interagir avec l'oracle Pragma.
id: snippet di atas menunjukkan impor yang diperlukan yang perlu Anda tambahkan ke modul kontrak Anda untuk berinteraksi dengan Pragma Oracle.
tr: Yukarıdaki snippet, Pragma kahini ile etkileşim kurmak için sözleşme modülünüze eklemeniz gereken gerekli ithalatı gösterir.
zh_cn: 上面的片段显示您需要添加到合同模块中的必要导入, 以便与 Praggma 甲骨文互动 。

source: Required Price Feed Function Impl in Contract
es: Precio requerido Función de alimentación Impl en contrato
fr: Requis fonction d'alimentation des prix Impl dans le contrat
id: Diperlukan Fungsi Feed Harga Impl dalam Kontrak
tr: Sözleşmede Gerekli Fiyat Besleme Fonksiyonu Impl
zh_cn: 合同中必需的价格进餐功能

source: // Retrieve the oracle dispatcher
es: // Recuperar el oracle despachador
fr: // Récupérer l'expéditeur d'oracle
id: #/ Retrie the oracle dispatcher
tr: // Kahin göndericiyi geri al
zh_cn: / 检索信器调度器

source: // Call the Oracle contract, for a spot entry
es: // Llame al contrato Oracle, para una entrada puntual
fr: // Appelez le contrat Oracle, pour une entrée ponctuelle
tr: // Nokta girişi için Oracle sözleşmesini arayın
zh_cn: 呼叫甲骨文合同, 抽空进入

source: The `get_asset_price` function is responsible for retrieving the price of the asset specified by the `asset_id` argument from Pragma Oracle. The `get_data_median` method is called from the `IPragmaDispatcher` instance by passing the `DataType::SpotEntry(asset_id)` as an argument and its output is assigned to a variable named `output` of type `PragmaPricesResponse`. Finally, the function returns the price of the requested asset as a `u128`.
es: La función `get_asset_price` es responsable de recuperar el precio del activo especificado por el argumento `asset_id` de Pragma Oracle. El método `get_data_median` se llama de la instancia `IPragmaDispatcher` pasando el `DataType::SpotEntry(asset_id)` como argumento y su salida se asigna a una variable llamada `output` del tipo `PragmaPricesResponse`. Por último, la función devuelve el precio del activo solicitado como `u128`.
fr: La fonction `get_asset_price` est responsable de la récupération du prix de l`actif spécifié par l`argument `asset_id` de Pragma Oracle. La méthode `get_data_median` est appelée à partir de l`instance `IPragmaDispatcher` en passant le `DataType::SpotEntry(asset_id)` comme argument et sa sortie est attribuée à une variable nommée `output` de type `PragmaPricesResponse`. Enfin, la fonction retourne le prix de l`actif demandé comme un `u128`.
id: Fungsi 'get'_asset_price_price' bertanggung jawab untuk mengambil harga aset yang dispesifikasikan oleh argumen dari Pragma Oracle. Metoda 'deta_median_median_median' disebut dari contoh ÉPIPragma Dispatcher. Akhirnya, fungsi tersebut mengembalikan harga yang diminta sebagai sebuah optimus_id_id) sebagai sebuah argumen dan hasilnya diberikan kepada variabel tipe pragmapricesReponse.
tr: get_asset_price işlevi, asset_id argümanı tarafından belirtilen varlığın fiyatının Pragma Oracle'dan alınmasından sorumludur. get_data_median yöntemi, IPragmaDispatcher örneğinden bir argüman olarak DataType::SpotEntry(asset_id) değerini geçerek çağrılır ve çıktısı bir değişkene atanır.
zh_cn: `get_asset_price' 函数负责从Pragma Oracle`asset_id'参数中收回`asset_id'参数中指明的资产价格,`get_data_medient'方法从`Itragma Dispatcher'实例中称为`get_dataType::SpotEntry(asset_id)'参数,其输出被指定给名为`PragmaPriccesResponse'类型“Exput”的变量。最后,该函数将请求资产的价格作为`u128'返回。

source: Example Application Using Pragma Price Feed
es: Ejemplo de aplicación con Pragma Price Feed
fr: Exemple d'application utilisant Pragma Price Feed
id: Contoh Aplikasi Dengan Asupan Pragma
tr: Pragma Fiyat Beslemesini Kullanarak Örnek Uygulama
zh_cn: 使用 Pragma 价格饲料的示例应用

source: // Calculate the amount of ETH needed
es: // Calcular la cantidad de ETH necesaria
fr: // Calculer la quantité d'ETH nécessaire
id: //Perhitungkan jumlah ETH yang dibutuhkan
tr: // Gerekli ETH miktarını hesaplayın
zh_cn: 计算需要的埃塞俄比亚(ETH)数量

source: // ETH Contract Address
es: // Dirección del contrato ETH
fr: // Adresse du contrat ETH
id: //Alamat Kontrak ETH
tr: // ETH Sözleşme Adresi
zh_cn: ETET 合同地址

source: // Transfer the ETH to the caller
es: // Transferir la ETH a la persona que llama
fr: // Transférer l'ETH à l'appelant
id: //Pindahkan ETH ke pemanggil
tr: // ETH'yi arayana aktar
zh_cn: 将ETH转至呼叫者

source: Note: Pragma returns the value of different token pairs using the decimal factor of 6 or 8. You can convert the value to the required decimal factor by dividing the value by \\( {10^{n}} \\), where `n` is the decimal factor.
es: Nota: Pragma devuelve el valor de diferentes pares de tokens usando el factor decimal de 6 o 8. Puede convertir el valor al factor decimal requerido dividiendo el valor por
fr: Note : Pragma retourne la valeur de différentes paires de jetons en utilisant le facteur décimal de 6 ou 8. Vous pouvez convertir la valeur en facteur décimal requis en divisant la valeur par \\( {10^{n}} \\), où `n` est le facteur décimal.
id: Catatan: Pragma mengembalikan nilai pasangan token yang berbeda menggunakan faktor desimal dari 6 atau 8. Anda dapat mengubah nilai ke faktor desimal yang diperlukan dengan membagi nilai dengan \\ Valencia {10^{n}} \\), di mana faktor desimal.
tr: Not: Pragma, 6 veya 8'in ondalık faktörünü kullanarak farklı jeton çiftlerinin değerini döndürür. n'nin ondalık faktör olduğu değeri ( 10n ) ile bölerek değeri gerekli ondalık faktöre dönüştürebilirsiniz.
zh_cn: 注意: Praggma 使用小数点为 6 或 8 的十进制系数返回不同象征性配对的值。您可以通过将数值除以\\ ({ 10\\\\\\\\) 来将数值转换为所需的小数系数,“n” 是小数点。

source: The code above is an example implementation of an applications consuming a price feed from the Pragma oracle. The contract imports necessary modules and interfaces, including the `IPragmaABIDispatcher` for interacting with the Pragma oracle contract and the `ERC20ABIDispatcher` for interacting with the ETH ERC20 token contract.
es: El código anterior es un ejemplo de aplicación de aplicaciones que consumen una fuente de precios del oráculo Pragma. El contrato importa módulos e interfaces necesarios, incluido el `IPragmaABIDispatcher` para interactuar con el contrato Pragma oracle y el `ERC20ABIDispatcher` para interactuar con el contrato simbólico ETH ERC20.
fr: Le code ci-dessus est un exemple d'applications consommant un flux de prix de l'oracle de Pragma. Le contrat importe les modules et interfaces nécessaires, y compris le `IPragmaABIDispatcher` pour interagir avec le contrat d'oracle de Pragma et le `ERC20ABIDispatcher` pour interagir avec le contrat de jeton ETH ERC20.
id: Kode di atas adalah sebuah implementasi contoh dari sebuah aplikasi yang mengkonsumsi umpan harga dari peramal Pragma. Kontrak ini mengimpor modul dan antarmuka yang diperlukan, termasuk ECHC20 token kontrak dengan ETHC20.
tr: Yukarıdaki kod, Pragma kahini'nden bir fiyat beslemesi tüketen bir uygulamanın örnek bir uygulamasıdır. Sözleşme, Pragma kahini sözleşmesi ve ETH ERC20 token sözleşmesi ile etkileşime girmek için IPragmaABIDispatcher dahil olmak üzere gerekli modülleri ve arayüzleri ithal eder.
zh_cn: 上面的代码是使用Praggma oracle的价格饲料的应用程序的一个实例,合同进口必要的模块和接口,包括用于与Praggma oracle合同互动的`IPragmaABIDispatcher'和用于与ETH ERRC20象征性合同互动的`ERC20ABIDispatcher'。

source: The contract has a `const` that stores the token pair ID of `ETH/USD`, and a `Storage` struct that holds two fields `pragma_contract` and `product_price_in_usd`. The constructor function initializes the `pragma_contract` address and sets the `product_price_in_usd` to 100.
es: El contrato tiene un `const` que almacena la identificación del par de fichas de `ETH/USD`, y una estructura `Almacenamiento` que contiene dos campos `pragma_contract` y `product_price_in_usd`. La función constructora inicializa la dirección `pragma_contract` y establece el `product_price_in_usd` a 100.
fr: Le contrat a un `const` qui stocke l'ID de paire de jetons de `ETH/USD`, et une structure `Storage` qui contient deux champs `pragma_contract` et `product_price_in_usd`. La fonction constructeur initialise l'adresse `pragma_contract` et définit le `product_price_in_usd` à 100.
id: Kontrak ini memiliki sebuah struktur yang menyimpan pasangan token ID dari ÉTH/USD, dan sebuah struktur yang memiliki dua bidang Ápragma_contractà dan Árect_usd_usd. Fungsi konstruktor menginisialisasi alamat ·ra_contractía dan mengatur alamat product_price_in_usd menjadi 100.
tr: Sözleşme, ETH/USD token çifti kimliğini depolayan bir const ve pragma_contract ve product_price_in_usd olmak üzere iki alanı tutan bir Storage yapısına sahiptir. Yapılandırıcı işlevi pragma_contract adresini başlatır ve product_price_in_usd değerini 100 olarak ayarlar.
zh_cn: 合同有一个`契约 ',储存`ETH/USD'的标牌对牌号,以及一个`标准'支架,该支架拥有两个字段`pragma_contract'和`product_price_in_usd'。构建符功能初始化了`pragma_contract'地址,并将`product_press_in_usd'设置为`product_press_in_usd'至100。
