Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: We can now decompose how these instructions are executed to understand what this code does:
es: Ahora podemos descomponer cómo se ejecutan estas instrucciones para entender lo que hace este código:
fr: Nous pouvons maintenant décomposer la façon dont ces instructions sont exécutées pour comprendre ce que fait ce code :
id: Sekarang kita bisa menguraikan bagaimana instruksi ini dijalankan untuk memahami apa kode ini lakukan:
tr: Şimdi bu kodun ne yaptığını anlamak için bu talimatların nasıl yürütüldüğünü ayrıştırabiliriz:
zh_cn: 我们现在可以分解这些指令是如何执行的 来理解这个代码会做什么:

source: `call rel 3`: this instruction increments the PC by 3 and executes the instruction at this location, which is `call rel 9` at `PC = 4`.
es: `llamada rel 3`: esta instrucción incrementa el PC en 3 y ejecuta la instrucción en este lugar, que es `llamada rel 9` en `PC = 4`.
fr: `appel rel 3`: cette instruction incrémente le PC par 3 et exécute l'instruction à cet endroit, qui est `appel rel 9` à `PC = 4`.
id: Panggilan rel 3: instruksi ini meningkatkan PC dengan 3 dan mengeksekusi instruksi di lokasi ini, yang adalah ·call rel 9 TM di åPC = 4.
tr: Call rel 3: Bu talimat PC'yi 3'e yükseltir ve PC = 4'de Call rel 9 olan talimatları bu konumda yürütür.
zh_cn: `召回 regl 3':本指令将个人电脑加增为3,并在此处执行指令,即`PC=4'的`call regl 9'。

source: `call rel 9` increments the PC by 9 and executes the instruction at `PC = 13`, which is actually line 9.
es: `call rel 9` incrementa el PC en 9 y ejecuta la instrucción en `PC = 13`, que es realmente la línea 9.
fr: `appel rel 9` incrémente le PC par 9 et exécute l'instruction à `PC = 13`, qui est en fait la ligne 9.
id: Hubungi rel 9Ul untuk meningkatkan PC pada 9 dan jalankan instruksi di ▪PC = 13, yang sebenarnya adalah baris 9.
tr: call rel 9, PC'yi 9 oranında artırır ve talimatı PC = 13'de yürütür, bu da aslında 9. satırdır.
zh_cn: `召回regl 9'将个人电脑加到9,并在`PC=13'执行指示,其实是第9行。

source: `[ap + 0] = 2, ap++`: `ap` stands for Allocation Pointer, which points to the first memory cell that has not been used by the program so far. This means we store the value `2` in the next free memory cell indicated by the current value of `ap`, after which we increment `ap` by 1. Then, we go to the next line which is `ret`.
es: `[ap + 0] = 2, ap: `ap` significa puntero de asignación, que apunta a la primera celda de memoria que no ha sido utilizada por el programa hasta ahora. Esto significa que almacenamos el valor `2` en la siguiente celda de memoria libre indicada por el valor actual de `ap`, después de lo cual incrementamos `ap` por 1. Luego, vamos a la siguiente línea que es `ret`.
fr: `[ap + 0] = 2, ap++`: `ap` désigne le pointeur d'attribution, qui pointe vers la première cellule mémoire qui n'a pas été utilisée jusqu'à présent par le programme. Cela signifie que nous conservons la valeur `2` dans la prochaine cellule mémoire libre indiquée par la valeur actuelle de `ap`, après quoi nous incrémentons `ap` par 1. Ensuite, nous allons à la ligne suivante qui est `ret`.
id: Ini berarti kita menyimpan nilai tersebut di sel memori bebas berikutnya yang ditunjukkan oleh nilai saat ini dari Alokasi Pointer, setelah itu kita naik 1.
tr: [ap + 0] = 2, ap++: ap, şimdiye kadar program tarafından kullanılmayan ilk bellek hücresine işaret eden Allocation Pointer'ı ifade eder. Bu, ap'nin mevcut değeri ile belirtilen bir sonraki ücretsiz bellek hücresinde ap değerini sakladığımız anlamına gelir, ardından ap'yi 1 ile arttırırız. Sonra, ret olan bir sonraki satıra geçeriz.
zh_cn: `[ap+0]=2, ap:`ap'表示分配指针,指第一个内存单元格,但迄今为止程序尚未使用,这意味着我们将`ap'表示的`2'值储存在下一个免费内存单元格中,以`ap'的当前值表示,之后我们增加`ap ',1。 然后,我们进入下一行,即`ret'。

source: `ret`: jumps back to the line after `call rel 9`, so we go to line 4.
es: `ret`: salta de nuevo a la línea después de `llamar a rel 9`, así que vamos a la línea 4.
fr: `ret`: saute vers la ligne après `appel rel 9`, donc nous allons à la ligne 4.
id: Kembali ke garis setelah panggilan ulang ke 9 jadi kita pergi ke baris 4.
tr: ret: call rel 9'dan sonra çizgiye geri atlar, böylece 4. çizgiye geçeriz.
zh_cn: `雷特':在`召回第9号'后回到线上,所以我们转到第4行。

source: `[ap + 0] = 1, ap++` : we store the value `1` in `[ap]` and we apply `ap++` so that `[ap - 1] = 1`. This means we now have `[ap-1] = 1, [ap-2] = 2` and we go to the next line.
es: `[ap + 0] = 1, ap : almacenamos el valor `1` en `[ap]` y aplicamos `ap de modo que `[ap - 1] = 1`. Esto significa que ahora tenemos `[ap-1] = 1, [ap-2] = 2` y vamos a la siguiente línea.
fr: `[ap + 0] = 1, ap++` : nous stockons la valeur `1` dans `[ap]` et nous appliquons `ap++` de sorte que `[ap - 1] = 1`. Cela signifie que nous avons maintenant `[ap-1] = 1, [ap-2] = 2` et nous allons à la ligne suivante.
id: Jadi kita akan pergi ke baris berikutnya. ini berarti kita memiliki [ap-1] = 1, [ap-2] dan kita pergi ke baris berikutnya.
tr: [ap + 0] = 1, ap++ : 1 değerini [ap] içinde saklarız ve ap++ uygulamasını uygularız, böylece [ap - 1] = 1 olur. Bu, şimdi [ap-1] = 1, [ap-2] = 2 değerine sahip olduğumuz ve bir sonraki satıra gittiğimiz anlamına gelir.
zh_cn: `[ap + 0 = 1, ap = 1:我们在`ap'中储存`1'值,我们应用`ap ',以便`[ap - 1]=1 ',这意味着我们现在有`[ap - 1]=1,[ap-2]=2 ',我们走下一行。

source: `[ap + 0] = [ap + -1] + [ap + -2], ap++`: we sum the values `1` and `2` and store the result in `[ap]`, and we apply `ap++` so the result is `[ap-1] = 3, [ap-2] = 1, [ap-3]=2`.
es: `[ap + 0] = [ap + -1] + [ap + -2], ap: sumamos los valores `1` y `2` y almacenamos el resultado en `[ap]`, y aplicamos `ap por lo que el resultado es `[ap-1] = 3, [ap-2] = 1, [ap-3]=2`.
fr: `[ap + 0] = [ap + -1] + [ap + -2], ap++`: nous additionnons les valeurs `1` et `2` et stockons le résultat dans `[ap]`, et nous appliquons `ap++` de sorte que le résultat est `[ap-1] = 3, [ap-2] = 1, [ap-3]=2`.
id: [ap + -1] + [ap + -2], ap++: kita jumlahkan nilai-nilainya, dan 2] dan simpan hasilnya dalam å[ap], dan kita terapkan ▪ap++ (ap-1] = 3, [ap] = 1, [ap-3]=2.
tr: [ap + 0] = [ap + -1] + [ap + -2], ap++: 1 ve 2 değerlerini toplamıyoruz ve sonucu [ap] olarak saklıyoruz ve ap++ uygulamasını uyguluyoruz, böylece sonuç [ap-1] = 3, [ap-2] = 1, [ap-3] = 2.
zh_cn: `[ap + 0] = [ap + -1] + [ap + -2], ap:我们对数值“1”和“2”进行总和,并将结果储存在`[ap]中,我们应用`ap =,结果为`[ap-1] = 3,[ap-2]=1,[ap-3]=2。

source: `ret`: jumps back to the line after `call rel 3`, so we go to line 2.
es: `ret`: salta de nuevo a la línea después de `llamar a rel 3`, así que vamos a la línea 2.
fr: `ret`: saute vers la ligne après `appel rel 3`, donc nous allons à la ligne 2.
id: Kembali ke garis setelah panggilan rel 3, jadi kita pergi ke baris 2.
tr: ret: call rel 3'den sonra çizgiye geri atlar, bu yüzden 2. çizgiye geçeriz.
zh_cn: `雷特':在`召回瑞特3'后回到线上,所以我们转到第2行。

source: `ret`: last instruction executed as there is no more `call` instruction where to jump right after. This is the actual return instruction of the Cairo `main` function.
es: `ret`: última instrucción ejecutada ya que no hay más instrucción `call` donde saltar justo después. Esta es la instrucción real de retorno de la función `main` de El Cairo.
fr: `ret`: dernière instruction exécutée car il n'y a plus d'instruction `appel` où sauter immédiatement après. Il s'agit de l'instruction réelle de retour de la fonction `main` du Caire.
id: Ini adalah instruksi kembali yang sebenarnya dari fungsi Kairo.
tr: ret: artık call talimatı olmadığı için gerçekleştirilen son talimat. Bu, Kahire main fonksiyonunun gerçek dönüş talimatıdır.
zh_cn: `ret':由于不再有`调用'指令而执行的最后指令。这是开罗`主要'功能的实际返回指令。

source: To summarize:
es: En resumen:
fr: Pour résumer :
id: Untuk meringkas:
tr: Özetlemek gerekirse:
zh_cn: 总结如下:

source: `call rel 3` corresponds to the `main` function, which is obviously not inlined.
es: " call rel 3 " corresponde a la función " principal ", que obviamente no está inlineada.
fr: `appel rel 3` correspond à la fonction `main`, qui n'est évidemment pas alignée.
id: Hubungi rel 3 dan sesuai dengan fungsinya, yang jelas-jelas tidak terinline.
tr: call rel 3, açıkça satır içi olmayan main işlevine karşılık gelir.
zh_cn: `call rel 3'对应的`主要'功能,显然没有内嵌。

source: `call rel 9` triggers the call the `not_inlined` function, which returns `2` and stores it at the final location `[ap-3]`.
es: `call rel 9` activa la función `not_inlined`, que devuelve `2` y la almacena en el lugar final `[ap-3]`.
fr: `call rel 9` déclenche l'appel de la fonction `not_inlined`, qui retourne `2` et le stocke à l'emplacement final `[ap-3]`.
id: Teleponlah Rel 9 reli memicu panggilan fungsi yang tidak terinline, yang kembali dan menyimpannya di lokasi akhir [ap-3].
tr: call rel 9, 2 döndüren ve [ap-3] son konumda depolayan not_inlined fonksiyonunun çağrısını tetikler.
zh_cn: `召回 recall rel 9'触发呼叫`not_inlined'函数,该函数返回`2 ',储存在最后地点`[ap-3]'。

source: The line 4 is the inlined code of the `inlined` function, which returns `1` and stores it at the final location `[ap-2]`. We clearly see that there is no `call` instruction in this case, because the body of the function is inserted and directly executed.
es: La línea 4 es el código inlineado de la función `inlined`, que devuelve `1` y lo almacena en la ubicación final `[ap-2]`. Vemos claramente que no hay instrucción `call` en este caso, porque el cuerpo de la función se inserta y se ejecuta directamente.
fr: La ligne 4 est le code aligné de la fonction `inlined`, qui retourne `1` et le stocke à l'emplacement final `[ap-2]`. Nous voyons clairement qu'il n'y a pas d'instruction `appel` dans ce cas, parce que le corps de la fonction est inséré et directement exécuté.
id: Garis 4 adalah kode yang diinline dari fungsi ·inlined, yang kembali ke nomor 1 dan menyimpannya di lokasi akhir [ap-2]. kita melihat dengan jelas bahwa tidak ada instruksi ·callé dalam kasus ini, karena badan fungsi dimasukkan dan langsung dieksekusi.
tr: 4. satır, 1 döndüren ve [ap-2] son konumda depolayan inlined fonksiyonunun satır içi kodudur. Bu durumda call talimatının olmadığını açıkça görüyoruz, çünkü fonksiyonun gövdesi takılı ve doğrudan çalıştırılıyor.
zh_cn: 第4行是`内嵌'函数的内嵌代码,返回`1 ',储存在最后地点`[ap-2] ',我们清楚地看到,在本案中没有`调用'指令,因为函数的体是插入并直接执行的。

source: After that, the sum is computed and we ultimately go back to the line 2 which contains the final `ret` instruction that returns the sum, corresponding to the return value of the `main` function.
es: Después de eso, la suma se calcula y en última instancia volvemos a la línea 2 que contiene la instrucción final `ret` que devuelve la suma, correspondiente al valor de retorno de la función `main`.
fr: Après cela, la somme est calculée et nous revenons finalement à la ligne 2 qui contient l'instruction finale `ret` qui renvoie la somme, correspondant à la valeur de retour de la fonction `main`.
id: Setelah itu, jumlahnya dihitung dan kami akhirnya kembali ke baris 2 yang berisi instruksi terakhir yang mengembalikan jumlah tersebut, sesuai dengan nilai kembali fungsinya.
tr: Bundan sonra, toplam hesaplanır ve sonuçta main fonksiyonunun dönüş değerine karşılık gelen toplamı döndüren son ret talimatını içeren satır 2'ye geri döneriz.
zh_cn: 在此之后,计算总和,我们最终回到第2行,该行载有最后的`ret'指示,该指示返回总和,与`主要'函数的返回值相对应。

source: It is interesting to note that in both Sierra code and Casm code, the `not_inlined` function will be called and executed before the body of the `inlined` function, even though the Cairo program executes `inlined() + not_inlined()`.
es: Es interesante señalar que tanto en el código Sierra como en el código Casm, la función `not_inlined` será llamada y ejecutada antes del cuerpo de la función `inlined`, aunque el programa El Cairo ejecute `inlined() + not_inlined()`.
fr: Il est intéressant de noter que dans le code Sierra et le code Casm, la fonction `not_inlined` sera appelée et exécutée avant le corps de la fonction `inlined`, même si le programme du Caire exécute `inlined() + not_inlined()`.
id: Sangat menarik untuk dicatat bahwa dalam kode Sierra maupun kode Casm, fungsi ·not_inlined) akan disebut dan dieksekusi sebelum tubuh fungsi Áinlined, meskipun program Kairo mengeksekusi Áinlined®) + bukan_inlined Allah.
tr: Hem Sierra kodunda hem de Casm kodunda, Kahire programı inlined() + not_inlined() çalıştırsa bile, not_inlined işlevinin inlined işlevinin gövdesinden önce çağrılacağını ve çalıştırılacağını belirtmek ilginçtir.
zh_cn: 值得注意的是,在Sierra代码和Casm代码中,在`Inlined'函数正文之前,将调用和履行`not_inlined'函数,尽管开罗方案执行`inlined()+not_inlined()'。

source: The Casm code of our program clearly shows that there is a function call for the `not_inlined` function, while the `inlined` function is correctly inlined.
es: El código Casm de nuestro programa muestra claramente que hay una llamada de función para la función `not_inlined`, mientras que la función `inlined` está correctamente alineada.
fr: Le code Casm de notre programme montre clairement qu'il y a un appel de fonction pour la fonction `not_inlined`, tandis que la fonction `inlined` est correctement alignée.
id: Kode Casm dari program kami dengan jelas menunjukkan bahwa ada panggilan fungsi untuk fungsi ånot_inlinedé, sementara fungsi ·inlinedé benar-benar diinline.
tr: Programımızın Casm kodu, not_inlined işlevi için bir işlev çağrısı olduğunu açıkça gösterirken, inlined işlevi doğru sıralanmıştır.
zh_cn: 我们程序的 Casm 代码清楚地显示,有一个函数需要“非内嵌”函数,而“内嵌”函数的内嵌正确。

source: Additional Optimizations
es: Optimizaciones adicionales
fr: Optimisations supplémentaires
id: Optimasi Tambahan
tr: Ek Optimizasyonlar
zh_cn: 额外优化

source: Let's study another program that shows other benefits that inlining may sometimes provide. Listing 11-4 shows a Cairo program that calls 2 functions and doesn't return anything:
es: Vamos a estudiar otro programa que muestra otros beneficios que el inlining puede a veces proporcionar. Listar 11-4 muestra un programa de El Cairo que llama a 2 funciones y no devuelve nada:
fr: Étudions un autre programme qui montre d'autres avantages que l'inline peut parfois fournir. Listing 11-4 montre un programme du Caire qui appelle 2 fonctions et ne retourne rien:
id: Mari kita mempelajari program lain yang menunjukkan manfaat lain bahwa inlining kadang-kadang dapat menyediakan.
tr: İnlining'in bazen sağlayabileceği diğer faydaları gösteren başka bir programı inceleyelim. 11-4'ü listelemek, 2 işlevi çağıran ve hiçbir şey döndürmeyen bir Kahire programını gösterir:
zh_cn: 让我们研究另一个显示内衬有时可能提供的其他好处的方案。 列出 11 - 4 显示一个开罗方案, 它需要 2 功能, 没有任何回报 :

source: <span class="caption">Listing 11-4: A small Cairo program that calls `inlined` and `not_inlined` and doesn't return any value.</span>
es: <span class="caption">Lista 11-4: Un pequeño programa de El Cairo que llama a `inlined` y `not_inlined` y no devuelve ningún valor.</span>
fr: <span class="caption">Liste 11-4: Un petit programme du Caire qui appelle `inlined` et `not_inlined` et ne retourne aucune valeur.</span>
id: <span class="caption">Listing 11-4: Sebuah program Kairo kecil yang memanggil [inlined] dan tidak_inlinedán dan tidak mengembalikan nilai apapun.</span>
tr: span class="caption">Liste 11-4: inlined ve not_inlined olarak adlandırılan ve herhangi bir değer döndürmeyen küçük bir Kahire programı./span>
zh_cn: <span类=“caption” > listing 11-4:一个称为“Inlined”和“not_inlined”且不返回任何值的小型开罗方案。 </span>

source: Here is the corresponding Sierra code:
es: Aquí está el código correspondiente de Sierra:
fr: Voici le code Sierra correspondant:
id: Berikut ini adalah kode Sierra yang sesuai:
tr: İşte buna karşılık gelen Sierra kodu:
zh_cn: 以下是相应的Sierra代码:

source: In this specific case, we can observe that the compiler has applied additional optimizations to the `main` function of our code : the code of the `inlined` function, which is annotated with the `#[inline(always)]` attribute, is actually not copied in the `main` function. Instead, the `main` function starts with the `function_call` libfunc to call the `not_inlined` function, entirely omitting the code of the `inlined` function.
es: En este caso concreto, podemos observar que el compilador ha aplicado optimizaciones adicionales a la función `main` de nuestro código: el código de la función `inlined`, que está anotado con el atributo `[inline(always)]`, en realidad no se copia en la función `main`. En cambio, la función `main` comienza con la función `function_call` libfunc para llamar a la función `not_inlined`, omitiendo totalmente el código de la función `inlined`.
fr: Dans ce cas précis, nous pouvons observer que le compilateur a appliqué des optimisations supplémentaires à la fonction `main` de notre code : le code de la fonction `inlined`, qui est annoté avec l'attribut `#[inline(toujours)]`, n'est en fait pas copié dans la fonction `main`. Au lieu de cela, la fonction `main` commence par la fonction `fonction_call` libfunc pour appeler la fonction `not_inlined`, en omettant totalement le code de la fonction `inlined`.
id: Dalam kasus spesifik ini, kita dapat mengamati bahwa kompiler telah menerapkan optimasi tambahan untuk fungsi kode kita: kode dari fungsi ·inlined, yang telah dianotasi dengan fungsi ▪#[inline kalians] atribut tambahan, sebenarnya tidak disalin dalam fungsi thosemain. Sebaliknya, fungsi ·mainía dimulai dengan fungsi fungsi fungsi fungsi fungsi ófunction_call libfunc untuk memanggil fungsi åno_inlined, seluruhnya menghilangkan kode fungsi ıinlined.
tr: Bu özel durumda, derleyicinin kodumuzun main fonksiyonuna ek optimizasyonlar uyguladığını gözlemleyebiliriz: #[inline(hep)] özniteliği ile belirtilen inline işlevinin kodu, aslında main işlevinde kopyalanmaz. Bunun yerine, main işlevi, main işlevini çağırmak için function_callfunc ile başlar.
zh_cn: 在此具体情况下,我们可以观察到,汇编者对我们代码的`主要'功能应用了额外的优化:`内含'函数的代码,加上`内含(线性)'属性的注释,实际上没有在`内含(线性)'函数中复制,而`主要'函数从`职能'呼唤`libfunc调用`非线性'函数开始,完全省略了`内含(线性)'函数的代码。

source: Because `inlined` return value is never used, the compiler optimizes the `main` function by skipping the `inlined` function code. This will actually reduce the code length while reducing the number of steps required to execute `main`.
es: Dado que el valor de retorno `inlined` nunca se utiliza, el compilador optimiza la función `main` omitiendo el código de función `inlined`. Esto reducirá la longitud del código al tiempo que reduce el número de pasos necesarios para ejecutar `main`.
fr: Comme la valeur de retour `inlined` n'est jamais utilisée, le compilateur optimise la fonction `main` en sautant le code de fonction `inlined`. Cela réduira en fait la longueur du code tout en réduisant le nombre d'étapes nécessaires pour exécuter `main`.
id: Karena nilai kembali yang diinline tidak pernah digunakan, kompiler mengoptimalkan fungsi ımain dengan melewatkan kode fungsi ·inlined. Ini akan benar-benar mengurangi panjang kode ketika mengurangi jumlah langkah yang diperlukan untuk mengeksekusi ·main.
tr: inlined dönüş değeri asla kullanılmadığı için, derleyici inlined fonksiyon kodunu atlayarak main işlevini optimize eder. Bu, main çalıştırmak için gereken adımların sayısını azaltırken aslında kod uzunluğunu azaltacaktır.
zh_cn: 由于“内含”返回值从未使用,汇编者通过跳过“内含”函数代码优化了“主要”功能,这将实际上缩短代码长度,同时减少执行“主要”所需步骤的数量。

source: In contrast, line 0 uses the `function_call` libfunc to execute the `not_inlined` function normally. This means that all the code from lines 7 to 8 will be executed:
es: Por el contrario, la línea 0 utiliza el libfunc `function_call` para ejecutar la función `not_inlined` normalmente. Esto significa que todo el código de las líneas 7 a 8 se ejecutará:
fr: En revanche, la ligne 0 utilise la fonction `fonction_call` libfunc pour exécuter la fonction `not_inlined` normalement. Cela signifie que tous les codes des lignes 7 à 8 seront exécutés :
id: Sebagai kontras, baris 0 menggunakan fungsi dari libfunc untuk menjalankan fungsi yang tidak terinline secara normal. Ini berarti bahwa semua kode dari baris 7 sampai 8 akan dijalankan:
tr: Buna karşılık, 0 satırı not_inlined işlevini normal olarak yürütmek için func_call libfunc kullanır. Bu, 7 ila 8 satırları arasındaki tüm kodun çalıştırılacağı anlamına gelir:
zh_cn: 相比之下,第0行通常使用“函数呼叫” libfunc来执行“非线性”函数。 这意味着从行7到行8的所有代码都将被执行:

source: This value stored in the variable with id `0` is then dropped on line 1, as it is not used in the `main` function:
es: Este valor almacenado en la variable con id `0` se deja caer en la línea 1, ya que no se utiliza en la función `main`:
fr: Cette valeur stockée dans la variable avec id `0` est ensuite supprimée à la ligne 1, car elle n'est pas utilisée dans la fonction `main`:
id: Nilai ini disimpan dalam variabel dengan id those0 kemudian didrop di baris 1, karena tidak digunakan dalam fungsi åmain:
tr: id 0 ile değişkende depolanan bu değer daha sonra main işlevinde kullanılmadığı için 1 satırına bırakılır:
zh_cn: 此值储存在有 id'0'的变量中的变量中,然后在第1行下调,因为该值未用于“主要”函数:

source: Finally, as the `main` function doesn't return any value, a variable of unit type `()` is created and returned:
es: Por último, como la función `main` no devuelve ningún valor, se crea y devuelve una variable de tipo de unidad `()`:
fr: Enfin, comme la fonction `main` ne renvoie aucune valeur, une variable du type d'unité `()` est créée et renvoyée :
id: Akhirnya, karena fungsi ımain tidak mengembalikan nilai apapun, sebuah variabel dari tipe satuan diciptakan dan dikembalikan:
tr: Son olarak, main işlevi herhangi bir değer döndürmediği için, () birim tipinin bir değişkeni oluşturulur ve döndürülür:
zh_cn: 最后,由于`主要'函数不返回任何价值,因此创建并返回了`()'类型单位的变量:

source: Inlining is a compiler optimization technique that can be very useful in various situations. Inlining a function allows to get rid of the overhead of calling a function with the `function_call` libfunc by injecting the Sierra code directly in the caller function's context, while potentially optimizing the Sierra code executed to reduce the number of steps. If used effectively, inlining can even reduce code length as shown in the previous example.
es: Inlining es una técnica de optimización del compilador que puede ser muy útil en varias situaciones. Inlining una función permite deshacerse de la sobrecarga de llamar a una función con el libfunc `función_call` inyectando el código Sierra directamente en el contexto de la función de llamada, mientras que potencialmente optimiza el código Sierra ejecutado para reducir el número de pasos. Si se utiliza eficazmente, inlining puede incluso reducir la longitud del código como se muestra en el ejemplo anterior.
fr: L'inline est une technique d'optimisation du compilateur qui peut être très utile dans diverses situations. L'inline d'une fonction permet de se débarrasser des frais généraux d'appel d'une fonction avec la fonction `fonction_call` libfunc en injectant le code Sierra directement dans le contexte de la fonction appelante, tout en optimisant potentiellement le code Sierra exécuté pour réduire le nombre d'étapes.
id: Inlining adalah teknik compiler optimasi yang dapat sangat berguna dalam berbagai situasi. Menginlining sebuah fungsi memungkinkan untuk menghapus overhead dari memanggil sebuah fungsi dengan libfunc æui dengan menyuntikkan kode Sierra langsung dalam konteks fungsi pemanggil, sementara berpotensi mengoptimalisasi kode Sierra dieksekusi untuk mengurangi jumlah langkah. Jika digunakan secara efektif, inlining bahkan dapat mengurangi panjang kode seperti yang ditunjukkan dalam contoh sebelumnya.
tr: İnlining, çeşitli durumlarda çok yararlı olabilecek bir derleyici optimizasyon tekniğidir. Bir fonksiyonun inlining edilmesi, Sierra kodunu doğrudan arayan fonksiyonun bağlamına enjekte ederek function_call libfunc ile bir fonksiyonu çağırmanın yükünden kurtulmayı sağlarken, potansiyel olarak adımların sayısını azaltmak için çalıştırılan Sierra kodunu optimize eder. Etkili kullanılırsa, inlining önceki örnekte gösterildiği gibi kod uzunluğunu bile azaltabilir.
zh_cn: 内衬是一种编译优化技术,在不同情况下非常有用。 外衬功能可以将调用功能的“ 函数呼叫’ libfunc” 的间接责任消除, 直接将 Sierra 代码插入调用函数的背景中, 同时有可能优化执行的Sierra 代码以减少步骤数量。 如果有效使用, 内衬甚至可以降低前一个示例所示的代码长度 。
