Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The new `largest_list` function includes in its definition the requirement that whatever generic type is placed there, it must be droppable. This is what we call _trait bounds_. The `main` function remains unchanged, the compiler is smart enough to deduce which concrete type is being used and if it implements the `Drop` trait.
es: La nueva función `largest_list` incluye en su definición el requisito de que cualquiera que sea el tipo genérico que se coloque allí, debe ser droppable. Esto es lo que llamamos _trait limits_. La función `main` permanece inalterada, el compilador es lo suficientemente inteligente como para deducir qué tipo de concreto se está utilizando y si implementa el rasgo `Drop`.
fr: La nouvelle fonction `plus grande_liste` inclut dans sa définition l'exigence que tout type générique y soit placé, il doit être droppable. C'est ce que nous appelons _trait limits_. La fonction `main` reste inchangée, le compilateur est assez intelligent pour déduire quel type de béton est utilisé et s'il implémente le caractère `Drop`.
id: Fungsi _list_list_besar baru termasuk dalam definisinya persyaratan bahwa jenis generik apa pun ditempatkan di sana, itu harus droppable. Ini adalah apa yang kita sebut _trait bounds_. Fungsi æuía tetap tidak berubah, compiler cukup pintar untuk menyimpulkan jenis beton mana yang digunakan dan jika alat itu menerapkan sifat.
tr: Yeni en büyük_list işlevi tanımında, hangi jenerik tip oraya yerleştirilirse yerleştirilsin, bırakılabilir olması zorunluluğunu içerir. Buna _trait limits_ diyoruz. main fonksiyonu değişmeden kalır, derleyici hangi beton tipinin kullanıldığını ve Drop özelliğini uygularsa uygulayacak kadar akıllıdır.
zh_cn: 新的 " 最大清单 " 功能的定义包括以下要求:无论放在哪里的通用类型,它必须是可投放的。这就是我们所称的`trait边框'。`主要'功能保持不变,汇编者足够聪明,可以推断使用的是哪种具体类型,如果它执行`滴滴'特性。

source: Constraints for Generic Types
es: Limitaciones para los tipos genéricos
fr: Contraintes pour les types génériques
id: Kendala bagi Tipe Generik
tr: Genel Tipler için Kısıtlamalar
zh_cn: 通用类型限制

source: When defining generic types, it is useful to have information about them. Knowing which traits a generic type implements allows us to use it more effectively in a function's logic at the cost of constraining the generic types that can be used with the function. We saw an example of this previously by adding the `TDrop` implementation as part of the generic arguments of `largest_list`. While `TDrop` was added to satisfy the compiler's requirements, we can also add constraints to benefit our function logic.
es: Al definir los tipos genéricos, es útil tener información sobre ellos. Conocer qué rasgos de un tipo genérico implementa nos permite utilizarlo más eficazmente en la lógica de una función a costa de limitar los tipos genéricos que se pueden utilizar con la función. Vemos un ejemplo de esto anteriormente añadiendo la aplicación `TDrop'como parte de los argumentos genéricos de `largest_list`. Si bien `TDrop'se añadió para satisfacer los requisitos del compilador, también podemos añadir limitaciones para beneficiar nuestra lógica de funciones.
fr: En définissant des types génériques, il est utile d'avoir des informations à leur sujet. Savoir quels caractères d'un type générique nous permet de l'utiliser plus efficacement dans la logique d'une fonction au prix de restreindre les types génériques qui peuvent être utilisés avec la fonction. Nous avons vu un exemple de cela précédemment en ajoutant l'implémentation `TDrop` dans le cadre des arguments génériques de `plus important_list`. Alors que `TDrop` a été ajouté pour satisfaire les exigences du compilateur, nous pouvons également ajouter des contraintes pour bénéficier de notre logique de fonction.
id: Ketika mendefinisikan tipe generik, sangat berguna untuk memiliki informasi tentang mereka. Mengetahui sifat mana yang diimplementasikan suatu tipe umum memungkinkan kita untuk menggunakannya lebih efektif dalam logika fungsi dengan biaya membatasi jenis umum yang dapat digunakan dengan fungsi. kita melihat contoh ini sebelumnya dengan menambahkan implementasi ÁTDROP bertautan sebagai bagian dari argumen umum Ást_listé. Sementara ÁTROP (penguasa umum) ditambahkan untuk memenuhi persyaratan kompiler, kita juga dapat menambahkan batasan untuk membantu logika fungsi kita.
tr: Jenerik tipleri tanımlarken, onlar hakkında bilgi sahibi olmak yararlıdır. Jenerik tip uygulamalarının hangi özellikleri olduğunu bilmek, fonksiyonla birlikte kullanılabilecek jenerik tipleri kısıtlama pahasına bir fonksiyonun mantığında daha etkili bir şekilde kullanmamızı sağlar. Best_list'in jenerik argümanlarının bir parçası olarak TDrop uygulamasını ekleyerek daha önce bunun bir örneğini gördük. Fonksiyon kısıtlamalarını karşılamak için TDrop eklenirken, derleyici gereksinimlerimizi de ekleyebiliriz.
zh_cn: 在界定通用类型时,掌握有关通用类型的信息是有益的。了解通用类型工具的特性,使我们能够在功能逻辑中更有效地使用该功能,而代价是限制该功能可以使用的通用类型。我们以前曾看到过这方面的一个例子,在`大列表'的通用论据中增加了`TDrop'执行。虽然增加`TDrop'是为了满足汇编者的要求,但我们也可以增加一些制约,以利我们的功能逻辑。

source: Imagine that we want, given a list of elements of some generic type `T`, to find the smallest element among them. Initially, we know that for an element of type `T` to be comparable, it must implement the `PartialOrd` trait. The resulting function would be:
es: Imagínese que, dada una lista de elementos de algún tipo genérico `T`, queremos encontrar el elemento más pequeño entre ellos. Inicialmente, sabemos que para que un elemento de tipo `T` sea comparable, debe implementar el rasgo `PartialOrd`. La función resultante sería:
fr: Imaginez que nous voulons, avec une liste d'éléments de certains types génériques `T`, trouver le plus petit élément parmi eux. Initialement, nous savons que pour qu'un élément de type `T` soit comparable, il doit mettre en œuvre le caractère `PartialOrd`. La fonction résultante serait:
id: Bayangkan bahwa kita ingin, mengingat daftar unsur-unsur dari beberapa jenis generik, untuk menemukan elemen terkecil di antara mereka.
tr: Bazı jenerik tip T elemanlarının bir listesi göz önüne alındığında, aralarında en küçük elemanı bulmak istediğimizi düşünün. Başlangıçta, T tipi bir elemanın karşılaştırılabilir olması için PartialOrd özelliğini uygulaması gerektiğini biliyoruz. Ortaya çıkan işlev:
zh_cn: 想象一下,如果有一份`T'类的通用元素清单,我们想要找到其中最小元素。起初,我们知道,要使`T'类的元素具有可比性,它必须具有`部分命令'特性。

source: // Given a list of T get the smallest one // The PartialOrd trait implements comparison operations for T
es: // Dada una lista de T obtener el más pequeño // El rasgo ParcialOrd implementa operaciones de comparación para T
fr: // Vu une liste de T obtenir le plus petit // Le caractère PartialOrd implémente des opérations de comparaison pour T
id: //Diberikan daftar T mendapatkan yang terkecil satu /The ParsialOrd sifat mengimplementasikan operasi perbandingan untuk T
tr: // T'nin bir listesi verildiğinde en küçük olanı elde edin // Parsiyel Ord özelliği, T için karşılaştırma işlemlerini uygular
zh_cn: / 部分字母特性执行T类的比较操作。

source: // This represents the smallest element through the iteration // Notice that we use the desnap (*) operator
es: // Esto representa el elemento más pequeño a través de la iteración // Note que usamos el operador de desnap (*)
fr: // Ceci représente l'élément le plus petit à travers l'itération // Notez que nous utilisons l'opérateur desnap (*)
id: //Ini merepresentasikan elemen terkecil melalui iterasi / // Perhatikan bahwa kita menggunakan operator desnap (*)
tr: // Bu, yineleme yoluyla en küçük elemanı temsil eder // Desnap (*) operatörünü kullandığımıza dikkat edin
zh_cn: 这是通过迭代//通知中最小的元素, 即我们使用稀释 (*) 操作员

source: // The index we will use to move through the list
es: // El índice que usaremos para movernos a través de la lista
fr: // L'index que nous utiliserons pour passer à travers la liste
id: # # The indeks we will use to move through the list
tr: // Listede gezinmek için kullanacağımız indeks
zh_cn: / 用于在列表中移动的索引

source: // Iterate through the whole list storing the smallest
es: // Iterar a través de toda la lista almacenando el más pequeño
fr: // Itérer à travers toute la liste en stockant le plus petit
id: //Tuliskan melalui seluruh daftar menyimpan yang terkecil
tr: // En küçükleri depolayan tüm liste boyunca yinele
zh_cn: / 通过整个列表循环 存储最小的

source: // We need to specify that we are passing a snapshot of `list` as an argument
es: // Tenemos que especificar que estamos pasando una instantánea de `lista` como argumento
fr: // Nous devons spécifier que nous passons un instantané de `list` comme argument
id: /Kita perlu menentukan bahwa kita melewati snapshot dari ælisté sebagai argumen
tr: // list'nin bir anlık görüntüsünü bir argüman olarak aktardığımızı belirtmemiz gerekir.
zh_cn: 我们需要具体说明,我们正在以`清单'为论据简略描述一下`清单'

source: The `smallest_element` function uses a generic type `T` that implements the `PartialOrd` trait, takes a snapshot of an `Array<T>` as a parameter and returns a copy of the smallest element. Because the parameter is of type `@Array<T>`, we no longer need to drop it at the end of the execution and so we are not required to implement the `Drop` trait for `T` as well. Why does it not compile then?
es: La función `small_element` utiliza un tipo genérico `T` que implementa el rasgo `PartialOrd`, toma una instantánea de un `Array<T® como parámetro y devuelve una copia del elemento más pequeño. Debido a que el parámetro es del tipo `Array<T`, ya no necesitamos soltarlo al final de la ejecución y por lo tanto no estamos obligados a implementar el rasgo `Drop` para `T` también. ¿Por qué no se compila entonces?
fr: La fonction `smallest_element` utilise un type générique `T` qui implémente le caractère `PartialOrd`, prend un instantané d'un `Array<T>` comme paramètre et retourne une copie du plus petit élément. Parce que le paramètre est de type `@Array<T>`, nous n'avons plus besoin de le déposer à la fin de l'exécution et donc nous ne sommes pas tenus d'implémenter le caractère `Drop` pour `T` aussi bien. Pourquoi ne pas compiler alors?
id: Fungsi umumnya menggunakan tipe umum yang menerapkan sifat "Partial Ord," mengambil snapshot dari sebuah array<T> sebagai sebuah parameter dan mengembalikan salinan dari elemen terkecil. Karena parameternya bertipe tipe atau Array<T>, kita tidak perlu lagi menjatuhkannya pada akhir eksekusi dan jadi kita tidak diharuskan menerapkan sifat irpropánebi untuk saat itu juga. Mengapa tidak disusun kemudian?
tr: smallest_element işlevi, PartialOrd özelliğini uygulayan, bir ArrayT> görüntüsünü parametre olarak alan ve en küçük elemanın bir kopyasını döndüren jenerik bir T tipini kullanır. Parametre ArrayT> türü olduğu için, neden yürütmenin sonunda bırakmamız gerekmez ve bu nedenle Drop özelliğini derlememiz gerekmez?
zh_cn: `小型'函数使用通用类型`T ',用于执行`部分字母'特性,将`Array<T'缩影作为参数,并返回最小元素的复制件。由于该参数属于'Array<T'类型,因此我们不再需要在执行结束时丢弃该参数,因此我们不必也执行`T'的`滴滴'特性。为什么它当时没有编译?

source: When indexing on `list`, the value results in a snap of the indexed element, and unless `PartialOrd` is implemented for `@T` we need to desnap the element using `*`. The `*` operation requires a copy from `@T` to `T`, which means that `T` needs to implement the `Copy` trait. After copying an element of type `@T` to `T`, there are now variables with type `T` that need to be dropped, requiring `T` to implement the `Drop` trait as well. We must then add both `Drop` and `Copy` traits implementation for the function to be correct. After updating the `smallest_element` function the resulting code would be:
es: Al indizar en `lista`, el valor resulta en una instantánea del elemento indexado, y a menos que `PartialOrd` se aplique para `T` tenemos que desactivar el elemento usando `*`. La operación `*` requiere una copia de `T` a `T`, lo que significa que `T` necesita implementar el rasgo `Copy`. Después de copiar un elemento de tipo `T` a `T`, ahora hay variables con el tipo `T` que deben ser eliminadas, requiriendo `T` para implementar el rasgo `Drop` también. A continuación, debemos añadir los rasgos `Drop` y `Copy` para que la función sea correcta. Después de actualizar la función `pequeño_element` el código resultante sería:
fr: Lors de l'indexation sur `list`, l'opération `*` nécessite une copie de `@T` à `T`, ce qui signifie que `T` doit implémenter le caractère `Copy`. Après avoir copié un élément de type `@T` à `T`, il y a maintenant des variables avec le type `T` qui doivent être supprimées, exigeant `T` pour implémenter le caractère `Drop` aussi. Nous devons ensuite ajouter à la fois l'implémentation `Drop` et `Copy` pour que la fonction soit correcte. Après la mise à jour de la fonction `smallest_element`, le code résultant serait:
id: Ketika meng-indeks pada daftar, nilai yang dihasilkan dalam penyerapan elemen terindeks, dan kecuali jika 'Partial Ord' diimplementasikan untuk sifat 'product' kita perlu mengubah elemen tersebut menggunakan \t\. Operasi ini memerlukan salinan dari ▪T), yang berarti bahwa kita harus mengimplementasikan sifat ▪T. Setelah menyalin elemen ke tipe níT, sekarang ada variabel dengan tipe yang perlu diturunkan, yang membutuhkan untuk mengimplementasikan sifat tersebut.
tr: list üzerinde indekslenirken, değer endeksli elemanın bir çırpıda sonuçlanır ve PartialOrd T için uygulanmadığı sürece, * fonksiyonunu kullanarak öğeyi çözmemiz gerekir. T'den T'ye bir kopya gerekir, bu da T'nin Copy özelliğinin uygulanması gerektiği anlamına gelir.
zh_cn: 在`清单'上编制索引时,数值导致指数元素的断裂,除非`部分Ord'为`T'执行`部分Ord ',我们需要使用```T'来取消该元素。该操作要求从`T'复制一份到`T ',这意味着`T'需要执行`Copy'特性。在将`T'类型`T'类型要素复制到`T'之后,现在有需要删除的`T'类型的变量,需要`T'执行`Drop'特性。然后,我们必须增加`Drop'和`Copy'特性执行,以使函数正确。在更新`Smest_emint'函数后,由此产生的代码将:

source: Anonymous Generic Implementation Parameter (`+` Operator)
es: Parámetro Anónimo Genérico de Implementación ( Operador)
fr: Paramètre de mise en œuvre générique anonyme (opérateur`+`)
id: Parameter Implementasi Generik Anonymous (Neunim + Operator)
tr: Anonim Genel Uygulama Parametresi (+ Operatörü)
zh_cn: 匿名通用执行参数(接线员)

source: Until now, we have always specified a name for each implementation of the required generic trait: `TPartialOrd` for `PartialOrd<T>`, `TDrop` for `Drop<T>`, and `TCopy` for `Copy<T>`.
es: Hasta ahora, siempre hemos especificado un nombre para cada aplicación del rasgo genérico requerido: " TPartialOrd " para " PartialOrd ", " TDrop " para " Drop ", y " Tcopy " para " Copy ".
fr: Jusqu'à présent, nous avons toujours spécifié un nom pour chaque application du caractère générique requis : `TPartialOrd` pour `PartialOrd<T>`, `TDrop` pour `Drop<T>` et `TCopy` pour `Copy<T>`.
id: Sampai sekarang, kita selalu menentukan nama untuk setiap implementasi sifat umum yang diperlukan: ÁTPartialOrd untuk ÁPartialOrd<T>, ÁTDROPOPE untuk (DROP) <T>, dan UBJUK) untuk <T>.
tr: Şimdiye kadar, gerekli genel özelliğin her bir uygulaması için her zaman bir isim belirledik: PartialOrdT> için TPartialOrd, Drop için Drop, CopyT> için TCopy.
zh_cn: 迄今为止,我们一直为每个执行所需的通用特性指定名称:`部分Ord < T'的`PartialOrd'、`Drop < T'的`TDrop'和`Copy < T'的`TCopy'。

source: However, most of the time, we don't use the implementation in the function body; we only use it as a constraint. In these cases, we can use the `+` operator to specify that the generic type must implement a trait without naming the implementation. This is referred to as an _anonymous generic implementation parameter_.
es: Sin embargo, la mayoría de las veces, no usamos la implementación en el cuerpo de la función; sólo la usamos como restricción. En estos casos, podemos usar el operador para especificar que el tipo genérico debe implementar un rasgo sin nombrar la implementación. Esto se conoce como un parámetro de implementación genérico _anónimo_.
fr: Cependant, la plupart du temps, nous n'utilisons pas l'implémentation dans le corps de la fonction; nous ne l'utilisons que comme contrainte. Dans ces cas, nous pouvons utiliser l'opérateur `+` pour spécifier que le type générique doit implémenter un trait sans nommer l'implémentation. Ceci est appelé un paramètre d'implémentation générique _anonyme_.
id: Namun, sebagian besar waktu, kita tidak menggunakan implementasi dalam tubuh fungsi; kita hanya menggunakannya sebagai kendala. Dalam kasus ini, kita dapat menggunakan operator á+ (transporter) untuk menyatakan bahwa tipe umum harus mengimplementasikan suatu sifat tanpa menyebutkan implementasi. Ini disebut sebagai sebuah parameter umum yang umum _anomous.
tr: Bununla birlikte, çoğu zaman, uygulamayı işlev gövdesinde kullanmıyoruz; sadece bir kısıtlama olarak kullanıyoruz. Bu durumlarda, + operatörünü, jenerik tipin uygulamayı adlandırmadan bir özellik uygulaması gerektiğini belirtmek için kullanabiliriz. Bu, _anonim jenerik uygulama parametresi_ olarak adlandırılır.
zh_cn: 然而,大部分时间, 我们不使用函数机体中的执行; 我们只使用它作为制约。 在这些情况下, 我们可以使用 {{} {} {} 操作员来指定通用类型必须执行特性而不命名执行 。 这被称为 匿名通用执行参数_ 。

source: For example, `+PartialOrd<T>` is equivalent to `impl TPartialOrd: PartialOrd<T>`.
es: Por ejemplo, "PartialOrd" es equivalente a "impl TPartialOrd: ParcialOrd".
fr: Par exemple, `+PartialOrd<T>` est équivalent à `impl TPartialOrd: PartialOrd<T>`.
id: Sebagai contoh, 'PartialOrd'<T> setara dengan 'imp TPartialOrd': ParsialOrd<T>.
tr: Örneğin, +PartialOrdT>, impl TPartialOrd: ParsiyelOrdT> ile eşdeğerdir.
zh_cn: 例如,“PartialOrd<T”相当于“impl TpartialOrd:部分rord<T”。

source: We can rewrite the `smallest_element` function signature as follows:
es: Podemos reescribir la firma de la función `smallest_element` de la siguiente manera:
fr: Nous pouvons réécrire la signature de la fonction `smallest_element` comme suit:
id: Kita dapat menulis ulang fungsi signature æsmallest_element sebagai berikut:
tr: smallest_element fonksiyon imzasını aşağıdaki gibi yeniden yazabiliriz:
zh_cn: 我们可以重写“最小元素”功能签字如下:

source: Structs
es: Estructuras
fr: Structures
id: Struktur
zh_cn: 条迹

source: We can also define structs to use a generic type parameter for one or more fields using the `<>` syntax, similar to function definitions. First, we declare the name of the type parameter inside the angle brackets just after the name of the struct. Then we use the generic type in the struct definition where we would otherwise specify concrete data types. The next code example shows the definition `Wallet<T>` which has a `balance` field of type `T`.
es: También podemos definir structs para usar un parámetro de tipo genérico para uno o más campos usando la sintaxis, similar a las definiciones de funciones. Primero, declaramos el nombre del parámetro de tipo dentro de los corchetes de ángulo justo después del nombre de la estructura. Luego usamos el tipo genérico en la definición de estructura donde de otro modo especificaríamos tipos de datos concretos. El siguiente ejemplo de código muestra la definición `Wallet<T® que tiene un campo `balance` de tipo `T`.
fr: Nous pouvons également définir des structures pour utiliser un paramètre de type générique pour un ou plusieurs champs en utilisant la syntaxe `<>`, similaire aux définitions de fonction. D'abord, nous déclarons le nom du paramètre de type à l'intérieur des crochets d'angle juste après le nom de la structure. Ensuite, nous utilisons le type générique dans la définition de la structure où nous préciserions autrement des types de données concrètes. L'exemple de code suivant montre la définition `Wallet<T>` qui a un champ `balance` de type `T`.
id: Kita juga dapat mendefinisikan struktur untuk menggunakan parameter tipe generik untuk satu atau lebih bidang menggunakan sintaks <>, mirip dengan definisi fungsi. Pertama, kita menyatakan nama parameter tipe di dalam kurung sudut hanya setelah nama struct. Kemudian kita menggunakan tipe umum dalam definisi struktur di mana kita akan menentukan tipe data konkrit. Contoh kode selanjutnya menunjukkan definisi ▪Wallet<T> yang memiliki daerah yang seimbang dengan tipe ▪T.
tr: Fonksiyon tanımlarına benzer şekilde > sözdizimi kullanılarak bir veya daha fazla alan için jenerik tip parametresi kullanmak üzere de structları tanımlayabiliriz. İlk olarak, struct'un adından hemen sonra açı parantezlerinin içindeki tip parametresinin adını beyan ederiz. Daha sonra struct tanımındaki jenerik tipi, aksi takdirde somut veri türlerini belirteceğimiz şekilde kullanırız. Bir sonraki kod örneği, WalletT> dengesinin tanımını gösterir.
zh_cn: 我们还可以使用与函数定义相似的 语法来定义用于一个或多个字段的通用类型参数。 首先,我们声明在圆形名称之后方格括号中的类型参数名称。 然后,我们使用结构定义中的通用类型,否则我们将指定具体的数据类型。 下一个代码示例显示定义“Wallet < T ”, 该定义含有“T”类“平衡”字段。

source: The above code derives the `Drop` trait for the `Wallet` type automatically. It is equivalent to writing the following code:
es: El código anterior deriva del rasgo `Drop` para el tipo `Wallet` automáticamente. Es equivalente a escribir el siguiente código:
fr: Le code ci-dessus dérive le caractère `Drop` pour le type `Wallet` automatiquement. Il est équivalent à l'écriture du code suivant:
id: Kode di atas memperoleh sifat lturop untuk tipe allet yang secara otomatis. sama saja dengan menulis kode berikut:
tr: Yukarıdaki kod, Wallet türü için Drop özelliğini otomatik olarak türetir. Aşağıdaki kodu yazmakla eşdeğerdir:
zh_cn: 上述代码自动产生“瓦利特”型号的“裁剪”特性,相当于写入以下代码:

source: We avoid using the `derive` macro for `Drop` implementation of `Wallet` and instead define our own `WalletDrop` implementation. Notice that we must define, just like functions, an additional generic type for `WalletDrop` saying that `T` implements the `Drop` trait as well. We are basically saying that the struct `Wallet<T>` is droppable as long as `T` is also droppable.
es: Evitamos el uso de la macro `derive` para la aplicación `Drop` de `Wallet` y, en su lugar, definimos nuestra propia aplicación `WalletDrop`. Tenga en cuenta que debemos definir, al igual que las funciones, un tipo genérico adicional para `WalletDrop` que diga que `T` implementa también el rasgo `Drop`. Básicamente estamos diciendo que la estructura `Wallet<T' es goteable siempre que `T` sea goteable.
fr: Nous évitons d'utiliser la macro `derive` pour l'implémentation `Drop` de `Wallet` et définissons plutôt notre propre implémentation `WalletDrop`. Notez que nous devons définir, tout comme les fonctions, un type générique supplémentaire pour `WalletDrop` en disant que `T` implémente également le caractère `Drop`. Nous disons essentiellement que la structure `Wallet<T>` est droppable tant que `T` est également droppable.
id: Kita menghindari penggunaan makro UBROP untuk implementasi ÁWalletó dan sebaliknya mendefinisikan implementasi smua kita sendiri. Perhatikan bahwa kita harus mendefinisikan, seperti fungsi, sebuah jenis umum tambahan untuk walletDropóc mengatakan bahwa kita juga menerapkan sifat yang dapat diturunkan. kita pada dasarnya mengatakan bahwa struktur <T> juga dapat dijatuhkan.
tr: Drop makrosunu Wallet uygulamasının uygulanması için kullanmaktan kaçınıyoruz ve bunun yerine kendi WalletDrop uygulamamızı tanımlamalıyız. Fonksiyonlar gibi, WalletDrop için ek bir jenerik türü tanımlamamız gerektiğine dikkat edin, T'nin Drop özelliğini de uyguladığını söylüyoruz. Temel olarak WalletT> yapısının da çıkarılabilir olduğunu söylüyoruz.
zh_cn: 我们避免使用`衍生'宏观来`削减'执行`瓦利特 ',而是定义我们自己的`瓦利特德罗普执行';我们注意到,我们必须像功能一样,为`瓦利特德罗普确定另外一种通用类型的`瓦利特德罗普 ',说`T'也执行`减少'特性;我们基本上说,只要`T'也可以下降,“瓦利特`塔'建筑就可下降。
