Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: To use a struct after we’ve defined it, we create an _instance_ of that struct by specifying concrete values for each of the fields. We create an instance by stating the name of the struct and then add curly brackets containing _key: value_ pairs, where the keys are the names of the fields and the values are the data we want to store in those fields. We don’t have to specify the fields in the same order in which we declared them in the struct. In other words, the struct definition is like a general template for the type, and instances fill in that template with particular data to create values of the type.
es: Para usar una estructura después de que la definimos, creamos una _instance_ de esa estructura especificando valores concretos para cada uno de los campos. Creamos una instancia indicando el nombre de la estructura y luego agregamos corchetes en curly que contienen _key: value_ pairs, donde las claves son los nombres de los campos y los valores son los datos que queremos almacenar en esos campos. No tenemos que especificar los campos en el mismo orden en que los declaramos en la estructura. En otras palabras, la definición de estructura es como una plantilla general para el tipo, y las instancias rellenan esa plantilla con datos particulares para crear valores del tipo.
fr: Pour utiliser une struct après que nous l'avons définie, nous créons une _instance_ de cette struct en spécifiant des valeurs concrètes pour chacun des champs. Nous créons une instance en indiquant le nom de la struct et puis ajoutons des crochets bouclés contenant _key: value_ paires, où les clés sont les noms des champs et les valeurs sont les données que nous voulons stocker dans ces champs. Nous n'avons pas à spécifier les champs dans le même ordre dans lequel nous les avons déclarés dans la struct. En d'autres termes, la définition de struct est comme un modèle général pour le type, et les instances remplissent ce modèle avec des données particulières pour créer des valeurs du type.
id: Untuk menggunakan sebuah struktur setelah kami mendefinisikannya, kami membuat sebuah _instance_ dari struktur itu dengan menspesifikasikan nilai beton untuk setiap bidang. Kami membuat suatu contoh dengan menyatakan nama struct dan kemudian menambahkan cucket keriting yang berisi _key: nilai_pasang, di mana kunci adalah nama dari bidang dan nilai-nilai adalah data yang ingin kami simpan di bidang tersebut. Kita tidak perlu menspesifikasikan bidang-bidang tersebut dalam urutan yang sama di mana kita menyatakan mereka dalam struktur. Dalam kata lain, definisi struktur adalah seperti template umum untuk tipe, dan contoh mengisi data dengan tipe tertentu untuk membuat nilai-nilai tersebut.
tr: Tanımladıktan sonra bir struct kullanmak için, her bir alan için somut değerler belirleyerek bu struct'un bir _instance_'sini oluşturuyoruz. struct'un adını belirterek bir örnek oluşturuyoruz ve sonra _key: value_ çiftleri içeren kıvırcık kelimeler ekliyoruz, burada anahtarlar alanların isimleri ve diğer değerler gibi, bu alanlarda saklamak istediğimiz verilerdir.
zh_cn: 要在定义它后使用支架, 我们通过为每个字段指定具体值来创建支架。 我们通过说明支架的名称来创建一个例。 然后添加括号, 括号中包含 _key: value_ 配对, 键是字段的名称, 值是我们要在这些字段中存储的数据。 我们不必按照在支架中声明的顺序来指定字段。 换句话说, 支架定义就像一个类型的一般模板, 并在模板中填写特定数据, 以创建该类型的值 。

source: For example, we can declare two particular users as shown in Listing 5-2.
es: Por ejemplo, podemos declarar dos usuarios particulares como se muestra en la Lista 5-2.
fr: Par exemple, nous pouvons déclarer deux utilisateurs particuliers comme indiqué dans Listing 5-2.
id: Misalnya, kita dapat menyatakan dua pengguna khusus seperti yang ditunjukkan dalam Listing 5-2.
tr: Örneğin, Listeleme 5-2'de gösterildiği gibi iki belirli kullanıcı ilan edebiliriz.
zh_cn: 例如,我们可以申报名单5-2中显示的两个特定用户。

source: "someusername123"
fr: "quelque nom d'utilisateur123"
tr: "someusername123" (İngilizce).
zh_cn: "某个用户名123"

source: "someone@example.com"
es: "alguien@ejemplo.com"
fr: "quelqu'un@exemple.com"
id: "Seseorang@example.com"
tr: "birisi@example.com"
zh_cn: "某个@example.com"

source: <span class="caption">Listing 5-2: Creating two instances of the `User` struct</span>
es: <span class="caption">Lista 5-2: Creación de dos instancias de la estructura `Usuario`</span>
fr: <span class="caption">Liste 5-2: Création de deux instances de la structure `User`</span>
id: <span class="caption">Listing 5-2: Membuat dua contoh dari ▪Userå struct</span>
tr: span class="caption">Listing 5-2: User struct/span> iki örnek oluşturma
zh_cn: <span类=“caption” > listing 5-2: 创建两个`用户'支架 </span>实例

source: To get a specific value from a struct, we use dot notation. For example, to access `user1`'s email address, we use `user1.email`. If the instance is mutable, we can change a value by using the dot notation and assigning into a particular field. Listing 5-3 shows how to change the value in the `email` field of a mutable `User` instance.
es: Para obtener un valor específico de una estructura, utilizamos notación de puntos. Por ejemplo, para acceder a la dirección de correo electrónico de `user1`, usamos `user1.email`. Si la instancia es mutable, podemos cambiar un valor usando la notación de puntos y asignando en un campo en particular. El listado 5-3 muestra cómo cambiar el valor en el campo `email` de una instancia `Usuario` mutable.
fr: Pour obtenir une valeur spécifique à partir d'un struct, nous utilisons la notation dot. Par exemple, pour accéder à l'adresse e-mail de `user1`, nous utilisons `user1.email`. Si l'instance est mutable, nous pouvons modifier une valeur en utilisant la notation dot et en assignant dans un champ particulier. Listing 5-3 montre comment modifier la valeur dans le champ `email` d'une instance `User` mutable.
id: Untuk mendapatkan nilai spesifik dari sebuah struct, kita menggunakan notasi titik. Sebagai contoh, untuk mengakses alamat email ·user1, kita menggunakan åuser1.email. Jika contoh ini dapat dimutasi, kita dapat mengubah nilai dengan menggunakan notasi titik dan menetapkan ke bidang tertentu. Daftar 5-3 menunjukkan bagaimana mengubah nilai dalam medan yang dapat dimutasikan dengan sebuah contoh User.
tr: Bir yapılandırmadan belirli bir değer elde etmek için nokta notasyonu kullanırız. Örneğin, user1 e-posta adresine erişmek için user1.email kullanırız. Eğer örnek değiştirilebilirse, nokta notasyonu kullanarak ve belirli bir alana atayarak bir değeri değiştirebiliriz. 5-3 listelemek, email değişken User örneğindeki değerin nasıl değiştirileceğini gösterir.
zh_cn: 为了从柱形中获取特定值,我们使用点符号。例如,为了访问“用户1”的电子邮件地址,我们使用“用户1.email ” 。如果实例是可变的,我们可以通过使用点符号和指定到特定字段来改变一个值。列出 5-3 显示如何改变可变的“用户”实例“电子邮件”字段中的值。

source: "anotheremail@example.com"
es: "anotheremail@ejemplo.com"
fr: "anotheremail@exemple.com"
id: "exemail@example.com"
tr: "başkaemail@example.com"
zh_cn: (注:@example.com)

source: <span class="caption">Listing 5-3: Changing the value in the email field of a `User` instance</span>
es: <span class="caption">Lista 5-3: Cambiar el valor en el campo de correo electrónico de una instancia `Usuario`</span>
fr: <span class="caption">Liste 5-3: Modification de la valeur dans le champ de courriel d'une instance `User`</span>
id: <span class="caption">Listing 5-3: Mengubah nilai dalam ruas surel dari sebuah User_Instance</span>
tr: span class="caption">Listeleme 5-3: Bir Kullanıcı örneğinin e-posta alanındaki değeri değiştirme/span>
zh_cn: <span类=“caption” > listing 5-3: 更改`用户' 例 </span> 在电子邮件字段中的值

source: Note that the entire instance must be mutable; Cairo doesn’t allow us to mark only certain fields as mutable.
es: Tenga en cuenta que toda la instancia debe ser mutable; El Cairo no nos permite marcar sólo ciertos campos como mutables.
fr: Notez que toute l'instance doit être mutable ; Le Caire ne nous permet pas de marquer seulement certains champs comme mutables.
id: Perhatikan bahwa seluruh contoh harus bermutasi; Kairo tidak memungkinkan kita untuk menandai hanya bidang tertentu sebagai mutable.
tr: Dikkat edin, bütün olay değiştirilebilir olmalıdır; Kahire sadece belirli alanları değiştirilebilir olarak işaretlememize izin vermez.
zh_cn: 开罗不允许我们只将某些领域标为可变领域。

source: As with any expression, we can construct a new instance of the struct as the last expression in the function body to implicitly return that new instance.
es: Como con cualquier expresión, podemos construir una nueva instancia de la estructura como la última expresión en el cuerpo de la función para devolver implícitamente esa nueva instancia.
fr: Comme avec n'importe quelle expression, nous pouvons construire une nouvelle instance de la structure comme la dernière expression dans le corps de la fonction pour retourner implicitement cette nouvelle instance.
id: Seperti dengan ekspresi apapun, kita dapat membangun sebuah contoh baru dari struktur sebagai ekspresi terakhir dalam tubuh fungsi untuk secara implisit kembali bahwa contoh baru.
tr: Herhangi bir ifadede olduğu gibi, bu yeni örneği dolaylı olarak geri döndürmek için fonksiyon gövdesindeki son ifade olarak strüktün yeni bir örneğini oluşturabiliriz.
zh_cn: 与任何表达式一样,我们可以构建一个新的构造实例,作为函数体中最后的表达式,以隐含地返回新的实例。

source: Listing 5-4 shows a `build_user` function that returns a `User` instance with the given email and username. The `active` field gets the value of `true`, and the `sign_in_count` gets a value of `1`.
es: El listado 5-4 muestra una función `build_user` que devuelve una instancia `Usuario` con el correo electrónico y el nombre de usuario dados. El campo `active` obtiene el valor de `true`, y el `sign_in_count` obtiene un valor de `1`.
fr: Listing 5-4 affiche une fonction `build_user` qui renvoie une instance `User` avec le courriel et le nom d'utilisateur donné. Le champ `active` obtient la valeur de `true`, et le `sign_in_count` obtient une valeur de `1`.
id: Daftar 5-4 menunjukkan sebuah fungsi Ábuild_useré yang mengembalikan sebuah contoh User_user dengan nama surel dan pengguna yang diberikan. ruas yang aktif mendapat nilai dari Á1.
tr: Listeleme 5-4, verilen e-posta ve kullanıcı adı ile bir User örneği döndüren bir build_user işlevi gösterir. active alanı true değerini alır ve sign_in_count değeri 1 değerini alır.
zh_cn: 列表 5-4 显示一个“建设_用户”功能,该功能以给定的电子邮件和用户名返回“用户”实例。“活动”字段获得“真”的值,“信号_in_count”获得“1”的值。

source: <span class="caption">Listing 5-4: A `build_user` function that takes an email and username and returns a `User` instance.</span>
es: <span class="caption">Lista 5-4: Una función `build_user` que toma un correo electrónico y un nombre de usuario y devuelve una instancia `Usuario`.</span>
fr: <span class="caption">Liste 5-4: Une fonction `build_user` qui prend un courriel et un nom d`utilisateur et retourne une instance `User`.</span>
id: <span class="caption">Listing 5-4: Sebuah fungsi yang dibangun_userå yang mengambil sebuah email dan nama pengguna dan mengembalikan sebuah instance User.</span>
tr: span class="caption">Listing 5-4: Bir e-posta ve kullanıcı adı alan ve bir User örneği döndüren bir build_user işlevi./span>
zh_cn: <span类=“caption” > listing 5-4:`building_user' 函数,需要电子邮件和用户名并返回“用户”实例。 </span>

source: It makes sense to name the function parameters with the same name as the struct fields, but having to repeat the `email` and `username` field names and variables is a bit tedious. If the struct had more fields, repeating each name would get even more annoying. Luckily, there’s a convenient shorthand!
es: Tiene sentido nombrar los parámetros de la función con el mismo nombre que los campos struct, pero tener que repetir los nombres y variables de los campos `email` y `username` es un poco tedioso. Si la estructura tenía más campos, repetir cada nombre sería aún más molesto. Por suerte, hay una taquigrafía conveniente!
fr: Il est logique de nommer les paramètres de fonction avec le même nom que les champs struct, mais devoir répéter les noms de champ `email` et `username` est un peu fastidieux. Si la structure avait plus de champs, répéter chaque nom serait encore plus ennuyeux. Heureusement, il ya un raccourci pratique!
id: Masuk akal untuk menamai parameter fungsi dengan nama yang sama dengan bidang struct, tetapi harus mengulangi åemail åeername dan nama-nama dan variabel agak membosankan. Jika struktur memiliki lebih banyak bidang, mengulangi setiap nama akan mendapatkan lebih menjengkelkan.
tr: Fonksiyon parametrelerini yapı alanları ile aynı isimle adlandırmak mantıklıdır, ancak email ve username alan adlarını ve değişkenlerini tekrarlamak zorunda kalmak biraz sıkıcıdır. Yapıtın daha fazla alanı olsaydı, her ismi tekrarlamak daha da can sıkıcı olurdu. Neyse ki, uygun bir kısa el var!
zh_cn: 将功能参数命名为与构件字段相同的名称是有道理的,但必须重复“电子邮件”和“用户名”的字段名称和变量有点乏味。 如果构件有更多的字段,重复每个名称会更令人烦恼。幸运的是,有一个方便的速记!

source: Using the Field Init Shorthand
es: Usando la taquigrafía de campo Init
fr: Utilisation du champ Init Shorthand
id: Menggunakan Field Imnit Shorthand
tr: Field Init Shorthand Kullanımı
zh_cn: 使用 Field Init 速记

source: Because the parameter names and the struct field names are exactly the same in Listing 5-4, we can use the field init shorthand syntax to rewrite `build_user` so it behaves exactly the same but doesn’t have the repetition of `username` and `email`, as shown in Listing 5-5.
es: Debido a que los nombres de los parámetros y los nombres de los campos struct son exactamente los mismos en Listar 5-4, podemos usar la sintaxis taquigráfica del campo init para reescribir `build_user` de modo que se comporte exactamente igual pero no tenga la repetición de `usuario` y `email`, como se muestra en Listar 5-5.
fr: Comme les noms de paramètres et les noms de champs de struct sont exactement les mêmes dans Listing 5-4, nous pouvons utiliser le champ init syntaxe shorthand pour réécrire `build_user` de sorte qu'il se comporte exactement le même mais n'a pas la répétition de `username` et `email`, comme indiqué dans Listing 5-5.
id: Karena nama parameter dan nama struct field persis sama dalam Listing 5-4, kita dapat menggunakan field init sintaks pendek tangan untuk menulis ulang åuser_user--sehingga berperilaku persis sama tetapi tidak memiliki pengulangan dari ▪usernameà dan ıemail à, seperti yang ditunjukkan dalam Listing 5-5.
tr: Parametre adları ve yapı alanı adları Listeleme 5-4'te tam olarak aynı olduğundan, build_user'ı yeniden yazmak için alanı init shorthand sözdizimi kullanabiliriz, böylece tam olarak aynı davranır ancak Listeleme 5-5'te gösterildiği gibi username ve email tekrarlarına sahip değildir.
zh_cn: 由于在5-4列表中参数名称和支架字段名称完全相同,我们可以使用缩略语法中的字段重写“建设用户”,使其行为完全相同,但不重复“用户名称”和“电子邮件”,如5-5列表所示。

source: <span class="caption">Listing 5-5: A `build_user` function that uses field init shorthand because the `username` and `email` parameters have the same name as struct fields.</span>
es: <span class="caption">Lista 5-5: Una función `build_user` que usa taquigrafía field init porque los parámetros `username` y `email` tienen el mismo nombre que los campos struct.</span>
fr: <span class="caption">Liste 5-5: Une fonction `build_user` qui utilise le champ init shorthand parce que les paramètres `username` et `email` ont le même nom que les champs struct.</span>
id: <span class="caption">Listing 5-5: A Ábuild_useró fungsi yang menggunakan tangan pendek field init karena parameter ·userà dan ·email memiliki nama yang sama dengan bidang struktur.</span>
tr: span class="caption">Listeleme 5-5: username ve email parametreleri struct alanları ile aynı isme sahip olduğu için field init shorthand kullanan bir build_user fonksiyonu./span>
zh_cn: <span类=“caption” > listing 5-5:一个使用字段的“建设_user”功能,因为“用户名称”和“email”参数的名称与阵列相同。 </span>

source: Here, we’re creating a new instance of the `User` struct, which has a field named `email`. We want to set the `email` field’s value to the value in the `email` parameter of the `build_user` function. Because the `email` field and the `email` parameter have the same name, we only need to write `email` rather than `email: email`.
es: Aquí, estamos creando una nueva instancia de la estructura `User`, que tiene un campo llamado `email`. Queremos establecer el valor del campo `email` en el parámetro `email` de la función `build_user`. Debido a que el campo `email` y el parámetro `email` tienen el mismo nombre, sólo necesitamos escribir `email` en lugar de `email: email`.
fr: Ici, nous créons une nouvelle instance de la structure `User`, qui a un champ nommé `email`. Nous voulons définir la valeur `email`s à la valeur dans le paramètre `email` de la fonction `build_user`. Parce que le champ `email` et le paramètre `email` ont le même nom, nous avons seulement besoin d'écrire `email` plutôt que `email: email`.
id: Di sini, kita akan membuat contoh baru dari struktur User, yang memiliki bidang yang bernama ·email. kita ingin mengatur parameter medan yang sama, kita hanya perlu menulis di email daripada email: email.
tr: Burada, email adında bir alana sahip olan User yapısının yeni bir örneğini oluşturuyoruz. email alanının değerini build_user işlevinin email parametresindeki değere ayarlamak istiyoruz. email alanı ve email parametresi aynı isme sahip olduğundan, email yerine email yazmamız yeterlidir.
zh_cn: 这里,我们正在创建一个`用户'系统的新实例,其字段名为`电子邮件 ',我们要将`电子邮件'字段值设置为`建设`用户'功能的`电子邮件'参数中的数值,因为`电子邮件'字段和`电子邮件'参数具有相同名称,我们只需写“电子邮件”而不是`电子邮件:电子邮件'。

source: Creating Instances from Other Instances with Struct Update Syntax
es: Crear instancias de otros casos con Struct Update Syntax
fr: Création d'instances à partir d'autres instances avec Struct Update Syntax
id: Membuat Instansi dari Instances Lain dengan Sintaks Pemutakhiran Struct
tr: Struct Update Syntax ile Diğer Instances'lardan Instances Oluşturma
zh_cn: Struct 更新语法

source: It’s often useful to create a new instance of a struct that includes most of the values from another instance, but changes some. You can do this using _struct update syntax_.
es: A menudo es útil crear una nueva instancia de una estructura que incluye la mayoría de los valores de otra instancia, pero cambia algunos. Puede hacer esto usando _struct update sintaxis_.
fr: Il est souvent utile de créer une nouvelle instance d'une structure qui inclut la plupart des valeurs d'une autre instance, mais en modifie certains. Vous pouvez le faire en utilisant _struct update syntaxe_.
id: Sering kali sangat berguna untuk membuat contoh baru dari sebuah struktur yang mencakup sebagian besar nilai dari contoh lain, tetapi mengubah beberapa. Anda dapat melakukan ini menggunakan sintaks pemutakhiran _struct_.
tr: Genellikle, başka bir örnekten gelen değerlerin çoğunu içeren, ancak bazılarını değiştiren yeni bir yapılandırma örneği oluşturmak yararlıdır. Bunu _struct güncelleme sözdizimi_ kullanarak yapabilirsiniz.
zh_cn: 创建一个包含来自其他实例的大多数值但会改变部分值的新结构实例通常是有益的。 您可以使用 _ struct 更新语法_ 来做到这一点 。

source: First, in Listing 5-6 we show how to create a new `User` instance in `user2` regularly, without the update syntax. We set a new value for `email` but otherwise use the same values from `user1` that we created in Listing 5-2.
es: En primer lugar, en Listar 5-6 mostramos cómo crear una nueva instancia `Usuario` en `user2` regularmente, sin la sintaxis de actualización. Configuramos un nuevo valor para `email` pero de otro modo usamos los mismos valores de `user1` que creamos en Listar 5-2.
fr: Tout d'abord, dans Listing 5-6, nous montrons comment créer une nouvelle instance `User` dans `user2` régulièrement, sans la syntaxe de mise à jour. Nous avons défini une nouvelle valeur pour `email` mais autrement utiliser les mêmes valeurs de `user1` que nous avons créé dans Listing 5-2.
id: Pertama, di Listing 5-6 kita menunjukkan bagaimana untuk membuat sebuah contoh User yang baru secara teratur, tanpa sintaks update. kita menetapkan nilai baru untuk email tetapi jika tidak menggunakan nilai yang sama dari ▪user1▪ yang kita buat dalam Listing 5-2.
tr: İlk olarak, Listeleme 5-6'da, güncelleme sözdizimi olmadan user2'de düzenli olarak yeni bir User örneğinin nasıl oluşturulacağını gösteririz. email için yeni bir değer belirleriz, ancak Listeleme 5-2'de oluşturduğumuz user1 ile aynı değerleri kullanırız.
zh_cn: 首先,在列出5-6时,我们说明如何在不更新语法的情况下,定期在“用户2”中创建一个新的“用户”实例,我们为“电子邮件”设定了一个新的值,但以其他方式使用我们在列出5-2时创建的“用户1”的相同值。

source: "another@example.com"
es: "otro@ejemplo.com"
fr: "un autre@exemple.com"
id: "@example.com" lain
tr: "başka@example.com"
zh_cn: "另一个@ example. com"

source: <span class="caption">Listing 5-6: Creating a new `User` instance using all but one of the values from `user1`</span>
es: <span class="caption">Lista 5-6: Crear una nueva instancia `Usuario` usando todos menos uno de los valores de `user1/span>
fr: <span class="caption">Liste 5-6: Création d'une nouvelle instance `User` en utilisant toutes les valeurs sauf une de `user1`</span>
id: <span class="caption">Listing 5-6: Membuat sebuah contoh baru menggunakan semua tapi salah satu nilai dari </span>
tr: span class="caption">Liste 5-6: user1/span> 'den gelen değerlerden birini kullanarak yeni bir User örneği oluşturma
zh_cn: <span class="Caption" > listing 5-6: 创建一个新的`用户'例,使用除“user1\\\\\\\\/span”所有值以外的一个值

source: Using struct update syntax, we can achieve the same effect with less code, as shown in Listing 5-7. The syntax `..` specifies that the remaining fields not explicitly set should have the same value as the fields in the given instance.
es: Utilizando la sintaxis struct update, podemos lograr el mismo efecto con menos código, como se muestra en Listar 5-7. La sintaxis `..` especifica que los campos restantes no configurados explícitamente deben tener el mismo valor que los campos en la instancia dada.
fr: En utilisant la syntaxe struct update, nous pouvons obtenir le même effet avec moins de code, comme indiqué dans Listing 5-7. La syntaxe `..` spécifie que les champs restants non explicitement définis doivent avoir la même valeur que les champs dans l'instance donnée.
id: Menggunakan sintaks pemutakhiran struktur, kita dapat mencapai efek yang sama dengan kode yang lebih sedikit, seperti yang ditunjukkan dalam Listing 5-7. Sintaks..spesifikasikan bahwa bagian-bagian yang tersisa tidak secara eksplisit diset harus memiliki nilai yang sama dengan ruas yang diberikan.
tr: Yapısal güncelleme sözdizimi kullanılarak, Listeleme 5-7'de gösterildiği gibi, daha az kodla aynı etkiyi elde edebiliriz. Sözdizimi.., açıkça ayarlanmamış kalan alanların, verilen örnekteki alanlarla aynı değere sahip olması gerektiğini belirtir.
zh_cn: 使用 Struct 更新语法, 我们可以以更少的代码实现同样的效果, 如列表 5-7 所示。 语法 `.'规定, 尚未明确设定的剩余字段应与特定实例中的字段具有相同价值 。

source: <span class="caption">Listing 5-7: Using struct update syntax to set a new `email` value for a `User` instance but to use the rest of the values from `user1`</span>
es: <span class="caption">Lista 5-7: Usando la sintaxis struct update para establecer un nuevo valor `email` para una instancia `Usuario` pero para usar el resto de los valores de `user1/span>
fr: <span class="caption">Liste 5-7: Utiliser la syntaxe de mise à jour de struct pour définir une nouvelle valeur `email` pour une instance `User` mais pour utiliser le reste des valeurs de `user1`</span>
id: <span class="caption">Listing 5-7: Menggunakan sintaks update struct untuk mengatur nilai baru </span>
tr: span class="caption">Listeleme 5-7: Bir Kullanıcı örneği için yeni bir email değeri ayarlamak için yapılandırma güncelleme sözdiziminin kullanılması, ancak user1/span> 'den kalan değerlerin kullanılması
zh_cn: <span类=“Caption” > Listing 5-7: 使用 strutct 更新语法来设置“ 用户” 实例的新“ 电子邮件” 值, 但要使用“ 用户” 的其余值
