Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Therefore, inlining should be applied with caution. Using `#[inline]` or `#[inline(always)]` indiscriminately will lead to increased compile time. It is particularly useful to inline small functions, ideally with many arguments. This is because inlining large functions will increase the code length of the program, and handling many arguments will increase the number of steps to execute these functions.
es: Por lo tanto, el inlining debe ser aplicado con precaución. Usar •[inline]` o •[inline(siempre)]` indiscriminadamente conducirá a un aumento del tiempo de compilación. Es particularmente útil para inline pequeñas funciones, idealmente con muchos argumentos. Esto es porque inlining grandes funciones aumentará la longitud del código del programa, y el manejo de muchos argumentos aumentará el número de pasos para ejecutar estas funciones.
fr: L'utilisation de `#[inline]` ou `#[inline(toujours)]` conduira à une augmentation du temps de compilation. Il est particulièrement utile d'insérer de petites fonctions, idéalement avec de nombreux arguments. C'est parce que l'utilisation de grandes fonctions augmentera la longueur du code du programme, et le traitement de nombreux arguments augmentera le nombre d'étapes pour exécuter ces fonctions.
id: Oleh karena itu, inlining harus diterapkan dengan hati-hati. Menggunakan fungsi kecil, idealnya dengan banyak argumen. Hal ini karena inlining fungsi besar akan meningkatkan panjang kode program, dan menangani banyak argumen akan meningkatkan jumlah langkah untuk melaksanakan fungsi ini.
tr: Bu nedenle, astarlama dikkatli bir şekilde uygulanmalıdır. #[inline] veya #[inline(hep)]'yi kullanmak, ayrım gözetmeksizin daha fazla derleme süresine yol açacaktır. İdeal olarak birçok argümanla küçük fonksiyonları satır içine almak özellikle yararlıdır. Bunun nedeni, büyük fonksiyonların astarlanmasının programın kod uzunluğunu artıracağı ve birçok argümanın ele alınmasının bu işlevleri yerine getirmek için gereken adımların sayısını artıracağıdır.
zh_cn: 因此,应谨慎地应用内衬。 不分青红皂白地使用“ 内嵌” 或“ 内联(线性) ” 将增加汇编时间。 插入小功能特别有用, 最好加上许多论据。 这是因为内嵌大型功能将增加程序代码长度, 处理许多论据将增加执行这些功能的步骤的数量 。

source: The more frequently a function is called, the more beneficial inlining becomes in terms of performance. By doing so, the number of steps for the execution will be lower, while the code length will not grow that much or might even decrease in terms of total number of instructions.
es: Cuanto más frecuentemente se llama una función, más beneficioso se convierte en inlining en términos de rendimiento. Al hacerlo, el número de pasos para la ejecución será menor, mientras que la longitud del código no crecerá tanto o incluso podría disminuir en términos de número total de instrucciones.
fr: Plus une fonction est appelée, plus l'inline plus bénéfique devient en termes de performance. Ce faisant, le nombre d'étapes pour l'exécution sera plus faible, tandis que la longueur du code ne augmentera pas tant ou pourrait même diminuer en termes de nombre total d'instructions.
id: Semakin sering sebuah fungsi disebut, semakin bermanfaat inlining dalam hal kinerja. Dengan melakukannya, jumlah langkah untuk eksekusi akan lebih rendah, sementara panjang kode tidak akan tumbuh sebanyak itu atau bahkan mungkin menurun dalam hal jumlah total instruksi.
tr: Bir fonksiyon ne kadar sık çağrılırsa, performans açısından o kadar faydalı astarlama olur. Bunu yaparak, yürütme için adım sayısı daha düşük olacak, kod uzunluğu o kadar fazla artmayacak veya toplam talimat sayısı açısından bile azalabilir.
zh_cn: 要求一个功能的频率越高,从业绩角度来说,从内衬越有利,执行步骤的数目就越少,而守则的长度不会长得那么大,甚至从指示的总数来看也不会减少。

source: Inlining is often a tradeoff between number of steps and code length. Use the `inline` attribute cautiously where it is appropriate.
es: El inlining es a menudo una compensación entre el número de pasos y la longitud del código. Utilice el atributo `inline` con cautela cuando sea apropiado.
fr: L'inline est souvent un compromis entre le nombre d'étapes et la longueur du code. Utilisez l'attribut `inline` avec prudence là où cela est approprié.
id: Inlining sering kali merupakan tradeoff antara sejumlah langkah dan panjang kode.
tr: İnlining genellikle basamak sayısı ve kod uzunluğu arasında bir takastır. Uygun olduğu yerde inline özniteliğini dikkatli kullanın.
zh_cn: 内衬往往是若干步骤和编码长度之间的权衡,适当时谨慎使用 " 内线 " 属性。

source: Inlining Example
es: Ejemplo de inlining
fr: Exemple d'information
id: Contoh yang Mendesak
tr: Inlining Örnek
zh_cn: 内列示例

source: Let's introduce a short example to illustrate the mechanisms of inlining in Cairo. Listing 11-3 shows a basic program allowing comparison between inlined and non-inlined functions.
es: Vamos a introducir un breve ejemplo para ilustrar los mecanismos de inlining en El Cairo. Listar 11-3 muestra un programa básico que permite la comparación entre funciones enlineadas y no enlineadas.
fr: Introduisons un court exemple pour illustrer les mécanismes de l'inline au Caire. Listing 11-3 montre un programme de base permettant une comparaison entre les fonctions alignées et non alignées.
id: Mari kita perkenalkan contoh singkat untuk menggambarkan mekanisme inlining di Kairo. Daftar 11-3 menunjukkan program dasar memungkinkan perbandingan antara fungsi inline dan non-inline.
tr: Kahire'de inlining mekanizmalarını örneklemek için kısa bir örnek verelim. 11-3'ü listelemek, inlined ve inlined olmayan fonksiyonlar arasında karşılaştırma yapılmasına izin veren temel bir program göstermektedir.
zh_cn: 让我们举一个简短的例子来说明开罗的内衬机制。 列出 11-3 显示一个基本程序, 能够比较内嵌功能和非内嵌功能 。

source: <span class="caption">Listing 11-3: A small Cairo program that adds the return value of 2 functions, with one of them being inlined</span>
es: <span class="caption">Lista 11-3: Un pequeño programa de El Cairo que añade el valor de retorno de 2 funciones, con una de ellas inlined</span>
fr: <span class="caption">Liste 11-3: Un petit programme du Caire qui ajoute la valeur de retour de 2 fonctions, l'une d'entre elles étant alignée</span>
id: <span class="caption">Listing 11-3: Sebuah program Kairo kecil yang menambahkan nilai kembali dari 2 fungsi, dengan salah satu dari mereka sedang diinline</span>
tr: span class="caption">Liste 11-3: Biri satır içi olmak üzere 2 fonksiyonun dönüş değerini ekleyen küçük bir Kahire programı/span>
zh_cn: <span class="Caption" > listing 11-3:一个小开罗程序,增加了2个函数的返回值,其中1个功能被嵌入 </span>

source: Let's take a look at the corresponding Sierra code to see how inlining works under the hood:
es: Echemos un vistazo al código correspondiente de Sierra para ver cómo funciona el inlining debajo del capó:
fr: Jetons un coup d'oeil au code Sierra correspondant pour voir comment l'inline fonctionne sous le capot :
id: Mari kita lihat pada kode Sierra yang sesuai untuk melihat bagaimana inlining bekerja di bawah tenda:
tr: İnlining'in kaputun altında nasıl çalıştığını görmek için ilgili Sierra koduna bir göz atalım:
zh_cn: 让我们看看相应的Sierra代码 看看在引擎盖下面的内衬是如何工作的:

source: // type declarations
es: // declaraciones de tipo
fr: // Déclarations de type
id: //jenis deklarasi
tr: // tip beyanlar
zh_cn: / 类型声明

source: // libfunc declarations
es: // declaraciones libfunc
fr: // déclarations libfunc
id: // deklarasi libfunc
tr: // libfunc beyanları
zh_cn: //自由声明

source: // statements
es: // declaraciones
fr: // déclarations
id: //pernyataan
tr: // ifadeler
zh_cn: / 发言/发言

source: // funcs
zh_cn: / fincs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs / funcs

source: The Sierra file is structured in three parts:
es: El archivo Sierra está estructurado en tres partes:
fr: Le fichier Sierra est structuré en trois parties :
id: Berkas Sierra terstruktur dalam tiga bagian:
tr: Sierra dosyası üç bölüm halinde yapılandırılmıştır:
zh_cn: Sierra文件分为三部分:

source: Type and libfunc declarations.
es: Declaraciones tipo y libfunc.
fr: Tapez et libfunc déclarations.
id: Tipe dan deklarasi libfunc.
tr: Tür ve libfunc beyanları.
zh_cn: 类型和 libfunc 声明 。

source: Statements that constitute the program.
es: Declaraciones que constituyen el programa.
fr: Déclarations qui constituent le programme.
id: Pernyataan yang membentuk program.
tr: Programı oluşturan ifadeler.
zh_cn: 构成方案的说明。

source: Declaration of the functions of the program.
es: Declaración de las funciones del programa.
fr: Déclaration des fonctions du programme.
id: Deklarasi fungsi program.
tr: Programın fonksiyonlarının deklarasyonu.
zh_cn: 宣布方案的职能。

source: The Sierra code statements always match the order of function declarations in the Cairo program. Indeed, the declaration of the functions of the program tells us that:
es: Las declaraciones de código Sierra siempre coinciden con el orden de las declaraciones de función en el programa de El Cairo. De hecho, la declaración de las funciones del programa nos dice que:
fr: Les déclarations de code Sierra correspondent toujours à l'ordre des déclarations de fonction dans le programme du Caire. En effet, la déclaration des fonctions du programme nous dit que:
id: Pernyataan kode Sierra selalu cocok dengan urutan deklarasi fungsi dalam program Kairo.
tr: Sierra kod ifadeleri her zaman Kahire programındaki işlev beyanlarının sırasına uyuyor. Gerçekten de, programın işlevlerinin beyanı bize şunları söylüyor:
zh_cn: 塞拉码声明总是符合开罗方案中功能声明的顺序。 事实上,该程序功能声明告诉我们:

source: `main` function starts at line 0, and returns a `felt252` on line 5.
es: La función `main` comienza en la línea 0, y devuelve un `felt252` en la línea 5.
fr: La fonction `main` commence à la ligne 0 et renvoie un `felt252` à la ligne 5.
id: Fungsi utama dimulai pada baris 0, dan kembali ke saluran 252.
tr: main fonksiyonu 0 satırından başlar ve 5 satırında bir felt252 döndürür.
zh_cn: `主要'功能从第0行开始,返回第5行的`felt252'。

source: `inlined` function starts at line 6, and returns a `felt252` on line 8.
es: La función `inlined` comienza en la línea 6 y devuelve un `felt252` en la línea 8.
fr: La fonction `inlined` commence à la ligne 6 et renvoie un `felt252` à la ligne 8.
id: Fungsi dibariskan di baris 6, dan mengembalikan sebuah ± 252 di baris 8.
tr: inlined işlevi 6. satırdan başlar ve 8. satırda felt252 değerini döndürür.
zh_cn: `内含'功能从第6行开始,返回第8行的`felt252'。

source: `not_inlined` function starts at line 9, and returns a `felt252` on line 11.
es: La función `not_inlined` comienza en la línea 9, y devuelve una `felt252` en la línea 11.
fr: La fonction `not_inlined` commence à la ligne 9 et renvoie un `felt252` à la ligne 11.
id: Fungsi tidak_dibariskan dimulai di baris 9, dan mengembalikan sebuah irfelt252 di baris 11.
tr: not_inlined işlevi 9. satırdan başlar ve 11. satırda bir felt252 döndürür.
zh_cn: “非线性”函数从第9行开始,返回第11行的“felt252”。

source: All statements corresponding to the `main` function are located between lines 0 and 5:
es: Todas las declaraciones correspondientes a la función " principal " se encuentran entre las líneas 0 y 5:
fr: Tous les énoncés correspondant à la fonction `main` sont situés entre les lignes 0 et 5:
id: Semua laporan yang berhubungan dengan fungsi ımain yang terletak di antara garis 0 dan 5:
tr: main fonksiyonuna karşılık gelen tüm ifadeler 0 ve 5 satırları arasında bulunur.
zh_cn: 与`主要'功能相应的所有语句位于第0行和第5行之间:

source: The `function_call` libfunc is called on line 0 to execute the `not_inlined` function. This will execute the code from lines 9 to 10 and store the return value in the variable with id `0`.
es: La función `function_call` libfunc se llama en la línea 0 para ejecutar la función `not_inlined`. Esto ejecutará el código de las líneas 9 a 10 y almacenará el valor de retorno en la variable con id `0`.
fr: La fonction `fonction_call` libfunc est appelée à la ligne 0 pour exécuter la fonction `not_inlined`. Cela exécutera le code des lignes 9 à 10 et stockera la valeur de retour dans la variable avec id `0`.
id: Fungsi fungsinya adalah libfunc disebut di baris 0 untuk menjalankan fungsi ænot_inlined. Ini akan mengeksekusi kode dari baris 9 sampai 10 dan menyimpan nilai kembali dalam variabel dengan id 0.
tr: func_call libfunc, not_inlined fonksiyonunu çalıştırmak için 0 satırına çağrılır. Bu, kodu 9'dan 10'a kadar olan satırlardan çalıştıracak ve id 0 ile değişkendeki dönüş değerini depolayacaktır.
zh_cn: “函数呼叫'libfunc'被调用到第0行,以执行`非线性'函数,这将执行从行9到行10的代码,并将返回值以 id'0'存储在变量中。

source: This code uses a single data type, `felt252`. It uses two library functions - `felt_const<2>`, which returns the constant `felt252` 2, and `store_temp<felt252>`, which pushes a constant value to memory. The first line calls the `felt_const<2>` libfunc to create a variable with id `0`. Then, the second line pushes this variable to memory for later use.
es: Este código utiliza un solo tipo de datos, `felt252`. Utiliza dos funciones de biblioteca - `felt_const<2'', que devuelve la constante `felt252` 2, y `store_temp<felt252'', que empuja un valor constante a la memoria. La primera línea llama al `felt_const<2'' libfunc para crear una variable con id `0`. A continuación, la segunda línea empuja esta variable a la memoria para su uso posterior.
fr: Ce code utilise un seul type de données, `felt252`. Il utilise deux fonctions de bibliothèque - `felt_const<2>`, qui retourne la constante `felt252` 2, et `store_temp<felt252>`, qui pousse une valeur constante à la mémoire. La première ligne appelle la `felt_const<2>` libfunc pour créer une variable avec id `0`. Ensuite, la deuxième ligne pousse cette variable à la mémoire pour une utilisation ultérieure.
id: Kode ini menggunakan sebuah tipe data tunggal, yang menggunakan dua fungsi perpustakaan - ▪felt_const<2>, yang mengembalikan tipe konstan TINGGAL2, dan Ástore_temp<felt252>, yang mendorong nilai konstan ke memori. Baris pertama memanggil baris pertama yang disebut <2> libfunc untuk membuat variabel dengan É0. Kemudian, baris kedua mendorong variabel ini untuk digunakan nanti.
tr: Bu kod tek bir veri türü kullanır, felt252. felt252 2 sabitini döndüren iki kütüphane işlevi kullanır ve store_tempfelt252> sabit bir değeri hafızaya iter. İlk satır daha sonra felt_const2> libfunc'u id 0 ile bir değişken oluşturmak için çağırır.
zh_cn: 此代码使用单一数据类型 `felt252' 。 它使用两个库函数 - `felt_ const < 2\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: After that, Sierra statements from line 1 to 2 are the actual body of the `inlined` function:
es: Después de eso, las declaraciones de Sierra de las líneas 1 a 2 son el cuerpo real de la función `inlined`:
fr: Après cela, les déclarations Sierra de la ligne 1 à 2 sont le corps réel de la fonction "inlined" :
id: Setelah itu, pernyataan Sierra dari baris 1 sampai 2 adalah tubuh yang sebenarnya dari fungsi æinlined:
tr: Bundan sonra, 1 ile 2 arasındaki Sierra ifadeleri, inlined fonksiyonunun gerçek gövdesidir:
zh_cn: 之后,第1行至第2行的Sierra语句是`内含'函数的实际正文:

source: The only difference is that the inlined code will store the `felt252_const` value in a variable with id `1`, because `[0]` refers to a variable previously assigned:
es: La única diferencia es que el código inlined almacenará el valor `felt252_const` en una variable con id `1`, porque `[0]` se refiere a una variable previamente asignada:
fr: La seule différence est que le code aligné stockera la valeur `felt252_const` dans une variable avec id `1`, parce que `[0]` se réfère à une variable précédemment assignée:
id: Satu-satunya perbedaan adalah bahwa kode inline akan menyimpan nilai ▪felt252_consté dalam variabel dengan id ·1," karena [0] reference ke variabel sebelumnya ditugaskan:
tr: Tek fark, satır içi kodun felt252_const değerini 1 id ile bir değişkende saklamasıdır, çünkü [0] daha önce atanmış bir değişkeni ifade eder:
zh_cn: 唯一的区别是,内嵌代码将把`felt252_const' 值存储在有id`1'的变量中,因为`[0]是指先前指定的变量:

source: Note: in both cases (inlined or not), the `return` instruction of the function being called is not executed, as this would lead to prematurely end the execution of the `main` function. Instead, return values of `inlined` and `not_inlined` will be added and the result will be returned.
es: Nota: En ambos casos (inlineados o no), la instrucción `return` de la función que se llama no se ejecuta, ya que esto llevaría a terminar prematuramente la ejecución de la función `main`; en cambio, se añadirán los valores de retorno de `inlined` y `not_inlined` y se devolverá el resultado.
fr: Note : dans les deux cas (inligned ou non), l'instruction `return` de la fonction en cours d'appel n'est pas exécutée, car cela conduirait à mettre fin prématurément à l'exécution de la fonction `main`. Au lieu de cela, les valeurs de retour de `inlined` et `not_inlined` seront ajoutées et le résultat sera retourné.
id: Catatan: dalam kedua kasus ini (dibariskan atau tidak), instruksi dari fungsi yang disebut tidak dijalankan, karena hal ini akan menyebabkan eksekusi dini dari fungsi ·returné. Sebaliknya, kembali nilai-nilai (inlined) dan tidak_inlined) akan ditambahkan dan hasilnya akan dikembalikan.
tr: Not: Her iki durumda da (inlined olsun ya da olmasın), çağrılan fonksiyonun return talimatı çalıştırılmaz, çünkü bu main fonksiyonunun yürütülmesini erken sona erdirir. Bunun yerine, inlined ve not_inlined geri dönüş değerleri eklenecek ve sonuç iade edilecektir.
zh_cn: 注:在两种情况(内含或非内含)中,所呼叫函数的`返回'指示没有执行,因为这将导致`主要'函数的履行过早结束,而是将增加`内含'和`未内含'的返回值,结果将被退回。

source: Lines 3 to 5 contain the Sierra statements that will add the values contained in variables with ids `0` and `1`, store the result in memory and return it:
es: Las líneas 3 a 5 contienen las frases Sierra que añadirán los valores contenidos en las variables con los ids `0` y `1`, almacenarán el resultado en memoria y lo devolverán:
fr: Les lignes 3 à 5 contiennent les instructions Sierra qui ajouteront les valeurs contenues dans les variables avec les ids `0` et `1`, stockeront le résultat dans la mémoire et le retourneront:
id: Baris 3 sampai 5 berisi pernyataan Sierra yang akan menambahkan nilai-nilai yang terkandung dalam variabel dengan ids ·0 dan ·1), menyimpan hasilnya dalam memori dan mengembalikannya:
tr: 3 ila 5 arasındaki satırlar, 0 ve 1 ile değişkenlerde bulunan değerleri ekleyecek Sierra ifadelerini içerir, sonucu bellekte saklar ve döndürür:
zh_cn: 第3至5行载有塞拉语句,这些语句将添加以 " 0 " 和 " 1 " 代号为代号的变量中的数值,储存结果并返回内存:

source: Now, let's take a look at the Casm code corresponding to this program to really understand the benefits of inlining.
es: Ahora, echemos un vistazo al código Casm correspondiente a este programa para entender realmente los beneficios de inlining.
fr: Maintenant, jetons un coup d'oeil au code Casm correspondant à ce programme pour vraiment comprendre les avantages de l'inline.
id: Sekarang, mari kita lihat kode Casm yang berhubungan dengan program ini untuk benar-benar memahami manfaat inlining.
tr: Şimdi, bu programa karşılık gelen Casm koduna bir göz atalım, gerçekten astarlamanın faydalarını anlamak için.
zh_cn: 现在,让我们来看看与这个程序相对应的 Casm 代码, 来真正理解内衬的好处。

source: Casm Code Explanations
es: Explicaciones sobre el código de la carcasa
fr: Explications du code Casm
id: Penjelasan Kode Casm
tr: Casm Kodu Açıklamaları
zh_cn: Casm Casm 代码解释

source: Here is the Casm code for our previous program example:
es: Aquí está el código Casm para nuestro ejemplo de programa anterior:
fr: Voici le code Casm pour notre précédent exemple de programme :
id: Berikut adalah kode Casm untuk contoh program kami sebelumnya:
tr: İşte önceki program örneğimiz için Casm kodu:
zh_cn: 以下是我们上一个程序示例的 Casm 代码 :

source: Don't hesitate to use [cairovm.codes](https://cairovm.codes/) playground to follow along and see all the execution trace.
es: No dude en utilizar [cairovm.codes](https://cairovm.codes/) parque infantil para seguir y ver todos los rastros de ejecución.
fr: N'hésitez pas à utiliser [cairovm.codes](https://cairovm.codes/) aire de jeux pour suivre et voir toute la trace d'exécution.
id: Jangan ragu untuk menggunakan [cairovm.codes][https://cairovm.codes/) taman bermain untuk mengikuti sepanjang dan melihat semua jejak eksekusi.
tr: [cairovm.codes](https://cairovm.codes/) oyun alanını takip etmek ve tüm yürütme izini görmek için kullanmaktan çekinmeyin.
zh_cn: (https://cairovm.codes/)游乐场,

source: Each instruction and each argument for any instruction increment the Program Counter (known as PC) by 1. This means that `ret` on line 2 is actually the instruction at `PC = 3`, as the argument `3` corresponds to `PC = 2`.
es: Cada instrucción y cada argumento para cualquier instrucción incrementan el Contador del Programa (conocido como PC) por 1. Esto significa que `ret` en la línea 2 es realmente la instrucción en `PC = 3 ', ya que el argumento `3'corresponde a `PC = 2 '.
fr: Chaque instruction et chaque argument pour toute instruction incrémentent le compteur de programme (connu sous le nom de PC) par 1. Cela signifie que `ret` à la ligne 2 est en fait l'instruction à `PC = 3`, puisque l'argument `3` correspond à `PC = 2`.
id: Setiap instruksi dan setiap argumen untuk peningkatan setiap Program Kontra (dikenal sebagai PC) oleh 1. Ini berarti bahwa året di baris 2 sebenarnya adalah instruksi di ÉPC = 3), sebagai argumen yang berkorespondensi dengan ▪3.
tr: Her talimat ve herhangi bir talimat için her argüman, Program Sayacını (PC olarak bilinir) 1'e yükseltir. Bu, 3 argümanının PC = 2 'ye karşılık gelmesinden dolayı, 2 satırdaki ret'nin aslında PC = 3 'deki talimat olduğu anlamına gelir.
zh_cn: 方案柜台(称为PC)的任何指示加注的每项指示和每一论点,以1计,这意味着第2行的`停止'实际上是`PC=3'的指令,因为`3'的论据相当于`PC=2'。

source: The `call` and `ret` instructions allow implementation of a function stack:
es: Las instrucciones " call " y " ret " permiten la aplicación de una pila de funciones:
fr: Les instructions `call` et `ret` permettent la mise en œuvre d'une pile de fonctions:
id: Instruksi yang diberikan memungkinkan implementasi dari sebuah stack fungsi:
tr: call ve ret talimatları bir fonksiyon yığınının uygulanmasına izin verir:
zh_cn: `调用'和`调用'指示允许执行功能堆叠:

source: `call` instruction acts like a jump instruction, updating the PC to a given value, whether relatively to the current value using `rel` or absolutely using `abs`.
es: La instrucción `call` actúa como una instrucción de salto, actualizando el PC a un valor dado, ya sea relativamente al valor actual usando `rel` o absolutamente usando `abs`.
fr: `appel` instruction agit comme une instruction de saut, la mise à jour du PC à une valeur donnée, que ce soit relativement à la valeur actuelle en utilisant `rel` ou absolument en utilisant `abs`.
id: Instruksi seperti melompat, meng-update komputer ke suatu nilai tertentu, apakah relatif terhadap nilai yang digunakan saat ini atau benar-benar menggunakan komputer.
tr: call talimatı atlama talimatı gibi davranır, PC'yi belirli bir değere günceller, ister rel kullanarak mevcut değere göre ister abs kullanarak.
zh_cn: `调用'指令如同跳跃指令,将个人电脑更新到给定值,无论是相对于使用`rel'或绝对使用`abs'的当前值。

source: `ret` instruction jumps back right after the `call` instruction and continues the execution of the code.
es: La instrucción `ret` salta justo después de la instrucción `call` y continúa la ejecución del código.
fr: "ret" instruction saute juste après l'instruction "appel" et continue l'exécution du code.
id: Instruksinya melompat kembali tepat setelah instruksinya dan melanjutkan eksekusi kodenya.
tr: ret talimatı, call talimatından hemen sonra geri atlar ve kodun yürütülmesine devam eder.
zh_cn: " 调用 " 指令在 " 调用 " 指令后立即跳回 " 指令,并继续执行该代码。
