Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Note: `name` is the name that we’ll be using in the contract to refer to the component. It is different than the name of your impl.
es: Nota: `nombre` es el nombre que usaremos en el contrato para referirnos al componente. Es diferente al nombre de su impl.
fr: Note : `name` est le nom que nous utiliserons dans le contrat pour désigner le composant. Il est différent du nom de votre impl.
id: Catatan: Nama yang akan kita gunakan dalam kontrak untuk mengacu pada komponennya.
tr: Not: name, sözleşmede bileşene atıfta bulunmak için kullanacağımız isimdir. Bu, impl'nizin adından farklıdır.
zh_cn: 注:`姓名'是指我们在合同中将用来指该部件的名称,与你的插管的名称不同。

source: You can also define internal functions that will not be accessible externally, by simply omitting the `#[embeddable_as(name)]` attribute above the internal `impl` block. You will be able to use these internal functions inside the contract you embed the component in, but not interact with it from outside, as they're not a part of the abi of the contract.
es: También puede definir funciones internas a las que no se podrá acceder externamente, simplemente omitiendo el atributo «[embeddable_as(name)]» por encima del bloque interno «impl». Podrá utilizar estas funciones internas dentro del contrato en el que incruste el componente, pero no interactúe con él desde fuera, ya que no forman parte del abi del contrato.
fr: Vous pouvez également définir des fonctions internes qui ne seront pas accessibles à l'extérieur, en omettant simplement l'attribut `#[embeddable_as(name)]` au-dessus du bloc `impl` interne. Vous pourrez utiliser ces fonctions internes à l'intérieur du contrat dans lequel vous intégrez le composant, mais pas interagir avec celui-ci de l'extérieur, car elles ne font pas partie de l'abi du contrat.
id: Anda juga dapat mendefinisikan fungsi internal yang tidak dapat diakses secara eksternal, dengan hanya menghilangkan fungsi internal di dalam kontrak yang Anda embed atau berinteraksi dengan komponen di luar, karena mereka bukan bagian dari abi kontrak.
tr: Ayrıca #[embeddable_as(name)] özniteliğini dahili impl bloğunun üstünden atlayarak harici olarak erişilemeyecek iç fonksiyonları da tanımlayabilirsiniz. Bu iç işlevleri, bileşeni yerleştirdiğiniz sözleşmenin içinde kullanabilirsiniz, ancak sözleşmenin abisinin bir parçası olmadıkları için dışarıdan etkileşimde bulunamazsınız.
zh_cn: 您也可以定义无法从外部访问的内部功能, 简单地略去内部“ impl” 区块之上的“ [embedable_ as( name)] ” 属性。 您可以在合同内使用这些内部功能, 将组件嵌入合同内, 但不能从外部与它互动, 因为这些功能不是合同附件的一部分 。

source: Functions within these `impl` block expect arguments like `ref self: ComponentState<TContractState>` (for state-modifying functions) or `self: @ComponentState<TContractState>` (for view functions). This makes the impl generic over `TContractState`, allowing us to use this component in any contract.
es: Las funciones dentro de este bloque `impl` esperan argumentos como `ref self: ComponentState<TContractState® (para funciones de modificación del estado) o `self: @ComponentState<TContractState® (para funciones de visualización). Esto hace que el impl genérico sobre `TContractState`, que nos permite utilizar este componente en cualquier contrato.
fr: Fonctions à l'intérieur de ces blocs `impl` attendent des arguments comme `ref self: ComponentState<TContractState>` (pour les fonctions modifiant l'état) ou `self: @ComponentState<TContractState>` (pour les fonctions de vue), ce qui rend l'impl générique sur `TContractState`, nous permettant d'utiliser ce composant dans n'importe quel contrat.
id: Fungsi-fungsi dalam blok ini mengharap argumen seperti 'componentstate': Componentstate<TContract>) (untuk fungsi modifikasi negara) atau diri sendiri: @CompentState<TContractate> (untuk fungsi tili). Hal ini membuat impl generik lebih dari ÉTContractSateía, memungkinkan kita untuk menggunakan komponen ini dalam kontrak apapun.
tr: Bu impl bloğu içindeki işlevler, ref benliği: ComponentStateTContractState> (devlet değiştirme işlevleri için) veya self: @ComponentStateTContractState> (görme işlevleri için) gibi argümanları bekler. Bu, impl jenerikini TContractState üzerinde yapar ve bu bileşeni herhangi bir sözleşmede kullanmamıza izin verir.
zh_cn: 这些`简单'区块预期参数中的功能,如`自我:国家元件 < 合同国}}(用于国家调整功能)或`本身:@concononentstate < 合同国'{(用于观察功能),这使“合同国”的内插成为通用的,使我们能够在任何合同中使用这一组成部分。

source: Example: an Ownable Component
es: Ejemplo: un componente propio
fr: Exemple : un composant propre
id: Contoh: Komponen yang Dapat Dimiliki
tr: Örnek: Sahiplenilebilir Bileşen
zh_cn: 示例:一个自有组成部分

source: ⚠️ The example shown below has not been audited and is not intended for production use. The authors are not responsible for any damages caused by the use of this code.
es: El ejemplo que se muestra a continuación no ha sido auditado y no está destinado al uso de la producción. Los autores no son responsables de los daños causados por el uso de este código.
fr: L'exemple ci-dessous n'a pas été vérifié et n'est pas destiné à la production. Les auteurs ne sont pas responsables des dommages causés par l'utilisation de ce code.
id: ▪ Contoh yang diperlihatkan di bawah ini belum diaudit dan tidak ditujukan untuk penggunaan produksi. Penulis tidak bertanggung jawab atas kerusakan apa pun yang disebabkan oleh penggunaan kode ini.
tr: Aşağıda gösterilen örnek denetlenmemiştir ve üretim kullanımına yönelik değildir. Yazarlar bu kodun kullanımından kaynaklanan herhangi bir zarardan sorumlu değildir.
zh_cn: 以下的例子未经审计,也不打算用于生产,提交人对使用这一代码造成的任何损害不负责。

source: The interface of the Ownable component, defining the methods available externally to manage ownership of a contract, would look like this:
es: La interfaz del componente Propiedad, que define los métodos disponibles externamente para gestionar la propiedad de un contrato, se vería así:
fr: L'interface de la composante Ownable, définissant les méthodes disponibles à l'extérieur pour gérer la propriété d'un contrat, ressemblerait à ceci:
id: Antarmuka komponen yang dapat dimiliki, mendefinisikan metode yang tersedia secara eksternal untuk mengelola kepemilikan kontrak, akan terlihat seperti ini:
tr: Bir sözleşmenin mülkiyetini yönetmek için harici olarak mevcut yöntemleri tanımlayan Sahipli bileşenin arayüzü şu şekilde görünecektir:
zh_cn: 自有部分的接口,界定了外部管理合同所有权的现有方法,看起来是这样:

source: The component itself is defined as:
es: El componente en sí se define como:
fr: Le composant lui-même est défini comme suit:
id: Komponen itu sendiri didefinisikan sebagai:
tr: Bileşenin kendisi şöyle tanımlanır:
zh_cn: 构成部分本身的定义是:

source: This syntax is actually quite similar to the syntax used for contracts. The only differences relate to the `#[embeddable_as]` attribute above the impl and the genericity of the impl block that we will dissect in details.
es: Esta sintaxis es en realidad bastante similar a la sintaxis utilizada para los contratos. Las únicas diferencias se relacionan con el atributo "[embeddable_as]` por encima de la impl y la genérica del bloque de impl que vamos a diseccionar en detalles.
fr: Cette syntaxe est en fait assez similaire à la syntaxe utilisée pour les contrats. Les seules différences concernent l'attribut `#[embeddable_as]` au-dessus de l'impl et la generalité du bloc impl que nous disséquerons dans les détails.
id: Sintaks ini sebenarnya cukup mirip dengan sintaks yang digunakan untuk kontrak. Perbedaan-perbedaan hanya berhubungan dengan yang "#[terbengkak_as]_as] atribut di atas impl dan generik dari blok impl yang akan kita bedah secara detail.
tr: Bu sözdizimi aslında sözleşmeler için kullanılan sözdizimi ile oldukça benzerdir. Tek farklar, impl'nin üzerindeki #[embeddable_as] özniteliği ve ayrıntılı olarak inceleyeceğimiz impl bloğunun genelliği ile ilgilidir.
zh_cn: 这个语法实际上与合同所使用的语法非常相似,唯一的差别在于“{[emiddable_as]’’ ” 属性高于Unl和Unl块的通用性,我们将在细节中解析。

source: As you can see, our component has two `impl` blocks: one corresponding to the implementation of the interface trait, and one containing methods that should not be exposed externally and are only meant for internal use. Exposing the `assert_only_owner` as part of the interface wouldn't make sense, as it's only meant to be used internally by a contract embedding the component.
es: Como puede ver, nuestro componente tiene dos bloques `impl`: uno que corresponde a la implementación del rasgo de interfaz, y otro que contiene métodos que no deben exponerse externamente y que sólo están destinados a uso interno. Exponer el `assert_only_owner` como parte de la interfaz no tendría sentido, ya que sólo está destinado a ser utilizado internamente por un contrato que incrusta el componente.
fr: Comme vous pouvez le voir, notre composant a deux blocs `impl`: un correspondant à l'implémentation du trait d'interface, et une contenant des méthodes qui ne devraient pas être exposées externement et ne sont destinées qu'à une utilisation interne. Exposer le `assert_only_owner` dans le cadre de l'interface n'aurait pas de sens, car il est uniquement destiné à être utilisé en interne par un contrat en intégrant le composant.
id: Seperti yang dapat Anda lihat, komponen kami memiliki dua blok ·implplo: satu yang berhubungan dengan implementasi dari sifat antarmuka, dan satu metode yang mengandung yang tidak boleh terekspos secara eksternal dan hanya untuk penggunaan internal. Mengeksposisert_only_ownerà sebagai bagian dari antarmuka tidak akan masuk akal, karena itu hanya dimaksudkan untuk digunakan secara internal oleh kontrak yang menggabungkan komponen.
tr: Gördüğünüz gibi, bileşenimizin iki impl bloğu vardır: biri arayüz özelliğinin uygulanmasına karşılık gelir ve biri harici olarak maruz bırakılmaması gereken ve yalnızca dahili kullanım için olan yöntemleri içerir. Arayüzün bir parçası olarak assert_only_owner'ı açığa çıkarmak mantıklı olmaz, çünkü yalnızca bileşeni gömen bir sözleşme ile dahili olarak kullanılması amaçlanmıştır.
zh_cn: 如你所见,我们的组成部分有两个`内含'区块:一个与接口特性的实施相对应,一个含有不应对外暴露并仅用于内部使用的方法。 将`资产所有者'作为接口的一部分暴露是没有道理的,因为它只是被嵌入组成部分的合同内部使用。

source: A Closer Look at the `impl` Block
es: Una mirada más cercana al bloque `impl`
fr: Un regard plus étroit sur le bloc `impl`
id: A Closer Look at the éimplin Block
tr: impl Bloğuna Daha Yakından Bir Bakış
zh_cn: 更仔细地看一看`impl'区块

source: The `#[embeddable_as]` attribute is used to mark the impl as embeddable inside a contract. It allows us to specify the name of the impl that will be used in the contract to refer to this component. In this case, the component will be referred to as `Ownable` in contracts embedding it.
es: El atributo `[embeddable_as]` se utiliza para marcar el impl como incrustable dentro de un contrato. Nos permite especificar el nombre del impl que se utilizará en el contrato para referirse a este componente. En este caso, el componente se denominará `Ownable` en los contratos que lo incrustan.
fr: L'attribut `#[embeddable_as]` est utilisé pour marquer l'impl comme intégrable à l'intérieur d'un contrat. Il nous permet de spécifier le nom de l'impl qui sera utilisé dans le contrat pour désigner ce composant. Dans ce cas, l'élément sera appelé `Ownable` dans les contrats l'intégrant.
id: Atribut yang dapat dibenamkan ini digunakan untuk menandai impl sebagai dapat dibenamkan dalam sebuah kontrak. Hal ini memungkinkan kita untuk menentukan nama impl yang akan digunakan dalam kontrak untuk mengacu ke komponen ini. Dalam hal ini, komponen akan disebut sebagai enembedding kontrak.
tr: #[embeddable_as] özniteliği, impl'i bir sözleşmenin içine gömülebilir olarak işaretlemek için kullanılır. Bu bileşene atıfta bulunmak için sözleşmede kullanılacak impl'in adını belirtmemize izin verir. Bu durumda, bileşen gömülü sözleşmelerde Ownable olarak anılacaktır.
zh_cn: `{[emeddable_as]’ 属性用于标记内嵌在合同中的内嵌,让我们能够指定合同中将使用的内嵌名称来指这个组成部分,在这种情况下,在嵌入该组成部分的合同中,该组成部分将被称为`Ownable'。

source: The implementation itself is generic over `ComponentState<TContractState>`, with the added restriction that `TContractState` must implement the `HasComponent<T>` trait. This allows us to use the component in any contract, as long as the contract implements the `HasComponent` trait. Understanding this mechanism in details is not required to use components, but if you're curious about the inner workings, you can read more in the ["Components Under the Hood"](./ch16-02-01-under-the-hood.md) section.
es: La aplicación en sí misma es genérica sobre `ComponentState<TContractState®, con la restricción añadida de que `TContractState` debe implementar el rasgo `HasComponent<T®. Esto nos permite utilizar el componente en cualquier contrato, siempre y cuando el contrato implemente el rasgo `HasComponent`. Entender este mecanismo en detalles no es necesario para usar componentes, pero si tienes curiosidad por el funcionamiento interno, puedes leer más en la sección ["Components Under the Hood"](./ch16-02-01-under-the-hood.md).
fr: La mise en œuvre elle-même est générique sur `ComponentState<TContractState>`, avec la restriction supplémentaire que `TContractState` doit mettre en œuvre le caractère `HasComponent<T>`. Cela nous permet d'utiliser le composant dans n'importe quel contrat, tant que le contrat met en œuvre le caractère `HasComponent`. Comprendre ce mécanisme dans les détails n'est pas nécessaire pour utiliser des composants, mais si vous êtes curieux au sujet du fonctionnement intérieur, vous pouvez en lire plus dans la section [./ch16-02-01-under-the-hood.md).
id: In implementasi itu sendiri adalah generik daripada komponenstate<TContractstate>, dengan tambahan pembatasan yang kontraksi. Memahami mekanisme ini dalam rincian tidak diperlukan untuk menggunakan komponen, tetapi jika Anda ingin tahu tentang pekerjaan dalam tubuh, Anda dapat membaca lebih banyak dalam "Compents Under the Hood".HasCompponent.16-thehood-underhood.
tr: Uygulamanın kendisi ComponentStateTContractState> üzerinde geneldir, TContractState'in HasComponentT> özelliğini uygulaması gereken ek kısıtlama ile. Bu, sözleşme HasComponent özelliğini uyguladığı sürece, herhangi bir sözleşmedeki bileşeni kullanmamızı sağlar. Bu mekanizmayı ayrıntılarda anlamak, bileşenleri kullanmak için gerekli değildir, ancak meraklıysanız
zh_cn: 实施本身是通用的,而不是“Compent State <Ttract State> ”, 附加的限制是“缔约国”必须执行`Has Conponent <T}特性,这使我们能够在任何合同中使用该组成部分,只要合同执行`Has Conponent'特性。在使用部件时不需要详细了解这一机制,但是,如果你对内部运作感到好奇,可以在[“Hood下的构件”](./ch16-02-01-under-the bethy.md)一节中读更多。

source: One of the major differences from a regular smart contract is that access to storage and events is done via the generic `ComponentState<TContractState>` type and not `ContractState`. Note that while the type is different, accessing storage or emitting events is done similarly via `self.storage_var_name.read()` or `self.emit(...).`
es: Una de las principales diferencias con respecto a un contrato inteligente regular es que el acceso al almacenamiento y a los eventos se realiza a través del tipo genérico `ComponentState<TContractState® y no `ContractState`. Tenga en cuenta que, si bien el tipo es diferente, acceder al almacenamiento o emitir eventos se hace de manera similar a través de `self.storage_var_name.read()` o `self.emit(...)`.
fr: Une des principales différences par rapport à un contrat intelligent régulier est que l'accès au stockage et aux événements se fait via le type générique `ComponentState<TContractState>` et non pas `ContractState`. Notez que bien que le type soit différent, l'accès au stockage ou à l'émission d'événements se fait de la même manière via `self.storage_var_name.read()` ou `self.emit(...)`.
id: Salah satu perbedaan besar dari kontrak cerdas yang biasa adalah akses ke penyimpanan dan acara dilakukan melalui umum ▪ Komponentstate<TContract> tipe dan bukan tipe ÁContractState. Perhatikan bahwa ketika jenis ini berbeda, mengakses penyimpanan atau memancarkan peristiwa dilakukan dengan cara yang sama melalui sendiri.storage_var_name) atau Áselfselfself...).
tr: Düzenli bir akıllı sözleşmeden en büyük farklardan biri, depolama ve etkinliklere erişimin ComponentStateTContractState> türü değil, genel ContractState üzerinden yapılmasıdır. Tür farklı olsa da, depolama veya yayan etkinliklere erişmenin self.storage_var_name.read() veya self.emit(...) aracılığıyla benzer şekilde yapıldığını unutmayın.
zh_cn: 与正常的智能合同的主要区别之一是,获取储存和事件是通过通用的 " Commonent State <Ttract State'类型 " 而不是 " Parties State " 类型进行的,请注意,虽然这种类型不同,但获取储存或排放事件也同样通过`self.storage_var_name.read()'或`self.emit(.)'进行。

source: Note: To avoid the confusion between the embeddable name and the impl name, we recommend keeping the suffix `Impl` in the impl name.
es: Nota: Para evitar la confusión entre el nombre incrustable y el nombre impl, recomendamos mantener el sufijo `Impl` en el nombre impl.
fr: Note : Pour éviter la confusion entre le nom intégrable et le nom impl, nous vous recommandons de conserver le suffixe `Impl` dans le nom impl.
id: Catatan: Untuk menghindari kebingungan antara nama lampiran dan nama impl, kami merekomendasikan agar nama akhiran tersebut tetap ada dalam nama impl.
tr: Not: Gömülü isim ile impl adı arasındaki karışıklığı önlemek için, Impl son ekini impl adında tutmanızı öneririz.
zh_cn: 注意:为了避免混淆嵌入式名称和内嵌式名称,我们建议把后缀`Impl'保留在内嵌式名称中。

source: Migrating a Contract to a Component
es: Migrar un contrato a un componente
fr: Migrer un contrat en un élément
id: Memisahkan Kontrak dengan Komponen
tr: Bir Sözleşmenin Bir Bileşene Taşınması
zh_cn: 将合同移至一个构成部分

source: Since both contracts and components share a lot of similarities, it's actually very easy to migrate from a contract to a component. The only changes required are:
es: Dado que ambos contratos y componentes comparten muchas similitudes, en realidad es muy fácil migrar de un contrato a un componente. Los únicos cambios requeridos son:
fr: Puisque les contrats et les composants ont beaucoup de similitudes, il est en fait très facile de passer d'un contrat à un composant. Les seuls changements requis sont:
id: Karena kedua kontrak dan komponen berbagi banyak kesamaan, sebenarnya sangat mudah untuk bermigrasi dari kontrak ke komponen. satu-satunya perubahan yang diperlukan adalah:
tr: Hem sözleşmeler hem de bileşenler birçok benzerliği paylaştığından, bir sözleşmeden bir bileşene göç etmek aslında çok kolaydır. Gerekli olan tek değişiklikler:
zh_cn: 由于合同和部件有许多相似之处,实际上很容易从合同转换成部件。

source: Adding the `#[starknet::component]` attribute to the module.
es: Añadiendo el atributo "[starknet::componente]` al módulo.
fr: Ajout de l'attribut `#[starknet::component]` au module.
id: Menambahkan atribut å#[Starknet::component]å ke modul.
tr: #[starknet::component] özniteliğini modüle eklemek.
zh_cn: 向模块添加 {[ Starkknet:: 元件] 属性 。

source: Adding the `#[embeddable_as(name)]` attribute to the `impl` block that will be embedded in another contract.
es: Añadiendo el atributo "[embeddable_as(name)]` al bloque `impl` que será incrustado en otro contrato.
fr: Ajout de l'attribut `#[embeddable_as(name)]` au bloc `impl` qui sera intégré dans un autre contrat.
id: Menambahkan aktiviti pada blok yang akan tertanam dalam kontrak lain.
tr: #[embeddable_as(name)] özniteliğini başka bir sözleşmeye gömülecek olan impl bloğuna eklemek.
zh_cn: 将“{[embedable_as_as(name)]”属性添加到将嵌入另一合同的`impl'块。

source: Adding generic parameters to the `impl` block:
es: Añadiendo parámetros genéricos al bloque `impl`:
fr: Ajouter des paramètres génériques au bloc `impl` :
id: Menambahkan parameter generik ke blok æimplo:
tr: impl bloğuna jenerik parametreler ekleme:
zh_cn: 在“impl”区块中添加通用参数:

source: Adding `TContractState` as a generic parameter.
es: Añadiendo `TContractState` como parámetro genérico.
fr: Ajouter `TContractState` comme paramètre générique.
id: Menambahkan 'TContractState' sebagai parameter umum.
tr: TContractState genel parametre olarak eklenir.
zh_cn: 添加`缔约国'作为通用参数。

source: Adding `+HasComponent<TContractState>` as an impl restriction.
es: Añadiendo â € TM tiene Component< TcontractStateâ TM como una restricción de impl.
fr: Ajouter `+HasComponent<TContractState>` comme restriction impl.
id: Menambahkan <TContractState> sebagai pembatasan impl.
tr: +HasComponentTContractState> impl kısıtlaması olarak eklenir.
zh_cn: 添加“Has Concomonent <Ttract State>”作为不设限制。

source: Changing the type of the `self` argument in the functions inside the `impl` block to `ComponentState<TContractState>` instead of `ContractState`.
es: Cambiar el tipo de argumento `auto` en las funciones dentro del bloque `impl` a `EstadoComponente<EstadoTContract` en lugar de `EstadoContracto`.
fr: Modifier le type d'argument `self` dans les fonctions à l'intérieur du bloc `impl` en `ComponentState<TContractState>` au lieu de `ContractState`.
id: Mengubah tipe argumen diri sendiri dalam fungsi di dalam blok ıimploclate menjadi komponenstate<TContract> bukan ContractState (kontrate).
tr: Impl bloğu içindeki işlevlerdeki self argümanının türünü ContractState yerine ComponentStateTContractState> olarak değiştirmek.
zh_cn: 将`内设'区块内的功能中的`自我'论点类型改为`Compent State <Ttract State ',而不是`缔约国'。

source: For traits that do not have an explicit definition and are generated using `#[generate_trait]`, the logic is the same - but the trait is generic over `TContractState` instead of `ComponentState<TContractState>`, as demonstrated in the example with the `InternalTrait`.
es: En el caso de los rasgos que no tienen una definición explícita y que se generan utilizando el término "[generate_trait]", la lógica es la misma, pero el rasgo es genérico sobre "TcontractState" en lugar de "ComponentState<TcontractState", como se demuestra en el ejemplo del "Trait interno".
fr: Pour les caractères qui n'ont pas de définition explicite et qui sont générés en utilisant `#[generate_trait]`, la logique est la même - mais le caractère est générique sur `TContractState` au lieu de `ComponentState<TContractState>`, comme le montre l'exemple avec le `InternalTrait`.
id: Untuk sifat-sifat yang tidak memiliki definisi eksplisit dan dihasilkan menggunakan \\fnCandara\fs55\b1\4cH000000\4aH80}koresponponent<TContractate>
tr: Açık bir tanımı olmayan ve #[genate_trait] kullanılarak oluşturulan özellikler için, mantık aynıdır - ancak özellik, InternalTrait örneğinde gösterildiği gibi, ComponentState yerine TContractState üzerinde geneldir.
zh_cn: 对于没有明确定义、使用``[遗传_trait]产生的特性,逻辑是相同的,但这种特性一般高于`缔约国 ',而不是`进口国<缔约国 ',如`内部Trait'的例子所示。

source: Using Components Inside a Contract
es: Uso de componentes dentro de un contrato
fr: Utilisation de composants à l'intérieur d'un contrat
id: Menggunakan Komponen di Dalam Kontrak
tr: Bir Sözleşmenin İçindeki Bileşenleri Kullanmak
zh_cn: 合同内使用部件

source: The major strength of components is how it allows reusing already built primitives inside your contracts with a restricted amount of boilerplate. To integrate a component into your contract, you need to:
es: La principal fuerza de los componentes es cómo permite reutilizar primitivos ya construidos dentro de sus contratos con una cantidad restringida de placa de caldera. Para integrar un componente en su contrato, usted necesita:
fr: La force majeure des composants est la façon dont il permet de réutiliser des primitives déjà construits à l'intérieur de vos contrats avec une quantité limitée de plaque de chaudière. Pour intégrer un composant dans votre contrat, vous devez :
id: Kekuatan utama komponen adalah bagaimana hal itu memungkinkan penggunaan kembali primitif dalam kontrak Anda dengan sejumlah terbatas boilerplate. untuk mengintegrasikan komponen ke dalam kontrak Anda, Anda perlu:
tr: Bileşenlerin ana gücü, sözleşmelerinizin içinde zaten inşa edilmiş ilkelleri sınırlı miktarda kazan plakasıyla yeniden kullanmaya nasıl izin verdiğidir. Bir bileşeni sözleşmenize entegre etmek için şunları yapmanız gerekir:
zh_cn: 组件的主要强度在于它允许您在合同中用数量有限的锅炉板重新使用已经建成的原始材料。 要将组件纳入合同,您需要:
