Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The core library prelude delivers the fundamental programming constructs and operations needed for basic Cairo programs, without requiring the explicit import of elements. Since the core library prelude is automatically imported, its contents are available for use in any Cairo crate without explicit imports. This prevents repetition and provides a better devX. This is what allows you to use `ArrayTrait::append()` or the `Default` trait without bringing them explicitly into scope.
es: El preludio de la biblioteca central proporciona los constructos y operaciones de programación fundamentales necesarios para los programas básicos de El Cairo, sin exigir la importación explícita de elementos. Dado que el preludio de la biblioteca central se importa automáticamente, sus contenidos están disponibles para su uso en cualquier caja de El Cairo sin importaciones explícitas. Esto evita la repetición y proporciona un mejor devX. Esto es lo que le permite utilizar `ArrayTrait::append()` o el rasgo `Default` sin introducirlos explícitamente en el ámbito de aplicación.
fr: Le prélude de base de la bibliothèque fournit les constructions et les opérations de programmation fondamentales nécessaires pour les programmes de base du Caire, sans exiger l'importation explicite d'éléments. Puisque le prélude de base de la bibliothèque est automatiquement importé, son contenu est disponible pour une utilisation dans n'importe quelle caisse du Caire sans importation explicite. Cela empêche la répétition et fournit un meilleur devX. C'est ce qui vous permet d'utiliser `ArrayTrait::append()` ou le caractère `Default` sans les introduire explicitement dans la portée.
id: Perpustakaan inti prelude memberikan konstruksi pemrograman dasar dan operasi yang diperlukan untuk program-program dasar Kairo, tanpa memerlukan impor elemen yang eksplisit. Karena perpustakaan inti prelude secara otomatis diimpor, isinya tersedia untuk digunakan di setiap peti Kairo tanpa impor eksplisit. Hal ini mencegah pengulangan dan menyediakan devX yang lebih baik. Ini adalah apa yang memungkinkan Anda untuk menggunakan ▪ArrayTrait:apend 1964) atau sifat ÁDafán tanpa membawa mereka secara eksplisit ke ruang lingkup.
tr: Çekirdek kütüphane önlüğü, temel Kahire programları için gerekli temel programlama yapılarını ve işlemleri, öğelerin açık bir şekilde içe aktarılmasını gerektirmeden sunar. Çekirdek kütüphane önlüğü otomatik olarak içe aktarıldığından, içeriği açık bir şekilde içe aktarılmadan herhangi bir Kahire kasasında kullanılabilir. Bu tekrarlamayı önler ve daha iyi bir devX sağlar. ArrayTrait::append() veya Default özelliğini açıkça kapsamadan kullanmanızı sağlayan şey budur.
zh_cn: 核心图书馆前端提供开罗基本程序所需的基本编程结构和操作,而无需明确输入元素。由于核心图书馆前端是自动进口的,因此其内容可在任何开罗箱中使用,无需明确输入。这防止了重复,提供了更好的devX。这就是您可以使用`ArrayTrait:附录()'或`Default' 特性,而没有将其明确纳入范围。

source: You can choose which prelude to use. For example, adding `edition = "2023_11"` in the _Scarb.toml_ configuration file will load the prelude from November 2023. Note that when you create a new project using `scarb new` command, the _Scarb.toml_ file will automatically include `edition = "2023_11"`.
es: Puede elegir qué preludio usar. Por ejemplo, añadir `edición = "2023_11"` en el archivo de configuración _Scarb.toml_ cargará el preludio a partir de noviembre de 2023. Tenga en cuenta que cuando cree un nuevo proyecto usando el comando `scarb new`, el archivo _Scarb.toml_ incluirá automáticamente `edición = "2023_11"`.
fr: Vous pouvez choisir le prélude à utiliser. Par exemple, ajouter `edition = "2023_11"` dans le fichier de configuration _scarb.toml_ chargera le prélude à partir de novembre 2023. Notez que lorsque vous créez un nouveau projet en utilisant la commande `scarb new`, le fichier _scarb.toml_ comprendra automatiquement `edition = "2023_11"`.
id: Anda dapat memilih prelude mana yang akan digunakan. Sebagai contoh, menambahkan roodisi = "2023_11" dalam berkas konfigurasi _Scarb.toml_ akan memuat preludesi dari November 2023. Perlu dicatat bahwa ketika Anda membuat proyek baru menggunakan perintah baru ▪scarb baru, berkas _Scarb.toml_ secara otomatis akan memuat fusition = "2023_11"
tr: Hangi önbelleği kullanacağınızı seçebilirsiniz. Örneğin, _Scarb.toml_ yapılandırma dosyasına edition = "2023_11" eklenmesi, önbelleği Kasım 2023'ten itibaren yükleyecektir. scarb new komutunu kullanarak yeni bir proje oluşturduğunuzda, _Scarb.toml_ dosyasının otomatik olarak edition = "2023_11" içereceğini unutmayın.
zh_cn: 您可以选择要使用的前缀 。 例如, 在 _Scarb.toml_配置文件中添加“ edtion = “ 2023_ 11 ”, 从 2023 年 11 月 2023 日起将装入前缀 。 请注意, 当您使用 ` screb new' 命令创建新工程时, _ Scarb.toml_ 文件将自动包含“ edtion = “ 2023_ 11 ” 。

source: The compiler currently exposes 2 different versions of the prelude:
es: El compilador actualmente expone 2 versiones diferentes del preludio:
fr: Le compilateur expose actuellement 2 versions différentes du prélude:
id: kompiler saat ini mengekspos 2 versi berbeda dari prelude:
tr: Derleyici şu anda prelüdün 2 farklı sürümünü açığa çıkarır:
zh_cn: 汇编者目前揭露了前奏的两种不同版本:

source: A general version, with a lot of traits that are made available, corresponding to `edition = "2023_01"`.
es: Una versión general, con muchos rasgos que se ponen a disposición, correspondiente a `edición = "2023_01"`.
fr: Une version générale, avec beaucoup de traits qui sont mis à disposition, correspondant à `édition = "2023_01"`.
id: Sebuah versi umum, dengan banyak sifat yang tersedia, sesuai dengan åedition = "2023_01."
tr: edition = "2023_01"'e karşılık gelen, kullanılabilir hale getirilen birçok özelliğe sahip genel bir sürüm.
zh_cn: 通用版本,具有许多可用特性,相当于`编辑=`2023_01'`。

source: A restricted version, including the most essential traits needed for general Cairo programming, corresponding to `edition = 2023_11`.
es: Una versión restringida, que incluye los rasgos más esenciales necesarios para la programación general de El Cairo, correspondiente a `edición = 2023_11`.
fr: Une version restreinte, comprenant les traits les plus essentiels nécessaires à la programmation générale du Caire, correspondant à "édition = 2023_11".
id: Versi yang terbatas, termasuk sifat yang paling penting yang diperlukan untuk pemrograman umum Kairo, yang berhubungan dengan edisi = 2023_11.
tr: edition = 2023_11'ye karşılık gelen, genel Kahire programlaması için gerekli olan en temel özellikler de dahil olmak üzere sınırlı bir sürüm.
zh_cn: 限制性版本,包括开罗总体方案拟订所需的最基本特征,相当于 " 编辑=2023_11 " 。

source: Appendix E - Common Error Messages
es: Apéndice E - Mensajes de error comunes
fr: Annexe E - Messages d'erreur communs
id: Lampiran E - Common Error Pesan
tr: Ek E - Ortak Hata Mesajları
zh_cn: 附录E - 常见错误信息

source: You might encounter error messages when writing Cairo code. Some of them occur very frequently, which is why we will be listing the most common error messages in this appendix to help you resolve common issues.
es: Usted puede encontrar mensajes de error al escribir el código de El Cairo. Algunos de ellos ocurren con mucha frecuencia, por lo que vamos a enumerar los mensajes de error más comunes en este apéndice para ayudarle a resolver problemas comunes.
fr: Vous pourriez rencontrer des messages d'erreur lors de l'écriture du code du Caire. Certains d'entre eux se produisent très fréquemment, c'est pourquoi nous allons lister les messages d'erreur les plus courants dans cette annexe pour vous aider à résoudre des problèmes communs.
id: Anda mungkin menemukan pesan kesalahan ketika menulis kode Kairo. Beberapa dari mereka terjadi sangat sering, itulah sebabnya kita akan mendaftarkan pesan kesalahan yang paling umum dalam apendiks ini untuk membantu Anda menyelesaikan masalah umum.
tr: Kahire kodunu yazarken hata mesajlarıyla karşılaşabilirsiniz. Bazıları çok sık meydana gelir, bu nedenle ortak sorunları çözmenize yardımcı olmak için bu ekteki en yaygın hata mesajlarını listeleyeceğiz.
zh_cn: 您在写入开罗代码时可能会遇到错误信息。 其中一些非常频繁发生, 这就是为什么我们将在本附录中列出最常见的错误信息, 以帮助您解决常见问题 。

source: `Variable not dropped.`: this error message means that you are trying to make a variable with a type that do not implement the `Drop` trait go out of scope, withtout destroying it. Make sure that variables that need to be dropped at the end of the execution of a function implement the `Drop` trait or the `Destruct` trait. See [Ownership](ch04-01-what-is-ownership.md#destroying-values---example-with-feltdict) section.
es: `Variable no se cayó.`: este mensaje de error significa que usted está tratando de hacer una variable con un tipo que no implementa el rasgo `Drop` sale fuera de alcance, sin destruirlo. Asegúrese de que las variables que necesitan ser caídas al final de la ejecución de una función implementen el rasgo `Drop` o el rasgo `Destruct`. Vea [Propiedad](ch04-01-what-is-ownership.md#destroying-values---ejemplo-with-feltdict) sección.
fr: `Variable not labd.`: ce message d'erreur signifie que vous essayez de faire une variable avec un type qui n'implémente pas le caractère `Drop` sortir de la portée, sans la détruire. Assurez-vous que les variables qui doivent être abandonnées à la fin de l'exécution d'une fonction implémentent le caractère `Drop` ou le caractère `Destruct`. Voir [Ownership](ch04-01- what-is-ownership.md#destroying-values---example-with-feltdict) section.
id: Pesan galat ini berarti Anda mencoba membuat variabel dengan tipe yang tidak mengimplementasikan sifat ÉDropán. Lihat [Ownership]. (Ownership].Anch04-is-ownership.m#destroyering-value--exple-with-fectivet) bagian.
tr: Variable not drop.: Bu hata mesajı, Drop özelliğini uygulamayan bir türe sahip bir değişkeni kapsam dışına çıkarmaya çalıştığınız anlamına gelir, onu yok eder. Bir fonksiyonun yürütülmesinin sonunda düşmesi gereken değişkenlerin Drop özelliğini veya Destruct-what-what-whonest özelliğini uyguladığından emin olun.
zh_cn: `可变不可丢弃 。 ` : 此错误信息意味着您正在试图制造一个变量, 其类型不执行 ` 拖放' 特性, 然后再将其销毁。 确保在执行函数的结尾处需要丢弃的变量能够执行 `拖放' 特性 或` 破坏' 特性 。 见 [所有者] (ch04-01-what- is- 拥有. md# destroying- values- example- with- feltdict) 部分。

source: `Variable was previously moved.`: this error message means that you are trying to use a variable whose ownership has already been transferred to another function. When a variable doesn't implement the `Copy` trait, it is passed by value to functions, and ownership of the variable is transferred to the function. Such a variable cannot be used anymore in the current context after its ownership has been transferred. It is often useful to use the `clone` method in this situation.
es: `Variable fue movido previamente.`: este mensaje de error significa que usted está tratando de utilizar una variable cuya propiedad ya ha sido transferida a otra función. Cuando una variable no implementa el rasgo `Copiar`, se pasa por valor a las funciones, y la propiedad de la variable se transfiere a la función. Tal variable ya no puede ser utilizada en el contexto actual después de su propiedad ha sido transferida. A menudo es útil utilizar el método `clone'en esta situación.
fr: `Variable a été précédemment déplacé.`: ce message d'erreur signifie que vous essayez d'utiliser une variable dont la propriété a déjà été transférée à une autre fonction. Lorsqu'une variable n'implémente pas le caractère `Copie`, elle est transmise par valeur aux fonctions, et la propriété de la variable est transférée à la fonction. Une telle variable ne peut plus être utilisée dans le contexte actuel après que sa propriété a été transférée. Il est souvent utile d'utiliser la méthode `clone` dans cette situation.
id: Sebelumnya dapat diubah. Pesan kesalahan ini berarti anda mencoba menggunakan variabel yang kepemilikannya telah ditransfer ke fungsi lain. ketika variabel tidak mengimplementasikan sifat (COP), ia diteruskan oleh nilai ke fungsi, dan kepemilikan variabel tersebut dipindahkan ke fungsi. Variabel tersebut tidak dapat digunakan lagi dalam konteks saat ini setelah kepemilikannya dipindahkan. Sering berguna untuk menggunakan metode Áclone dalam situasi ini.
tr: Variable daha önce taşındı.: Bu hata mesajı, sahipliği zaten başka bir fonksiyona aktarılan bir değişkeni kullanmaya çalıştığınız anlamına gelir. Bir değişken Copy özelliğini uygulamadığında, fonksiyona değer tarafından geçirilir ve değişkenin mülkiyeti fonksiyona aktarılır. Böyle bir değişken, sahipliği aktarıldıktan sonra mevcut bağlamda kullanılamaz. Bu yöntemde clone kullanımı genellikle yararlıdır.
zh_cn: `可变先前已移动 。 ` : 此错误信息意指您正在试图使用一个其所有权已经转移至另一个函数的变量。 当变量不执行“ 复制” 特性时,该变量被按价值传递到函数,该变量的所有权被转移到函数。 此变量在所有权转移后无法在当前背景下使用。 在这种情况下,使用“ 克隆” 方法通常有用。

source: `error: Trait has no implementation in context: core::fmt::Display::<package_name::struct_name>`: this error message is encountered if you try to print an instance of a custom data type with `{}` placeholders in a `print!` or `println!` macro. To mitigate this issue, you need to either manually implement the `Display` trait for your type, or use the `Debug` trait by applying `derive(Debug)` to your type, allowing to print your instance by adding `:?` in `{}` placeholders.
es: `error: El rasgo no tiene implementación en contexto: core::fmt::Display::<package_name:::struct_name»: este mensaje de error se encuentra si intenta imprimir una instancia de un tipo de datos personalizado con marcadores de posición en una macro `print!` o `println!`. Para mitigar este problema, necesita implementar manualmente el rasgo `Display` para su tipo, o utilizar el rasgo `Debug` aplicando `derive(Debug)` a su tipo, permitiendo imprimir su instancia agregando `:?` en marcadores de posición.
fr: `error: Trait n'a pas d'implémentation dans le contexte: core::fmt::Display::<package_name::struct_name>`: ce message d'erreur est rencontré si vous essayez d'imprimer une instance d'un type de données personnalisé avec `{}` placeholders dans une macro `print!` ou `println!`. Pour atténuer ce problème, vous devez soit implémenter manuellement le caractère `Display` pour votre type, soit utiliser le caractère `Debug` en appliquant `derive(Debug)` à votre type, permettant d'imprimer votre instance en ajoutant `:?` dans `{}` placeholders.
id: RIGRATOR: Trait tidak memiliki implementasi dalam konteks: core:fmt: Display::<package_name::::struct_name>: pesan kesalahan ini ditemui jika Anda mencoba untuk mencetak suatu contoh dari tipe data kustom dengan pemegang tempat dalam sebuah Áprint! atau ÁprintInln!
tr: error: Trait'in bağlamda bir uygulaması yoktur: core::fmt::Display::package_name:::struct_name>: print! veya println! makro. Bu sorunu hafifletmek için, Display özelliğinizi manuel olarak uygulamanız gerekir.
zh_cn: `error: Trait 在上下文中没有执行: 核心 : fmt : Display: <package_ name: struct_name\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

source: `Got an exception while executing a hint: Hint Error: Failed to deserialize param #x.`: this error means that the execution failed because an entrypoint was called without the expected arguments. Make sure that the arguments you provide when calling an entrypoint are correct. There is a classic issue with `u256` variables, which are actually structs of 2 `u128`. Therefore, when calling a function that takes a `u256` as argument, you need to pass 2 values.
es: `Tengo una excepción al ejecutar una pista: Error de pista: Falló al deserializar el param #x.`: este error significa que la ejecución falló porque se llamó un punto de entrada sin los argumentos esperados. Asegúrese de que los argumentos que proporciona al llamar a un punto de entrada son correctos. Hay un problema clásico con las variables `u256`, que en realidad son structs de 2 `u128. Por lo tanto, al llamar a una función que toma un `u256` como argumento, es necesario pasar 2 valores.
fr: `Got une exception lors de l'exécution d'un indice: Hint Error: Failed to déserialize param #x.`: cette erreur signifie que l'exécution a échoué parce qu'un point d'entrée a été appelé sans les arguments attendus. Assurez-vous que les arguments que vous fournissez lors de l'appel d'un point d'entrée sont corrects. Il y a un problème classique avec les variables `u256`, qui sont en fait des structs de 2 `u128`. Par conséquent, lorsque vous appelez une fonction qui prend un `u256` comme argument, vous devez passer 2 valeurs.
id: GOT exception while excepting a hint Error: Gagal untuk deserialize param #x.
tr: Bir ipucu çalıştırırken bir istisna var: İpucu Hatası: Param # x'i deserialize etmek için başarısız.: Bu hata, yürütmenin başarısız olduğu anlamına gelir çünkü bir giriş noktası beklenen argümanlar olmadan çağrılmıştır. Bir giriş noktasını çağırırken verdiğiniz argümanların doğru olduğundan emin olun. u256 değişkenleriyle ilgili klasik bir sorun var, aslında 2 u128'nin yapıtlarıdır. Bu nedenle, bir fonksiyona ihtiyaç duyduğunuzda,
zh_cn: `在执行提示时有例外 : 提示错误: 解除 palim #x. 失败 : 此错误意味着执行失败, 因为一个输入点被调用时没有预期参数。 请确保您在调用一个输入点时提供的论点是正确的。 ` u256' 变量存在典型问题, 这些变量实际上是 2 ` u128'的支架。 因此, 当调用一个以` u256' 作为参数的函数时, 您需要通过 2 个值 。

source: `Item path::item is not visible in this context.`: this error message lets us know that the path to bring an item into scope is correct, but there is a vibility issue. In cairo, all items are private to parent modules by default. To resolve this issue, make sure that all the modules on the path to items and items themselves are declared with `pub(crate)` or `pub` to have access to them.
es: `Item path:: item is not visible in this context.`: este mensaje de error nos permite saber que la ruta para introducir un elemento en el alcance es correcta, pero hay un problema de visibilidad. En cairo, todos los elementos son privados a los módulos de origen por defecto. Para resolver este problema, asegúrese de que todos los módulos en la ruta a los elementos y elementos se declaran con `pub(crate)` o `pub` para tener acceso a ellos.
fr: `Item path::item n'est pas visible dans ce contexte.`: ce message d'erreur nous permet de savoir que le chemin pour introduire un élément dans la portée est correct, mais il y a un problème de vabilité. Dans cairo, tous les éléments sont privés aux modules parent par défaut. Pour résoudre ce problème, assurez-vous que tous les modules sur le chemin vers les éléments et les éléments eux-mêmes sont déclarés avec `pub(crate)` ou `pub` pour y avoir accès.
id: Jalur ltitem:: tidak terlihat dalam konteks ini. Pesan kesalahan ini memungkinkan kita tahu bahwa jalan untuk membawa item ke ruang lingkup benar, tetapi ada masalah dengan kemampuan. Dalam cairo, semua benda bersifat pribadi ke modul induk secara default. Untuk menyelesaikan masalah ini, pastikan bahwa semua modul pada jalur ke item dan benda-benda itu sendiri dinyatakan dengan ▪pubáncrate) atau Ábábé untuk mengaksesnya.
tr: Item yolu:: item bu bağlamda görünür değildir.: bu hata mesajı bize bir öğeyi kapsama alanına getirme yolunun doğru olduğunu, ancak bir uygunluk sorunu olduğunu bildirir. cairo'da, tüm öğeler varsayılan olarak ana modüllere özeldir. Bu sorunu çözmek için, öğelere ve öğelere giden yoldaki tüm modüllerin kendilerine erişmesi için pub(krate) veya pub ile ilan edildiğinden emin olun.
zh_cn: `项目路径:在此背景下,项目不可见。':这个错误信息让我们知道,将项目带入范围的道路是正确的,但有一个可变问题。在cairo,所有项目默认都是母模块的私有项目。为了解决这个问题,确保项目和项目本身路径上的所有模块都以`pub(crate)'或`pub'进行申报,以便访问它们。

source: `Identifier not found.`: this error message is a bit aspecific but might indicate that:
es: `Identificador no encontrado.`: este mensaje de error es un poco específico, pero podría indicar que:
fr: `Identificateur non trouvé.`: ce message d'erreur est un peu spécifique mais pourrait indiquer que:
id: Pengidentifikasi tidak ditemukan. Pesan kesalahan ini sedikit spesifik tapi mungkin menunjukkan bahwa:
tr: Tanımlayıcı bulunamadı.: bu hata mesajı biraz spesifiktir, ancak şunları gösterebilir:
zh_cn: `未找到身份识别符。':此错误信息有点具体,但可能表明:

source: A variable is being used before it has been declared. Make sure to declare variables with the `let` keyword.
es: Se está utilizando una variable antes de que se haya declarado. Asegúrese de declarar variables con la palabra clave `let`.
fr: Une variable est utilisée avant qu'elle n'ait été déclarée. Assurez-vous de déclarer des variables avec le mot-clé `let`.
id: Variabel sedang digunakan sebelum dideklarasikan. Pastikan untuk mendeklarasikan variabel dengan kata kuncinya.
tr: Bildirilmeden önce bir değişken kullanılıyor. let anahtar kelimesi ile değişkenleri beyan etmeyi unutmayın.
zh_cn: 在宣布变量之前,正在使用变量。确保用“let”关键字声明变量。

source: The path to bring an item into scope is wrongly defined. Make sure to use valid paths.
es: La ruta para introducir un elemento en el alcance está mal definida. Asegúrese de utilizar rutas válidas.
fr: Le chemin pour introduire un élément dans la portée est mal défini. Assurez-vous d'utiliser des chemins valides.
id: Path untuk membawa suatu butir ke dalam ruang lingkup salah didefinisikan. Pastikan untuk menggunakan path yang valid.
tr: Bir öğeyi kapsama alanına getirme yolu yanlış tanımlanmıştır. Geçerli yolları kullandığınızdan emin olun.
zh_cn: 将项目引入范围的道路定义错误。 请确保使用有效的路径 。

source: Starknet Components Related Error Messages
fr: Starknet Components Messages d'erreur associés
id: Komponen Starknet Terkait Pesan Galat
tr: Starknet Bileşenleri İlgili Hata Mesajları
zh_cn: Starknet 元件相关错误消息

source: You might encounter some errors when trying to implement components. Unfortunately, some of them lack meaningful error messages to help debug. This section aims to provide you with some pointers to help you debug your code.
es: Es posible que encuentre algunos errores al intentar implementar componentes. Desafortunadamente, algunos de ellos carecen de mensajes de error significativos para ayudar a depurar. Esta sección tiene como objetivo proporcionarle algunos punteros para ayudarle a depurar su código.
fr: Vous pourriez rencontrer des erreurs lors de la mise en œuvre de composants. Malheureusement, certains d'entre eux manquent de messages d'erreur significatifs pour aider à déboguer. Cette section vise à vous fournir quelques pointeurs pour vous aider à déboguer votre code.
id: Anda mungkin menemui beberapa kesalahan ketika mencoba mengimplementasikan komponen. Sayangnya, beberapa dari mereka tidak memiliki pesan galat yang berarti untuk membantu debug. Bagian ini bertujuan untuk menyediakan beberapa penunjuk untuk membantu anda men-debug kode.
tr: Bileşenleri uygulamaya çalışırken bazı hatalarla karşılaşabilirsiniz. Ne yazık ki, bazıları hata ayıklamaya yardımcı olmak için anlamlı hata mesajlarından yoksundur. Bu bölüm, kodunuzu hata ayıklamanıza yardımcı olacak bazı işaretçiler sağlamayı amaçlamaktadır.
zh_cn: 尝试执行组件时可能会遇到一些错误。 不幸的是, 有些缺少有意义的错误信息来帮助调试 。 本节旨在为您提供一些指示符, 帮助您调试您的代码 。
