Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Note: This is still an experimental feature and can only be used if `experimental-features = ["negative_impls"]` is enabled in your _Scarb.toml_ file, under the `[package]` section.
es: Nota: Esto sigue siendo una característica experimental y sólo se puede usar si `experimental-features = ["negativo_impls"]` está habilitado en su archivo _Scarb.toml_, en la sección `[paquete]`.
fr: Note : Ceci est encore une fonctionnalité expérimentale et ne peut être utilisé que si `experimental-features = ["négatif_impls"]` est activé dans votre fichier _Scarb.toml_, sous la section `[package]`.
id: Catatan: Ini masih merupakan fitur eksperimental dan hanya dapat digunakan jika ·experimental-features = ["negatitive_impls"]]
tr: Not: Bu hala deneysel bir özelliktir ve yalnızca [package] bölümünün altındaki _Scarb.toml_ dosyanızda experimental-features = ["negatif_impls"] etkinleştirildiğinde kullanılabilir.
zh_cn: 注意:这仍然是一个实验性特征,只有在“[包装]”部分下您的 _Scarb.toml_文件启用了`实验性地物=[“阴性_impls'’'`实验性地物'的情况下,才能使用。

source: Negative implementations, also known as negative traits or negative bounds, are a mechanism that allows you to express that a type does not implement a certain trait when defining the implementation of a trait over a generic type. Negative impls enable you to write implementations that are applicable only when another implementation does not exist in the current scope.
es: Las implementaciones negativas, también conocidas como rasgos negativos o límites negativos, son un mecanismo que le permite expresar que un tipo no implementa un determinado rasgo al definir la implementación de un rasgo sobre un tipo genérico. Impls negativos le permiten escribir implementaciones que son aplicables sólo cuando otra implementación no existe en el ámbito actual.
fr: Les implémentations négatives, également appelées caractères négatifs ou limites négatives, sont un mécanisme qui vous permet d'exprimer qu'un type n'implémente pas un certain caractère lors de la définition de l'implémentation d'un caractère sur un type générique. Des impls négatifs vous permettent d'écrire des implémentations qui ne sont applicables que lorsque une autre implémentation n'existe pas dans la portée actuelle.
id: In implementasi negatif, juga dikenal sebagai sifat negatif atau batas negatif, adalah mekanisme yang memungkinkan Anda untuk mengekspresikan bahwa tipe tidak mengimplementasikan suatu sifat tertentu ketika mendefinisikan implementasi dari sifat atas tipe umum. Impls negatif memungkinkan Anda untuk menulis implementasi yang hanya berlaku ketika implementasi lain tidak ada dalam lingkup saat ini.
tr: Negatif özellikler veya negatif sınırlar olarak da bilinen negatif uygulamalar, bir türün bir özelliğin genel bir tür üzerinde uygulanmasını tanımlarken belirli bir özelliği uygulamadığını ifade etmenizi sağlayan bir mekanizmadır. Negatif impls, yalnızca mevcut kapsamda başka bir uygulama bulunmadığında uygulanabilir uygulamaları yazmanızı sağlar.
zh_cn: 负执行(又称负特性或负边框)是一种机制,它允许您表达一种类型在定义对普通类型实施特性时不执行某种特性。负内径使您能够写入仅在目前范围内不存在另一种执行时才适用的执行。

source: For example, let's say we have a trait `Producer` and a trait `Consumer`, and we want to define a generic behavior where all types implement the `Consumer` trait by default. However, we want to ensure that no type can be both a `Consumer` and a `Producer`. We can use negative impls to express this restriction.
es: Por ejemplo, digamos que tenemos un rasgo `Productor` y un rasgo `Consumidor`, y queremos definir un comportamiento genérico donde todos los tipos implementan el rasgo `Consumidor` por defecto. Sin embargo, queremos asegurarnos de que ningún tipo puede ser tanto un `Consumidor` como un `Productor`. Podemos usar impls negativos para expresar esta restricción.
fr: Par exemple, disons que nous avons un trait `Producer` et un trait `Consumer`, et nous voulons définir un comportement générique où tous les types implémentent le caractère `Consumer` par défaut. Cependant, nous voulons nous assurer qu'aucun type ne peut être à la fois un `Consumer` et un `Producer`. Nous pouvons utiliser des impls négatifs pour exprimer cette restriction.
id: Sebagai contoh, katakanlah kita memiliki sifat producer dan sifat konsuer, dan kita ingin mendefinisikan perilaku umum di mana semua tipe menerapkan sifat konsumen secara default. Namun, kita ingin memastikan bahwa tidak ada tipe yang dapat keduanya adalah sebuah ▪Consumer atau producer. kita dapat menggunakan laknat negatif untuk mengekspresikan pembatasan ini.
tr: Örneğin, bir Producer ve bir Consumer özelliğimiz olduğunu varsayalım ve her türün varsayılan olarak Consumer özelliğini uyguladığı genel bir davranış tanımlamak istiyoruz. Ancak, hiçbir türün hem Consumer hem de Producer olmasını sağlamak istiyoruz. Bu kısıtlamayı ifade etmek için negatif impls kullanabiliriz.
zh_cn: 例如,让我们说,我们有一个`制造者'和`消费者'的特性,我们想界定一种通用行为,即所有类型都默认地实施`消费者'的特性,然而,我们想确保任何类型都不能既是`消费者'又是`生产者 ',我们可以用负分泌来表达这种限制。

source: In Listing 8-2, we define a `ProducerType` that implements the `Producer` trait, and two other types, `AnotherType` and `AThirdType`, which do not implement the `Producer` trait. We then use negative impls to create a default implementation of the `Consumer` trait for all types that do not implement the `Producer` trait.
es: En la Lista 8-2, definimos un `Tipo de Productor` que implementa el rasgo `Productor'y otros dos tipos, `Otro Tipo` y `Tercer Tipo`, que no implementan el rasgo `Productor '. A continuación, utilizamos impls negativos para crear una aplicación predeterminada del rasgo `Consumidor'para todos los tipos que no implementan el rasgo `Productor '.
fr: Dans la liste 8-2, nous définissons un type de producteur qui implémente le caractère de producteur, et deux autres types, `AnotherType` et `ATroisièmeType`, qui n'implémentent pas le caractère de producteur. Nous utilisons ensuite des implus négatifs pour créer une implémentation par défaut du caractère de consommateur pour tous les types qui n'implémentent pas le caractère de producteur.
id: Di Listing 8-2, kami mendefinisikan sebuah ·AthirdType yang mengimplementasikan sifat-sifat producer (producer), dan dua tipe lainnya, dan dua tipe lainnya, ▪AnotherType) dan ·AThirdType-- yang tidak menerapkan sifat producer.
tr: Listeleme 8-2'de, Producer özelliğini uygulayan bir ProducerType ve Producer özelliğini uygulamayan AnotherType ve AThirdType diğer iki türü tanımlarız. Daha sonra Producer özelliğini uygulamayan tüm türler için Consumer özelliğinin varsayılan bir uygulamasını oluşturmak için negatif impls kullanırız.
zh_cn: 在清单8-2中,我们定义了一种`生产者'特性的`生产者'类型,以及另外两种不执行`生产者'特性的`其他类型'和`第三类型'的`生产者'特性的`生产者'类型,然后我们用负分母来为不执行`生产者'特性的所有类型创建默认执行`消费者'特性的`消费者'类型。

source: "{:?} consumed value: {}"
es: "{:?} el valor consumido:
fr: "{:?} valeur consommée: {}"
id: "{:?} nilai yang dikonsumsi: {}"
tr: ":? tüketilen değer: "
zh_cn: "{{:}消费值:____________________________________________________________________________________________________________________________

source: // producer.consumer(production); Invalid: ProducerType does not implement Consumer
es: // productor.consumidor(producción); Inválido: ProductorType no implementa Consumidor
fr: // producteur.consommateur(production); Invalide: producteurType ne met pas en œuvre le consommateur
id: //produser.consumer[production]; Tidak valid: ProducerType tidak mengimplementasikan Konsumer
tr: // producer.consumer(production); Geçersiz: ProducerType Tüketiciyi uygulamaz
zh_cn: / 生产者. 消费者(生产); 无效: 生产者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 生产者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 生产者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者- 消费者-

source: <span class="caption"> Listing 8-2: Using negative impls to enforce that a type cannot implement both `Producer` and `Consumer` traits simultaneously</span>
es: <span class="caption"> Listado 8-2: Uso de impls negativos para hacer cumplir que un tipo no puede implementar simultáneamente los rasgos `Productor` y `Consumidor`</span>
fr: <span class="caption"> Listage 8-2: Utilisation d'impls négatifs pour faire respecter qu'un type ne peut implémenter simultanément les caractères `Producer` et `Consumer`</span>
id: <span class="caption"> Listing 8-2: Menggunakan impls negatif untuk memaksakan bahwa sebuah tipe tidak dapat mengimplementasi baik producer maupun karakter Konsumer secara simultan</span>
tr: span class="caption"> Listeleme 8-2: Bir türün hem Producer hem de Consumer özelliklerini aynı anda uygulayamayacağını zorlamak için negatif impls kullanmak/span>
zh_cn: <span类=“Caption” > Listing 8-2:使用负墨漏强制要求某类型不能同时执行 </span> " 和 " 开户'特性 " 。

source: In the `main` function, we create instances of `ProducerType`, `AnotherType`, and `AThirdType`. We then call the `produce` method on the `producer` instance and pass the result to the `consume` method on the `another_type` and `third_type` instances. Finally, we try to call the `consume` method on the `producer` instance, which results in a compile-time error because `ProducerType` does not implement the `Consumer` trait.
es: En la función `main`, creamos instancias de `ProducerType`, `OtherType` y `ATercerTipo`. A continuación, llamamos al método `Producer` en la instancia `Producer` y pasamos el resultado al método `Consumo` en las instancias `other_type` y `third_type`. Finalmente, tratamos de llamar al método `Consumo` en la instancia `Producer`, lo que resulta en un error de compilación porque `ProducerType` no implementa el rasgo `Consumo`.
fr: Dans la fonction `main`, nous créons des instances de `ProducerType`, `AnotherType` et `ATroisièmeType`. Ensuite, nous appelons la méthode `producte` sur l`instance `producter` et nous transmettons le résultat à la méthode `consume` sur les instances `another_type` et `Troisième_type`. Enfin, nous essayons d`appeler la méthode `consume` sur l`instance `producter`, ce qui donne lieu à une erreur de compilation parce que `ProducerType` n`implémente pas le caractère `Consumer`.
id: Dalam fungsinya, kita membuat contoh-contoh dari producerType, dan lain-lain yang digunakan dan kita mencoba untuk membuat metode producer pada contoh producer (producerType), yang menghasilkan kesalahan karena producer (producer) producer (producer) muncul karena producer) producer (producer) yang tidak menerapkan sifat-sifat tersebut.
tr: main fonksiyonunda, ProducerType, AnotherType ve A ThirdType örneklerini oluştururuz. Daha sonra produce metodunu producer örneğinde çağırırız ve sonucu another_type ve third_type örnekleri üzerinde consume metoduna aktarırız. Son olarak, consume metodunu producer olarak çağırmaya çalışırız.
zh_cn: 在`主要'函数中,我们创建了`生产机类型'、`另一类类型'和`第三类类型'实例,然后我们将`生产机类型'实例称为`生产方法 ',并将结果传递给`另一类类型'和`第三类类型'实例的`集成方法';最后,我们试图将`生产机类型'实例称为`集成方法 ',结果产生编译时间错误,因为`生产机类型'不执行`消费机类型'特性。

source: Error handling
es: Manipulación de errores
fr: Gestion des erreurs
id: Kesalahan penanganan
tr: Hata işleme
zh_cn: 错误处理错误处理

source: In this chapter, we will explore various error handling techniques provided by Cairo, which not only allow you to address potential issues in your code, but also make it easier to create programs that are adaptable and maintainable. By examining different approaches to managing errors, such as pattern matching with the `Result` enum, using the `?` operator for more ergonomic error propagation, and employing the `unwrap` or `expect` methods for handling recoverable errors, you'll gain a deeper understanding of Cairo's error handling features. These concepts are crucial for building robust applications that can effectively handle unexpected situations, ensuring your code is ready for production.
es: En este capítulo, exploraremos varias técnicas de manejo de errores proporcionadas por El Cairo, que no sólo le permiten abordar posibles problemas en su código, sino que también facilitan la creación de programas adaptables y mantenibles. Examinando diferentes enfoques para manejar errores, como el ajuste de patrones con el enum `Resultado`, utilizando el operador `?` para una propagación de errores más ergonómica, y empleando los métodos `unwrap` o `esperable` para manejar errores recuperables, obtendrá una comprensión más profunda de las características de manejo de errores de El Cairo. Estos conceptos son cruciales para construir aplicaciones robustas que puedan manejar eficazmente situaciones inesperadas, asegurando que su código esté listo para la producción.
fr: Dans ce chapitre, nous explorerons diverses techniques de gestion des erreurs fournies par le Caire, qui non seulement vous permettent de traiter les problèmes potentiels dans votre code, mais aussi de créer plus facilement des programmes adaptables et pouvant être maintenus. En examinant différentes approches de gestion des erreurs, telles que la correspondance des motifs avec l'enum `Résultat`, en utilisant l'opérateur `?` pour une propagation plus ergonomique des erreurs, et en utilisant les méthodes `unwrap` ou `expect` pour gérer les erreurs récupérables, vous acquerrez une meilleure compréhension des caractéristiques de gestion des erreurs du Caire.
id: Dalam bab ini, kita akan menjelajahi berbagai teknik penanganan kesalahan yang disediakan oleh Kairo, yang tidak hanya memungkinkan Anda untuk mengatasi masalah potensial dalam kode Anda, tetapi juga membuatnya lebih mudah untuk membuat program yang dapat disesuaikan dan dapat dipertahankan. Dengan memeriksa pendekatan yang berbeda untuk mengelola kesalahan, seperti pola yang cocok dengan enum resultic resolve, menggunakan årgentic operator untuk propagasi kesalahan ergonotic, dan menggunakan metode Áun wrave atau auxexpectánust untuk menangani kesalahan-kesalahan yang dapat diperbaiki, Anda akan memperoleh pemahaman lebih dalam fitur penanganan error Kairo. Konsep ini sangat penting untuk aplikasi bangunan yang dapat ditangani secara efektif, yang tidak terduga dapat ditangani oleh kode Anda untuk produksi secara tidak terduga.
tr: Bu bölümde, Kahire tarafından sağlanan çeşitli hata işleme tekniklerini inceleyeceğiz, bu da kodunuzdaki potansiyel sorunları ele almanızı sağlamakla kalmaz, aynı zamanda uyarlanabilir ve bakımlı programlar oluşturmayı kolaylaştırır. Hataları yönetmek için Result enum ile eşleşen desen gibi farklı yaklaşımları inceleyerek, daha ergonomik hata yayılımı için? operatörünü kullanarak ve unwrap veya expect yöntemlerini kullanarak.
zh_cn: 在本章中,我们将探讨开罗提供的各种错误处理技术,这些技术不仅使您能够解决代码中的潜在问题,而且还使创建适应性强和可维持的程序更加容易。通过研究管理错误的不同方法,例如与`Result' enum 匹配的模式,使用`?' 运算器进行更多的人类工程错误传播,以及使用`unlop'或`预期'方法处理可回收错误,您将更深入地了解开罗的错误处理功能。这些概念对于建立能够有效处理意外情况的稳健应用程序至关重要,确保您的代码可以制作。

source: Unrecoverable Errors with `panic`
es: Errores irrecuperables con `pánico`
fr: Erreurs non récupérables avec `panic`
id: Kesalahan Tak Dapat Dipulihkan dengan åpanic)
tr: panic ile düzeltilemeyen hatalar
zh_cn: “panic” 的无法恢复错误

source: In Cairo, unexpected issues may arise during program execution, resulting in runtime errors. While the `panic` function from the core library doesn't provide a resolution for these errors, it does acknowledge their occurrence and terminates the program. There are two primary ways that a panic can be triggered in Cairo: inadvertently, through actions causing the code to panic (e.g., accessing an array beyond its bounds), or deliberately, by invoking the `panic` function.
es: En El Cairo, pueden surgir problemas inesperados durante la ejecución del programa, que resultan en errores de tiempo de ejecución. Si bien la función `panic` de la biblioteca central no proporciona una resolución para estos errores, sí reconoce su ocurrencia y termina el programa. Hay dos maneras principales de que un pánico se puede desencadenar en El Cairo: inadvertidamente, a través de acciones que causan el pánico del código (por ejemplo, el acceso a un array más allá de sus límites), o deliberadamente, invocando la función `panic`.
fr: Au Caire, des problèmes inattendus peuvent survenir pendant l'exécution du programme, entraînant des erreurs d'exécution. Bien que la fonction `panic` de la bibliothèque centrale ne fournisse pas de résolution pour ces erreurs, elle reconnaît leur occurrence et met fin au programme. Il y a deux façons principales qu'une panique peut être déclenchée au Caire : par inadvertance, par des actions provoquant la panique du code (par exemple, l'accès à un tableau au-delà de ses limites), ou délibérément, en invoquant la fonction `panic`.
id: Di Kairo, masalah yang tak terduga mungkin muncul selama eksekusi program, yang mengakibatkan kesalahan dalam runtime. sementara fungsi Épanicå dari perpustakaan inti tidak memberikan resolusi untuk kesalahan ini, ia mengakui kejadian mereka dan mengakhiri program. ada dua cara utama agar kepanikan dapat dipicu di Kairo: secara tidak sengaja, melalui tindakan yang menyebabkan kode panik (misalnya, mengakses array di luar batas-batasnya), atau sengaja, dengan melibatkan fungsi progenik.
tr: Kahire'de program yürütme sırasında beklenmedik sorunlar ortaya çıkabilir, bu da çalışma zamanı hatalarıyla sonuçlanır. Çekirdek kütüphaneden gelen panic işlevi bu hatalar için bir çözüm sağlamazken, bu hataların meydana geldiğini kabul eder ve programı sonlandırır. Kahire'de bir paniğin tetiklenebilmesinin iki ana yolu vardır: yanlışlıkla, kodun paniğe neden olan eylemlerle (örneğin, sınırlarının ötesinde bir diziye erişme) veya kasıtlı olarak, panic işlevini çağırarak.
zh_cn: 在开罗,程序执行期间可能会出现意外问题,导致运行时间错误。 虽然核心图书馆的“ 普通” 功能不能为这些错误提供解决方案, 但它确实承认了这些错误的发生并终止了程序。 开罗有两种主要方式可以引发恐慌: 无意中, 导致代码恐慌的行动( 例如, 访问超出其界限的阵列), 或故意, 引用“ 普通” 功能 。

source: When a panic occurs, it leads to an abrupt termination of the program. The `panic` function takes an array as an argument, which can be used to provide an error message and performs an unwind process where all variables are dropped and dictionaries squashed to ensure the soundness of the program to safely terminate the execution.
es: Cuando se produce un pánico, se produce una terminación brusca del programa. La función `panic` toma un array como argumento, que se puede utilizar para proporcionar un mensaje de error y realiza un proceso de desenganche donde todas las variables se sueltan y los diccionarios se aplastan para asegurar la solidez del programa para terminar con seguridad la ejecución.
fr: Lorsqu'une panique se produit, elle conduit à une fin brutale du programme. La fonction `panic` prend un tableau comme argument, qui peut être utilisé pour fournir un message d'erreur et effectue un processus de décompression où toutes les variables sont abandonnées et les dictionnaires écrasés pour assurer la solidité du programme pour mettre fin en toute sécurité à l'exécution.
id: Ketika kepanikan terjadi, hal itu mengarah ke penghentian program secara tiba-tiba. Fungsi ·panicáne mengambil sebuah array sebagai argumen, yang dapat digunakan untuk memberikan pesan kesalahan dan melakukan sebuah proses unwind di mana semua variabel dijatuhkan dan kamus terjepit untuk memastikan soundness dari program untuk dengan aman mengakhiri eksekusi.
tr: Bir panik meydana geldiğinde, programın ani bir şekilde sonlandırılmasına yol açar. panic işlevi, bir hata mesajı sağlamak için kullanılabilen ve tüm değişkenlerin bırakıldığı bir gevşeme işlemi gerçekleştiren bir argüman olarak bir dizi alır ve programın yürütmeyi güvenli bir şekilde sonlandırmasını sağlamak için sözlükler ezilir.
zh_cn: 当发生恐慌时,它会导致程序突然终止。“panic”函数将一个阵列作为参数,用于提供错误信息,并进行一个无线进程,即所有变量被丢弃,词典被压碎,以确保程序稳妥,安全终止执行。

source: Here is how we can call `panic` from inside a program and return the error code `2`:
es: Aquí es cómo podemos llamar a `panic` desde el interior de un programa y devolver el código de error `2`:
fr: Voici comment nous pouvons appeler `panic` de l'intérieur d'un programme et retourner le code d'erreur `2`:
id: Berikut adalah bagaimana kita dapat memanggil æpanicé dari dalam program dan mengembalikan kode kesalahan:
tr: Bir programın içinden panic'yi nasıl çağırabiliriz ve hata kodunu 2 döndürebiliriz:
zh_cn: 下面我们如何从程序内称为`panic'并返回错误代码`2':

source: "This line isn't reached"
es: "Esta línea no se alcanza"
fr: "Cette ligne n'est pas atteinte"
id: "Garis ini tidak mencapai"
tr: "Bu çizgiye ulaşılamadı"
zh_cn: "这条线没有达到"

source: Running the program will produce the following output:
es: La ejecución del programa producirá la siguiente salida:
fr: L'exécution du programme produira la sortie suivante:
id: Menjalankan program akan menghasilkan keluaran berikut:
tr: Programın çalıştırılması aşağıdaki çıktıyı üretecektir:
zh_cn: 运行程序将产生以下产出:

source: As you can notice in the output, the call to `println!` macro is never reached, as the program terminates after encountering the `panic` statement.
es: Como se puede notar en la salida, la llamada a `println!` macro nunca se alcanza, ya que el programa termina después de encontrar la declaración `panic`.
fr: Comme vous pouvez le remarquer dans la sortie, l'appel à `println!` macro n'est jamais atteint, car le programme se termine après avoir rencontré l'instruction `panic`.
id: Seperti yang dapat Anda lihat di output, panggilan ke åprintln! makro tidak pernah dicapai, karena program berakhir setelah menghadapi pernyataan ·panicáne.
tr: Çıktıda fark edebileceğiniz gibi, println! makrosuna yapılan çağrıya asla ulaşılmaz, çünkü program panic ifadesiyle karşılaştıktan sonra sona erer.
zh_cn: 正如您在输出中注意到的那样,“println!” 宏的号召从未达到,因为程序在遇到“panic” 语句后终止。
