Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: The `main` function includes 2 function calls:
es: La función `main` incluye 2 llamadas a funciones:
fr: La fonction `main` comprend 2 appels de fonction:
id: Fungsi utama mencakup 2 fungsi panggilan:
tr: main işlevi 2 işlev çağrısı içerir:
zh_cn: `主要'职能包括2个职能电话:

source: `pass_data` that takes a variable of type `Cart`.
es: `pass_data` que toma una variable de tipo `Cart`.
fr: `pass_data` qui prend une variable de type `Cart`.
id: Pass_data yang membutuhkan variabel tipe kart.
tr: pass_data değişken Cart tipini alır.
zh_cn: " pass_data ",采用 " Cart " 类型变量。

source: `pass_pointer` that takes a pointer of type `Box<Cart>`.
es: `pass_pointer` que toma un puntero de tipo `Box<Cart®.
fr: `pass_pointer` qui prend un pointeur de type `Box<Cart>`.
id: Penunjuk yang membutuhkan sebuah penunjuk tipe. Kotak<Cart>.
tr: pass_pointer türü BoxCart> işaretçisini alır.
zh_cn: `通过'指针 ',指针为`Box<Cart'。

source: When passing data to a function, the entire data is copied into the last available memory cells right before the function call. Calling `pass_data` will copy all 3 fields of `Cart` to memory, while `pass_pointer` only requires the copy of the `new_box` pointer which is of size 1.
es: Al pasar datos a una función, todos los datos se copian en las últimas celdas de memoria disponibles justo antes de la llamada a la función. Llamar a `pass_data` copiará los 3 campos de `Cart` a la memoria, mientras que `pass_pointer` solo requiere la copia del puntero `new_box` que es de tamaño 1.
fr: Lorsque vous passez des données à une fonction, les données entières sont copiées dans les dernières cellules de mémoire disponibles juste avant l'appel de la fonction. Appeler `pass_data` copiera les 3 champs de `Cart` à la mémoire, alors que `pass_pointer` ne nécessite que la copie du pointeur `new_box` qui est de taille 1.
id: Ketika mengirim data ke sebuah fungsi, seluruh data disalin ke dalam sel memori terakhir yang tersedia tepat sebelum panggilan fungsi. Memanggil spass_data akan menyalin semua 3 ▪Cartá ke memori, sementara åpass_pointer hanya membutuhkan salinan dari pointer baru_box yang berukuran 1.
tr: Veriyi bir fonksiyona aktarırken, tüm veriler işlev çağrısından hemen önce mevcut olan son bellek hücrelerine kopyalanır. pass_data'yi aramak, Cart'nin tüm 3 alanını belleğe kopyalarken, pass_pointer yalnızca 1 boyutunda olan new_box işaretçisinin kopyasını gerektirir.
zh_cn: 当将数据传送到函数时,整个数据将被复制到函数调用前最后可用的内存单元格中。调用“pass_data”将把“Cart”的所有3个字段复制到内存,而“pass_pointer”只要求 1 大小的“new_box”指针副本。

source: The illustration above demonstrates how the memory behaves in both cases. The first instance of `Cart` is stored in the execution segment, and we need to copy all its fields to memory before calling the `pass_data` function. The second instance of `Cart` is stored in the boxed segment, and the pointer to it is stored in the execution segment. When calling the `pass_pointer` function, only the pointer to the struct is copied to memory right before the function call. In both cases, however, instantiating the struct will store all its values in the execution segment: the boxed segment can only be filled with data taken from the execution segment.
es: La ilustración anterior demuestra cómo se comporta la memoria en ambos casos. La primera instancia de `Cart` se almacena en el segmento de ejecución, y necesitamos copiar todos sus campos a la memoria antes de llamar a la función `pass_data`. La segunda instancia de `Cart` se almacena en el segmento de caja, y el puntero a él se almacena en el segmento de ejecución. Al llamar a la función `pass_pointer`, sólo el puntero a la estructura se copia a la memoria justo antes de la llamada a la función. Sin embargo, en ambos casos, la instancia de la estructura almacenará todos sus valores en el segmento de ejecución: el segmento de caja sólo se puede llenar con datos tomados del segmento de ejecución.
fr: L'illustration ci-dessus montre comment la mémoire se comporte dans les deux cas. La première instance de `Cart` est stockée dans le segment d'exécution, et nous devons copier tous ses champs en mémoire avant d'appeler la fonction `pass_data`. La deuxième instance de `Cart` est stockée dans le segment encadré, et le pointeur vers celui-ci est stocké dans le segment d'exécution. Lorsqu'il appelle la fonction `pass_pointer`, seul le pointeur vers la structure est copié en mémoire juste avant l'appel de la fonction. Cependant, dans les deux cas, l'instantannage de la structure stockera toutes ses valeurs dans le segment d'exécution: le segment encadré ne peut être rempli que par des données prises depuis le segment d'exécution.
id: Perumpamaan di atas menunjukkan bagaimana cara kerja memori dalam kedua kasus. Contoh pertama dari segmen yang disimpan dalam kotak, dan pointer untuk itu disimpan dalam segmen eksekusi. Ketika memanggil semua medan memori sebelum memanggil fungsi Ápass_data.
tr: Yukarıdaki örnek, belleğin her iki durumda da nasıl davrandığını göstermektedir. Cart'nin ilk örneği yürütme segmentinde saklanır ve pass_data işlevini çağırmadan önce tüm alanlarını hafızaya kopyalamamız gerekir. Cart'nin ikinci örneği kutulu segmentte saklanır ve ona işaret eden kişi her iki yürütme segmentinde de saklanabilir. pass_pointer işlevini çağırırken, yalnızca sağdaki strug işlevine edilir.
zh_cn: 以上插图说明了这两种情况下的内存情况。第一个`Cart'实例存储在执行部分,我们需要在调用`pass_data' 函数之前将其所有字段复制到记忆中。第二个`Cart'实例存储在框框中,其指针存储在执行部分。当调用`pass_pointer'函数时,只有支架的指针在函数调用之前被复制到记忆中。但是,在这两种情况下,即时结构将把其所有数值存储在执行部分:只有从执行部分取的数据才能填充框中。

source: The `Nullable<T>` Type for Dictionaries
es: El tipo `Nulable<T® para diccionarios
fr: Le type `Nullable<T>` pour les dictionnaires
id: Jenis untuk Kamus (Dictionaries)
tr: NulableT> Sözlükler için Tip
zh_cn: 用于字典的“ ullball<T} 类型” 字典

source: `Nullable<T>` is another type of smart pointer that can either point to a value or be `null` in the absence of value. It is defined at the Sierra level. This type is mainly used in dictionaries that contain types that don't implement the `zero_default` method of the `Felt252DictValue<T>` trait (i.e., arrays and structs).
es: `Nulable<T® es otro tipo de puntero inteligente que puede apuntar a un valor o ser `null` en ausencia de valor. Se define a nivel de Sierra. Este tipo se utiliza principalmente en diccionarios que contienen tipos que no implementan el método `cero_default` del rasgo `Felt252DictValue<T® (es decir, arrays y structs).
fr: `Nullable<T>` est un autre type de pointeur intelligent qui peut pointer vers une valeur ou être `null` en l'absence de valeur. Il est défini au niveau de la Sierra. Ce type est principalement utilisé dans les dictionnaires qui contiennent des types qui ne mettent pas en œuvre la méthode `zero_default` du trait `Felt252DictValue<T>` (i.e., tableaux et structures).
id: Ini didefinisikan pada tingkat Sierra. Tipe ini terutama digunakan dalam dictionaries yang tidak menerapkan metode thoseol_default asal-asalan dari font <T.e., array dan structs).
tr: NullableT>, değer yokluğunda bir değere işaret edebilen veya null olabilen başka bir akıllı işaretçi türüdür. Sierra seviyesinde tanımlanır. Bu tür, çoğunlukla Felt252DictValueT> özelliğinin zero_default yöntemini uygulamayan türler içeren sözlüklerde kullanılır (yani, diziler ve yapılar).
zh_cn: `Nullble<T}是另一种智能指针,可以指向一个值,也可以指向没有值的`Null`。在Sierra一级定义了这种指针。这种类型主要用于字典中含有不执行“Felt252DictValue<T”特性(即阵列和阵列)的`0-default'方法的字典。

source: If we try to access an element that does not exist in a dictionary, the code will fail if the `zero_default` method cannot be called.
es: Si intentamos acceder a un elemento que no existe en un diccionario, el código fallará si no se puede llamar al método `cero_default`.
fr: Si nous essayons d'accéder à un élément qui n'existe pas dans un dictionnaire, le code échouera si la méthode `zero_default` ne peut pas être appelée.
id: Jika kita mencoba untuk mengakses elemen yang tidak ada dalam kamus, kode akan gagal jika metode ·zero_defaulté tidak dapat disebut.
tr: Bir sözlükte bulunmayan bir öğeye erişmeye çalışırsak, zero_default yöntemi çağrılmazsa kod başarısız olur.
zh_cn: 如果我们试图访问字典中不存在的元素,如果无法调用`零-默认'方法,代码将失效。

source: [Chapter 3.2](/ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) about dictionaries thoroughly explains how to store a `Span<felt252>` variable inside a dictionary using the `Nullable<T>` type. Please refer to it for further information.
es: [Capítulo 3.2](/ch03-02-dictionarys.md#dictionarys-of-types-no-soported-natively) acerca de los diccionarios explica a fondo cómo almacenar una variable `Span<felt252® dentro de un diccionario usando el tipo `Nulable<T®. Consultelo para más información.
fr: [Chapitre 3.2](/ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natually) sur les dictionnaires explique en détail comment stocker une variable `Span<felt252>` à l'intérieur d'un dictionnaire en utilisant le type `Nullable<T>`. Veuillez vous y référer pour plus d'informations.
id: [Chapter 3.2) Tentang dictionary dijelaskan secara menyeluruh bagaimana menyimpan sebuah ÁSpan<felt252> variabel di dalam kamus menggunakan tipe <T> yang tidak didukung. Silakan merujuk ke sana untuk informasi lebih lanjut.
tr: [Bölüm 3.2](/ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) sözlükler hakkında bir Spanfelt252> değişkeninin NulableT> tipini kullanarak bir sözlük içinde nasıl saklanacağını ayrıntılı bir şekilde açıklar. Daha fazla bilgi için lütfen buna bakın.
zh_cn: [第3.2章](/Ch03-02-词典.md#词典-类型-无支持-本地)关于词典的完整解释如何使用`Nullble<T类型在字典中存储“span<felt252}”变量。请参考该词典了解更多信息。

source: {{#quiz ../quizzes/ch11-02-smart_pointers.toml}}
fr: {{#quiz../quizes/ch11-02-smart_pointers.toml}}
zh_cn: Quiz./quizzes/ch11-02-mart_pointers.toml

source: Operator overloading is a feature in some programming languages that allows the redefinition of standard operators, such as addition (`+`), subtraction (`-`), multiplication (`*`), and division (`/`), to work with user-defined types. This can make the syntax of the code more intuitive, by enabling operations on user-defined types to be expressed in the same way as operations on primitive types.
es: La sobrecarga del operador es una característica en algunos lenguajes de programación que permite la redefinición de los operadores estándar, como la adición (), la resta (`-`), la multiplicación (`*`), y la división (`/`), para trabajar con tipos definidos por el usuario. Esto puede hacer la sintaxis del código más intuitiva, permitiendo que las operaciones en tipos definidos por el usuario se expresen de la misma manera que las operaciones en tipos primitivos.
fr: La surcharge d'opérateurs est une fonctionnalité dans certains langages de programmation qui permet la redéfinition des opérateurs standard, tels que l'ajout (`+`), la soustraction (`-`), la multiplication (`*`) et la division (`/`), pour travailler avec des types définis par l'utilisateur, ce qui peut rendre la syntaxe du code plus intuitive, en permettant aux opérations sur des types définis par l'utilisateur d'être exprimées de la même manière que les opérations sur des types primitifs.
id: Operator overloading adalah fitur dalam beberapa bahasa pemrograman yang memungkinkan redefinisi operator standar, seperti penambahan (Negeri), pengurangan, perkalian, dan pembagian (Negeri), untuk bekerja dengan tipe yang terdefinisi pengguna. Hal ini dapat membuat sintaks kode lebih intuitif, dengan mengaktifkan operasi pada tipe user-defined untuk diekspresikan dengan cara yang sama seperti operasi pada tipe primitif.
tr: Operatör aşırı yüklenmesi, bazı programlama dillerinde, kullanıcı tanımlı türlerle çalışmak için ekleme (+), çıkarma (-), çarpma (*) ve bölme (/) gibi standart operatörlerin yeniden tanımlanmasına izin veren bir özelliktir. Bu, kullanıcı tanımlı türlerdeki işlemlerin ilkel türlerdeki işlemlerle aynı şekilde ifade edilmesini sağlayarak, kodun sözdizimini daha sezgisel hale getirebilir.
zh_cn: 操作员超载是某些编程语言的一个特点,使得能够重新定义标准操作员,例如添加()、减(`-')、乘()和分(`/'),以便与用户定义的类型合作,这可以使代码的语法更直观,使用户定义类型的操作能够与原始类型的操作以同样的方式表达。

source: In Cairo, operator overloading is achieved through the implementation of specific traits. Each operator has an associated trait, and overloading that operator involves providing an implementation of that trait for a custom type. However, it's essential to use operator overloading judiciously. Misuse can lead to confusion, making the code more difficult to maintain, for example when there is no semantic meaning to the operator being overloaded.
es: En El Cairo, la sobrecarga del operador se logra a través de la implementación de rasgos específicos. Cada operador tiene un rasgo asociado, y sobrecarga que el operador implica proporcionar una implementación de ese rasgo para un tipo personalizado. Sin embargo, es esencial utilizar sobrecarga del operador con juicio. El uso indebido puede conducir a confusión, haciendo el código más difícil de mantener, por ejemplo cuando no hay significado semántico para el operador que se sobrecarga.
fr: Au Caire, la surcharge de l'opérateur est réalisée par la mise en œuvre de caractères spécifiques. Chaque opérateur a un caractère associé, et la surcharge que l'opérateur implique de fournir une mise en œuvre de ce caractère pour un type personnalisé. Cependant, il est essentiel d'utiliser l'opérateur surchargeuse judicieusement. La mauvaise utilisation peut conduire à la confusion, rendant le code plus difficile à maintenir, par exemple quand il n'y a pas de sens sémantique pour l'opérateur en surcharge.
id: Di Kairo, operator overloading dicapai melalui implementasi sifat-sifat tertentu. Setiap operator memiliki sifat terkait, dan overloading operator termasuk menyediakan implementasi sifat itu untuk tipe kustom. Namun, sangat penting untuk menggunakan operator overloading sewenang-wenang. Misuse dapat menyebabkan kebingungan, membuat kode lebih sulit untuk mempertahankan, misalnya ketika tidak ada makna semantik untuk operator yang kelebihan beban.
tr: Kahire'de, operatör aşırı yüklenmesi belirli özelliklerin uygulanması yoluyla elde edilir. Her operatör ilişkili bir özelliğe sahiptir ve bu operatörün aşırı yüklenmesi, özel bir tür için bu özelliğin uygulanmasını sağlamayı içerir. Bununla birlikte, operatör aşırı yüklenmesini akıllıca kullanmak esastır. Yanlış kullanım, kodun bakımını zorlaştırabilir, örneğin operatörün aşırı yüklenmesinin anlamsal bir anlamı olmadığında.
zh_cn: 在开罗,操作员超载是通过实施特定特性来实现的。 每个操作员都有相关特性,而超载操作员的超载则涉及对某种定制类型实施该特性。 但是,必须明智地使用操作员超载。 滥用会导致混乱,使代码更难维持,比如当操作员超载没有语义意义时。

source: Consider an example where two `Potions` need to be combined. `Potions` have two data fields, mana and health. Combining two `Potions` should add their respective fields.
es: Consideremos un ejemplo en el que hay que combinar dos " pociones ". Las " pociones " tienen dos campos de datos, el maná y la salud, y la combinación de dos " pociones " debería añadir sus respectivos campos.
fr: Examinez un exemple où deux «Potions» doivent être combinées. Les «Potions» ont deux champs de données, la mana et la santé. La combinaison de deux «Potions» devrait ajouter leurs champs respectifs.
id: Perhatikan contoh di mana dua sumber daya perlu dikombinasikan.
tr: İki Potions'un birleştirilmesi gereken bir örneği ele alalım. Potions'nin iki veri alanı, mana ve sağlık alanı vardır. İki Potions'un birleştirilmesi, ilgili alanlarını içermelidir.
zh_cn: 例如,两个`政策'需要合并。`政策'有两个数据领域,即mana和健康。将两个`政策'合并,应增加各自的领域。

source: // Both potions were combined with the `+` operator.
es: // Ambas pociones se combinaron con el operador.
fr: // Les deux potions ont été combinées avec l'opérateur `+`.
id: //Kedua ramuan itu dikombinasikan dengan operator.
tr: // Her iki iksir de + operatörü ile birleştirildi.
zh_cn: 两种药剂均与 操作员结合使用。

source: In the code above, we're implementing the `Add` trait for the `Potion` type. The add function takes two arguments: `lhs` and `rhs` (left and right-hand side). The function body returns a new `Potion` instance, its field values being a combination of `lhs` and `rhs`.
es: En el código anterior, estamos implementando el rasgo `Add` para el tipo `Potion`. La función add toma dos argumentos: `lhs` y `rhs` (izquierda y derecha). El cuerpo de la función devuelve una nueva instancia `Potion`, siendo sus valores de campo una combinación de `lhs` y `rhs`.
fr: Dans le code ci-dessus, nous implémentons le caractère `Add` pour le type `Potion`. La fonction add prend deux arguments: `lhs` et `rhs` (à gauche et à droite). Le corps de la fonction retourne une nouvelle instance `Potion`, ses valeurs de champ étant une combinaison de `lhs` et `rhs`.
id: Dalam kode di atas, kami menerapkan sifat yang sama untuk jenis 'Potion' ditambah fungsinya membutuhkan dua argumen: 'lhs' dan 'rhs' (kiri dan kanan-tangan).
tr: Yukarıdaki kodda, Potion tipi için Add özelliğini uyguluyoruz. Ekleme işlevi iki argüman alır: lhs ve rhs (sol ve sağ taraf). Fonksiyon gövdesi yeni bir Potion örneğini döndürür, alan değerleri lhs ve rhs'nin bir kombinasyonudur.
zh_cn: 在以上代码中,我们正在执行`政治'类型的`添加'特性,添加函数需要两个参数:`lhs'和`rhs'(左侧和右侧)。函数体返回一个新的`potion'实例,其字段值是`lhs'和`rhs'的组合。

source: As illustrated in the example, overloading an operator requires specification of the concrete type being overloaded. The overloaded generic trait is `Add<T>`, and we define a concrete implementation for the type `Potion` with `Add<Potion>`.
es: Como se ilustra en el ejemplo, para sobrecargar a un operador es necesario especificar el tipo de concreto que se está sobrecargando. El rasgo genérico sobrecargado es `Add<T®, y definimos una aplicación concreta para el tipo `Potion` con `Add<Potion®.
fr: Comme l'illustre l'exemple, la surcharge d'un opérateur nécessite la spécification du type de béton surchargé. Le caractère générique surchargé est `Add<T>`, et nous définissons une mise en œuvre concrète pour le type `Potion` avec `Add<Potion>`.
id: Sebagaimana diilustrasikan dalam contoh ini, membebani operator memerlukan spesifikasi dari tipe beton yang kelebihan beban. Sifat umum yang berlebihan adalah Tambahkan<T>, dan kami mendefinisikan implementasi beton untuk tipe ▪Potionà dengan <Potion>.
tr: Örnekte gösterildiği gibi, bir operatörün aşırı yüklenmesi, beton tipinin aşırı yüklenmesini gerektirir. Aşırı yüklenmiş jenerik özellik AddT>'dir ve AddPotion> ile Potion tipi için somut bir uygulama tanımlarız.
zh_cn: 如例子所示,操作员超载要求具体说明超载的具体类型。超载的通用特性是“Add<T”,我们用“Add<Potion”定义了“Potion”类型的具体实施。

source: {{#quiz ../quizzes/ch11-03-operator-overloading.toml}}
es: quiz../quizzes/ch11-03-operador-sobrecarga.toml
fr: {{#quiz../quizes/ch11-03-operator-overloading.toml}}
zh_cn: Quiz./quizzes/ch11-03-Operator-overloading.toml /quizzes/ch11-03-Operator-loading.toml

source: Hashes
fr: Haches
tr: Haşhaşlar
zh_cn: 头饰

source: At its essence, hashing is a process of converting input data (often called a message) of any length into a fixed-size value, typically referred to as a "hash." This transformation is deterministic, meaning that the same input will always produce the same hash value. Hash functions are a fundamental component in various fields, including data storage, cryptography and data integrity verification. They are very often used when developing smart contracts, especially when working with [Merkle trees](https://en.wikipedia.org/wiki/Merkle_tree#Uses).
es: En su esencia, el hashing es un proceso de conversión de datos de entrada (a menudo llamados un mensaje) de cualquier longitud en un valor de tamaño fijo, normalmente llamado "hash". Esta transformación es determinista, lo que significa que la misma entrada siempre producirá el mismo valor de hash. Las funciones de hash son un componente fundamental en varios campos, incluyendo almacenamiento de datos, criptografía y verificación de integridad de datos. Se utilizan muy a menudo cuando se desarrollan contratos inteligentes, especialmente cuando se trabaja con [Merkle trees] (https://en.wikipedia.org/wiki/Merkle_tree#Uses).
fr: Au fond, le hachage est un processus de conversion des données d'entrée (souvent appelées un message) de n'importe quelle longueur en une valeur de taille fixe, généralement appelée "hash". Cette transformation est déterministe, ce qui signifie que la même entrée produira toujours la même valeur de hachage. Les fonctions Hash sont un élément fondamental dans divers domaines, y compris le stockage des données, la cryptographie et la vérification de l'intégrité des données.
id: Pada esensinya, hashing adalah proses mengubah data masukan (yang sering disebut pesan) dari panjang apa pun menjadi nilai ukuran tetap, biasanya disebut sebagai "hash." Transformasi ini adalah deterministik, berarti bahwa masukan yang sama akan selalu menghasilkan nilai hash. Fungsi hash adalah komponen fundamental dalam berbagai bidang, termasuk penyimpanan data, kriptografi dan identifikasi data. Mereka sering digunakan ketika mengembangkan kontrak cerdas, terutama ketika bekerja dengan [Merkle trees] whtps.wikipedia.org/wi/wiki/Mlepedia_trees).
tr: Özünde, hashing, herhangi bir uzunluktaki girdi verilerini (genellikle mesaj olarak adlandırılır) genellikle "hash" olarak adlandırılan sabit boyutlu bir değere dönüştürme işlemidir. Bu dönüşüm deterministiktir, yani aynı girdi her zaman aynı hash değerini üretecektir. Hash fonksiyonları, veri depolama, kriptografi ve veri bütünlüğü doğrulaması dahil olmak üzere çeşitli alanlarda temel bir bileşendir.
zh_cn: 从本质上说,散列是一种将任何长度的输入数据(通常称为信息)转换成固定规模值的过程,通常被称为“hash”。这种转变具有决定性意义,意味着同样的输入将永远产生相同的散列值。散列函数是各个领域的基本组成部分,包括数据存储、加密和数据完整性核查。它们常常用于制定智能合同,特别是在与[Merkle trees](https://en.wikipedia.org/wiki/Merkle_tree#Universes)合作时。

source: In this chapter, we will present the two hash functions implemented natively in the Cairo core library: `Poseidon` and `Pedersen`. We will discuss when and how to use them, and see examples with Cairo programs.
es: En este capítulo, presentaremos las dos funciones de hash implementadas nativamente en la biblioteca central de El Cairo: `Poseidon` y `Pedersen`. Discutiremos cuándo y cómo utilizarlas, y veremos ejemplos con los programas de El Cairo.
fr: Dans ce chapitre, nous présenterons les deux fonctions de hachage mises en œuvre nativement dans la bibliothèque centrale du Caire : `Poseidon` et `Pedersen`. Nous discuterons quand et comment les utiliser, et verrons des exemples avec les programmes du Caire.
id: Di bab ini, kami akan menyajikan kedua fungsi hash yang diimplementasikan secara asli di perpustakaan inti Kairo:
tr: Bu bölümde, Kahire çekirdek kütüphanesinde doğal olarak uygulanan iki hash fonksiyonunu sunacağız: Poseidon ve Pedersen. Bunları ne zaman ve nasıl kullanacağımızı tartışacağız ve Kahire programlarıyla örnekler göreceğiz.
zh_cn: 在本章中,我们将介绍开罗核心图书馆“Poseidon”和“Pedersen”这两个散列功能。我们将讨论何时和如何使用这两个功能,并见开罗方案的例子。

source: Hash Functions in Cairo
es: Funciones de hash en El Cairo
fr: Fonctions de hash au Caire
id: Fungsi Hash di Kairo
tr: Kahire'de Hash Fonksiyonları
zh_cn: 开罗的散列函数

source: The Cairo core library provides two hash functions: Pedersen and Poseidon.
es: La biblioteca central de El Cairo ofrece dos funciones de hash: Pedersen y Poseidón.
fr: La bibliothèque centrale du Caire offre deux fonctions de hachage : Pedersen et Poseidon.
id: Perpustakaan inti Kairo menyediakan dua fungsi hash: Pedersen dan Poseidon.
tr: Kahire çekirdek kütüphanesi iki hash işlevi sunar: Pedersen ve Poseidon.
zh_cn: 开罗核心图书馆提供两种散列功能:Pedersen和Poseidon。
