Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Define generic structure
es: Definir la estructura genérica
fr: Définir la structure générique
id: Definisikan struktur generik
tr: Jenerik yapıyı tanımla
zh_cn: 界定通用结构

source: `enum ident<...> ...`
fr: "identité de l'énum<...>..."
id: Enimum terident <...>...
zh_cn: ".号 " 号号号 " 号号 " 号 " 号号 " 号号 " 号号 " 号号 " 号号 " 号号 " 号号号 " 号号 " 号号号 " 号号号 " 号号号 " 号号号号 " 号号号 " 号号号 " 号号 " 号号号 " 号号号 " 号号号 " 号号号 " 号号号 " 号号号 " 号号号 " 号号 " 号号号 " 号号号号 " 号号号 " 号号 " 号号号 " 号号 " 号号 " 号号号 " 号号 " 号号号 " 号号 " 号号号号号号 " 号号号号号 " 号号号 " 号号 " 号号号号号 " 号号号号号 " 号号号号号号号 " 号号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号 " 号

source: Define generic enumeration
es: Definir enumeración genérica
fr: Définir l'énumération générique
id: Definisikan enumerasi generik
tr: Genel numaralandırmayı tanımla
zh_cn: 界定一般查点

source: Define generic implementation
es: Definir la aplicación genérica
fr: Définir la mise en œuvre générique
id: Definisikan implementasi generik
tr: Genel uygulamayı tanımla
zh_cn: 界定一般实施

source: <span class="caption">Table B-4: Generics</span>
es: <span class="caption">Tabla B-4: Genéricos</span>
fr: <span class="caption">Tableau B-4: génériques</span>
id: <span class="caption">Tabel B-4: Generik</span>
tr: span class="caption">Tablo B-4: Genel/span>
zh_cn: <span类=“Caption” >表B-4:通用 </span>

source: Table B-5 shows symbols that appear in the context of specifying attributes on an item.
es: La tabla B-5 muestra símbolos que aparecen en el contexto de especificar atributos en un elemento.
fr: Le tableau B-5 indique les symboles qui apparaissent dans le contexte de la spécification des attributs d'un élément.
id: Tabel B-5 menampilkan simbol yang muncul dalam konteks dari spesifikasikan atribut pada suatu item.
tr: Tablo B-5, bir öğedeki özniteliklerin belirtilmesi bağlamında görünen sembolleri gösterir.
zh_cn: 表B-5显示在指定项目属性时出现的符号。

source: `#[derive(...)]`
fr: «#[dérivé(...)]»
tr: #[türev(...)]
zh_cn: *[代(...)]`

source: Automatically implements a trait for a type
es: Implementa automáticamente un rasgo para un tipo
fr: Implémente automatiquement un trait pour un type
id: Otomatis mengimplementasikan suatu sifat bagi suatu tipe
tr: Bir tür için bir özelliği otomatik olarak uygular
zh_cn: 自动执行类型特性

source: `#[inline]`
es: «[en línea]»
fr: `#[en ligne]`
zh_cn: [内 `

source: Hint to the compiler to allow inlining of annotated function
es: Consejo al compilador para permitir el inlining de la función anotada
fr: Alignez-vous sur le compilateur pour permettre l'inline de la fonction annotée
id: Petunjuk ke kompiler untuk mengijinkan inlining dari fungsi ternotasi
tr: Derleyiciye not edilen fonksiyonun astarlanmasına izin vermek için ipucu
zh_cn: 向汇编者提示,以便插入附加说明的功能

source: `#[inline(always)]`
es: «[en línea(siempre)]».
fr: `#[en ligne(toujours)]`
tr: #[inline(hep)]
zh_cn: ``[内线(始终 `

source: Hint to the compiler to systematically inline annotated function
es: Indíquese al compilador la función anotada en línea sistemática
fr: Astuce au compilateur à la fonction annotée systématiquement en ligne
id: Petunjuk ke kompiler untuk secara sistematis inline fungsi ternotasi
tr: Derleyiciye sistematik olarak satır içi açıklama işlevine işaret et
zh_cn: 将附加说明的函数系统嵌入到汇编器中

source: `#[inline(never)]`
es: «[en línea(nunca)]».
fr: `#[inline(jamais)]`
id: # # [inline Allah tidak pernah]]
zh_cn: [内 [永 `

source: Hint to the compiler to never inline annotated function
es: Sugerir al compilador que nunca inline función anotada
fr: Alignez-vous sur le compilateur pour ne jamais inline fonction annotée
id: Petunjuk ke kompiler untuk tidak pernah inline fungsi ternotasi
tr: Derleyiciye not edilmiş bir işlevi asla satır içine almaması için ipucu
zh_cn: 向汇编者提示, 永远不要插入附加说明的函数

source: `#[must_use]`
es: «[debe_usar]»
fr: `#[doit_utiliser]`
zh_cn: `[必须_用 `

source: Hint to the compiler that the return value of a function or a specific returned type must be used
es: Sugerir al compilador que el valor de retorno de una función o un tipo específico devuelto debe ser utilizado
fr: Astuce au compilateur que la valeur de retour d'une fonction ou d'un type renvoyé spécifique doit être utilisée
id: Petunjuk ke kompiler bahwa nilai kembali dari sebuah fungsi atau tipe yang dikembalikan spesifik harus digunakan
tr: Derleyiciye, bir fonksiyonun veya belirli bir döndürülen türün dönüş değerinin kullanılması gerektiğine dair ipucu
zh_cn: 提示编辑器必须使用函数或特定返回类型返回值

source: `#[generate_trait]`
fr: `#[caractère_généré]`
tr: #[genate_trait]
zh_cn: [遗传_trait]`

source: Automatically generates a trait for an impl
es: Genera automáticamente un rasgo para un impl
fr: Génére automatiquement un trait pour une impl
id: Otomatis menghasilkan suatu sifat untuk sebuah impl
tr: Bir impl için otomatik olarak bir özellik oluşturur
zh_cn: 自动生成软管特性

source: `#[available_gas(...)]`
es: «[disponible_gas(...)]»
fr: `#[disponible_gaz(...)]`
tr: #[kullanılabilir_gaz(...)]
zh_cn: *[可用_gas(...)]`

source: Set the maximum amount of gas available to execute a function
es: Establecer la cantidad máxima de gas disponible para ejecutar una función
fr: Définir la quantité maximale de gaz disponible pour exécuter une fonction
id: Mengatur maksimum jumlah gas yang tersedia untuk mengeksekusi suatu fungsi
tr: Bir fonksiyonu çalıştırmak için mevcut maksimum gaz miktarını ayarlayın
zh_cn: 设定可用于执行函数的最大气体量

source: `#[panic_with('...', wrapper_name)]`
zh_cn: * ```[panic_ with('......)',包装_name'`

source: Creates a wrapper for the annotated function which will panic if the function returns `None` or `Err`, with the given data as the panic error
es: Crea una envoltura para la función anotada que entrará en pánico si la función devuelve `None` o `Err`, con los datos dados como el error de pánico
fr: Crée un wrapper pour la fonction annotée qui paniquera si la fonction retourne `Aucune` ou `Err`, avec les données données données comme erreur de panique
id: Membuat pembungkus untuk fungsi anotasi yang akan panik jika fungsinya kembali atau dengan data yang diberikan sebagai kesalahan panik
tr: None veya Err işlevinin geri gelmesi durumunda panik yapacak olan açıklamalı fonksiyon için bir ambalaj oluşturur, verilen veriler panik hatası olarak
zh_cn: 为附加说明的函数创建一个包装纸,如果函数返回`无'或`错误 ',如果函数返回`无'或`错误 ',以给定数据为惊慌错误,则会惊慌

source: `#[test]`
es: «[prueba]»
zh_cn: `[试 `

source: Describe a function as a test function
es: Describir una función como función de prueba
fr: Décrivez une fonction comme une fonction de test
id: Gambarkan sebuah fungsi sebagai sebuah fungsi tes
tr: Bir fonksiyonu bir test fonksiyonu olarak tanımlamak
zh_cn: 描述函数为测试函数

source: `#[cfg(...)]`
zh_cn: `[参考(...)]`

source: Configuration attribute, especially used to configure a `tests` module with `#[cfg(test)]`
es: Atributo de configuración, especialmente utilizado para configurar un módulo de `pruebas` con '[cfg(test)]`
fr: attribut de configuration, spécialement utilisé pour configurer un module `tests` avec `#[cfg(test)]`
id: Atribut konfigurasi, khususnya digunakan untuk menata sebuah modul åtestó dengan "#[cfgresslertest)]
tr: Yapılandırma özniteliği, özellikle bir tests modülünü #[cfg(test)] ile yapılandırmak için kullanılır
zh_cn: 配置属性, 特别是用于配置“ 测试” 模块的“ 测试” 属性

source: `#[should_panic]`
es: «[debería_panic]»
id: ¶ [seharusnya_panik]
tr: #[olmalı_panik]
zh_cn: `[应_泛 `

source: Specifies that a test function should necessarily panic
es: Especifica que una función de prueba debe necesariamente entrar en pánico
fr: Spécifie qu'une fonction de test doit nécessairement paniquer
id: Tentukan bahwa fungsi tes harus selalu panik
tr: Bir test fonksiyonunun mutlaka panik yapması gerektiğini belirtir
zh_cn: 指定测试函数必须恐慌

source: `#[starknet::contract]`
es: «[starknet::contrato]».
zh_cn: [星网:合同]`

source: Defines a Starknet smart contract
es: Define un contrato inteligente Starknet
fr: Définit un contrat intelligent Starknet
id: Mendefinisikan kontrak cerdas Starknet
tr: Starknet akıllı sözleşmesini tanımlar
zh_cn: 定义斯塔克内特智能合同

source: `#[starknet::interface]`
id: ?? [starknet:: antar muka]?
zh_cn: [星网::接口]`

source: Defines a Starknet interface
es: Define una interfaz Starknet
fr: Définit une interface Starknet
id: Mendefinisikan antarmuka Starknet
tr: Bir Starknet arayüzü tanımlar
zh_cn: 定义 Starknet 界面

source: `#[starknet::component]`
es: «[starknet::componente]».
fr: `#[starknet::composante]`
zh_cn: [星网::构成部分]`

source: Defines a Starknet component
es: Define un componente Starknet
fr: Définit un composant Starknet
id: Mendefinisikan komponen Starknet
tr: Starknet bileşenini tanımlar
zh_cn: 定义 Starknet 组件

source: `#[starknet::embeddable]`
es: «[starknet::embedddable]»
id: ?? [starknet::terbenamkan]
zh_cn: ``[星网::可腐 `

source: Defines an isolated embeddable implementation that can be injected in any smart contract
es: Define una implementación incrustable aislada que puede inyectarse en cualquier contrato inteligente
fr: Définit une implémentation intégrable isolée qui peut être injectée dans n'importe quel contrat intelligent
id: Mendefinisikan sebuah implementasi yang dapat dibenamkan yang dapat disuntikkan dalam kontrak pintar apapun
tr: Herhangi bir akıllı sözleşmede enjekte edilebilen izole bir gömülü uygulamayı tanımlar
zh_cn: 定义可在任何智能合同中注入的孤立的嵌入式实施

source: `#[embeddable_as(...)]`
id: # # [embeddable_as Allahn...]]
zh_cn: *[可编 [作为(...)]`

source: Defines an embeddable implementation inside a component
es: Define una implementación incrustable dentro de un componente
fr: Définit une implémentation intégrable à l'intérieur d'un composant
id: Mendefinisikan sebuah implementasi yang dapat dibenamkan di dalam sebuah komponen
tr: Bir bileşenin içine gömülebilir bir uygulamayı tanımlar
zh_cn: 定义构成部分内可嵌入的执行内容

source: `#[storage]`
es: «[Almacenamiento]»
fr: `#[stockage]`
tr: #[Depolama]
zh_cn: `[储存]`

source: Defines the storage of a smart contract
es: Define el almacenamiento de un contrato inteligente
fr: Définit le stockage d'un contrat intelligent
id: Mendefinisikan penyimpanan kontrak cerdas
tr: Akıllı sözleşmenin depolanmasını tanımlar
zh_cn: 定义智能合同的储存

source: `#[event]`
es: «[evento]»
fr: `#[événement]`
id: # [devent]
tr: #[olay]
zh_cn: `[活动]`

source: Defines an event in a smart contract
es: Define un evento en un contrato inteligente
fr: Définit un événement dans un contrat intelligent
id: Mendefinisikan suatu kejadian dalam sebuah kontrak cerdas
tr: Akıllı sözleşmede bir olayı tanımlar
zh_cn: 在智能合同中定义事件

source: `#[constructor]`
fr: `#[constructeur]`
tr: #[yapımcı]
zh_cn: `[构 `

source: Defines the constructor in a smart contract
es: Define el constructor en un contrato inteligente
fr: Définit le constructeur dans un contrat intelligent
id: Mendefinisikan konstruktor dalam kontrak pintar
tr: Yapılandırıcıyı akıllı bir sözleşmede tanımlar
zh_cn: 在一个智能合同中定义构建器

source: `#[abi(embed_v0)]`
id: S.T.A.R.A.R.D.
zh_cn: * [(embed_v0)]`

source: Defines an implementation of a trait, exposing the functions of the impl as entrypoints of a contract
es: Define la implementación de un rasgo, exponiendo las funciones del impl como puntos de entrada de un contrato
fr: Définit une mise en œuvre d'un trait, exposant les fonctions de l'impl comme points d'entrée d'un contrat
id: Mendefinisikan implementasi sebuah sifat, mengekspos fungsi impl sebagai titik masuk sebuah kontrak
tr: Bir özelliğin uygulanmasını tanımlar, impl'nin işlevlerini bir sözleşmenin giriş noktaları olarak ortaya çıkarır
zh_cn: 定义了特性的实施,将分化功能暴露为合同的切入点

source: `#[abi(per_item)]`
fr: `#[abi(par_item)]`
id: ▪#[abi[abiper_item)]]
zh_cn: [(每个项目)]`

source: Allows individual definition of the entrypoint type of functions inside an impl
es: Permite definir individualmente el tipo de punto de entrada de funciones dentro de un impl
fr: Permet une définition individuelle du type de fonction de point d'entrée à l'intérieur d'un impl
id: Memungkinkan definisi individu dari tipe titik masuk fungsi dalam sebuah impl
tr: Bir impl içindeki girdi noktası tipinin bireysel tanımına izin verir
zh_cn: 允许对内插插管函数的切入点类型进行单个定义

source: `#[external(v0)]`
fr: `#[externe(v0)]`
id: S.E.L.D.A.R.A.R.D.
tr: #[dış(v0)]
zh_cn: [外部(v0)]`

source: Defines an external function when `#[abi(per_item)]` is used
es: Define una función externa cuando se utiliza «[abi(per_item)]»
fr: Définit une fonction externe lorsque `#[abi(per_item)]` est utilisé
id: Mendefinisikan fungsi eksternal ketika "#[abi[abiper_item)] digunakan
tr: #[abi(per_item)] kullanıldığında bir dış fonksiyonu tanımlar
zh_cn: 使用 {{{{{{{{{{( per_ itp}} ` 时定义外部函数

source: Defines a enum variant of the `Event` enum that is not nested, ignoring the variant name in the serialization process, very useful for composability when using Starknet components
es: Define una variante de enum del enum `Event` que no está anidado, ignorando el nombre de la variante en el proceso de serialización, muy útil para la composibilidad cuando se utilizan componentes Starknet
fr: Définit une variante enum de l'enum `Event` qui n'est pas imbriquée, ignorant le nom de la variante dans le processus de sérialisation, très utile pour la composabilité lors de l'utilisation des composants Starknet
id: Mendefinisikan varian enum dari enum yang tidak bersarang, mengabaikan nama varian dalam proses seri, sangat berguna untuk komposabilitas ketika menggunakan komponen Starknet
tr: Event enum'un bir enum varyantını tanımlar, serileştirme işleminde varyant adını göz ardı eder, Starknet bileşenlerini kullanırken uyumluluk için çok kullanışlıdır.
zh_cn: 定义“Event” enum的昆虫变体,该变体没有嵌套,在序列化过程中忽略变体名称,在使用 Starknet 组件时对可变性非常有用

source: `#[key]`
es: «[clave]»
fr: `#[clé]`
id: # [kunci]
tr: #[anahtar]
zh_cn: `[关键]`

source: Defines an indexed `Event` enum field, allowing for more efficient queries and filtering of events
es: Define un campo de enum `Evento' indexado, permitiendo consultas más eficientes y filtrado de eventos
fr: Définit un champ enum `Event` indexé, permettant des requêtes et un filtrage plus efficaces des événements
id: Mendefinisikan medan enum indeks, memungkinkan pencarian yang lebih efisien dan penyaringan peristiwa
tr: İndekslenmiş bir Event enum alanını tanımlar, daha verimli sorgulara ve olayların filtrelenmesine izin verir
zh_cn: 定义索引化的“晚上”内容字段,以便更有效地查询和筛选事件

source: <span class="caption">Table B-5: Attributes</span>
es: <span class="caption">Tabla B-5: Atributos</span>
fr: <span class="caption">Tableau B-5: Attributs</span>
id: <span class="caption">Tabel B-5: Atribut</span>
tr: span class="caption">Tablo B-5: Öznitelikler/span>
zh_cn: <span类=“Caption” >表B-5:属性 </span>

source: Table B-6 shows symbols that appear in the context of calling or defining macros.
es: La Tabla B-6 muestra símbolos que aparecen en el contexto de llamar o definir macros.
fr: Le tableau B-6 montre les symboles qui apparaissent dans le contexte de l'appel ou de la définition des macros.
id: Tabel B-6 menunjukkan simbol yang muncul dalam konteks panggilan atau mendefinisikan makro.
tr: Tablo B-6, makroları çağırma veya tanımlama bağlamında görünen sembolleri gösterir.
zh_cn: 表B-6显示在调用或定义宏时出现的符号。

source: `print!`
fr: "Empreinte!"
id: Sidik jari!
zh_cn: 印记!

source: Inline printing
es: Impresión en línea
fr: Impression en ligne
id: Pencetakan inline
tr: Satır içi baskı
zh_cn: 内线打印

source: `println!`
fr: "Imprimé!"
id: Cetakan!
zh_cn: " 印记! "

source: Print on a new line
es: Imprimir en una nueva línea
fr: Imprimer sur une nouvelle ligne
id: Cetak pada baris baru
tr: Yeni bir satırda yazdır
zh_cn: 在新行打印

source: `consteval_int!`
zh_cn: " 常务会议! "

source: Declare a constant that is the result of a computation of integers
es: Declarar una constante que es el resultado de un cálculo de enteros
fr: Déclarer une constante qui est le résultat d'un calcul d'entiers
id: Menyatakan konstanta yang merupakan hasil dari komputasi integer
tr: Tam sayıların hesaplanmasının sonucu olan bir sabiti ilan edin
zh_cn: 声明一个常数,该常数是计算整数的结果

source: `array!`
fr: "Arrête!"
id: Anarray!
zh_cn: " 列车! "

source: Instantiate and fill arrays
es: Instantátese y llene los arrays
fr: Tableaux instantanés et de remplissage
id: Seketika dan isi array
tr: Dizileri anlık olarak doldur ve doldur
zh_cn: 证明和填充阵列

source: `panic!`
es: ¡Pánico!
fr: 'panique!'
zh_cn: `西班牙人! '

source: Calls `panic` function and allows to provide a message error longer than 31 characters
es: Llama a la función `panic` y permite proporcionar un error de mensaje de más de 31 caracteres
fr: Appele la fonction `panic` et permet de fournir une erreur de message supérieure à 31 caractères
id: Memanggil fungsi åpanicáne dan memungkinkan untuk memberikan pesan error lebih dari 31 karakter
tr: panic işlevini çağırır ve 31 karakterden daha uzun bir mesaj hatası sağlar
zh_cn: 调用 `panic' 函数并允许提供超过 31 个字符的信息错误

source: `assert!`
es: `asertar! '
fr: "s'il vous plaît!"
id: Sosert!
zh_cn: `资产! '

source: Evaluates a Boolean and panics if `false`
es: Evalúa a un booleano y entra en pánico si `falso'
fr: Évalue un booléen et panique si `faux`
id: Mengevaluasi Boolean dan panik jika false
tr: Bir Boolean değerlendirir ve false ise panikler
zh_cn: 评估布尔和恐慌,如果`假'

source: Evaluates an equality, and panics if not equal
es: Evalúa una igualdad, y entra en pánico si no es igual
fr: Evalue une égalité, et panique si ce n'est égal
id: Mengevaluasi kesetaraan, dan panik jika tidak sama
tr: Eşitliği değerlendirir ve eşit değilse panikler
zh_cn: 评估平等,如果不是平等,也会惊慌失措

source: `assert_ne!`
id: Sosert_ne!
zh_cn: `assrt_ne!'`Assert_ne!'`Assert_ne!'`Assert_ne! '

source: Evaluates an equality, and panics if equal
es: Evalúa una igualdad, y entra en pánico si es igual
fr: Evalue une égalité, et panique si égal
id: Mengevaluasi kesetaraan, dan panik jika sama
tr: Eşitliği değerlendirir ve eşitse panikler
zh_cn: 评估平等,如果平等,则评估恐慌

source: `assert_lt!`
id: S_lT!
zh_cn: `资产! '

source: Evaluates a comparison, and panics if greater or equal
es: Evalúa una comparación, y entra en pánico si es mayor o igual
fr: Évaluer une comparaison, et paniquer si plus ou égal
id: Mengevaluasi perbandingan, dan panik jika lebih besar atau sama
tr: Bir karşılaştırmayı değerlendirir ve daha büyük veya eşitse panikler
zh_cn: 评估比较,评估恐慌,如果更大或相等

source: `assert_le!`
zh_cn: `assrt_le!'阿瑟特! '

source: Evaluates a comparison, and panics if greater
es: Evalúa una comparación y, si es mayor, entra en pánico.
fr: Évalue une comparaison, et panique si plus
id: Mengevaluasi perbandingan, dan panik jika lebih besar
tr: Bir karşılaştırmayı değerlendirir ve daha büyükse panikler
zh_cn: 评估比较,评估恐慌,如果更大

source: `assert_gt!`
id: "Asseert_gt!"
zh_cn: `assrt_gt!'(Assert_gt! )

source: Evaluates a comparison, and panics if lower or equal
es: Evalúa una comparación, y entra en pánico si es inferior o igual
fr: Évalue une comparaison, et panique si faible ou égale
id: Mengevaluasi perbandingan, dan panik jika lebih rendah atau sama
tr: Bir karşılaştırmayı değerlendirir ve daha düşük veya eşitse panikler
zh_cn: 比较评价比较,低或等的惊慌或惊慌

source: `assert_ge!`
zh_cn: `Astort_ge! '

source: Evaluates a comparison, and panics if lower
es: Evalúa una comparación, y entra en pánico si es menor
fr: Évalue une comparaison, et panique si moins
id: Mengevaluasi perbandingan, dan panik jika lebih rendah
tr: Bir karşılaştırmayı değerlendirir ve daha düşükse panikler
zh_cn: 评估比较,如果比较低,就会惊慌

source: Format a string and returns a `ByteArray` with the contents
es: Formatear una cadena y devuelve un `ByteArray` con el contenido
fr: Formater une chaîne et retourner un `ByteArray` avec le contenu
id: Memformat string dan mengembalikan sebuah byteArray dengan isi
tr: Bir dizeyi biçimlendirin ve içeriği olan bir ByteArray döndürür
zh_cn: 格式化字符串并返回含有内容的“ Byte 阵列”

source: `write!`
es: `escriba!`
fr: "Écris!"
id: Tulis!
tr: Yaz!
zh_cn: " 写! "

source: Write formatted strings in a formatter
es: Escribir cadenas formateadas en una formateria
fr: Écrire des chaînes formatées dans une matière
id: Tulis string keterangan dalam sebuah formateri
tr: Biçimlendirilmiş dizeleri bir biçimlendiriciye yazın
zh_cn: 将格式格式化字符串写入为要处理的事项

source: `writeln!`
es: `writelin! '
fr: C'est écrit!
id: Penulisan!
zh_cn: " wwretln! " (Wwretln! )

source: Write formatted strings in a formatter on a new line
es: Escribir cadenas formateadas en formateria en una nueva línea
fr: Écrire des chaînes formatées dans un format sur une nouvelle ligne
id: Tulis string terformat dalam sebuah formatter pada baris baru
tr: Biçimlendirilmiş dizeleri yeni bir satırda biçimlendiriciye yazın
zh_cn: 将格式化字符串写入新行的要书

source: `get_dep_component!`
zh_cn: " 获取部件! "

source: Returns the requested component state from a snapshot of the state inside a component
es: Devuelve el estado de componente solicitado de una instantánea del estado dentro de un componente
fr: Renvoie l'état du composant demandé à partir d'un instantané de l'état à l'intérieur d'un composant
id: Mengembalikan keadaan komponen yang diminta dari snapshot dari keadaan di dalam suatu komponen
tr: İstenen bileşen durumunu, bir bileşenin içindeki durumun bir anlık görüntüsünden döndürür
zh_cn: 从部件内状态的快照返回请求的组件状态

source: `get_dep_component_mut!`
zh_cn: " 获取组件!"

source: Returns the requested component state from a reference of the state inside a component
es: Devuelve el estado de componente solicitado desde una referencia del estado dentro de un componente
fr: Renvoie l'état du composant demandé à partir d'une référence de l'état à l'intérieur d'un composant
id: Mengembalikan keadaan komponen yang diminta dari referensi keadaan di dalam komponen
tr: İstenen bileşen durumunu, bir bileşen içindeki durum referansından döndürür
zh_cn: 从部件内状态的引用返回请求的组件状态

source: `component!`
es: `componente!`
fr: "composante!"
id: Komponen!
tr: bileşen!
zh_cn: " 构件! "

source: Macro used in Starknet contracts to embed a component inside a contract
es: Macro utilizado en los contratos Starknet para incrustar un componente dentro de un contrato
fr: Macro utilisé dans les contrats Starknet pour intégrer un composant dans un contrat
id: Makro digunakan dalam kontrak Starknet untuk menanamkan komponen di dalam kontrak
tr: Makro Starknet sözleşmelerinde bir bileşeni bir sözleşmenin içine yerleştirmek için kullanılır
zh_cn: Starknet 合同中用于将组成部分嵌入合同的宏

source: <span class="caption">Table B-6: Macros</span>
es: <span class="caption">Tabla B-6: Macros</span>
fr: <span class="caption">Tableau B-6: Macros</span>
id: <span class="caption">Tabel B-6: Macros</span>
tr: span class="caption">Tablo B-6: Makrolar/span>
zh_cn: <span类=“Caption” >表B-6:宏 </span>

source: Table B-7 shows symbols that create comments.
es: La tabla B-7 muestra símbolos que crean comentarios.
fr: Le tableau B-7 montre les symboles qui créent des commentaires.
id: Tabel B-7 menunjukkan simbol yang membuat komentar.
tr: Tablo B-7 yorum oluşturan sembolleri gösterir.
zh_cn: 表B-7显示创建注释的符号。

source: Line comment
es: Comentario de línea
fr: Commentaire de ligne
id: Komentar baris
tr: Satır yorumu
zh_cn: 线条注释注释

source: <span class="caption">Table B-7: Comments</span>
es: <span class="caption">Tabla B-7: Comentarios</span>
fr: <span class="caption">Tableau B-7: Commentaires</span>
id: <span class="caption">Tabel B-7: Komentar</span>
tr: span class="caption">Tablo B-7: Yorumlar/span>
zh_cn: <span类=“Caption” >表B-7:批注 </span>

source: Table B-8 shows symbols that appear in the context of using tuples.
es: La tabla B-8 muestra los símbolos que aparecen en el contexto del uso de tuplas.
fr: Le tableau B-8 montre les symboles qui apparaissent dans le contexte de l'utilisation des tuples.
id: Tabel B-8 menampilkan simbol yang muncul dalam konteks menggunakan tuples.
tr: Tablo B-8, tuples kullanımı bağlamında görünen sembolleri gösterir.
zh_cn: 表B-8显示了在使用图普尔时出现的符号。
