Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Cairo is quite different from traditional programming languages, especially when it comes to overhead costs and its primary advantages. Your program can be executed in two different ways:
es: El Cairo es muy diferente de los lenguajes de programación tradicionales, especialmente cuando se trata de gastos generales y sus principales ventajas. Su programa se puede ejecutar de dos maneras diferentes:
fr: Le Caire est très différent des langages traditionnels de programmation, surtout en ce qui concerne les frais généraux et ses principaux avantages. Votre programme peut être exécuté de deux façons différentes :
id: Kairo cukup berbeda dari bahasa pemrograman tradisional, terutama ketika datang ke biaya overhead dan keuntungan utama. program Anda dapat dijalankan dalam dua cara yang berbeda:
tr: Kahire, geleneksel programlama dillerinden oldukça farklıdır, özellikle de genel giderler ve birincil avantajları söz konusu olduğunda. Programınız iki farklı şekilde yürütülebilir:
zh_cn: 开罗与传统的编程语言有很大不同,特别是在间接费用及其主要优势方面。

source: When executed by the prover, it is similar to any other language. Because Cairo is virtualized, and because the operations were not specifically designed for maximum efficiency, this can lead to some performance overhead but it is not the most relevant part to optimize.
es: Cuando se ejecuta por el probador, es similar a cualquier otro idioma. Debido a que El Cairo está virtualizado, y debido a que las operaciones no fueron diseñadas específicamente para la máxima eficiencia, esto puede conducir a algunos gastos generales de rendimiento, pero no es la parte más relevante para optimizar.
fr: Lorsqu'il est exécuté par le prover, il est similaire à n'importe quelle autre langue. Parce que le Caire est virtualisé, et parce que les opérations n'ont pas été spécifiquement conçues pour une efficacité maximale, cela peut conduire à certains frais généraux de performance, mais il n'est pas la partie la plus pertinente à optimiser.
id: Ketika dieksekusi oleh prover, itu mirip dengan bahasa lain. karena Kairo di virtualisasi, dan karena operasi tidak dirancang secara khusus untuk efisiensi maksimum, ini dapat menyebabkan beberapa kinerja overhead tapi itu bukan bagian yang paling relevan untuk mengoptimalkan.
tr: Kanıtlayıcı tarafından yürütüldüğünde, diğer dillere benzer. Kahire sanallaştırıldığından ve işlemler maksimum verimlilik için özel olarak tasarlanmadığından, bu bazı performans yüküne yol açabilir, ancak optimize etmek için en alakalı kısım değildir.
zh_cn: 由证明人执行时,它与其他语言类似。 因为开罗已经虚拟化,而且由于业务不是专门设计来达到最高效率的,这可能导致某些业绩管理费,但这不是最相关的部分。

source: When the generated proof is verified by a verifier, it is a bit different. This has to be as cheap as possible since it could potentially be verified on many very small machines. Fortunately verifying is faster than computing and Cairo has some unique advantages to improve it even more. A notable one is non-determinism. This is a topic you will cover in more detail later in this book, but the idea is that you can theoretically use a different algorithm for verifying than for computing. Currently, writing custom non-deterministic code is not supported for the developers, but the standard library leverages non-determinism for improved performance. For example sorting an array in Cairo costs the same price as copying it. Because the verifier doesn't sort the array, it just checks that it is sorted, which is cheaper.
es: Cuando la prueba generada es verificada por un verificador, es un poco diferente. Esto tiene que ser tan barato como sea posible ya que podría ser verificado en muchas máquinas muy pequeñas. Afortunadamente verificar es más rápido que la computación y El Cairo tiene algunas ventajas únicas para mejorarlo aún más. Una notable es el no-determinismo. Este es un tema que usted cubrirá en más detalle más adelante en este libro, pero la idea es que se puede utilizar teóricamente un algoritmo diferente para verificar que para la computación. Actualmente, la escritura de código personalizado no-determinista no es compatible con los desarrolladores, pero la biblioteca estándar aprovecha el no-determinismo para mejorar el rendimiento. Por ejemplo, ordenar una matriz en El Cairo cuesta el mismo precio que copiarlo. Debido a que el verificador no clasifica la matriz, sólo comprueba que está clasificado, que es más barato.
fr: Lorsque la preuve générée est vérifiée par un vérificateur, elle est un peu différente. Cela doit être aussi bon marché que possible car il pourrait potentiellement être vérifié sur de nombreuses très petites machines. Heureusement, la vérification est plus rapide que l'informatique et le Caire a quelques avantages uniques pour l'améliorer encore plus. Un notable est non-déterminisme. C'est un sujet que vous allez couvrir plus en détail plus tard dans ce livre, mais l'idée est que vous pouvez théoriquement utiliser un algorithme différent pour vérifier que pour l'informatique. Actuellement, l'écriture de code non-déterministe personnalisé n'est pas supporté pour les développeurs, mais la bibliothèque standard exploite le non-déterminisme pour améliorer les performances. Par exemple, le tri d'un tableau au Caire coûte le même prix que la copie. Parce que le vérificateur ne trie pas le tableau, il vérifie simplement qu'il est trié, ce qui est moins cher.
id: Ketika bukti yang dihasilkan diverifikasi oleh sebuah pemverifikasi, hal ini sedikit berbeda. Ini harus semurah mungkin karena bisa diverifikasi pada banyak mesin yang sangat kecil. Untungnya memverifikasi lebih cepat daripada komputasi dan Kairo memiliki beberapa keuntungan unik untuk meningkatkannya lagi. Sebuah hal yang dapat dilihat tidak ditentukan. Ini adalah topik yang akan Anda bahas dalam lebih detail dalam buku ini, tetapi idenya adalah bahwa Anda dapat secara teori menggunakan algoritma yang berbeda untuk memverifikasi. Saat ini, menulis kode custom non-tertentu tidak didukung untuk pengembang, tetapi standar pengadaan tidak ditentukan dalam kinerja yang lebih baik di buku ini. Untuk pengurutan contoh dalam array Kairo seperti harga yang sama.
tr: Oluşturulan kanıt bir doğrulayıcı tarafından doğrulandığında, biraz farklıdır. Bu, birçok çok küçük makinede potansiyel olarak doğrulanabileceği için mümkün olduğunca ucuz olmalıdır. Neyse ki doğrulama işlemi, hesaplamadan daha hızlıdır ve Kahire'nin daha da geliştirmek için bazı benzersiz avantajları vardır. Dikkat çekici olan, belirleyici olmayan bir özelliktir. Bu, daha sonra bu kitapta ele alacağınız bir konudur, ancak fikir, şu anda doğrulama için teorik olarak farklı bir algoritma kullanabileceğinizdir.
zh_cn: 当生成的证明由核查者核查时,它就有点不同了。 它必须尽可能便宜, 因为它有可能在很多非常小的机器上被核查。 幸运的是, 核查比计算要快, 开罗有一些独特的优势来进一步改进它。 一个显著的优势是非决定性的。 这是一个您在本书后面会更详细地讨论的专题, 但这个想法是, 您可以在理论上使用一种不同的算法来核查。 目前, 开发者不支持写自定义的非确定性代码, 但标准图书馆可以利用非确定性来改进性能。 例如, 在开罗对一个阵列进行分类, 成本与复制该阵列相同。 因为验证者不排序阵列, 它只是检查它被排序的算法, 成本更低。

source: Another aspect that sets the language apart is its memory model. In Cairo, memory access is immutable, meaning that once a value is written to memory, it cannot be changed. Cairo 1 provides abstractions that help developers work with these constraints, but it does not fully simulate mutability. Therefore, developers must think carefully about how they manage memory and data structures in their programs to optimize performance.
es: Otro aspecto que diferencia el lenguaje es su modelo de memoria. En El Cairo, el acceso a la memoria es inmutable, lo que significa que una vez que se escribe un valor a la memoria, no se puede cambiar. El Cairo 1 proporciona abstracciones que ayudan a los desarrolladores a trabajar con estas limitaciones, pero no simula completamente la mutabilidad. Por lo tanto, los desarrolladores deben pensar cuidadosamente sobre cómo gestionan la memoria y las estructuras de datos en sus programas para optimizar el rendimiento.
fr: Un autre aspect qui distingue le langage est son modèle de mémoire. Au Caire, l'accès à la mémoire est immuable, ce qui signifie qu'une fois qu'une valeur est écrite à la mémoire, elle ne peut pas être changée. Le Caire 1 fournit des abstractions qui aident les développeurs à travailler avec ces contraintes, mais il ne simule pas complètement la mutabilité.
id: Aspek lain yang mengatur bahasanya adalah model memorinya. di Kairo, akses memori tidak dapat berubah, berarti bahwa sekali nilai ditulis untuk memori, tidak dapat diubah. Kairo 1 menyediakan abstraksi yang membantu pengembang bekerja dengan batasan-batasan ini, tetapi tidak sepenuhnya mensimulasikan mutability. Oleh karena itu, pengembang harus memikirkan dengan cermat bagaimana mereka mengelola memori dan struktur data dalam program mereka untuk mengoptimalkan kinerja.
tr: Dili birbirinden ayıran bir başka özellik de bellek modelidir. Kahire'de bellek erişimi değişmezdir, yani bir değer hafızaya yazıldığında değiştirilemez. Kahire 1, geliştiricilerin bu kısıtlamalarla çalışmasına yardımcı olan soyutlamalar sağlar, ancak tamamen değişkenliği simüle etmez. Bu nedenle, geliştiriciler performanslarını optimize etmek için programlarındaki bellek ve veri yapılarını nasıl yönettiklerini dikkatlice düşünmelidir.
zh_cn: 将语言分开的另一个方面是其记忆模型。 在开罗,记忆存取是不可改变的,这意味着一旦一个数值写入记忆,它就无法改变。 开罗一号提供了抽象概念,帮助开发者克服这些制约,但并不完全模拟变异性。 因此,开发者必须仔细思考如何在程序内管理内存和数据结构,以优化性能。

source: References
es: Bibliografía
fr: Références
id: Referensi
tr: Kaynakça
zh_cn: 参考参考资料

source: Cairo CPU Architecture: <https://eprint.iacr.org/2021/1063>
es: El Cairo CPU Architecture: <https://eprint.iacr.org/2021/1063>
fr: Architecture du CPU du Caire : <https://eprint.iacr.org/2021/1063>
id: Arsitektur CPU Kairo: <https://eprint.iacr.org/2021/1063>
tr: Kahire CPU Mimarisi: https://eprint.iacr.org/2021/1063>
zh_cn: 开罗CPU建筑:<https://eprint.iacr.org/2021/1063>

source: Cairo, Sierra and Casm: <https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5>
es: El Cairo, Sierra y Casm: <https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5>
fr: Le Caire, la Sierra et Casm : <https://medium.com/nethermind-eth/under-the-hood- of-cairo-1-0-exploring-sierra-7f32808421f5>
id: Kairo, Sierra dan Casm: <https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5>
tr: Kahire, Sierra ve Casm: https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5>
zh_cn: 开罗、塞拉和卡斯姆:<https://medic.com/nethermind-eth/under-found-hood-for-cairo-1-0-exploring-sierra-7f32808421f5>

source: State of non determinism: <https://twitter.com/PapiniShahar/status/1638203716535713798>
es: Estado de no determinismo: <https://twitter.com/PapiniShahar/status/1638203716535713798>
fr: État de non-déterminisme: <https://twitter.com/PapiniShahar/status/1638203716535713798>
id: Keadaan determinisme non: <https://twitter.com/PapiniShahar/status/1638203716535713798>
tr: Determinizmin Durumu: https://twitter.com/PapiniShahar/status/1638273716535713798>
zh_cn: 非决定性现状:<https://twitter.com/PapiniShahar/status/1638203735353713798>

source: Let’s start your Cairo journey! There’s a lot to learn, but every journey starts somewhere. In this chapter, we’ll discuss:
es: ¡Comencemos tu viaje a El Cairo! Hay mucho que aprender, pero cada viaje comienza en alguna parte. En este capítulo, vamos a discutir:
fr: Commençons votre voyage au Caire! Il ya beaucoup à apprendre, mais chaque voyage commence quelque part. Dans ce chapitre, nous allons discuter:
id: Mari kita mulai perjalanan ke Kairo!
tr: Kahire yolculuğuna başlayalım! Öğrenecek çok şey var, ama her yolculuk bir yerden başlıyor. Bu bölümde, tartışacağız:
zh_cn: 让我们开始你的开罗之旅吧!有很多东西需要学习,但每次旅程都从某处开始。在本章中,我们将讨论:

source: Installing Scarb, which is Cairo's build toolchain and package manager, on Linux, macOS, and Windows.
es: Instalar Scarb, que es la cadena de herramientas de compilación y gestor de paquetes de El Cairo, en Linux, macOS y Windows.
fr: Installer Scarb, qui est la chaîne d'outils de construction du Caire et gestionnaire de paquets, sur Linux, macOS et Windows.
id: Memasang Scarb, yang merupakan gantungan alat Kairo dan manajer paket, pada Linux, macOS, dan Windows.
tr: Kahire'nin araç zinciri ve paket yöneticisi olan Scarb'ı Linux, macOS ve Windows'a yüklemek.
zh_cn: 在Linux、MacOS和Windows上安装疤痕,这是开罗的建筑工具链和软件包管理器。

source: Writing a program that prints `Hello, world!`.
es: Escribiendo un programa que imprime `¡Hola, mundo!`.
fr: Écrire un programme qui imprime "Bonjour, monde!".
id: Menulis program yang dicetak, dunia!
tr: Merhaba, dünya! yazdıran bir program yazmak.
zh_cn: 写一个程序,印有 " 你好,世界! " 。

source: Using basic Scarb commands to create a project and execute a program.
es: Usando comandos Scarb básicos para crear un proyecto y ejecutar un programa.
fr: Utiliser des commandes Scarb de base pour créer un projet et exécuter un programme.
id: Menggunakan perintah Scarb dasar untuk membuat proyek dan menjalankan program.
tr: Temel Scarb komutlarını kullanarak bir proje oluşturun ve bir programı çalıştırın.
zh_cn: 使用基本的疤痕命令创建工程并执行程序 。

source: Getting Help
es: Obtener ayuda
fr: Obtenir de l'aide
id: Mendapatkan Bantuan
tr: Yardım Alınıyor
zh_cn: 寻求帮助

source: If you have any questions about Starknet or Cairo, you can ask them in the [Starknet Discord server](https://discord.gg/starknet-community). The community is friendly and always willing to help.
es: Si tiene alguna pregunta sobre Starknet o El Cairo, puede preguntarles en el [Servidor Starknet Discord] (https://discord.gg/starknet-community). La comunidad es amable y siempre está dispuesta a ayudar.
fr: Si vous avez des questions sur Starknet ou le Caire, vous pouvez les poser dans le [serveur Starknet Discord](https://discord.gg/starknet-community). La communauté est amicale et toujours prête à aider.
id: Jika Anda memiliki pertanyaan tentang Starknet atau Kairo, Anda dapat bertanya kepada mereka di [Surver Discord Starknet] mereka ramah dan selalu bersedia membantu.
tr: Starknet veya Kahire hakkında herhangi bir sorunuz varsa, bunları [Starknet Discord sunucusu] (https://discord.gg/starknet-community) adresinden isteyebilirsiniz. Topluluk arkadaş canlısı ve her zaman yardım etmeye isteklidir.
zh_cn: 如果您有任何关于斯塔克内特或开罗的疑问, 您可以在 Starknet Discord 服务器( https:// discord.gg/ starknet- community) ( https:// discord. gg/ starknet- community) 中询问。 社区是友好的, 并且总是愿意提供帮助 。

source: Interacting with the Cairo Chatbot
es: Interactuando con el Chatbot de El Cairo
fr: Interagir avec le Chatbot du Caire
id: Berinteraksi dengan Chatbot Kairo
tr: Kahire Chatbot'u ile etkileşim
zh_cn: 与开罗查波特互动

source: Cairo has its own chatbot, which can help you with Cairo-related questions. The chatbot is trained on the Cairo book, and uses RAG to efficiently retrieve information to provide help. You can find the chatbot on the [Cairo-Chatbot](https://cairo-chatbot.vercel.app/) website.
es: El Cairo tiene su propio chatbot, que puede ayudarle con preguntas relacionadas con El Cairo. El chatbot está entrenado en el libro de El Cairo, y utiliza RAG para recuperar información de manera eficiente para proporcionar ayuda. Usted puede encontrar el chatbot en el [El Cairo-Chatbot] (https://cairo-chatbot.vercel.app/) sitio web.
fr: Le Caire a son propre chatbot, qui peut vous aider avec les questions liées au Caire. Le chatbot est formé sur le livre du Caire, et utilise RAG pour récupérer efficacement l'information pour fournir de l'aide. Vous pouvez trouver le chatbot sur le [Cairo-Chatbot](https://cairo-chatbot.vercel.app/) site Web.
id: Kairo memiliki robot chat-nya sendiri, yang dapat membantu Anda dengan pertanyaan-pertanyaan yang berhubungan dengan Kairo. Chatbot dilatih di buku Kairo, dan menggunakan RAG untuk memperoleh informasi secara efisien untuk menyediakan bantuan. Anda dapat menemukan chatbot (Kairo-Chatbot) di website [Cairo-Chatps://cairo-chatbot.vercel.app/).
tr: Kahire'nin Kahire ile ilgili sorularda size yardımcı olabilecek kendi chatbot'u vardır. Chatbot Kahire kitabında eğitilir ve yardım sağlamak için bilgileri verimli bir şekilde almak için RAG kullanır. Chatbot'u [Cairo-Chatbot](https://cairo-chatbot.vercel.app/) web sitesinde bulabilirsiniz.
zh_cn: 开罗有它自己的聊天室,可以帮助您解决与开罗有关的问题。 聊天室接受开罗书的培训,并利用RAG有效检索信息来提供帮助。 您可以在 [Cairo-Chatbot] (https://cairo-chatbot.vercel.app/) 网站上找到聊天室。

source: Cairo can be installed by simply downloading [Scarb](https://docs.swmansion.com/scarb/docs). Scarb bundles the Cairo compiler and the Cairo language server together in an easy-to-install package so that you can start writing Cairo code right away.
es: El Cairo se puede instalar simplemente descargando [Scarb](https://docs.swmansion.com/scarb/docs). Scarb agrupa el compilador de El Cairo y el servidor de idioma El Cairo en un paquete fácil de instalar para que pueda empezar a escribir código El Cairo de inmediato.
fr: Le Caire peut être installé en téléchargeant simplement [Scarb](https://docs.swmansion.com/scarb/docs). Scarb regroupe le compilateur du Caire et le serveur de langue du Caire dans un paquet facile à installer afin que vous puissiez commencer à écrire le code du Caire tout de suite.
id: Kairo dapat dipasang hanya dengan mengunduh [Scarb][Scarb][Hyttps://docs.swmansion.com/scarb/docs). Scarb mengelompokkan kompiler Kairo dan server bahasa Kairo bersama-sama dalam paket mudah-ke-install sehingga Anda dapat mulai menulis kode Kairo segera.
tr: Kahire basitçe indirerek kurulabilir [Scarb](https://docs.swmansion.com/scarb/docs). Scarb, Kahire derleyicisini ve Kahire dil sunucusunu bir araya getirir, böylece Kahire kodunu hemen yazmaya başlayabilirsiniz.
zh_cn: 开罗可以通过简单的下载 [Scarb] (https://docs.swmansion.com/scarb/docs) 来安装。 斯卡布将开罗汇编器和开罗语言服务器捆绑在一起,在一个容易安装的软件包中,以便您能够马上开始写入开罗代码。

source: Scarb is also Cairo's package manager and is heavily inspired by [Cargo](https://doc.rust-lang.org/cargo/), Rust’s build system and package manager.
es: Scarb es también el gestor de paquetes de El Cairo y está fuertemente inspirado en [Cargo] (https://doc.rust-lang.org/cargo/), el gestor de sistemas de construcción y paquetes de Rust.
fr: Scarb est également le gestionnaire de paquets du Caire et est fortement inspiré par [Cargo](https://doc.rust-lang.org/cargo/), Rust="s build system and package manager.
id: Scarb juga manajer paket Kairo dan sangat terinspirasi oleh [Cargo][Carhttps://doc.rust-lang.org/cargo/), Rustás membangun sistem dan manajer paket.
tr: Scarb aynı zamanda Kahire'nin paket yöneticisidir ve [Cargo](https://doc.rust-lang.org/cargo/), Rust'un yapı sistemi ve paket yöneticisinden yoğun bir şekilde ilham almaktadır.
zh_cn: Scarb也是开罗的一揽子计划经理,深受[Cargo](https://doc.rust-lang.org/cargo/)、Rust的建筑系统和一揽子计划经理的启发。

source: Scarb handles a lot of tasks for you, such as building your code (either pure Cairo or Starknet contracts), downloading the libraries your code depends on, building those libraries, and provides LSP support for the VSCode Cairo 1 extension.
es: Scarb se encarga de muchas tareas para usted, como la construcción de su código (ya sea puro El Cairo o Starknet contratos), la descarga de las bibliotecas de su código depende de, la construcción de esas bibliotecas, y proporciona apoyo LSP para la extensión VSOde El Cairo 1.
fr: Scarb s'occupe de beaucoup de tâches pour vous, telles que la construction de votre code (contrats du Caire pur ou de Starknet), le téléchargement des bibliothèques dont dépend votre code, la construction de ces bibliothèques, et fournit une prise en charge LSP pour l'extension VSCode Cairo 1.
id: Scarb menangani banyak tugas untuk Anda, seperti membangun kode Anda (yang merupakan kontrak Kairo atau Starknet murni), mengunduh perpustakaan yang kode Anda tergantung pada, membangun perpustakaan tersebut, dan menyediakan dukungan LSP untuk ekstensi VSCode Kairo 1.
tr: Scarb, kodunuzu oluşturmak (saf Kahire veya Starknet sözleşmeleri), kodunuzun bağlı olduğu kütüphaneleri indirmek, bu kütüphaneleri oluşturmak gibi sizin için birçok görevi yerine getirir ve VSCode Cairo 1 uzantısı için LSP desteği sağlar.
zh_cn: 刀疤为您处理许多任务, 例如建立您的代码(纯开罗或史塔克内特合同), 下载您的代码所依赖的图书馆, 建立这些图书馆, 并为 VSCode Cairo 1 扩展提供LSP 支持 。

source: As you write more complex Cairo programs, you might add dependencies, and if you start a project using Scarb, managing external code and dependencies will be a lot easier to do.
es: A medida que escriba programas más complejos de El Cairo, puede agregar dependencias, y si comienza un proyecto usando Scarb, la gestión de código externo y dependencias será mucho más fácil de hacer.
fr: Lorsque vous écrivez des programmes plus complexes au Caire, vous pouvez ajouter des dépendances, et si vous commencez un projet en utilisant Scarb, gérer le code externe et les dépendances sera beaucoup plus facile à faire.
id: Ketika Anda menulis program Kairo yang lebih kompleks, Anda mungkin menambahkan ketergantungan, dan jika Anda memulai sebuah proyek menggunakan Scarb, mengelola kode eksternal dan ketergantungan akan jauh lebih mudah untuk dilakukan.
tr: Daha karmaşık Kahire programları yazarken, bağımlılıklar ekleyebilirsiniz ve Scarb'ı kullanarak bir projeye başlarsanız, harici kodu ve bağımlılıkları yönetmek çok daha kolay olacaktır.
zh_cn: 当你写更复杂的开罗程序时,你可能会增加依赖性, 如果你开始一个使用刀疤的项目, 管理外部代码和依赖性会更容易得多。

source: Let's start by installing Scarb.
es: Empecemos instalando Scarb.
fr: Commençons par installer Scarb.
id: Mari kita mulai dengan memasang Scarb.
tr: Scarb'ı kurarak başlayalım.
zh_cn: 我们先安装刀疤吧

source: Installing Scarb
es: Instalación de Scarb
fr: Installation de Scarb
id: Memasang Scarb
tr: Scarb Kurulumu
zh_cn: 正在安装 scrab

source: Requirements
es: Necesidades
fr: Besoins
id: Persyaratan
tr: Gereksinimler
zh_cn: 所需资源所需资源所需资源所需资源所需资源所需资源所需资源所需资源所需资源所需资源所需资源

source: Scarb requires a Git executable to be available in the `PATH` environment variable.
es: Scarb requiere un ejecutable Git para estar disponible en la variable de entorno `PATH`.
fr: Scarb exige qu'un exécutable Git soit disponible dans la variable d'environnement `PATH`.
id: Scarb memerlukan sebuah aplikasi Git untuk tersedia dalam variabel lingkungan åPATH Rasulullah.
tr: Scarb, PATH ortam değişkeninde kullanılabilir olması için bir Git çalıştırılabiliri gerektirir.
zh_cn: 疤痕要求在“ PATH” 环境变量中提供 Git 执行文件。
