Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Similarly, Enums can only be written to storage if they implement the `Store` trait, which can be trivially derived as long as all associated types implement the `Store` trait.
es: Del mismo modo, los enums sólo pueden escribirse para su almacenamiento si aplican el rasgo de `Almacenamiento`, que puede derivarse trivialmente mientras todos los tipos asociados apliquen el rasgo de `Almacenamiento '.
fr: De même, les Enums ne peuvent être stockés que s'ils mettent en œuvre le caractère `Store`, qui peut être dérivé trivialement tant que tous les types associés mettent en œuvre le caractère `Store`.
id: Demikian pula, Enums hanya dapat ditulis untuk disimpan jika mereka menerapkan sifat åstore, yang dapat diambil secara sepele selama semua jenis yang terkait menerapkan sifat åstore.
tr: Benzer şekilde, Enum'lar yalnızca Store özelliğini uygularlarsa depolamaya yazılabilir, bu da tüm ilişkili türler Store özelliğini uyguladığı sürece önemsiz olarak türetilebilir.
zh_cn: 同样,只有执行`轮胎'特性,才能将东兽书写到储存处,只要所有相关类型都执行`轮胎'特性,就可以微乎其微地得出`轮胎'特性。

source: You might have noticed that we also derived `Drop` and `Serde` on our custom types. Both of them are required for properly serializing arguments passed to entrypoints and deserializing their outputs.
es: Usted podría haber notado que también derivamos `Drop` y `Serde` en nuestros tipos personalizados. Ambos son necesarios para serializar correctamente los argumentos pasados a los puntos de entrada y deserializar sus productos.
fr: Vous avez peut-être remarqué que nous avons également dérivé `Drop` et `Serde` sur nos types personnalisés. Les deux sont nécessaires pour sérialiser correctement les arguments passés aux points d'entrée et désérialiser leurs sorties.
id: Anda mungkin juga memperhatikan bahwa kami juga mendapat informasi dari Deprop dan tipe-tipe custom kami. Keduanya diperlukan untuk membuat argumen serial yang tepat untuk masuk dan mengurangi keluaran mereka.
tr: Özel türlerimizde de Drop ve Serde türettiğimizi fark etmiş olabilirsiniz. Her ikisi de giriş noktalarına aktarılan argümanları düzgün bir şekilde serileştirmek ve çıktılarını deserialize etmek için gereklidir.
zh_cn: 你可能已经注意到,我们也从我们的习惯类型中推导出`Drop'和`Serde ',两者都需要对通过进入点的论据进行适当序列整理,使其产出失效。

source: Structs Storage Layout
es: Diseño de almacenamiento de estructuras
fr: Structure de stockage des structures
id: Tata Letak Penyimpanan Struktur
tr: Structs Depolama Düzeni
zh_cn: Structs 存储布局

source: On Starknet, structs are stored in storage as a sequence of primitive types. The elements of the struct are stored in the same order as they are defined in the struct definition. The first element of the struct is stored at the base address of the struct, which is computed as specified in ["Addresses of Storage Variables"](./ch14-01-contract-storage.html#addresses-of-storage-variables) section and can be obtained by calling `var.address()`, and subsequent elements are stored at addresses contiguous to the first element. For example, the storage layout for the `owner` variable of type `Person` will result in the following layout:
es: En Starknet, las estructuras se almacenan en el almacenamiento como una secuencia de tipos primitivos. Los elementos de la estructura se almacenan en el mismo orden que se definen en la definición de estructura. El primer elemento de la estructura se almacena en la dirección de base de la estructura, que se calcula como se especifica en ["Dirección de variables de almacenamiento"](./ch14-01-contract-storage.html#direcciones-de-almacenamiento-variables) sección y se puede obtener llamando a `var.address()`, y los elementos posteriores se almacenan en direcciones contiguas al primer elemento. Por ejemplo, el diseño de almacenamiento de la variable `propietario` del tipo `Person` dará como resultado el siguiente diseño:
fr: Sur Starknet, les structures sont stockées dans une séquence de types primitifs. Les éléments de la structure sont stockés dans le même ordre que ceux définis dans la définition de la structure. Le premier élément de la structure est stocké à l'adresse de base de la structure, qui est calculée comme spécifié dans la section [./ch14-01-contract-storage.html#addresses-of-storage-variables) et peut être obtenu en appelant `var.address()`, et les éléments suivants sont stockés aux adresses contiguës au premier élément. Par exemple, la mise en page de stockage de la variable `owner` du type `Person` entraînera la mise en page suivante:
id: Pada Starknet, struktur disimpan dalam urutan tipe primitif. Elemen-elemen dari struct disimpan dalam urutan yang sama seperti yang didefinisikan dalam definisi struct. Elemen pertama dari struktur disimpan di dasar alamat struct, yang dihitung seperti yang ditentukan dalam ["Alamat dari Variabel Penyimpanan"]./ch14-01-contract-torage.Hmladdress-of-tor-variable) dan dapat diperoleh dengan memanggil Á.address"), alamat selanjutnya disimpan pada elemen konig untuk contoh pertama. Untuk layouter, untuk layouter \\:
tr: Starknet'te, struct'lar bir dizi ilkel tip olarak depolanır. struct'ın elemanları, struct tanımında tanımlandığı gibi aynı sırada saklanır. struct'ın ilk elemanı, struct'ın ["Storage Değişkenlerinin Adresleri ve Adresleri" olarak belirtilen temel adresinde saklanır.
zh_cn: 在Starknet上,支架作为原始类型的序列储存在储存中。支架的各个组成部分的储存顺序与在支架定义中定义的顺序相同。支架的第一个组成部分储存在支架的基座(根据[“存储变量的代号”)(./ch14-01-合同-储存.html#地址-储存-可变性)部分的规定计算,可以通过调用`var.address()'获得,随后的元素储存在与第一个元素毗连的地址。例如,`所有者'类型`人'的储存布局将导致以下布局:

source: Fields
es: Campos
fr: Champs
tr: Alanlar
zh_cn: 外地

source: Address
es: Dirección
fr: Adresse
id: Alamat
tr: Adres
zh_cn: 地址地址地址地址

source: name
es: nombre
fr: Dénomination
id: nama
tr: isim
zh_cn: 名称名称名称名称名称

source: owner.address()
fr: adresse du propriétaire()
id: Pemilik.address[address]
tr: sahibi.address()
zh_cn: 拥有者. address ()

source: address
es: dirección
fr: Adresse
id: alamat
tr: adres
zh_cn: 地址地址地址地址地址地址

source: owner.address() +1
fr: adresse du propriétaire() +1
id: pemilik.address Allah) +1
zh_cn: 所有者. address () +1

source: Note that tuples are similarly stored in contract's storage, with the first element of the tuple being stored at the base address, and subsequent elements stored contiguously.
es: Tenga en cuenta que las tuplas se almacenan de manera similar en el almacenamiento del contrato, con el primer elemento de la tupla almacenado en la dirección de la base, y los elementos posteriores almacenados de forma contigua.
fr: Notez que les tuples sont également stockés dans le stockage du contrat, le premier élément du tuple étant stocké à l'adresse de base, et les éléments subséquents stockés de manière contiguë.
id: Perhatikan bahwa tuples juga disimpan dalam penyimpanan kontrak, dengan elemen pertama dari tuple yang disimpan di alamat dasar, dan unsur - unsur berikutnya yang tersimpan dengan kontguously.
tr: Tuple'ların benzer şekilde sözleşmenin deposunda depolandığını, tuple'ın ilk elemanının temel adreste depolandığını ve sonraki elemanların bitişik olarak depolandığını unutmayın.
zh_cn: 请注意,象牙同样储存在合同的储存中,象牙的第一个部分储存在基址,随后的一些部分以毗连方式储存。

source: Enums Storage Layout
es: Disposición de almacenamiento de enums
fr: Mise en page de stockage des enums
id: Tata Letak Penyimpanan Enums
tr: Enums Depolama Düzeni
zh_cn: Enums 存储布局

source: When you store an enum variant, what you're essentially storing is the variant's index and eventual associated values. This index starts at 0 for the first variant of your enum and increments by 1 for each subsequent variant. If your variant has an associated value, this value is stored starting from the address immediately following the address of the index of the variant. For example, suppose we have the `RegistrationType` enum with the `finite` variant that carries an associated limit date, and the `infinite` variant without associated data. The storage layout for the `finite` variant would look like this:
es: Cuando se almacena una variante de enum, lo que se almacena esencialmente es el índice de la variante y los valores asociados. Este índice comienza en 0 para la primera variante de su enum y aumenta por 1 para cada variante posterior. Si su variante tiene un valor asociado, este valor se almacena a partir de la dirección inmediatamente siguiente a la dirección del índice de la variante. Por ejemplo, supongamos que tenemos el `RegistroType` enum con la variante `finite` que lleva una fecha límite asociada, y la variante `infinite` sin datos asociados. El diseño de almacenamiento de la variante `finite` tendría este aspecto:
fr: Lorsque vous stockez une variante d'enum, ce que vous stockez essentiellement est l'index de la variante et les valeurs associées éventuelles. Cet index commence à 0 pour la première variante de votre enum et incréments par 1 pour chaque variante suivante. Si votre variante a une valeur associée, cette valeur est stockée à partir de l'adresse immédiatement après l'adresse de l'index de la variante. Par exemple, supposons que nous ayons l'enum `RegistrationType` avec la variante `finite` qui porte une date limite associée, et la variante `infini` sans données associées. La disposition de stockage pour la variante `finite` ressemblerait à ceci:
id: Ketika Anda menyimpan sebuah varian enum, apa yang pada dasarnya Anda simpan adalah indeks varian dan akhirnya terkait. Indeks ini dimulai pada 0 untuk varian pertama dari enum dan inkremen Anda oleh 1 untuk setiap varian berikutnya. Jika varian Anda memiliki nilai yang terkait, nilai ini disimpan mulai dari alamat berikut alamat dari indeks varian. Sebagai contoh, misalkan kita memiliki varian ▪RegitrasiTypeáum dengan varian yang mengandung batas yang terkait, dan varian yang berhubungan tanpa data yang terkait.
tr: Bir enum varyantı depoladığınızda, esas olarak depoladığınız şey varyantın indeksi ve nihai ilişkili değerlerdir. Bu indeks, enum'unuzun ilk varyantı için 0'dan başlar ve sonraki her varyantı için 1 oranında artar. Varyantınızın ilişkili bir değeri varsa, bu değer, varyantın indeksini takip eden adresten başlayarak saklanır. Örneğin, bu varyantın ile ilişkili bir varyantı olmadığını varsayalım.
zh_cn: 当您存储一个 enum 变量时, 您基本上储存的是 变量的索引和最终关联值。 该索引的起始点是 0, 您的宏的第一个变量的起始点是 0, 下一个变量的递增点是 1 。 如果您的变量有一个相关值, 该值则从该变量的索引地址旁边的地址开始存储。 例如, 假设我们拥有“ 注册Type” 组件, 配有带有相关限制日期的“ Finite ” 变量, 以及没有相关数据的“ 无限” 变量。 “ Finite ” 变量的存储布局将像这样:

source: Element
es: Elemento
fr: Élément
id: Elemen
tr: Eleman
zh_cn: 要素要素

source: Variant index (0 for finite)
es: Índice de variantes (0 para finitos)
fr: Indice de variation (0 pour les produits finis)
id: Indeks varian (0 untuk terbatas)
tr: Varyant indeksi (0 sonlu için)
zh_cn: 变式指数(限值为0)

source: registration_type.address()
id: register_type.address Allah)
tr: kayıt_type.address()
zh_cn: 注册_ type. address ()

source: Associated limit date
es: Fecha límite asociada
fr: Date limite associée
id: Batas waktu yang diasosiasikan
tr: İlişkili limit tarihi
zh_cn: 相关截止日期

source: registration_type.address() + 1
id: register_type.address Allah) + 1
tr: registership_type.address() + 1
zh_cn: 注册_type.mail () + 1

source: while the storage layout for the `infinite` would be as follows:
es: mientras que el esquema de almacenamiento del `infinito` sería el siguiente:
fr: Alors que la disposition de stockage pour l'infini serait la suivante:
id: Sementara tata letak penyimpanan untuk æinfiniteé akan seperti berikut:
tr: infinite için depolama düzeni aşağıdaki gibidir:
zh_cn: " 无限 " 的储存布局如下:

source: Variant index (1 for infinite)
es: Índice de variantes (1 para infinito)
fr: Indice de variation (1 pour infini)
id: Indeks varian (1 untuk tak terbatas)
tr: Varyant indeksi (1 sonsuz için)
zh_cn: 变式指数(1无无限)

source: Storage Mappings
es: Cartografías de almacenamiento
fr: Cartes de stockage
id: Pemetaan Penyimpanan
tr: Depolama Haritaları
zh_cn: 储存绘图

source: Storage mappings are similar to hash tables in that they allow mapping keys to values. However, unlike a typical hash table, the key data itself is not stored - only its hash is used to look up the associated value in the contract's storage. Mappings do not have a concept of length or whether a key/value pair is set. All values are by default set to 0. The only way to remove an entry from a mapping is to set its value to the default zero value.
es: Las asignaciones de almacenamiento son similares a las tablas de hash en el sentido de que permiten asignar claves a los valores. Sin embargo, a diferencia de una tabla de hash típica, los datos clave en sí no se almacenan - sólo se utiliza su hash para buscar el valor asociado en el almacenamiento del contrato. Los mapas no tienen un concepto de longitud o si se establece un par de claves/valor. Todos los valores se establecen por defecto en 0. La única manera de eliminar una entrada de una asignación es establecer su valor en el valor cero predeterminado.
fr: Les mappages de stockage sont similaires aux tables de hachage en ce sens qu'ils permettent aux clés de mappage de valeurs. Cependant, contrairement à une table de hachage typique, les données de la clé elle-même ne sont pas stockées - seul son hachage est utilisé pour rechercher la valeur associée dans le stockage du contrat. Les mappages n'ont pas de concept de longueur ou si une paire clé/valeur est définie. Toutes les valeurs sont par défaut définies à 0. La seule façon de supprimer une entrée d'une mappage est de définir sa valeur à la valeur de zéro par défaut.
id: Pemetaan penyimpanan mirip dengan tabel hash yang memungkinkan pemetaan kunci ke nilai-nilai. Namun, tidak seperti tabel hash yang khas, data kunci itu sendiri tidak disimpan - hanya hash yang digunakan untuk melihat nilai yang terkait dalam penyimpanan kontrak. Mapping tidak memiliki konsep panjang atau apakah pasangan kunci/nilai diset. Semua nilai diatur secara baku ke 0. Satu-satunya cara untuk menghapus entri dari sebuah pemetaan adalah untuk mengatur nilainya ke nilai baku nol.
tr: Depolama haritalamaları, anahtarların değerlere eşlenmesine izin verdikleri hash tablolarına benzer. Bununla birlikte, tipik bir hash tablosundan farklı olarak, anahtar verinin kendisi depolanmaz - yalnızca hash'i, sözleşmenin deposundaki ilişkili değeri aramak için kullanılır. Haritalamalarda uzunluk kavramı veya bir anahtar / değer çiftinin ayarlanıp ayarlanmadığı yoktur. Tüm değerler varsayılan olarak 0 olarak ayarlanır. Bir haritalamadan bir girişi kaldırmanın tek yolu, değerini varsayılan değere ayarlamaktır.
zh_cn: 存储映射与散列表相似, 因为它允许绘制值的密钥。 但是, 与典型的散列表不同, 关键数据本身没有被存储 - 只有散列用于查看合同存储中的关联值 。 映射没有长度概念, 也没有设定密钥/ 价值对。 所有值默认设置为 0。 从映射中删除条目的唯一方法是将其值设定为默认零值 。

source: Mappings are only used to compute the location of data in the storage of a contract given certain keys. They are thus **only allowed as storage variables**. They cannot be used as parameters or return parameters of contract functions, and cannot be used as types inside structs.
es: Los mapas sólo se utilizan para calcular la ubicación de los datos en el almacenamiento de un contrato dado ciertas claves. Por lo tanto ** sólo se permiten como variables de almacenamiento**. No se pueden utilizar como parámetros o parámetros de retorno de las funciones del contrato, y no se pueden utilizar como tipos dentro de estructuras.
fr: Les cartes ne sont utilisées que pour calculer l'emplacement des données dans le stockage d'un contrat avec certaines clés. Elles sont donc ** seulement autorisées comme variables de stockage**. Elles ne peuvent pas être utilisées comme paramètres ou paramètres de retour des fonctions de contrat, et ne peuvent pas être utilisées comme types à l'intérieur des structures.
id: Pemetaan hanya digunakan untuk menghitung lokasi data dalam penyimpanan sebuah kontrak yang diberikan kunci tertentu. Mereka dengan demikian ** hanya diperbolehkan sebagai variabel penyimpanan **. Mereka tidak dapat digunakan sebagai parameter atau parameter kembali dari fungsi kontrak, dan tidak dapat digunakan sebagai tipe dalam struktur.
tr: Haritalamalar, yalnızca belirli anahtarlar verilen bir sözleşmenin depolanmasındaki verilerin konumunu hesaplamak için kullanılır. Bu nedenle ** yalnızca depolama değişkenleri ** olarak izin verilir. Sözleşme işlevlerinin parametreleri veya dönüş parametreleri olarak kullanılamazlar ve strüktlerin içindeki tipler olarak kullanılamazlar.
zh_cn: 绘图仅用于计算合同存储中数据的位置,给定某些密钥。 因此,这些密钥** 仅允许作为存储变量**,不能用作合同功能的参数或返回参数,也不能用作建筑内的类型。

source: To declare a mapping, use the `LegacyMap` type enclosed in angle brackets `<>`, specifying the key and value types.
es: Para declarar una asignación, utilice el tipo `LegacyMap` incluido entre corchetes, especificando los tipos de clave y valor.
fr: Pour déclarer une cartographie, utilisez le type `LegacyMap` entre parenthèses `<>`, en spécifiant les types de clé et de valeur.
id: Untuk menyatakan suatu pemetaan, gunakan tipe 'LegacyMapp' yang dilampirkan dalam kurung sudut <>, tentukan tipe kunci dan nilai.
tr: Bir haritalamayı beyan etmek için, anahtar ve değer türlerini belirten > açılı parantez içinde bulunan LegacyMap tipini kullanın.
zh_cn: 要宣布绘图,请使用括号括号中括号内的“LegacyMap”类型,具体说明关键和值类型。

source: You can also create more complex mappings with multiple keys. You can find in Listing 14-2 the popular `allowances` storage variable of the ERC20 Standard which maps an `owner` and an allowed `spender` to their `allowance` amount using multiple keys passed inside a tuple:
es: También puede crear asignaciones más complejas con varias claves. Puede encontrar en la lista 14-2 la popular variable de almacenamiento `permitences` de la Norma ERC20 que asigna un `propietario` y un `pasajero` permitido a su cantidad `permitence` usando varias claves pasadas dentro de una tupla:
fr: Vous pouvez également créer des mappings plus complexes avec plusieurs clés. Vous pouvez trouver dans Listing 14-2 la variable populaire de stockage `allowances` de la norme ERC20 qui map un `propriétaire` et un `spender` autorisé à leur montant `allowance` en utilisant plusieurs clés passées à l'intérieur d'un tuple:
id: Anda juga dapat membuat pemetaan yang lebih kompleks dengan berbagai kunci. Anda dapat menemukan di Listing 14-2 variabel penyimpanan yang populer dari ERC20 Standard yang memetakan sebuah pemilik dan sebuah oposter yang diijinkan untuk jumlah yang diijinkan oleh mereka menggunakan beberapa kunci melewati sebuah tuple:
tr: Birden fazla tuşla daha karmaşık haritalar da oluşturabilirsiniz. Listeleme 14-2'de, bir sahibi ve izin verilen bir spender'yi bir tümenin içinde geçen birden fazla tuş kullanarak haritalayan ERC20 Standardının popüler allowances depolama değişkenini bulabilirsiniz:
zh_cn: 您也可以用多个密钥创建更复杂的映射图。 您可以在列表 14-2 中找到ESRC20 标准中流行的“允许”存储变量,该变量绘制了“所有者”和允许的“允许”“允许”`允许'到其`允许'的`允许'数量,使用在图普尔内传递的多个密钥:

source: <span class="caption">Listing 14-2: Storing a mapping with multiple keys inside a tuple</span>
es: <span class="caption">Lista 14-2: Almacenar una asignación con varias teclas dentro de una tupla</span>
fr: <span class="caption">Liste 14-2: Stocker une carte avec plusieurs touches à l'intérieur d'un tuple</span>
id: <span class="caption">Listing 14-2: Menyimpan sebuah pemetaan dengan beberapa kunci di dalam sebuah tuple</span>
tr: span class="caption">Listing 14-2: Bir tuple içinde birden fazla anahtar içeren bir haritanın saklanması/span>
zh_cn: <span class="caption" > listing 14-2: 在 tiple </span> 内存储带多个密钥的映射

source: The address in storage of a variable stored in a mapping is computed according to the description in the ["Addresses of Storage Variables"](./ch14-01-contract-storage.html#addresses-of-storage-variables) section.
es: La dirección en almacenamiento de una variable almacenada en una asignación se calcula según la descripción en la sección ["Dirección de variables de almacenamiento"](./ch14-01-contract-storage.html#direcciones-de-almacenamiento-variables).
fr: L'adresse dans le stockage d'une variable stockée dans une cartographie est calculée selon la description dans la section [./ch14-01-contract-storage.html#addresses-of-storage-variables).
id: Alamat dalam penyimpanan variabel yang disimpan dalam sebuah pemetaan dihitung sesuai dengan deskripsi dalam ["Alamat Variabel Penyimpanan"]] susah payah/ch14-01-contract-storage.htl#addresses-of-storage-variables) bagian.
tr: Bir haritalamada depolanan bir değişkenin depolanmasındaki adres, ["Depo Değişkenlerinin Adresleri"] [./ch14-01-sözleşme-depolama.html#adresleri-of-depolama-değişkenleri] bölümündeki açıklamaya göre hesaplanır.
zh_cn: 映射中存储变量的存储地址根据[“存储变量的地址”] (./ch14-01-合同-存储.html#地址-存储变量-变量)部分的说明计算。

source: If the key of a mapping is a struct, each element of the struct constitutes a key. Moreover, the struct should implement the `Hash` trait, which can be derived with the `#[derive(Hash)]` attribute. For example, if you have a struct with two fields, the address will be `h(h(sn_keccak(variable_name),k_1),k_2)` modulo \\( {2^{251}} - 256\\), where `k_1` and `k_2` are the values of the two fields of the struct.
es: Si la clave de una asignación es una estructura, cada elemento de la estructura constituye una clave. Además, la estructura debe implementar el rasgo `Hash`, que se puede derivar con el atributo `[derive(Hash)]`. Por ejemplo, si tiene una estructura con dos campos, la dirección será `h(h(sn_keccak(variable_name),k_1),k_2)` modulo فارسى( {2­251• - 256/23370/), donde `k_1` y `k_2` son los valores de los dos campos de la estructura.
fr: Si la clé d'un mapping est une structure, chaque élément de la structure constitue une clé. De plus, la structure devrait implémenter le caractère `Hash`, qui peut être dérivé avec l'attribut `#[derive(Hash)]`. Par exemple, si vous avez une structure avec deux champs, l'adresse sera `h(h(sn_keccak(variable_name),k_1),k_2)` modulo \\( {2^{251}} - 256\\), où `k_1` et `k_2` sont les valeurs des deux champs de la structure.
id: Jika kunci dari sebuah pemetaan adalah sebuah struct, setiap elemen dari struct merupakan sebuah kunci. Selain itu, struct harus mengimplementasikan sifat, yang dapat diturunkan dengan atribut ▪#[derive Allahh]]]. Sebagai contoh, jika Anda memiliki sebuah struktur dengan dua ruas, alamat akan menjadi ·h (holth)_ccakánkvariable_name), k_1), k_2) modulo\\ {{2251} -} 25\\1), di mana 2k_2 dan 2k dari area struktur.
tr: Bir haritalamanın anahtarı bir yapı ise, yapının her elemanı bir anahtar oluşturur. Ayrıca, yapı #[türev(Hash)]] özniteliği ile türetilebilen Hash özelliğini uygulamalıdır. Örneğin, iki alanlı bir yapınız varsa, adres h(snkeccak(variable_name),_k olacaktır.
zh_cn: 如果映射的键是一个支流, 则支流的每个元素构成一个键。 此外, 支流应该执行“ Hash” 特性, 可以通过 {{[ derive( Hash)] 属性来得出。 例如, 如果您有一个带有两个字段的支流, 地址将是 `h( h) (sn_keccak( 变量_ name), k_ 1, k_ 2) modulo\\\\( { {2251}} { - 256\\}), 其中“ k_ 1 ” 和 k_ 2 ” 是该支管的两个字段的值 。
