Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: Events play a crucial role in the integration of smart contracts in real-world applications. Take, for instance, the Non-Fungible Tokens (NFTs) minted on Starknet. An event is emitted each time a token is minted. This event is indexed and stored in some database, allowing applications to display almost instantaneously useful information to users. If the contract doesn't emit an event when minting a new token, it would be less practical, with the need of querying the state of the blockchain to get the data needed.
es: Los eventos juegan un papel crucial en la integración de contratos inteligentes en aplicaciones del mundo real. Tomemos, por ejemplo, los Tokens no fungibles (NFTs) acuñados en Starknet. Se emite un evento cada vez que se acuña un token. Este evento se indexa y almacena en alguna base de datos, permitiendo que las aplicaciones muestren información casi instantáneamente útil a los usuarios. Si el contrato no emite un evento al acuñar un nuevo token, sería menos práctico, con la necesidad de consultar el estado de la cadena de bloques para obtener los datos necesarios.
fr: Les événements jouent un rôle crucial dans l'intégration des contrats intelligents dans les applications du monde réel. Prenez, par exemple, les Tokens Non-Fungible (NFT) sur Starknet. Un événement est émis chaque fois qu'un token est minté. Cet événement est indexé et stocké dans une base de données, permettant aux applications d'afficher des informations presque instantanément utiles aux utilisateurs. Si le contrat n'émet pas un événement lors de la fusion d'un nouveau token, il serait moins pratique, avec la nécessité de questionner l'état de la blockchain pour obtenir les données nécessaires.
id: Peristiwa memainkan peran penting dalam integrasi kontrak cerdas di aplikasi dunia nyata. Ambil, misalnya, Token Non-Fungible (NFT) yang dicetak di Starknet. Sebuah peristiwa dipancarkan setiap kali sebuah token dicetak. Peristiwa ini diindeks dan disimpan dalam beberapa database, memungkinkan aplikasi untuk menampilkan informasi yang hampir seketika berguna kepada pengguna. Jika kontrak tidak memancarkan suatu peristiwa ketika mencetak token baru, itu akan kurang praktis, dengan kebutuhan dari query negara rantai blok untuk mendapatkan data yang dibutuhkan.
tr: Olaylar, akıllı sözleşmelerin gerçek dünyadaki uygulamalardaki entegrasyonunda çok önemli bir rol oynar. Örneğin, Starknet'te basılan Fungible Token'ları (NFT'ler) ele alalım. Bir token basıldığında bir olay yayılır. Bu olay, bazı veritabanında indekslenir ve saklanır, uygulamaların kullanıcılara neredeyse anında yararlı bilgiler görüntülemesine izin verir. Sözleşme, yeni bir jetonu bastırırken bir olay yaymazsa, blok zincirinin daha az pratik olması gerekir.
zh_cn: 事件在将智能合同融入现实世界应用程序方面发挥着关键作用。 例如, 将不可调试 Tokens (NFTs) 刻录在 Starknet 上。 每次标记被刻录时都会释放事件 。 该事件会被索引并存储在某个数据库中, 使应用程序能够向用户显示几乎即时有用的信息。 如果合同在装配新标记时不发布事件, 则不那么实际, 需要查询块链状态才能获得所需的数据 。

source: Defining Events
es: Definir los acontecimientos
fr: Définition des événements
id: Peristiwa - Peristiwa yang Ditetapkan
tr: Olayları Tanımlamak
zh_cn: 界定事件

source: All the different events in a contract are defined under the `Event` enum, which must implement the `starknet::Event` trait. This trait is defined in the core library as follows:
es: Todos los diferentes eventos de un contrato se definen bajo el enum `Evento`, que debe implementar el rasgo `starknet::Evento`. Este rasgo se define en la biblioteca principal de la siguiente manera:
fr: Tous les différents événements d'un contrat sont définis dans l'enum `Event`, qui doit mettre en œuvre le caractère `starknet::Event`. Ce caractère est défini dans la bibliothèque centrale comme suit:
id: Semua peristiwa yang berbeda dalam kontrak didefinisikan di bawah enum ÉEvent, yang harus mengimplementasikan åstarknet::Event) sifat ini didefinisikan dalam perpustakaan inti sebagai berikut:
tr: Bir sözleşmedeki tüm farklı olaylar, starknet::Event özelliğini uygulamak zorunda olan Event enum altında tanımlanır. Bu özellik çekirdek kütüphanede aşağıdaki gibi tanımlanır:
zh_cn: 合同中的所有不同事件均在`Event'enum下界定,必须执行`sharknet::Event'特性,核心图书馆对这一特性的定义如下:

source: The `#[derive(starknet::Event)]` attribute causes the compiler to generate an implementation for the above trait, instantiated with the `Event` type, which in our example is the following enum:
es: El atributo "derive(starknet::Event)]` hace que el compilador genere una implementación para el rasgo anterior, instaurado con el tipo "Event", que en nuestro ejemplo es el siguiente enum:
fr: L'attribut `#[derive(starknet::Event)]` fait en sorte que le compilateur génère une implémentation pour le caractère ci-dessus, momentanée avec le type `Event`, qui dans notre exemple est l'enum suivant:
id: Atribut:Event) menyebabkan kompiler untuk menghasilkan implementasi untuk sifat di atas, instansi dengan tipe ÉEventó, yang dalam contoh kita adalah enum berikut:
tr: #[türev(starknet::Event)] özniteliği, derleyicinin yukarıdaki özellik için bir uygulama oluşturmasına neden olur ve örneğimizde aşağıdaki enum olan Event tipi ile anında oluşturulur:
zh_cn: {{[衍生(星网:Event }}`属性导致编译者为上述特性产生一个执行过程,该特性与`天'类型同时出现,在我们的例子中,该类型如下:

source: Each variant of the `Event` enum has to be a struct or an enum, and each variant needs to implement the `starknet::Event` trait itself. Moreover, the members of these variants must implement the `Serde` trait (_c.f._ [Appendix C: Serializing with Serde](./appendix-03-derivable-traits.html#serializing-with-serde)), as keys/data are added to the event using a serialization process.
es: Cada variante del enum `Evento` tiene que ser una estructura o un enum, y cada variante necesita implementar el rasgo `starknet::Evento` en sí mismo. Además, los miembros de estas variantes deben implementar el rasgo `Serde` (_c.f._ [Apéndice C: Serializando con Serde](./apéndice-03-derivable-traits.html#serializing-with-serde)), ya que las claves/datos se añaden al evento utilizando un proceso de serialización.
fr: Chaque variante de l'enum `Event` doit être un struct ou un enum, et chaque variante doit implémenter le caractère `starknet::Event` lui-même. De plus, les membres de ces variantes doivent implémenter le caractère `Serde` (_c.f._ [Annexe C: Serializing with Serde](../appendix-03-derivable-traits.html#serializing-with-serde)), car des clés/données sont ajoutées à l'événement à l'aide d'un processus de sérialisation.
id: Setiap varian dari enum harus berupa struct atau enum, dan setiap varian perlu mengimplementasikan sifat Éstarknet::Eventix-03-traits.htl#menimplementasikan-serde), sebagai kunci/data ditambahkan ke kejadian yang menggunakan proses serial.
tr: Event enum'un her varyantı bir yapı veya enum olmak zorundadır ve her varyantın starknet::Event özelliğinin kendisini uygulaması gerekir. Ayrıca, bu varyantların üyeleri Serde özelliğini (_c.f._ [Ek C: Serileştirme Serde ile) uygulamalıdır.
zh_cn: `Event' enum的每一种变式都必须是树根或树根,每一变式都需要执行`starknet::Event' 特性本身,此外,这些变式的成员必须执行`serde' 特性(_c.f._[附录C:与Serde进行序列排序](./附录03-03-可发送-traits.html#sergic-serde),因为键/数据是使用序列化程序添加到事件上的。

source: The auto-implementation of the `starknet::Event` trait will implement the `append_keys_and_data` function for each variant of our `Event` enum. The generated implementation will append a single key based on the variant name (`StoredName`), and then recursively call `append_keys_and_data` in the impl of the `Event` trait for the variant’s type.
es: La aplicación automática de la `starknet::Event` rasgo implementará la función `append_keys_and_data` para cada variante de nuestro `Event` enum. La aplicación generada agregará una sola clave basada en el nombre de la variante (`StoredName`), y luego recursivamente llamará a `append_keys_and_data` en el impl del rasgo `Event` para el tipo de la variante.
fr: La mise en œuvre automatique du caractère `starknet::Event` implémentera la fonction `append_keys_and_data` pour chaque variante de notre enum `Event`. L'implémentation générée ajoutera une seule clé basée sur le nom de la variante (`StoredName`), puis appellera de manière récursive `append_keys_and_data` dans l'impl du caractère `Event` pour le type de variante.
id: Implementasi auto-implementation dari enum thosestarknet: Event; sifat akan mengimplementasikan auto-implemental_keys_and_data untuk setiap varian kami. Implementasi yang dihasilkan akan menambahkan satu kunci berdasarkan nama varian (Nemetored), dan kemudian secara recursive call ·append_keys_keys_and_ata dalam impl &amp;Eventánaity sifat untuk varians.
tr: starknet'in otomatik uygulaması::Event özelliği, Event enum'umuzun her bir varyantı için append_keys_and_data işlevini uygulayacaktır. Oluşturulan uygulama, varyant adına (StoredName) dayanan tek bir anahtar ekleyecek ve ardından append_keys_and_data değişkenini Event özelliği için impl'de yeniden çağıracaktır.
zh_cn: 自动实施“星网 ” : Event'特性将为我们的“ Even'enum ” 的每一种变体执行“附录_keys_and_data”功能。生成的落实将附加一个基于变体名称(`storedname')的单一密钥,然后在变体类型`vent'特性的插管中反复调用`append_keys_and_data'。

source: In our example, the `Event` enum contains only one variant, which is a struct named `StoredName`. We chose to name our variant with the same name as the struct name, but this is not enforced.
es: En nuestro ejemplo, el enum `Evento` contiene sólo una variante, que es una estructura llamada `Nombre guardado`. Elegimos nombrar nuestra variante con el mismo nombre que el nombre de la estructura, pero esto no se hace cumplir.
fr: Dans notre exemple, l'enum `Event` ne contient qu'une seule variante, qui est une structure nommée `StoredName`. Nous avons choisi de nommer notre variante avec le même nom que le nom de la structure, mais cela n'est pas appliqué.
id: Dalam contoh kami, enum mengandung hanya satu varian, yaitu struct bernama StoredName. kami memilih untuk menamai varian kami dengan nama yang sama dengan nama struct, tapi ini tidak dipaksakan.
tr: Örneğimizde, Event enum, StoredName adlı bir struct olan sadece bir varyant içerir. Varyantımızı struct adı ile aynı isimle adlandırmayı seçtik, ancak bu uygulanmadı.
zh_cn: 在我们的例子中,`Event' enum只包含一个变体,即一个名为`Stredname'的支架。我们选择用与支架名称相同的名字命名我们的变体,但并未强制执行。

source: Whenever an enum that derives the `starknet::Event` trait has an enum variant, this enum is nested by default. Therefore, the list of keys corresponding to the variant’s name will include the `sn_keccak` hash of the variant's name itself. This can be superfluous, typically when using embedded components in contracts. Indeed, in such cases, we might want the events defined in the components to be emitted without any additional data, and it could be useful to annotate the enum variant with the `#[flat]` attribute. By doing so, we allow to opt out of the nested behavior and ignore the variant name in the serialization process. On the other hand, nested events have the benefit of distinguishing between the main contract event and different components events, which might be helpful.
es: Cada vez que un enum que deriva el `starknet::Event` rasgo tiene una variante de enum, este enum es anidado por defecto. Por lo tanto, la lista de claves correspondientes al nombre de la variante incluirá el `sn_keccak` hash del propio nombre de la variante. Esto puede ser superfluo, típicamente cuando se utilizan componentes incrustados en contratos. De hecho, en tales casos, podríamos querer que los eventos definidos en los componentes se emitan sin ningún dato adicional, y podría ser útil anotar la variante de enum con el atributo `[flat]`. Al hacerlo, permitimos que se deje de lado el comportamiento anidado e ignorar el nombre de la variante en el proceso de serialización. Por otro lado, los eventos anidados tienen el beneficio de distinguir entre el evento principal del contrato y los diferentes eventos de componentes, lo que podría ser útil.
fr: Chaque fois qu'un enum qui dérive le caractère `starknet::Event` a une variante d'enum, cet enum est imbriqué par défaut. Par conséquent, la liste des clés correspondant au nom de la variante="sn_keccak` inclut le hash `sn_keccak` du nom de la variante elle-même. Cela peut être superflu, généralement lors de l'utilisation de composants intégrés dans les contrats. En effet, dans de tels cas, nous pourrions vouloir que les événements définis dans les composants soient émis sans données supplémentaires, et il pourrait être utile d'annoter la variante d'enum avec l'attribut `#[flat]`. Ce faisant, nous permettons de sortir du comportement imbriqué et d'ignorer le nom de la variante dans le processus de sérialisation. D'autre part, les événements imbriqués ont l'avantage de distinguer entre l'événement contractuel principal et les événements de composants différents, ce qui pourrait être utile.
id: Setiap kali enum ini bersarang secara baku. Oleh karena itu, daftar kunci yang berhubungan dengan nama varian akan mencakup Ás_keccaká hash dari nama varian itu sendiri. Hal ini dapat menjadi superfluous, biasanya ketika menggunakan komponen yang tertanam dalam kontrak. Memang, dalam kasus seperti itu, kita mungkin ingin peristiwa yang didefinisikan dalam komponen untuk dipancarkan tanpa adanya data tambahan, dan dapat berguna untuk melafalkan varian enum varian dengan atribut yang sedang terjadi.
tr: starknet::Event özelliğini türeten bir enum varyantı olduğunda, bu enum varsayılan olarak yuvalanır. Bu nedenle, varyantın adına karşılık gelen anahtarların listesi, varyantın adı arasındaki sn_keccak hash'ini içerecektir. Bu, tipik olarak sözleşmelerde gömülü bileşenleri kullanırken gereksiz olabilir. Gerçekten de, bu gibi durumlarda, ortaya çıkan herhangi bir ek bileşen içermeyen olayların tanımlanmasını isteyebiliriz.
zh_cn: 产生“ 恒星网” 的元素: : Event'treaty has a enum 变异体时, 这个变异体会默认嵌入。 因此, 与变异体名称相对应的密钥列表将包含该变异体名称本身的“ sn_keccak” hash 。 这可能是多余的, 通常在合同中使用嵌入组件时是如此。 事实上, 在这样的情况下, 我们可能希望在没有附加任何数据的情况下释放组件中界定的事件, 并且用“ [ 缩放] 属性来说明该变异体。 这样, 我们就可以选择退出嵌入的行为, 在序列化过程中忽略变异名称 。 另一方面, 嵌入事件的好处是区分主要合同事件和不同构件事件, 这可能是有益的 。

source: In our contract, we defined an event named `StoredName` that emits the contract address of the caller and the name stored within the contract, where the `user` field is serialized as a key and the `name` field is serialized as data.
es: En nuestro contrato, definimos un evento llamado `Nombre guardado` que emite la dirección del contrato del que llama y el nombre almacenado en el contrato, donde el campo `usuario` se serializa como una clave y el campo `nombre` se serializa como datos.
fr: Dans notre contrat, nous avons défini un événement nommé `StoredName` qui émet l'adresse du contrat de l'appelant et le nom stocké dans le contrat, où le champ `user` est sérialisé comme une clé et le champ `name` est sérialisé comme des données.
id: Dalam kontrak kami, kami mendefinisikan sebuah peristiwa bernama æStoredNama yang memancarkan alamat kontrak dari pemanggil dan nama yang tersimpan dalam kontrak, di mana medan pengiring serial sebagai kunci dan medan nama serial sebagai data.
tr: Sözleşmemizde, user alanının anahtar olarak seri hale getirildiği ve name alanının veri olarak seri hale getirildiği, arayanın sözleşme adresini ve sözleşme içinde depolanan adı yayan StoredName adlı bir olayı tanımladık.
zh_cn: 在我们的合同中,我们界定了一个名为`注册名称'的事件,该事件透露了打电话者的合同地址和合同中储存的名称,其中`用户'栏目被按序记为钥匙,`名称'栏目被按序记为数据。

source: Indexing events fields allows for more efficient queries and filtering of events. To index a field as a key of an event, simply annotate it with the `#[key]` attribute as demonstrated in the example for the `user` key. By doing so, any indexed field will allow queries of events that contain a given value for that field with \\( O(log(n)) \\) time complexity, while non indexed fields require any query to iterate over all events, providing \\( O(n) \\) time complexity.
es: Para indexar un campo como clave de un evento, basta con anotarlo con el atributo "[key]` como se demuestra en el ejemplo para la clave `user`. Al hacerlo, cualquier campo indexado permitirá consultas de eventos que contengan un valor dado para ese campo con la complejidad del tiempo de "( O(log(n)) فارسى", mientras que los campos no indexados requieren cualquier consulta para iterar sobre todos los eventos, proporcionando la complejidad del tiempo de "( O(n) ♥).
fr: Pour indexer un champ comme clé d'un événement, il suffit de l'annoter avec l'attribut `#[key]` comme démontré dans l'exemple de la clé `user`. Ce faisant, tout champ indexé permettra aux requêtes d'événements qui contiennent une valeur donnée pour ce champ avec \\( O(log(n)) \\) complexité temporelle, tandis que les champs non indexés nécessitent n'importe quelle requête pour itérer sur tous les événements, fournissant \\( O(n) \\) complexité temporelle.
id: Indexing fields fields memungkinkan untuk queries yang lebih efisien dan penyaringan kejadian. Untuk menindeks sebuah field sebagai kunci dari suatu acara, hanya mengnotasinya dengan atribut åkey] seperti yang ditunjukkan dalam contoh untuk kunci Áuser. Dengan melakukan itu, lapangan indeks apapun akan memungkinkan queries dari peristiwa yang mengandung nilai yang diberikan untuk bidang itu dengan \\ (\\ániglogánian) \) waktu kompleksitas, sementara daerah tidak terindeks membutuhkan query apapun untuk itu selama semua peristiwa, menyediakan \ \ \ \ \\ Allah) waktu kompleks.
tr: İndeksleme olayları alanları daha verimli sorgulara ve olayların filtrelenmesine izin verir. Bir alanı bir olayın anahtarı olarak indekslemek için, user anahtarı örneğinde gösterildiği gibi #[anahtar] özniteliği ile not edin. Bunu yaparak, indekslenmiş herhangi bir alan, (O(log(n) zaman karmaşıklığına sahip bu alan için belirli bir değer içeren olayların sorgularına izin verir, indekslenmemiş alanların ise herhangi bir sorgusunu gerektirir.
zh_cn: 索引事件字段允许更有效地查询和筛选事件。要将一个字段作为事件的关键,只需用“用户”键示例中显示的 {{[key] ’ 属性来说明它。这样,任何索引字段都允许查询含有该字段给定值的事件\\ (O(log(n))\\\) 时间复杂性,而非索引字段则要求对所有事件进行切换,提供\\\(O(n)\\\)时间复杂性。

source: When emitting the event with `self.emit(StoredName { user: user, name: name })`, a key corresponding to the name ` StoredName`, specifically `sn_keccak(StoredName)`, is appended to the keys list. `user`is serialized as key, thanks to the `#[key]` attribute, while address is serialized as data. After everything is processed, we end up with the following keys and data: `keys = [sn_keccak("StoredName"),user]` and `data = [name]`.
es: Al emitir el evento con `self.emit(StoredName { user: user, name: name })`, una clave correspondiente al nombre ` StoredName`, específicamente `sn_keccak(StoredName)`, se adjunta a la lista de claves. `user`se serializa como clave, gracias al atributo `[key]`, mientras que la dirección se serializa como datos. Después de todo se procesa, terminamos con las siguientes claves y datos: `keys = [sn_keccak("StoredName"), usuario]` y `data = [name]`.
fr: Lors de l'émission de l'événement avec `self.emit(StoredName { user: user, name: name })`, une clé correspondant au nom ` StoredName`, en particulier `sn_keccak(StoredName)`, est ajoutée à la liste des clés. `user`est sérialisé comme clé, grâce à l'attribut `#[key]`, tandis que l'adresse est sérialisée comme données. Après tout est traité, nous finissons avec les clés et données suivantes: `keys = [sn_keccak("StoredName"),user]` et `data = [name]`.
id: Ketika memancarkan acara itu dengan dirinya sendiri.emit_StoredName), pengguna, nama: nama], sebuah kunci yang berhubungan dengan nama [keyName [key], sementara alamat diserialisasi sebagai data. Setelah semuanya diproses, kita berakhir dengan kunci dan data berikut: tombol = snke_ccaktor"Stor"), dan [ameameed]
tr: self.emit(StoredName user: user, name: name ) ile olayı yayınlarken, StoredName ismine karşılık gelen bir anahtar, özellikle sn_keccak(StoredName) anahtar listesine eklenir. username(StoredName) anahtar olarak serileştirilir ve #[key] özniteliği sayesinde, adres veri olarak işlenir.
zh_cn: 当用`self.emit(用户名 {用户名:用户名:名称 } ` 发布事件时,关键列表中附有一个与`存储名 ',特别是`sn_keccak(用户名)'相对应的密钥。 " 用户名 " 由于 {[关键] 属性被序列作为密钥,而地址则作为数据序列化。在处理所有事项后,我们最后使用以下密钥和数据:`关键字 = [sn_keccak (“存储名”),用户] 和`数据= [名 。

source: Emitting Events
es: Emitiendo eventos
fr: Émission d'événements
tr: Olayları Yayan
zh_cn: 模拟事件

source: After defining events, we can emit them using `self.emit`, with the following syntax:
es: Después de definir los eventos, podemos emitirlos usando `self.emit`, con la siguiente sintaxis:
fr: Après avoir défini les événements, nous pouvons les émettre en utilisant `self.emit`, avec la syntaxe suivante:
id: Setelah mendefinisikan kejadian, kita dapat memancarkannya dengan menggunakan sendiri.emit, dengan sintaks berikut:
tr: Olayları tanımladıktan sonra, aşağıdaki sözdizimi ile self.emit kullanarak bunları yayabiliriz:
zh_cn: 在界定事件后,我们可以使用`self.emit ', 使用以下语法来发布:

source: The `emit` function is called on `self` and takes a reference to `self`, i.e., state modification capabilities are required. Therefore, it is not possible to emit events in view functions.
es: La función `emit` se denomina `auto' y se refiere a `auto', es decir, se requieren capacidades de modificación del Estado, por lo que no es posible emitir eventos a la vista de las funciones.
fr: La fonction `emit` est appelée `self` et prend une référence à `self`, c'est-à-dire que des capacités de modification d'état sont nécessaires. Par conséquent, il n'est pas possible d'émettre des événements en vue des fonctions.
id: Fungsi modifikasi negara diperlukan, karena itu, tidak mungkin untuk memancarkan peristiwa dalam pandangan fungsi.
tr: emit fonksiyonu self olarak adlandırılır ve self, yani durum değiştirme yeteneklerine bir referans alır. Bu nedenle, görünüm işlevlerinde olayları yaymak mümkün değildir.
zh_cn: `移民'功能是用`自己'来称呼的,并提到`自己 ',即需要国家修改能力,因此,不可能在观察功能中发布事件。

source: Interactions between smart contracts are an important feature when creating complex decentralized applications, as it allows for composability and separation of concerns. This chapter sheds light on how to make contracts interact with each other.
es: Las interacciones entre contratos inteligentes son una característica importante a la hora de crear aplicaciones descentralizadas complejas, ya que permiten la composibilidad y la separación de preocupaciones.Este capítulo arroja luz sobre cómo hacer que los contratos interactúen entre sí.
fr: Les interactions entre les contrats intelligents sont une caractéristique importante pour la création d'applications décentralisées complexes, car elles permettent la composabilité et la séparation des préoccupations.
id: Interaksi antara kontrak cerdas adalah fitur penting ketika membuat aplikasi yang terdesentralisasi kompleks, seperti yang memungkinkan untuk komposabilitas dan pemisahan kekhawatiran. Bab ini memberikan cahaya tentang bagaimana membuat kontrak berinteraksi satu sama lain.
tr: Akıllı sözleşmeler arasındaki etkileşimler, karmaşık merkezi olmayan uygulamalar yaratırken önemli bir özelliktir, çünkü bu, karmaşıklık ve endişelerin ayrılmasına izin verir. Bu bölüm, sözleşmelerin birbirleriyle nasıl etkileşime girebileceğine ışık tutar.
zh_cn: 智能合同之间的相互作用是建立复杂的分散应用程序的一个重要特征,因为它可以使各种关切能够兼容和分离,本章阐明了如何使合同相互配合。
