Repository: addegbenga/dem
Catalog: po/*.po
Languages: es, fr, id, tr, zh_cn

source: If you have a situation in which your program has logic that is too verbose to express using `match`, remember that `if let` is in your Cairo toolbox as well.
es: Si usted tiene una situación en la que su programa tiene lógica que es demasiado verboso para expresar usando `match`, recuerde que `si let'está en su caja de herramientas de El Cairo también.
fr: Si vous avez une situation dans laquelle votre programme a une logique qui est trop verbeuse pour exprimer en utilisant `match`, rappelez-vous que `si let` est aussi dans votre boîte à outils Cairo.
id: Jika Anda memiliki situasi di mana program Anda memiliki logika yang terlalu rinci untuk mengekspresikan penggunaan åmatch, ingatlah bahwa jika Anda membiarkan program Anda berada di dalam kotak peralatan Kairo juga.
tr: Programınızın match kullanarak ifade etmek için çok fiili olan bir mantığın olduğu bir durumunuz varsa, if let'in de Kahire araç kutunuzda olduğunu unutmayın.
zh_cn: 如果您的方案有逻辑性, 无法用“ 匹配” 表达, 请记住, “ 如果让” 也存在于您的开罗工具箱中 。

source: `while let`
es: `mientras que '
fr: "tout en laissant"
id: Sementara itu mari kita lakukan.
tr: bu arada
zh_cn: `同时让我们 '

source: The `while let` syntax is similar to the `if let` syntax, but it allows you to loop over a collection of values and execute a block of code for each value that matches a specified pattern. In the case below, the pattern is `Option::Some(x)`, which matches any `Some` variant of the `Option` enum.
es: La sintaxis `while let` es similar a la sintaxis `if let`, pero le permite hacer un bucle sobre una colección de valores y ejecutar un bloque de código para cada valor que coincida con un patrón especificado. En el caso siguiente, el patrón es `Option::Some(x)`, que coincide con cualquier variante `Some` del enum `Option`.
fr: La syntaxe `While let` est similaire à la syntaxe `if let`, mais elle vous permet de boucler une collection de valeurs et d'exécuter un bloc de code pour chaque valeur qui correspond à un motif spécifié. Dans le cas ci-dessous, le motif est `Option::Some(x)`, qui correspond à n'importe quelle variante `Some` de l'enum `Option`.
id: Sementara itu mari kita biarkan satu blok kode yang cocok dengan pola tertentu. Dalam kasus di bawah ini, polanya adalah ·Option:: Some Allahx), yang cocok dengan varian apapun dari enum ·Option.
tr: while let sözdizimi, if let sözdizimine benzer, ancak bir değer koleksiyonu üzerinde döngü kurmanıza ve belirli bir kalıpla eşleşen her değer için bir kod bloğu çalıştırmanıza izin verir. Aşağıdaki durumda, kalıp Option:Some(x), Option enum'un herhangi bir Some varyantıyla eşleşir.
zh_cn: `让我们'语法与`如果`语法相似,但允许您绕过一个数值集,对每个与特定模式相符的值执行一组代码,在下文中,该模式为`备选:some(x)',与`可选'范围的任何`某些`变量'相匹配。

source: Using `while let` provides a more concise and idiomatic way of writing this loop compared to a traditional `while` loop with explicit pattern matching or handling of the `Option` type. However, as with `if let`, you lose the exhaustive checking that a `match` expression provides, so you need to be careful to handle any remaining cases outside the `while let` loop if necessary.
es: El uso de `while let` proporciona una forma más concisa e idiomática de escribir este bucle en comparación con un bucle tradicional `while` con correspondencia explícita de patrones o manejo del tipo `Option`. Sin embargo, como en el caso de `if let`, se pierde la comprobación exhaustiva de que una expresión `match` proporciona, por lo que es necesario tener cuidado de manejar los casos restantes fuera del bucle `while let` si es necesario.
fr: L'utilisation de `While let` fournit une façon plus concise et idiomatique d'écrire cette boucle par rapport à une boucle traditionnelle `While` avec correspondance explicite des motifs ou la manipulation du type `Option`. Cependant, comme avec `si let`, vous perdez la vérification exhaustive qu'une expression `match` fournit, de sorte que vous devez être prudent pour traiter tous les cas restants en dehors de la boucle `While let` si nécessaire.
id: Dengan menggunakan pola pencocokan yang jelas atau penanganan jenis áOptioné. Namun, jika Anda membiarkan loop ini, Anda akan kehilangan pemeriksaan menyeluruh yang diberikan ekspresi yang tidak cocok, sehingga Anda perlu berhati-hati untuk menangani kasus-kasus yang tersisa di luar jenis tersebut.
tr: while let kullanmak, bu döngüyü geleneksel bir while döngüsü ile Option tipinin açık desen eşleşmesi veya işlenmesi ile karşılaştırıldığında daha özlü ve deyimsel bir yol sağlar. Bununla birlikte, if let ile olduğu gibi, bir match ifadesinin sağladığı kapsamlı denetimi kaybedersiniz, bu nedenle gerekirse while let döngüsü dışındaki kalan durumları ele almaya dikkat etmeniz gerekir.
zh_cn: 与传统的`循环'相比,使用`让我们'提供更简洁、更专门的方式来撰写这一循环,而传统的`循环'则对`可选'类型有明确的匹配或处理方式,然而,与`如果'一样,如果`如果 ',你就会失去`相匹配'表达方式所提供的详尽检查,所以你需要小心处理`不参与'的剩余案件,如有必要,则不参与 " 循环 " 。

source: As you write large programs, organizing your code will become increasingly important. By grouping related functionality and separating code with distinct features, you’ll clarify where to find code that implements a particular feature and where to go to change how a feature works.
es: A medida que usted escribe programas grandes, la organización de su código será cada vez más importante. Al agrupar la funcionalidad relacionada y separar el código con características distintas, usted aclarará dónde encontrar código que implementa una característica particular y dónde ir para cambiar cómo funciona una característica.
fr: Lorsque vous écrivez de grands programmes, l'organisation de votre code deviendra de plus en plus importante. En regroupant les fonctionnalités liées et en séparant le code avec des fonctionnalités distinctes, vous allez clarifier où trouver le code qui implémente une fonctionnalité particulière et où aller pour changer comment une fonctionnalité fonctionne.
id: Ketika Anda menulis program besar, mengatur kode Anda akan menjadi semakin penting. dengan mengelompokkan fungsi yang terkait dan memisahkan kode dengan fitur yang berbeda, Anda akan menjelaskan di mana untuk menemukan kode yang menerapkan fitur tertentu dan di mana untuk mengubah bagaimana fitur bekerja.
tr: Büyük programlar yazarken, kodunuzu düzenlemek giderek daha önemli hale gelecektir. İlgili işlevselliği gruplandırarak ve kodu farklı özelliklerle ayırarak, belirli bir özelliği uygulayan kodu nerede bulacağınızı ve bir özelliğin nasıl çalıştığını değiştirmek için nereye gideceğinizi açıklığa kavuşturacaksınız.
zh_cn: 当您写入大型程序时, 组织您的代码将变得日益重要。 通过组合相关功能和区分具有不同特性的代码, 您将澄清在哪里找到执行特定特性的代码, 以及到哪里去改变功能是如何运作的。

source: The programs we’ve written so far have been in one module in one file. As a project grows, you should organize code by splitting it into multiple modules and then multiple files. As a package grows, you can extract parts into separate crates that become external dependencies. This chapter covers all these techniques.
es: Los programas que hemos escrito hasta ahora han estado en un módulo en un archivo. A medida que un proyecto crece, debe organizar el código dividiéndolo en varios módulos y luego múltiples archivos. A medida que crece un paquete, puede extraer partes en cajas separadas que se convierten en dependencias externas. Este capítulo cubre todas estas técnicas.
fr: Les programmes que nous avons écrits jusqu'à présent ont été en un seul module dans un seul fichier. À mesure qu'un projet grandit, vous devriez organiser le code en le divisant en plusieurs modules puis en plusieurs fichiers. À mesure qu'un paquet grandit, vous pouvez extraire des parties dans des caisses séparées qui deviennent des dépendances externes. Ce chapitre couvre toutes ces techniques.
id: Program yang kita tulis sejauh ini telah berada dalam satu modul dalam satu berkas. Ketika sebuah proyek bertumbuh, Anda harus mengatur kode dengan memecahnya menjadi beberapa modul dan kemudian beberapa berkas. Sebagai paket tumbuh, Anda dapat mengekstrak bagian ke dalam peti terpisah yang menjadi ketergantungan eksternal. Bab ini mencakup semua teknik ini.
tr: Şimdiye kadar yazdığımız programlar tek bir dosyada tek bir modülde olmuştur. Bir proje büyüdükçe, birden fazla modüle ve daha sonra birden fazla dosyaya bölerek kod düzenlemelisiniz. Bir paket büyüdükçe, dış bağımlılık haline gelen ayrı sandıklara parça çıkarabilirsiniz. Bu bölüm tüm bu teknikleri kapsar.
zh_cn: 到目前为止,我们所写的程序一直以一个模块在一个文件中存在。随着工程的成长,你应该组织代码,将其分为多个模块,然后是多个文件。随着软件包的成长,你可以将部件分离成成为外部依赖的单箱。本章涵盖了所有这些技术。

source: We’ll also discuss encapsulating implementation details, which lets you reuse code at a higher level: once you’ve implemented an operation, other code can call your code without having to know how the implementation works.
es: También discutiremos los detalles de la implementación, que le permite reutilizar el código a un nivel superior: una vez que haya implementado una operación, otro código puede llamar a su código sin tener que saber cómo funciona la implementación.
fr: Nous allons également discuter de l'encapsulation des détails de l'implémentation, ce qui vous permet de réutiliser le code à un niveau supérieur : une fois que vous avez implémenté une opération, d'autres codes peuvent appeler votre code sans avoir à savoir comment fonctionne l'implémentation.
id: Kami juga akan membahas rincian implementasi yang memungkinkan Anda menggunakan ulang kode pada tingkat yang lebih tinggi: setelah Anda mengimplementasikan operasi, kode lain dapat menghubungi kode Anda tanpa harus tahu bagaimana implementasi bekerja.
tr: Ayrıca, kodu daha yüksek bir seviyede yeniden kullanmanıza izin veren uygulama ayrıntılarını kapsülleme konusunu tartışacağız: bir işlemi uyguladıktan sonra, diğer kod, uygulamanın nasıl çalıştığını bilmek zorunda kalmadan kodunuzu arayabilir.
zh_cn: 我们亦会讨论封装执行细节, 让您重新使用更高层次的代码: 一旦您实施了操作, 其他代码可以连用您的代码, 而不必知道执行方式如何运作 。

source: A related concept is scope: the nested context in which code is written has a set of names that are defined as “in scope”. When reading, writing, and compiling code, programmers and compilers need to know whether a particular name at a particular spot refers to a variable, function, struct, enum, module, constant, or other item and what that item means. You can create scopes and change which names are in or out of scope. You can’t have two items with the same name in the same scope.
es: Un concepto relacionado es el alcance: el contexto anidado en el que se escribe el código tiene un conjunto de nombres que se definen como “en alcance”. Al leer, escribir y compilar código, programadores y compiladores necesitan saber si un nombre en particular en un lugar determinado se refiere a una variable, función, estructura, enum, módulo, constante u otro elemento y lo que ese elemento significa. Puede crear alcances y cambiar qué nombres están dentro o fuera de alcance. No puede tener dos elementos con el mismo nombre en el mismo ámbito.
fr: Un concept connexe est le champ d'application : le contexte imbriqué dans lequel le code est écrit a un ensemble de noms qui sont définis comme "en champ d'application". Lors de la lecture, de l'écriture et de la compilation de code, les programmeurs et compilateurs doivent savoir si un nom particulier à un endroit particulier se réfère à une variable, fonction, struct, enum, module, constante ou autre élément et ce que signifie cet élément. Vous pouvez créer des champs d'applications et modifier quels noms sont dans ou hors champ d'application. Vous ne pouvez pas avoir deux éléments avec le même nom dans la même champ d'application.
id: Konsep yang terkait adalah ruang lingkup: konteks sarang di mana kode ditulis memiliki satu set nama yang didefinisikan sebagai ▪in scope. Ketika membaca, menulis, dan menyusun kode, programmer dan kompiler perlu tahu apakah nama tertentu pada tempat tertentu mengacu pada variabel, fungsi, struktur, enum, modul, konstan, atau item lainnya dan apa artinya. Anda dapat membuat ruang lingkup dan mengubah nama mana yang ada di dalam atau di luar lingkup. Anda tidak dapat memiliki dua item dengan nama yang sama dalam lingkup yang sama.
tr: İlgili bir kavram kapsamdır: kodun yazıldığı iç içe geçmiş bağlam, "kapsamlı" olarak tanımlanan bir dizi isme sahiptir. Kodu okurken, yazarken ve derlerken, programcıların ve derleyicilerin belirli bir noktadaki belirli bir ismin bir değişken, işlev, yapı, enum, modül, sabit veya başka bir öğeye atıfta bulunup bulunmadığını ve aynı öğenin ne anlama geldiğini bilmeleri gerekir. İki başlıkta veya dışında bulunan kapsamları ve değişiklikleri oluşturabilirsiniz.
zh_cn: 一个相关的概念是范围:代码书写时的嵌套环境有一套名称,被定义为“范围” 。读、写和编译代码时,程序员和编译员需要知道特定地点的特定名称是否指变量、函数、构造、内容、模块、常数或其他项,以及该项的含义。您可以创建范围,改变哪些名称在范围之内或之外。在同一范围内,您不能有两个名称相同的项目。

source: Cairo has a number of features that allow you to manage your code’s organization. These features, sometimes collectively referred to as the _module system_, include:
es: El Cairo tiene una serie de características que le permiten gestionar la organización de su código. Estas características, a veces se refieren colectivamente como el sistema _módulo_, incluyen:
fr: Le Caire dispose d'un certain nombre de fonctionnalités qui vous permettent de gérer votre organisation de code. Ces fonctionnalités, parfois collectivement appelées le _module system_, comprennent :
id: Kairo memiliki sejumlah fitur yang memungkinkan Anda mengelola organisasi kode. Fitur-fitur ini, kadang-kadang secara kolektif disebut sebagai sistem _modul_, termasuk:
tr: Kahire, kodunuzun organizasyonunu yönetmenize izin veren bir dizi özelliğe sahiptir. Bazen toplu olarak _module system_ olarak adlandırılan bu özellikler şunları içerir:
zh_cn: 开罗有许多特点,使您能够管理您的代码组织。这些特点有时统称为_模块系统,包括:

source: **Packages:** A Scarb feature that lets you build, test, and share crates.
es: **Paquetes:** Una función Scarb que le permite construir, probar y compartir cajas.
fr: **Packages:** Une fonction Scarb qui vous permet de construire, tester et partager des caisses.
id: ** Packages: ** Sebuah fitur Scarb yang memungkinkan Anda membangun, menguji, dan berbagi peti.
tr: **Paketler: ** Sandıkları inşa etmenizi, test etmenizi ve paylaşmanızı sağlayan bir Scarb özelliği.
zh_cn: ** 包件:** 使你能够制造、测试和分享箱箱的刀疤特征。

source: **Crates:** A tree of modules that corresponds to a single compilation unit. It has a root directory, and a root module defined at the _lib.cairo_ file under this directory.
es: **Crates:** Un árbol de módulos que corresponde a una sola unidad de compilación. Tiene un directorio raíz, y un módulo raíz definido en el archivo _lib.cairo_ bajo este directorio.
fr: **Crates:** Arbre de modules qui correspond à une seule unité de compilation. Il a un répertoire racine, et un module racine défini dans le fichier _lib.cairo_ sous ce répertoire.
id: **Crates:** Sebuah pohon modul yang berhubungan dengan satu unit kompilasi. Ia memiliki direktori root, dan modul root didefinisikan di berkas _lib.cairo_ di bawah direktori ini.
tr: **Crates:** Tek bir derleme birimine karşılık gelen bir modül ağacı. Bu dizinin altında bir kök dizini ve _lib.cairo_ dosyasında tanımlanan bir kök modülü vardır.
zh_cn: ** Crates:** 一棵模块树, 与一个单一的汇编单位相对应。 它有一个根目录, 以及在本目录下 _lib.cairo_ 文件定义的根模块 。

source: **Modules** and **use:** Let you control the organization and scope of items.
es: **Módulos** y **Uso:** Le permiten controlar la organización y el alcance de los artículos.
fr: **Modules** et **Utilisation :** Laissez-vous contrôler l'organisation et la portée des articles.
id: ** Modules** dan ** menggunakan:** Biarkan Anda mengontrol organisasi dan lingkup barang.
tr: **Modüller** ve **kullanım:** Öğelerin organizasyonunu ve kapsamını kontrol etmenize izin verin.
zh_cn: ** 模块** 和** use:** 请控制项目的组织和范围。

source: **Paths:** A way of naming an item, such as a struct, function, or module.
es: ** Rutas:** Una forma de nombrar un elemento, como una estructura, función o módulo.
fr: **Paths:** Une façon de nommer un élément, comme une structure, une fonction ou un module.
id: ** Paths:** Cara penamaan item, seperti struct, fungsi, atau modul.
tr: ** Paths:** Bir öğeyi adlandırmanın bir yolu, bir yapı, fonksiyon veya modül gibi.
zh_cn: ** 命名项目的方式,如支架、函数或模块。

source: In this chapter, we’ll cover all these features, discuss how they interact, and explain how to use them to manage scope. By the end, you should have a solid understanding of the module system and be able to work with scopes like a pro!
es: En este capítulo, vamos a cubrir todas estas características, discutir cómo interactúan, y explicar cómo utilizarlos para gestionar el alcance. Al final, usted debe tener una comprensión sólida del sistema de módulos y ser capaz de trabajar con los alcances como un profesional!
fr: Dans ce chapitre, nous allons couvrir toutes ces fonctionnalités, discuter comment elles interagissent, et expliquer comment les utiliser pour gérer la portée. D'ici la fin, vous devriez avoir une compréhension solide du système de module et être en mesure de travailler avec des champs comme un pro!
id: Di bab ini, kita akan membahas semua fitur ini, membahas bagaimana mereka berinteraksi, dan menjelaskan bagaimana mereka untuk mengelola ruang lingkup. pada akhirnya, Anda harus memiliki pemahaman yang solid tentang sistem modul dan dapat bekerja dengan ruang lingkup seperti pro!
tr: Bu bölümde, tüm bu özellikleri ele alacağız, nasıl etkileşime girdiklerini tartışacağız ve kapsamı yönetmek için nasıl kullanacaklarını açıklayacağız. Sonunda, modül sistemini sağlam bir şekilde anlamalı ve bir profesyonel gibi kapsamlarla çalışabilmelisiniz!
zh_cn: 在本章中,我们将涵盖所有这些特征,讨论它们互动的方式,并解释如何使用它们来管理范围。 最后,你应该对模块系统有扎实的了解,并且能够用像专业一样的范围工作!

source: What is a Crate?
es: ¿Qué es una caja?
fr: Qu'est-ce qu'une caisse?
id: Apa itu Crate?
tr: Crate nedir?
zh_cn: 克洛特是什么? 克洛特是什么? What is a Crate?

source: A crate is a subset of a package that is used in the actual Cairo compilation. This includes:
es: Una caja es un subconjunto de un paquete que se utiliza en la compilación real de El Cairo. Esto incluye:
fr: Une caisse est un sous-ensemble d'un paquet qui est utilisé dans la compilation réelle du Caire.
id: Peti adalah subset dari paket yang digunakan dalam kompilasi Kairo yang sebenarnya. Ini termasuk:
tr: Bir sandık, gerçek Kahire derlemesinde kullanılan bir paketin alt kümesidir. Bu şunları içerir:
zh_cn: 板条箱是实际开罗汇编中使用的包件的子集。 这包括:

source: The package source code, identified by the package name and the crate root, which is the main entry point of the package.
es: El código fuente del paquete, identificado por el nombre del paquete y la raíz de caja, que es el punto de entrada principal del paquete.
fr: Le code source du paquet, identifié par le nom du paquet et la racine de caisse, qui est le point d'entrée principal du paquet.
id: Kode sumber paket, yang diidentifikasi dengan nama paket dan akar peti, yang merupakan titik masuk utama paket.
tr: Paketin ana giriş noktası olan paket adı ve sandık kökü ile tanımlanan paket kaynak kodu.
zh_cn: 软件包源代码, 由软件包名称和箱根识别, 这是软件包的主要切入点 。

source: A subset of the package metadata that identifies crate-level settings of the Cairo compiler, for example, the `edition` field in the _Scarb.toml_ file.
es: Un subconjunto de metadatos de paquetes que identifica los ajustes a nivel de caja del compilador de El Cairo, por ejemplo, el campo `edición` en el archivo _Scarb.toml_.
fr: Un sous-ensemble des métadonnées de paquet qui identifie les paramètres de niveau de caisse du compilateur du Caire, par exemple, le champ `édition` dans le fichier _scarb.toml_.
id: Sebuah subset metadata paket yang mengidentifikasi pengaturan tingkat peti dari kompiler Kairo, misalnya, daerah ·editioná dalam berkas _Scarb.toml.
tr: Kahire derleyicisinin sandık düzeyindeki ayarlarını tanımlayan paket meta verilerinin bir alt kümesi, örneğin _Scarb.toml_ dosyasındaki edition alanı.
zh_cn: 用于确定开罗汇编者箱级设置的包件元数据的一个子集,例如,_Scarb.toml_文件中的`dition'字段。

source: Crates can contain modules, and the modules may be defined in other files that get compiled with the crate, as will be discussed in the subsequent sections.
es: Los dados pueden contener módulos, y los módulos pueden definirse en otros archivos que se compilan con la caja, como se discutirá en las secciones siguientes.
fr: Les caisses peuvent contenir des modules, et les modules peuvent être définis dans d'autres fichiers qui sont compilés avec la caisse, comme on le verra dans les sections suivantes.
id: Crates dapat berisi modul, dan modul dapat didefinisikan dalam berkas lain yang dikompile dengan peti, seperti yang akan dibahas di bagian selanjutnya.
tr: Sandıklar modüller içerebilir ve modüller, sonraki bölümlerde tartışılacağı gibi sandıkla derlenen diğer dosyalarda tanımlanabilir.
zh_cn: Crates可以包含模块,模块可以在与箱一起汇编的其他文件中定义,将在随后各节中讨论。

source: What is the Crate Root?
es: ¿Qué es la raíz de la caja?
fr: Qu'est-ce que la racine de la grille?
id: Apa itu Crate Root?
tr: Crate Kökü Nedir?
zh_cn: 克洛特根是什么? 克洛特根吗?

source: The crate root is the _lib.cairo_ source file that the Cairo compiler starts from and makes up the root module of your crate. We’ll explain modules in depth in the ["Defining Modules to Control Scope"](./ch07-02-defining-modules-to-control-scope.md) chapter.
es: La raíz de caja es el archivo fuente _lib.cairo_ que el compilador de El Cairo inicia y compone el módulo raíz de su caja. Explicaremos los módulos en profundidad en el capítulo ["Definir módulos para controlar el alcance"](./ch07-02-definir módulos-a-control-scope.md).
fr: La racine de la caisse est le fichier source _lib.cairo_ que le compilateur du Caire commence à partir et constitue le module racine de votre caisse. Nous allons expliquer les modules en profondeur dans le chapitre ["Définition des modules à la portée de contrôle"](./ch07-02-defining-modules-to-control-scope.md).
id: Akar peti adalah berkas sumber _lib.cairo_ yang dimulai oleh kompiler Kairo dan membentuk modul root dari peti anda. Kami akan menjelaskan modul dalam kedalaman di bab ["Defining Modules to Control Scope"]]./ch07-02-defining-modules-to-control-scope.md).
tr: Kasa kökü, Kahire derleyicisinin başladığı ve sandığınızın kök modülünü oluşturduğu _lib.cairo_ kaynak dosyasıdır. Modülleri ["Defining Modules to Control Scope"](./ch07-02-defining-modules-to-control-scope.md) bölümünde derinlemesine açıklayacağız.
zh_cn: 箱根是开罗编译器从_lib.cairo_源文件开始并组成您的箱根模块。我们将在[“控制范围定义模块”](./ch07-02-定义模块到控制范围.md)章中深入解释模块。

source: What is a Package?
es: ¿Qué es un paquete?
fr: Qu'est-ce qu'un paquet?
id: Apa itu Paket?
tr: Paket nedir?
zh_cn: 什么是包?

source: A Cairo package is a directory (or equivalent) containing:
es: Un paquete de El Cairo es un directorio (o equivalente) que contiene:
fr: Un paquet Cairo est un répertoire (ou équivalent) contenant:
id: Paket Kairo adalah direktori (atau ekuivalen) yang berisi:
tr: Bir Kahire paketi, aşağıdakileri içeren bir dizin (veya eşdeğeri) 'dir:
zh_cn: 开罗软件包是一个目录(或相当的),载有:

source: A _Scarb.toml_ manifest file with a `[package]` section.
es: Un archivo _Scarb.toml_ manifiesto con una sección `[paquete]`.
fr: Un fichier manifeste _scarb.toml_ avec une section `[package]`.
id: Berkas nyata _Scarb.toml dengan bagian [paket].
tr: [package] bölümü olan bir _Scarb.toml_ manifest dosyası.
zh_cn: A_Scarb.toml_带有`[包装]'部分的清单文件。

source: Associated source code.
es: Código fuente asociado.
fr: Code source associé.
id: Kode sumber yang terkait.
tr: Bağlantılı kaynak kodu.
zh_cn: 相关源代码。
